#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIScriptedBehavior_FlowUntilEnemySeen

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function AIScriptedBehavior_FlowUntilEnemySeen.AIScriptedBehavior_FlowUntilEnemySeen_C.ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen
// 0x0100 (0x0100 - 0x0000)
struct AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_Result2;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult Result)>  K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_Result;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionAIController*                     K2Node_Event_AIController;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAITask_FlowFieldMove*             CallFunc_FlowFieldMove_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_TaskWaitDelay_TaskOwner_CastInput;        // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameplayTask_WaitDelay*                CallFunc_TaskWaitDelay_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetEnemyCharacter_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLaneProgress_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_K2_GetLaneID_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_TaskWaitDelay_TaskOwner2_CastInput;       // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameplayTask_WaitDelay*                CallFunc_TaskWaitDelay_ReturnValue2;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionDamageableObjective_Base*         CallFunc_GetOwnTower_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAITask_MoveTo*                         CallFunc_AIMoveTo_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen) == 0x000008, "Wrong alignment on AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen");
static_assert(sizeof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen) == 0x000100, "Wrong size on AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, EntryPoint) == 0x000000, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_CustomEvent_Result2) == 0x000018, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_CustomEvent_Result2' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_CustomEvent_Result) == 0x000040, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_CustomEvent_AIController) == 0x000048, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_CreateDelegate_OutputDelegate4) == 0x000050, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_CreateDelegate_OutputDelegate5) == 0x000060, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_Event_AIController) == 0x000070, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_Event_AIController' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_FlowFieldMove_ReturnValue) == 0x000078, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_FlowFieldMove_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, K2Node_CreateDelegate_OutputDelegate6) == 0x000080, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_IsValid_ReturnValue2) == 0x000091, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_GetTeamNum_ReturnValue) == 0x000092, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_RandomFloatInRange_ReturnValue) == 0x000094, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_TaskWaitDelay_TaskOwner_CastInput) == 0x000098, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_TaskWaitDelay_TaskOwner_CastInput' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_TaskWaitDelay_ReturnValue) == 0x0000A8, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_TaskWaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_K2_GetEnemyCharacter_ReturnValue) == 0x0000B0, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_K2_GetEnemyCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_IsValid_ReturnValue3) == 0x0000B8, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_IsValid_ReturnValue4) == 0x0000B9, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_GetLaneProgress_ReturnValue) == 0x0000BC, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_GetLaneProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000C0, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_IsValid_ReturnValue5) == 0x0000C1, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_K2_GetLaneID_ReturnValue) == 0x0000C4, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_K2_GetLaneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_TaskWaitDelay_TaskOwner2_CastInput) == 0x0000C8, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_TaskWaitDelay_TaskOwner2_CastInput' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_TaskWaitDelay_ReturnValue2) == 0x0000D8, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_TaskWaitDelay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_IsValid_ReturnValue6) == 0x0000E1, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_GetOwnTower_ReturnValue) == 0x0000E8, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_GetOwnTower_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_AIMoveTo_ReturnValue) == 0x0000F0, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_AIMoveTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen, CallFunc_IsValid_ReturnValue7) == 0x0000F8, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen::CallFunc_IsValid_ReturnValue7' has a wrong offset!");

// Function AIScriptedBehavior_FlowUntilEnemySeen.AIScriptedBehavior_FlowUntilEnemySeen_C.BehaviorFinished
// 0x0008 (0x0008 - 0x0000)
struct AIScriptedBehavior_FlowUntilEnemySeen_C_BehaviorFinished final
{
public:
	class AOrionAIController*                     AIController_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIScriptedBehavior_FlowUntilEnemySeen_C_BehaviorFinished) == 0x000008, "Wrong alignment on AIScriptedBehavior_FlowUntilEnemySeen_C_BehaviorFinished");
static_assert(sizeof(AIScriptedBehavior_FlowUntilEnemySeen_C_BehaviorFinished) == 0x000008, "Wrong size on AIScriptedBehavior_FlowUntilEnemySeen_C_BehaviorFinished");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_BehaviorFinished, AIController_0) == 0x000000, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_BehaviorFinished::AIController_0' has a wrong offset!");

// Function AIScriptedBehavior_FlowUntilEnemySeen.AIScriptedBehavior_FlowUntilEnemySeen_C.OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA
// 0x0010 (0x0010 - 0x0000)
struct AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          AIController_0;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA) == 0x000008, "Wrong alignment on AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA");
static_assert(sizeof(AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA) == 0x000010, "Wrong size on AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA, Result) == 0x000000, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA::Result' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA, AIController_0) == 0x000008, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA::AIController_0' has a wrong offset!");

// Function AIScriptedBehavior_FlowUntilEnemySeen.AIScriptedBehavior_FlowUntilEnemySeen_C.OnMoveFinished_623B680040E2A42E4DABDF8D1D61043E
// 0x0001 (0x0001 - 0x0000)
struct AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_623B680040E2A42E4DABDF8D1D61043E final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_623B680040E2A42E4DABDF8D1D61043E) == 0x000001, "Wrong alignment on AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_623B680040E2A42E4DABDF8D1D61043E");
static_assert(sizeof(AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_623B680040E2A42E4DABDF8D1D61043E) == 0x000001, "Wrong size on AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_623B680040E2A42E4DABDF8D1D61043E");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_623B680040E2A42E4DABDF8D1D61043E, Result) == 0x000000, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_OnMoveFinished_623B680040E2A42E4DABDF8D1D61043E::Result' has a wrong offset!");

// Function AIScriptedBehavior_FlowUntilEnemySeen.AIScriptedBehavior_FlowUntilEnemySeen_C.RunBehavior
// 0x0020 (0x0020 - 0x0000)
struct AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior final
{
public:
	class AOrionAIController*                     AIController_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionAIBot*                            K2Node_DynamicCast_AsOrion_AIBot;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehavior_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior) == 0x000008, "Wrong alignment on AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior");
static_assert(sizeof(AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior) == 0x000020, "Wrong size on AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior, AIController_0) == 0x000000, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior::AIController_0' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior, ReturnValue) == 0x000008, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior::ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior, K2Node_DynamicCast_AsOrion_AIBot) == 0x000010, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior::K2Node_DynamicCast_AsOrion_AIBot' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior, CallFunc_RunBehavior_ReturnValue) == 0x000019, "Member 'AIScriptedBehavior_FlowUntilEnemySeen_C_RunBehavior::CallFunc_RunBehavior_ReturnValue' has a wrong offset!");

}

