#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIScriptedBehavior_AFK

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"
#include "GameplayTasks_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIScriptedBehavior_AFK.AIScriptedBehavior_AFK_C
// 0x0038 (0x0080 - 0x0048)
class UAIScriptedBehavior_AFK_C final : public UAIScriptedBehavior_BehaviorTree
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(Transient, DuplicateTransient)
	TArray<class AActor*>                         PatrolPoints;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	class AOrionAIBot*                            AIController;                                      // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask*                          MoveTask;                                          // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ClaimResource*            LogicTask;                                         // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           InitialTimer;                                      // 0x0078(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AIScriptedBehavior_AFK(int32 EntryPoint);
	void Go();
	void BehaviorFinished(class AOrionAIController* AIController_0);
	void OnFinish_6603ED9A4CBFC92580AF749D7F045D8E();
	void OnRequestFailed_4180D2B8423863ABDA5907BDA15CB0E0();
	void OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0(EPathFollowingResult Result, class AAIController* AIController_0);
	bool RunBehavior(class AOrionAIController* AIController_0);
	void LockLogic(class AOrionAIBot* BotController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIScriptedBehavior_AFK_C">();
	}
	static class UAIScriptedBehavior_AFK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIScriptedBehavior_AFK_C>();
	}
};
static_assert(alignof(UAIScriptedBehavior_AFK_C) == 0x000008, "Wrong alignment on UAIScriptedBehavior_AFK_C");
static_assert(sizeof(UAIScriptedBehavior_AFK_C) == 0x000080, "Wrong size on UAIScriptedBehavior_AFK_C");
static_assert(offsetof(UAIScriptedBehavior_AFK_C, UberGraphFrame) == 0x000048, "Member 'UAIScriptedBehavior_AFK_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAIScriptedBehavior_AFK_C, PatrolPoints) == 0x000050, "Member 'UAIScriptedBehavior_AFK_C::PatrolPoints' has a wrong offset!");
static_assert(offsetof(UAIScriptedBehavior_AFK_C, AIController) == 0x000060, "Member 'UAIScriptedBehavior_AFK_C::AIController' has a wrong offset!");
static_assert(offsetof(UAIScriptedBehavior_AFK_C, MoveTask) == 0x000068, "Member 'UAIScriptedBehavior_AFK_C::MoveTask' has a wrong offset!");
static_assert(offsetof(UAIScriptedBehavior_AFK_C, LogicTask) == 0x000070, "Member 'UAIScriptedBehavior_AFK_C::LogicTask' has a wrong offset!");
static_assert(offsetof(UAIScriptedBehavior_AFK_C, InitialTimer) == 0x000078, "Member 'UAIScriptedBehavior_AFK_C::InitialTimer' has a wrong offset!");

}

