#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIScriptedBehavior_AFK

#include "Basic.hpp"

#include "GameplayTasks_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AIScriptedBehavior_AFK.AIScriptedBehavior_AFK_C.ExecuteUbergraph_AIScriptedBehavior_AFK
// 0x00C8 (0x00C8 - 0x0000)
struct AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionAIController*                     K2Node_Event_AIController;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSpawnLocation_ReturnValue;             // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x003C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAITask_MoveTo*                         CallFunc_AIMoveTo_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_TaskWaitDelay_TaskOwner_CastInput;        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameplayTask_WaitDelay*                CallFunc_TaskWaitDelay_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue2;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_Result;                         // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK) == 0x000008, "Wrong alignment on AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK");
static_assert(sizeof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK) == 0x0000C8, "Wrong size on AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, EntryPoint) == 0x000000, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, K2Node_Event_AIController) == 0x000018, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::K2Node_Event_AIController' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_GetSpawnLocation_ReturnValue) == 0x000030, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_GetSpawnLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00003C, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_AIMoveTo_ReturnValue) == 0x000048, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_AIMoveTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000050, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_VSizeSquared_ReturnValue) == 0x00005C, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_IsValid_ReturnValue2) == 0x000060, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000061, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_IsValid_ReturnValue3) == 0x000062, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_TaskWaitDelay_TaskOwner_CastInput) == 0x000068, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_TaskWaitDelay_TaskOwner_CastInput' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_TaskWaitDelay_ReturnValue) == 0x000078, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_TaskWaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_IsValid_ReturnValue4) == 0x000080, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, K2Node_CreateDelegate_OutputDelegate2) == 0x000088, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_IsValid_ReturnValue5) == 0x000098, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_K2_GetPawn_ReturnValue2) == 0x0000A0, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_K2_GetPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_IsValid_ReturnValue6) == 0x0000A8, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, CallFunc_IsValid_ReturnValue7) == 0x0000A9, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, K2Node_CustomEvent_Result) == 0x0000AA, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, K2Node_CustomEvent_AIController) == 0x0000B0, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B8, "Member 'AIScriptedBehavior_AFK_C_ExecuteUbergraph_AIScriptedBehavior_AFK::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function AIScriptedBehavior_AFK.AIScriptedBehavior_AFK_C.BehaviorFinished
// 0x0008 (0x0008 - 0x0000)
struct AIScriptedBehavior_AFK_C_BehaviorFinished final
{
public:
	class AOrionAIController*                     AIController_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIScriptedBehavior_AFK_C_BehaviorFinished) == 0x000008, "Wrong alignment on AIScriptedBehavior_AFK_C_BehaviorFinished");
static_assert(sizeof(AIScriptedBehavior_AFK_C_BehaviorFinished) == 0x000008, "Wrong size on AIScriptedBehavior_AFK_C_BehaviorFinished");
static_assert(offsetof(AIScriptedBehavior_AFK_C_BehaviorFinished, AIController_0) == 0x000000, "Member 'AIScriptedBehavior_AFK_C_BehaviorFinished::AIController_0' has a wrong offset!");

// Function AIScriptedBehavior_AFK.AIScriptedBehavior_AFK_C.OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0
// 0x0010 (0x0010 - 0x0000)
struct AIScriptedBehavior_AFK_C_OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0 final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          AIController_0;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIScriptedBehavior_AFK_C_OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0) == 0x000008, "Wrong alignment on AIScriptedBehavior_AFK_C_OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0");
static_assert(sizeof(AIScriptedBehavior_AFK_C_OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0) == 0x000010, "Wrong size on AIScriptedBehavior_AFK_C_OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0");
static_assert(offsetof(AIScriptedBehavior_AFK_C_OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0, Result) == 0x000000, "Member 'AIScriptedBehavior_AFK_C_OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0::Result' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0, AIController_0) == 0x000008, "Member 'AIScriptedBehavior_AFK_C_OnMoveFinished_4180D2B8423863ABDA5907BDA15CB0E0::AIController_0' has a wrong offset!");

// Function AIScriptedBehavior_AFK.AIScriptedBehavior_AFK_C.RunBehavior
// 0x0038 (0x0038 - 0x0000)
struct AIScriptedBehavior_AFK_C_RunBehavior final
{
public:
	class AOrionAIController*                     AIController_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionAIBot*                            K2Node_DynamicCast_AsOrion_AIBot;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehavior_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor)
};
static_assert(alignof(AIScriptedBehavior_AFK_C_RunBehavior) == 0x000008, "Wrong alignment on AIScriptedBehavior_AFK_C_RunBehavior");
static_assert(sizeof(AIScriptedBehavior_AFK_C_RunBehavior) == 0x000038, "Wrong size on AIScriptedBehavior_AFK_C_RunBehavior");
static_assert(offsetof(AIScriptedBehavior_AFK_C_RunBehavior, AIController_0) == 0x000000, "Member 'AIScriptedBehavior_AFK_C_RunBehavior::AIController_0' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_RunBehavior, ReturnValue) == 0x000008, "Member 'AIScriptedBehavior_AFK_C_RunBehavior::ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_RunBehavior, K2Node_DynamicCast_AsOrion_AIBot) == 0x000010, "Member 'AIScriptedBehavior_AFK_C_RunBehavior::K2Node_DynamicCast_AsOrion_AIBot' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_RunBehavior, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AIScriptedBehavior_AFK_C_RunBehavior::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_RunBehavior, CallFunc_RunBehavior_ReturnValue) == 0x000019, "Member 'AIScriptedBehavior_AFK_C_RunBehavior::CallFunc_RunBehavior_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_RunBehavior, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'AIScriptedBehavior_AFK_C_RunBehavior::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_RunBehavior, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'AIScriptedBehavior_AFK_C_RunBehavior::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function AIScriptedBehavior_AFK.AIScriptedBehavior_AFK_C.LockLogic
// 0x0038 (0x0038 - 0x0000)
struct AIScriptedBehavior_AFK_C_LockLogic final
{
public:
	class AOrionAIBot*                            BotController;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_ClaimResource_InTaskOwner_CastInput;      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameplayTask_ClaimResource*            CallFunc_ClaimResource_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_K2_RunGameplayTask_TaskOwner_CastInput;   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayTaskRunResult                        CallFunc_K2_RunGameplayTask_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIScriptedBehavior_AFK_C_LockLogic) == 0x000008, "Wrong alignment on AIScriptedBehavior_AFK_C_LockLogic");
static_assert(sizeof(AIScriptedBehavior_AFK_C_LockLogic) == 0x000038, "Wrong size on AIScriptedBehavior_AFK_C_LockLogic");
static_assert(offsetof(AIScriptedBehavior_AFK_C_LockLogic, BotController) == 0x000000, "Member 'AIScriptedBehavior_AFK_C_LockLogic::BotController' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_LockLogic, CallFunc_ClaimResource_InTaskOwner_CastInput) == 0x000008, "Member 'AIScriptedBehavior_AFK_C_LockLogic::CallFunc_ClaimResource_InTaskOwner_CastInput' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_LockLogic, CallFunc_ClaimResource_ReturnValue) == 0x000018, "Member 'AIScriptedBehavior_AFK_C_LockLogic::CallFunc_ClaimResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_LockLogic, CallFunc_K2_RunGameplayTask_TaskOwner_CastInput) == 0x000020, "Member 'AIScriptedBehavior_AFK_C_LockLogic::CallFunc_K2_RunGameplayTask_TaskOwner_CastInput' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_AFK_C_LockLogic, CallFunc_K2_RunGameplayTask_ReturnValue) == 0x000030, "Member 'AIScriptedBehavior_AFK_C_LockLogic::CallFunc_K2_RunGameplayTask_ReturnValue' has a wrong offset!");

}

