#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmbientEvents

#include "Basic.hpp"


namespace SDK::Params
{

// Function AmbientEvents.DialogueSpeakerInterface.GetAudioComponentForDialogue
// 0x0008 (0x0008 - 0x0000)
struct DialogueSpeakerInterface_GetAudioComponentForDialogue final
{
public:
	class UAudioComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DialogueSpeakerInterface_GetAudioComponentForDialogue) == 0x000008, "Wrong alignment on DialogueSpeakerInterface_GetAudioComponentForDialogue");
static_assert(sizeof(DialogueSpeakerInterface_GetAudioComponentForDialogue) == 0x000008, "Wrong size on DialogueSpeakerInterface_GetAudioComponentForDialogue");
static_assert(offsetof(DialogueSpeakerInterface_GetAudioComponentForDialogue, ReturnValue) == 0x000000, "Member 'DialogueSpeakerInterface_GetAudioComponentForDialogue::ReturnValue' has a wrong offset!");

// Function AmbientEvents.DialogueSpeakerInterface.GetVoice
// 0x0008 (0x0008 - 0x0000)
struct DialogueSpeakerInterface_GetVoice final
{
public:
	class UDialogueVoice*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DialogueSpeakerInterface_GetVoice) == 0x000008, "Wrong alignment on DialogueSpeakerInterface_GetVoice");
static_assert(sizeof(DialogueSpeakerInterface_GetVoice) == 0x000008, "Wrong size on DialogueSpeakerInterface_GetVoice");
static_assert(offsetof(DialogueSpeakerInterface_GetVoice, ReturnValue) == 0x000000, "Member 'DialogueSpeakerInterface_GetVoice::ReturnValue' has a wrong offset!");

}

