#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Prime_Helix_v2

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimBP_Prime_Helix_v2.AnimBP_Prime_Helix_v2_C.ExecuteUbergraph_AnimBP_Prime_Helix_v2
// 0x0008 (0x0008 - 0x0000)
struct AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2) == 0x000004, "Wrong alignment on AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2");
static_assert(sizeof(AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2) == 0x000008, "Wrong size on AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2");
static_assert(offsetof(AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2, EntryPoint) == 0x000000, "Member 'AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2, CallFunc_Not_PreBool_ReturnValue2) == 0x000005, "Member 'AnimBP_Prime_Helix_v2_C_ExecuteUbergraph_AnimBP_Prime_Helix_v2::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");

}

