#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Prime_Helix_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Prime_Helix_v2.AnimBP_Prime_Helix_v2_C
// 0x1260 (0x2420 - 0x11C0)
class UAnimBP_Prime_Helix_v2_C final : public UOrionHeroAnimInstance
{
public:
	uint8                                         Pad_11B8[0x8];                                     // 0x11B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11C0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_8057546D4BF20E2EC486F4898BCFF4A3; // 0x11C8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_58660DD2496C9086489CF49438FF13B1; // 0x1210(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_021F3F8C41E4E26CD04E3EBBDC564A1B; // 0x1278(0x0078)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_C7863FEF40DE9E3BAC81309C93631313; // 0x12F0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15D0F984461B6FBCE0EF5B93A76275F6; // 0x1360(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4A08ABE645D8959C83F4F0940E2F1A93; // 0x13E0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BE02005A4B4969A763D4D68D0ADA5E1A; // 0x1460(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154; // 0x14E0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E6830DD74203A90AAFE9AE89BB7DF39B; // 0x1560(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726; // 0x15E0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676; // 0x1660(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D; // 0x16E0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336; // 0x1760(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29F1468B44CBBB84673FCB8427DFE6F2; // 0x17E0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_637344F84C8DE3C2FA8DAFA303827BAB; // 0x1860(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D9325EB048A3FE8230B29883A3724D1C; // 0x18D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E2090BC8477B4D319E7AB4B0FE2FD75C; // 0x1918(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D0F84EE149DF8C40623F32BF8012ED33; // 0x1988(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_F3036B4245A7B2329250CB802853EDCD; // 0x19D0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C30C348B4B75C3278E5445ADC7C8A3DD; // 0x1A40(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_AFACDD1E41DFD84397D910BB20C095FA; // 0x1A88(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_AF59F8784DB0FD0B177E4581A8D4ADC8; // 0x1AF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9B7783EC4A679F5EEE2CEDAF0DB0EE47; // 0x1B40(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_69889BAE4F5E7DC78D5FA6A5424E3604; // 0x1BB0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_79DF9F794923F250400EFB8C11089213; // 0x1BF8(0x00D8)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_1EC265BB4640E9E896A5EE8A219D9A62; // 0x1CD0(0x0060)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_2C55C49E4C53738A2F2319BF13551A65; // 0x1D30(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_B693B37D4C6A27D35E096795CCB0CA72; // 0x1E88(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7F99B24C4BE1A022D223D889CFA2B8C9; // 0x1EF0(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_D490F60C43F5C302BF17BFA9456613F3; // 0x1FD0(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9D94D660410F4D42E49F6F8E5D43A33C; // 0x2078(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_BC3A4ACB4C1D0FB3501E938BD74C2753; // 0x20C8(0x0050)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_049EC6CD4D3FB0BA3035D0859788B5E0; // 0x2118(0x0038)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9841B8E44403090E54CCFF9E70E94BD6; // 0x2150(0x0078)()
	uint8                                         Pad_21C8[0x8];                                     // 0x21C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_A453A4A04E01F81E1D9933A8FBE72406; // 0x21D0(0x01C0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_638BEC6C40C24A7354CA3CA3CA7D0E31; // 0x2390(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18F7AC594C00A667CC8D83A72FBC08FE; // 0x23D8(0x0048)()

public:
	void ExecuteUbergraph_AnimBP_Prime_Helix_v2(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_ApplyAdditive_021F3F8C41E4E26CD04E3EBBDC564A1B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_RotateRootBone_1EC265BB4640E9E896A5EE8A219D9A62();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_RotationOffsetBlendSpace_2C55C49E4C53738A2F2319BF13551A65();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_SequenceEvaluator_AFACDD1E41DFD84397D910BB20C095FA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_SequenceEvaluator_C7863FEF40DE9E3BAC81309C93631313();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_SequenceEvaluator_F3036B4245A7B2329250CB802853EDCD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_TransitionResult_15D0F984461B6FBCE0EF5B93A76275F6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_TransitionResult_29F1468B44CBBB84673FCB8427DFE6F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_TransitionResult_4A08ABE645D8959C83F4F0940E2F1A93();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Prime_Helix_v2_AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Prime_Helix_v2_C">();
	}
	static class UAnimBP_Prime_Helix_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Prime_Helix_v2_C>();
	}
};
static_assert(alignof(UAnimBP_Prime_Helix_v2_C) == 0x000010, "Wrong alignment on UAnimBP_Prime_Helix_v2_C");
static_assert(sizeof(UAnimBP_Prime_Helix_v2_C) == 0x002420, "Wrong size on UAnimBP_Prime_Helix_v2_C");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, UberGraphFrame) == 0x0011C0, "Member 'UAnimBP_Prime_Helix_v2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_Root_8057546D4BF20E2EC486F4898BCFF4A3) == 0x0011C8, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_Root_8057546D4BF20E2EC486F4898BCFF4A3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_Slot_58660DD2496C9086489CF49438FF13B1) == 0x001210, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_Slot_58660DD2496C9086489CF49438FF13B1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_ApplyAdditive_021F3F8C41E4E26CD04E3EBBDC564A1B) == 0x001278, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_ApplyAdditive_021F3F8C41E4E26CD04E3EBBDC564A1B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_SequenceEvaluator_C7863FEF40DE9E3BAC81309C93631313) == 0x0012F0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_SequenceEvaluator_C7863FEF40DE9E3BAC81309C93631313' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_15D0F984461B6FBCE0EF5B93A76275F6) == 0x001360, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_15D0F984461B6FBCE0EF5B93A76275F6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_4A08ABE645D8959C83F4F0940E2F1A93) == 0x0013E0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_4A08ABE645D8959C83F4F0940E2F1A93' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_BE02005A4B4969A763D4D68D0ADA5E1A) == 0x001460, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_BE02005A4B4969A763D4D68D0ADA5E1A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154) == 0x0014E0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_E6830DD74203A90AAFE9AE89BB7DF39B) == 0x001560, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_E6830DD74203A90AAFE9AE89BB7DF39B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726) == 0x0015E0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676) == 0x001660, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D) == 0x0016E0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336) == 0x001760, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TransitionResult_29F1468B44CBBB84673FCB8427DFE6F2) == 0x0017E0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TransitionResult_29F1468B44CBBB84673FCB8427DFE6F2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_SequencePlayer_637344F84C8DE3C2FA8DAFA303827BAB) == 0x001860, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_SequencePlayer_637344F84C8DE3C2FA8DAFA303827BAB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_StateResult_D9325EB048A3FE8230B29883A3724D1C) == 0x0018D0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_StateResult_D9325EB048A3FE8230B29883A3724D1C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_SequencePlayer_E2090BC8477B4D319E7AB4B0FE2FD75C) == 0x001918, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_SequencePlayer_E2090BC8477B4D319E7AB4B0FE2FD75C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_StateResult_D0F84EE149DF8C40623F32BF8012ED33) == 0x001988, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_StateResult_D0F84EE149DF8C40623F32BF8012ED33' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_SequenceEvaluator_F3036B4245A7B2329250CB802853EDCD) == 0x0019D0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_SequenceEvaluator_F3036B4245A7B2329250CB802853EDCD' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_StateResult_C30C348B4B75C3278E5445ADC7C8A3DD) == 0x001A40, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_StateResult_C30C348B4B75C3278E5445ADC7C8A3DD' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_SequenceEvaluator_AFACDD1E41DFD84397D910BB20C095FA) == 0x001A88, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_SequenceEvaluator_AFACDD1E41DFD84397D910BB20C095FA' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_StateResult_AF59F8784DB0FD0B177E4581A8D4ADC8) == 0x001AF8, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_StateResult_AF59F8784DB0FD0B177E4581A8D4ADC8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_SequencePlayer_9B7783EC4A679F5EEE2CEDAF0DB0EE47) == 0x001B40, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_SequencePlayer_9B7783EC4A679F5EEE2CEDAF0DB0EE47' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_StateResult_69889BAE4F5E7DC78D5FA6A5424E3604) == 0x001BB0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_StateResult_69889BAE4F5E7DC78D5FA6A5424E3604' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_StateMachine_79DF9F794923F250400EFB8C11089213) == 0x001BF8, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_StateMachine_79DF9F794923F250400EFB8C11089213' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_RotateRootBone_1EC265BB4640E9E896A5EE8A219D9A62) == 0x001CD0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_RotateRootBone_1EC265BB4640E9E896A5EE8A219D9A62' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_RotationOffsetBlendSpace_2C55C49E4C53738A2F2319BF13551A65) == 0x001D30, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_RotationOffsetBlendSpace_2C55C49E4C53738A2F2319BF13551A65' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_Slot_B693B37D4C6A27D35E096795CCB0CA72) == 0x001E88, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_Slot_B693B37D4C6A27D35E096795CCB0CA72' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_LayeredBoneBlend_7F99B24C4BE1A022D223D889CFA2B8C9) == 0x001EF0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_LayeredBoneBlend_7F99B24C4BE1A022D223D889CFA2B8C9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_SaveCachedPose_D490F60C43F5C302BF17BFA9456613F3) == 0x001FD0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_SaveCachedPose_D490F60C43F5C302BF17BFA9456613F3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_UseCachedPose_9D94D660410F4D42E49F6F8E5D43A33C) == 0x002078, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_UseCachedPose_9D94D660410F4D42E49F6F8E5D43A33C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_UseCachedPose_BC3A4ACB4C1D0FB3501E938BD74C2753) == 0x0020C8, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_UseCachedPose_BC3A4ACB4C1D0FB3501E938BD74C2753' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_IdentityPose_049EC6CD4D3FB0BA3035D0859788B5E0) == 0x002118, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_IdentityPose_049EC6CD4D3FB0BA3035D0859788B5E0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TwoWayBlend_9841B8E44403090E54CCFF9E70E94BD6) == 0x002150, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TwoWayBlend_9841B8E44403090E54CCFF9E70E94BD6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_TwoBoneIK_A453A4A04E01F81E1D9933A8FBE72406) == 0x0021D0, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_TwoBoneIK_A453A4A04E01F81E1D9933A8FBE72406' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_LocalToComponentSpace_638BEC6C40C24A7354CA3CA3CA7D0E31) == 0x002390, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_LocalToComponentSpace_638BEC6C40C24A7354CA3CA3CA7D0E31' has a wrong offset!");
static_assert(offsetof(UAnimBP_Prime_Helix_v2_C, AnimGraphNode_ComponentToLocalSpace_18F7AC594C00A667CC8D83A72FBC08FE) == 0x0023D8, "Member 'UAnimBP_Prime_Helix_v2_C::AnimGraphNode_ComponentToLocalSpace_18F7AC594C00A667CC8D83A72FBC08FE' has a wrong offset!");

}

