#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_PedSparrow

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimBP_PedSparrow.AnimBP_PedSparrow_C.ExecuteUbergraph_AnimBP_PedSparrow
// 0x000C (0x000C - 0x0000)
struct AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow) == 0x000004, "Wrong alignment on AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow");
static_assert(sizeof(AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow) == 0x00000C, "Wrong size on AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow");
static_assert(offsetof(AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow, EntryPoint) == 0x000000, "Member 'AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow, CallFunc_GetCurveValue_ReturnValue) == 0x000008, "Member 'AnimBP_PedSparrow_C_ExecuteUbergraph_AnimBP_PedSparrow::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");

}

