#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Turret

#include "Basic.hpp"

#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Turret.AnimBP_Turret_C
// 0x2F80 (0x38D0 - 0x0950)
class UAnimBP_Turret_C final : public UOrionSentryTurretAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0950(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_2B0BC3244D7D2A32BB8CD2AAAC55510B; // 0x0958(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_40FD457A408204B6CB3056BD9E5B75FA; // 0x09A0(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_0B2D25054BED54F3AA76D2B3941B11E9; // 0x0A08(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8FE7B1EC41B846A90EB98084620224DB; // 0x0AB0(0x0050)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_84271E164532FCDC9156E7A895B19021; // 0x0B00(0x01A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C8CF84BE46A0D835B98CA58ED30705FD; // 0x0CA0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_75E4BB134102A9267EFFF1AE41AE7687; // 0x0CE8(0x0048)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_7325B6734C261218D8D422898EA1DB54; // 0x0D30(0x01A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1E3BDF0641C5690CCD6CB1AAE0F22556; // 0x0ED0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9300CB374A017295E26EF4A1257ED264; // 0x0F50(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93424F67489001FD0DFA8C9681ACE4BD; // 0x0FD0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41066A9E4A4D5D9604CEFEA0F12B87F5; // 0x1050(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2E8F42134363257570E771BF21F2BA3E; // 0x10D0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_BA9E02834CD2275585B7769F5AC1C0EF; // 0x1140(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_505A9F694103813546274F8DF0DA54DD; // 0x1188(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_FA35BB20402E9DE2020B6AAD7D156B22; // 0x11F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DDC211E04E46B5071D8033BE4C30B285; // 0x1240(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_595FBF544E7BA4796689C3B57A115E4D; // 0x12B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D8BC20DF4CEBDF8D3B2928B2D87E0B88; // 0x12F8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_BE001A7F4F769ECF076A44A19D9C3FDC; // 0x1368(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_945902354E10BC84B3F5E68C32BA2374; // 0x13B0(0x00D8)()
	uint8                                         Pad_1488[0x8];                                     // 0x1488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9E2C683C4CCE19BDA787CC90C962A77D; // 0x1490(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48BAC635435961F085D1A8979F8A5EFC; // 0x1510(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B6EF96094578D7DAAD210F8B60EA6BE0; // 0x1590(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76E7434046391A191C67EAB15C87A907; // 0x1610(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_852414514A9E0E5E9B5F3B92447DF967; // 0x1690(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_091DCC3541714C6CDCE4848C7033967B; // 0x1710(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5B2FBE124D40EA80A15D6F9797D1EAD0; // 0x1790(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_901E920B402CD04DD1A9C1AB43A9099D; // 0x1810(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135AA7774CCAAED75DFEFF935C0BA2E9; // 0x1890(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39BC079F4DEDA36CAAA217B6E49D7FFE; // 0x1910(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_88F5F3B0498751F2D91B39B4590CE691; // 0x1980(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_89EDC86D46023AD9568F1CAD3B98D5A8; // 0x19C8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_EC495E204606022CC99756B2C51D6D4B; // 0x1A38(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8C91DD5643AFC11B5E9543B0914D50CD; // 0x1A80(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_790D187E4009AC553658F882511BAF2D; // 0x1AF0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D4791648459921A3376000B2FD6C5772; // 0x1B38(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_37F998024CFE56CF3D5AEAB9ECC77A93; // 0x1BA8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EBE3FE554EC935B843B0109063A7B9F7; // 0x1BF0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_2901BDCC4BF823A44E8E35A574FEDF56; // 0x1C60(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6AF48E8E4D8DB82C83E272A8FB403C03; // 0x1CA8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3CFE665E4D1E994CB004F397E063A60A; // 0x1D18(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_87BA7DFF4EE423B7EFA6B2B8C5CBBDD3; // 0x1D60(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_FF19FCB149CB03C90752D59A47795E26; // 0x1E38(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_0C6A336740B13814A77AE39EE9C9DCE5; // 0x1EB0(0x0078)()
	uint8                                         Pad_1F28[0x8];                                     // 0x1F28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81924D3A4D1D6D770D3E1997BE808E4C; // 0x1F30(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96D77DD1407D2EE08BB050913AF0E145; // 0x1FB0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3C93AE0745CDA1F54C53BDBA74A2DE45; // 0x2030(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_008999624CE911277C2CEB9425264988; // 0x20B0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DDFC1CB84FB5F0F7BA38D299F033E1EF; // 0x2130(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DBA9C218418FC1EC4DF5C0AA3298B086; // 0x21B0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7F1E54CB4A650CD7FAF0B88327F79E82; // 0x2230(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C4C2FF6746D8D9BCED2B25994AAF34FF; // 0x22B0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7D9075994DEC918771E8FC85AD019032; // 0x2330(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7BA0D10E4AA4F179E29D519E8EA2C3FD; // 0x23B0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F025CD524C5A8F2767F1DD8B0863C5E7; // 0x2430(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C67AB37F403658A184F81CAF1607D265; // 0x24B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7F151CBF4775A4A86F832AB3ACC2C8C5; // 0x2530(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_084358A841D9D44F0B58E78AD3C2AAFF; // 0x25A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_261B99FC444071A696989A8BB6D76477; // 0x25E8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_4BE89A494AFEEDF0BE2AC6BCFC61F865; // 0x2658(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_8FC9C34449CFA4B36E9CBFBAB22DB618; // 0x26A0(0x0038)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_2CE5CD5A43EFB58FC81337B8AE22E66C; // 0x26D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6CF0181F49A1A287AE0E7E995637FFC1; // 0x2720(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_ABFFFCA745B4ABB17544E7A60CF49267; // 0x2790(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C79438B64E1A28273CDA6D9547A06A1D; // 0x27D8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_62E2C11C4A3A9E136947019455B43EAF; // 0x2848(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7AE56E694DE330A96994DAAA630478B9; // 0x2890(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_045758DA42EA55749697E3BCAC687C33; // 0x2900(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B0F333C745560B9F91532F9D55C2DE5D; // 0x2948(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BCDDAB6746F4BC821087769B17D1AE44; // 0x2A20(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_FF66DA8746868389DC4793AD950C5B3C; // 0x2AF0(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_CEEABE63460F396E5B4B0D8C77D4980D; // 0x2BC0(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_CAA2EFD046354CF12FE0E980A8BE7BB3; // 0x2C68(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_848CB0B24A82822EE7C682938D590D6D; // 0x2CB8(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_08B51AF34ABE8118F1BE30A1A382D0C5; // 0x2D08(0x0068)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_F8AB2F124CED121D3B51C3A81749D38C; // 0x2D70(0x0158)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_F34CE59046D9FEAE23AFBC96D052626D; // 0x2EC8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24D2CC69466EF8EF86F99D98C5CD5CAF; // 0x3020(0x0050)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2362AB5648B140852ED99482F038AF66; // 0x3070(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_752C8462486634E461CA6DB6E5E70F0C; // 0x30E8(0x0070)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_D54CF2E247D2110BD1269A8628686AFC; // 0x3158(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FF33D0EB4B70DF97F009F49C946A3C77; // 0x3228(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BE10A6E348C019A246610AAA0ED5A7A3; // 0x3298(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_408083F0488E9D76E56929BEF8E6D821; // 0x3308(0x0070)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7BFD51414DAA065842A0D783807EC211; // 0x3378(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4967C1FF4B2BC165C8DB3AAE1FFABA08; // 0x33E0(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16FA4E84465436EF450A52825C16FBE1; // 0x3488(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_DE65BB56443FC7F82ACBA283E1758D45; // 0x34D8(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_350800714BB86C0BB4267394E5B3A347; // 0x3540(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_DA34C57C4C2B0D20B2A24F984FEC7C6F; // 0x3610(0x0050)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ECD3A577434841889800D1AC9695051C; // 0x3660(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_76FF703E4909E282AA6A8F956EF2ABBF; // 0x36A8(0x0048)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_0177A5E149C39C39570C8094F1CCC687; // 0x36F0(0x00E8)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_88B249A8430559E81475B9B52370F91C; // 0x37D8(0x00E8)()
	bool                                          Aiming;                                            // 0x38C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OpenShield;                                        // 0x38C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OpenPanel;                                         // 0x38C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Dead;                                              // 0x38C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Waking;                                            // 0x38C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38C5[0x3];                                     // 0x38C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TurretDamage;                                      // 0x38C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tower_Variation;                                   // 0x38CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AnimBP_Turret(int32 EntryPoint);
	void WakeUp();
	void SetDamage(float Damage);
	void SetShieldAndPanel(bool bOpen);
	void SetDead();
	void OnSetAiming(bool bIsAiming);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Turret_AnimGraphNode_ApplyAdditive_2362AB5648B140852ED99482F038AF66();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Turret_AnimGraphNode_BlendListByBool_350800714BB86C0BB4267394E5B3A347();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Turret_AnimGraphNode_BlendListByBool_BCDDAB6746F4BC821087769B17D1AE44();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Turret_AnimGraphNode_BlendListByBool_FF66DA8746868389DC4793AD950C5B3C();
