#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Buff_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Buff_Base.BP_Buff_Base_C
// 0x0018 (0x05F8 - 0x05E0)
class ABP_Buff_Base_C : public AOrionPickup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               BuffVisuals;                                       // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BuffVisualParticleTemplate;                        // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Buff_Base(int32 EntryPoint);
	void OnPickupActivated();
	void OnPickupDeactivated();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Buff_Base_C">();
	}
	static class ABP_Buff_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Buff_Base_C>();
	}
};
static_assert(alignof(ABP_Buff_Base_C) == 0x000008, "Wrong alignment on ABP_Buff_Base_C");
static_assert(sizeof(ABP_Buff_Base_C) == 0x0005F8, "Wrong size on ABP_Buff_Base_C");
static_assert(offsetof(ABP_Buff_Base_C, UberGraphFrame) == 0x0005E0, "Member 'ABP_Buff_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Buff_Base_C, BuffVisuals) == 0x0005E8, "Member 'ABP_Buff_Base_C::BuffVisuals' has a wrong offset!");
static_assert(offsetof(ABP_Buff_Base_C, BuffVisualParticleTemplate) == 0x0005F0, "Member 'ABP_Buff_Base_C::BuffVisualParticleTemplate' has a wrong offset!");

}

