#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraLens_Crit_Health_Recover

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CameraLens_Crit_Health_Recover.BP_CameraLens_Crit_Health_Recover_C.ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover
// 0x0028 (0x0028 - 0x0000)
struct BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionPlayerController_Game*            CallFunc_GetLocalPlayerController_Game_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeX;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeY;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover) == 0x000008, "Wrong alignment on BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover");
static_assert(sizeof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover) == 0x000028, "Wrong size on BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover");
static_assert(offsetof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover, EntryPoint) == 0x000000, "Member 'BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover, CallFunc_GetLocalPlayerController_Game_ReturnValue) == 0x000008, "Member 'BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover::CallFunc_GetLocalPlayerController_Game_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover, CallFunc_GetViewportSize_SizeX) == 0x000010, "Member 'BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover::CallFunc_GetViewportSize_SizeX' has a wrong offset!");
static_assert(offsetof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover, CallFunc_GetViewportSize_SizeY) == 0x000014, "Member 'BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover::CallFunc_GetViewportSize_SizeY' has a wrong offset!");
static_assert(offsetof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x00001C, "Member 'BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover, CallFunc_Less_FloatFloat_ReturnValue) == 0x000025, "Member 'BP_CameraLens_Crit_Health_Recover_C_ExecuteUbergraph_BP_CameraLens_Crit_Health_Recover::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

