#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_Enemy_Death_Ward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OrionVisionWard_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Card_Enemy_Death_Ward.BP_Card_Enemy_Death_Ward_C
// 0x0020 (0x06E0 - 0x06C0)
class ABP_Card_Enemy_Death_Ward_C final : public ABP_OrionVisionWard_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Card_Enemy_Death_Ward_C;         // 0x06C0(0x0008)(Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            StealthGameplayEffectHandle;                       // 0x06C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_Ward_Shimmer;                                    // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeGoingToStealth;                         // 0x06D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Card_Enemy_Death_Ward(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Card_Enemy_Death_Ward_C">();
	}
	static class ABP_Card_Enemy_Death_Ward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Card_Enemy_Death_Ward_C>();
	}
};
static_assert(alignof(ABP_Card_Enemy_Death_Ward_C) == 0x000008, "Wrong alignment on ABP_Card_Enemy_Death_Ward_C");
static_assert(sizeof(ABP_Card_Enemy_Death_Ward_C) == 0x0006E0, "Wrong size on ABP_Card_Enemy_Death_Ward_C");
static_assert(offsetof(ABP_Card_Enemy_Death_Ward_C, UberGraphFrame_BP_Card_Enemy_Death_Ward_C) == 0x0006C0, "Member 'ABP_Card_Enemy_Death_Ward_C::UberGraphFrame_BP_Card_Enemy_Death_Ward_C' has a wrong offset!");
static_assert(offsetof(ABP_Card_Enemy_Death_Ward_C, StealthGameplayEffectHandle) == 0x0006C8, "Member 'ABP_Card_Enemy_Death_Ward_C::StealthGameplayEffectHandle' has a wrong offset!");
static_assert(offsetof(ABP_Card_Enemy_Death_Ward_C, M_Ward_Shimmer) == 0x0006D0, "Member 'ABP_Card_Enemy_Death_Ward_C::M_Ward_Shimmer' has a wrong offset!");
static_assert(offsetof(ABP_Card_Enemy_Death_Ward_C, DelayBeforeGoingToStealth) == 0x0006D8, "Member 'ABP_Card_Enemy_Death_Ward_C::DelayBeforeGoingToStealth' has a wrong offset!");

}

