#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_Suppress_GroundPickup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Card_Suppress_GroundPickup.BP_Card_Suppress_GroundPickup_C.ExecuteUbergraph_BP_Card_Suppress_GroundPickup
// 0x00D8 (0x00D8 - 0x0000)
struct BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0008(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumAppliedEffectsLeftToApply_ReturnValue; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetTeamColorFromMPC_ReturnValue;          // 0x00C0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup) == 0x000008, "Wrong alignment on BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup");
static_assert(sizeof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup) == 0x0000D8, "Wrong size on BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, EntryPoint) == 0x000000, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000008, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000090, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, CallFunc_HasAuthority_ReturnValue) == 0x0000A8, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000AC, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, Temp_bool_IsClosed_Variable) == 0x0000B8, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, Temp_bool_Has_Been_Initd_Variable) == 0x0000B9, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, CallFunc_GetNumAppliedEffectsLeftToApply_ReturnValue) == 0x0000BC, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::CallFunc_GetNumAppliedEffectsLeftToApply_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, CallFunc_GetTeamColorFromMPC_ReturnValue) == 0x0000C0, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::CallFunc_GetTeamColorFromMPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_Card_Suppress_GroundPickup_C_ExecuteUbergraph_BP_Card_Suppress_GroundPickup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

