#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_VisionLaser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Card_VisionLaser.BP_Card_VisionLaser_C
// 0x0038 (0x0560 - 0x0528)
class ABP_Card_VisionLaser_C final : public AOrionDamageableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule1;                                          // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        P_Ward_Active;                                     // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Card_VisionLaser(int32 EntryPoint);
	void OnDeath();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	TArray<class UMeshComponent*> GetHighlightableMeshes();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Card_VisionLaser_C">();
	}
	static class ABP_Card_VisionLaser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Card_VisionLaser_C>();
	}
};
static_assert(alignof(ABP_Card_VisionLaser_C) == 0x000008, "Wrong alignment on ABP_Card_VisionLaser_C");
static_assert(sizeof(ABP_Card_VisionLaser_C) == 0x000560, "Wrong size on ABP_Card_VisionLaser_C");
static_assert(offsetof(ABP_Card_VisionLaser_C, UberGraphFrame) == 0x000528, "Member 'ABP_Card_VisionLaser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Card_VisionLaser_C, ParticleSystem) == 0x000530, "Member 'ABP_Card_VisionLaser_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_Card_VisionLaser_C, Cube) == 0x000538, "Member 'ABP_Card_VisionLaser_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_Card_VisionLaser_C, Capsule1) == 0x000540, "Member 'ABP_Card_VisionLaser_C::Capsule1' has a wrong offset!");
static_assert(offsetof(ABP_Card_VisionLaser_C, OrionGameplayVolume) == 0x000548, "Member 'ABP_Card_VisionLaser_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_Card_VisionLaser_C, Arrow) == 0x000550, "Member 'ABP_Card_VisionLaser_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Card_VisionLaser_C, P_Ward_Active) == 0x000558, "Member 'ABP_Card_VisionLaser_C::P_Ward_Active' has a wrong offset!");

}

