#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_VisionLaser

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Card_VisionLaser.BP_Card_VisionLaser_C.ExecuteUbergraph_BP_Card_VisionLaser
// 0x0004 (0x0004 - 0x0000)
struct BP_Card_VisionLaser_C_ExecuteUbergraph_BP_Card_VisionLaser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Card_VisionLaser_C_ExecuteUbergraph_BP_Card_VisionLaser) == 0x000004, "Wrong alignment on BP_Card_VisionLaser_C_ExecuteUbergraph_BP_Card_VisionLaser");
static_assert(sizeof(BP_Card_VisionLaser_C_ExecuteUbergraph_BP_Card_VisionLaser) == 0x000004, "Wrong size on BP_Card_VisionLaser_C_ExecuteUbergraph_BP_Card_VisionLaser");
static_assert(offsetof(BP_Card_VisionLaser_C_ExecuteUbergraph_BP_Card_VisionLaser, EntryPoint) == 0x000000, "Member 'BP_Card_VisionLaser_C_ExecuteUbergraph_BP_Card_VisionLaser::EntryPoint' has a wrong offset!");

// Function BP_Card_VisionLaser.BP_Card_VisionLaser_C.GetHighlightableMeshes
// 0x0010 (0x0010 - 0x0000)
struct BP_Card_VisionLaser_C_GetHighlightableMeshes final
{
public:
	TArray<class UMeshComponent*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm)
};
static_assert(alignof(BP_Card_VisionLaser_C_GetHighlightableMeshes) == 0x000008, "Wrong alignment on BP_Card_VisionLaser_C_GetHighlightableMeshes");
static_assert(sizeof(BP_Card_VisionLaser_C_GetHighlightableMeshes) == 0x000010, "Wrong size on BP_Card_VisionLaser_C_GetHighlightableMeshes");
static_assert(offsetof(BP_Card_VisionLaser_C_GetHighlightableMeshes, ReturnValue) == 0x000000, "Member 'BP_Card_VisionLaser_C_GetHighlightableMeshes::ReturnValue' has a wrong offset!");

}

