#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_SacrificialLink

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Card_SacrificialLink.BP_Card_SacrificialLink_C.ExecuteUbergraph_BP_Card_SacrificialLink
// 0x02C0 (0x02C0 - 0x0000)
struct BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachTo_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Direction;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0080(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue3;       // 0x008C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue2;                      // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x00CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x00E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0100(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue2;          // 0x010C(0x000C)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0118(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult2;      // 0x01A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0228(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0238(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink) == 0x000008, "Wrong alignment on BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink");
static_assert(sizeof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink) == 0x0002C0, "Wrong size on BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, EntryPoint) == 0x000000, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_GetDistanceTo_ReturnValue) == 0x000008, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, Temp_bool_IsClosed_Variable) == 0x00000D, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, Temp_bool_Has_Been_Initd_Variable) == 0x00000E, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000018, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000021, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000024, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_AttachTo_ReturnValue) == 0x000030, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_AttachTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000034, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000040, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000044, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_IsValid_ReturnValue2) == 0x000050, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, K2Node_CustomEvent_Direction) == 0x000051, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_IsValid_ReturnValue3) == 0x000052, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000054, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_GetSocketLocation_ReturnValue) == 0x00005C, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_GetVelocity_ReturnValue) == 0x000068, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x000074, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_Normal_ReturnValue) == 0x000080, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_Subtract_VectorVector_ReturnValue3) == 0x00008C, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_Subtract_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000098, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_Normal_ReturnValue2) == 0x0000A4, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_Normal_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_VLerp_ReturnValue) == 0x0000B0, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_VSize_ReturnValue) == 0x0000BC, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_FClamp_ReturnValue) == 0x0000C0, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_IsValid_ReturnValue4) == 0x0000C4, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000C8, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x0000CC, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_VInterpTo_ReturnValue) == 0x0000E4, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_IsValid_ReturnValue5) == 0x0000F0, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000F4, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_FindLookAtRotation_ReturnValue) == 0x000100, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_FindLookAtRotation_ReturnValue2) == 0x00010C, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_FindLookAtRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000118, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_SetWorldRotation_SweepHitResult2) == 0x0001A0, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_SetWorldRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000228, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000238, "Member 'BP_Card_SacrificialLink_C_ExecuteUbergraph_BP_Card_SacrificialLink::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_Card_SacrificialLink.BP_Card_SacrificialLink_C.ChangeSplineWidth
// 0x0001 (0x0001 - 0x0000)
struct BP_Card_SacrificialLink_C_ChangeSplineWidth final
{
public:
	bool                                          Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Card_SacrificialLink_C_ChangeSplineWidth) == 0x000001, "Wrong alignment on BP_Card_SacrificialLink_C_ChangeSplineWidth");
static_assert(sizeof(BP_Card_SacrificialLink_C_ChangeSplineWidth) == 0x000001, "Wrong size on BP_Card_SacrificialLink_C_ChangeSplineWidth");
static_assert(offsetof(BP_Card_SacrificialLink_C_ChangeSplineWidth, Direction) == 0x000000, "Member 'BP_Card_SacrificialLink_C_ChangeSplineWidth::Direction' has a wrong offset!");

// Function BP_Card_SacrificialLink.BP_Card_SacrificialLink_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Card_SacrificialLink_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Card_SacrificialLink_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Card_SacrificialLink_C_ReceiveTick");
static_assert(sizeof(BP_Card_SacrificialLink_C_ReceiveTick) == 0x000004, "Wrong size on BP_Card_SacrificialLink_C_ReceiveTick");
static_assert(offsetof(BP_Card_SacrificialLink_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Card_SacrificialLink_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Card_SacrificialLink.BP_Card_SacrificialLink_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_Card_SacrificialLink_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Card_SacrificialLink_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Card_SacrificialLink_C_UserConstructionScript");
static_assert(sizeof(BP_Card_SacrificialLink_C_UserConstructionScript) == 0x000008, "Wrong size on BP_Card_SacrificialLink_C_UserConstructionScript");
static_assert(offsetof(BP_Card_SacrificialLink_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Card_SacrificialLink_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

