#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decal_Venus_Primary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Decal_Venus_Primary.BP_Decal_Venus_Primary_C.ExecuteUbergraph_BP_Decal_Venus_Primary
// 0x0004 (0x0004 - 0x0000)
struct BP_Decal_Venus_Primary_C_ExecuteUbergraph_BP_Decal_Venus_Primary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_Venus_Primary_C_ExecuteUbergraph_BP_Decal_Venus_Primary) == 0x000004, "Wrong alignment on BP_Decal_Venus_Primary_C_ExecuteUbergraph_BP_Decal_Venus_Primary");
static_assert(sizeof(BP_Decal_Venus_Primary_C_ExecuteUbergraph_BP_Decal_Venus_Primary) == 0x000004, "Wrong size on BP_Decal_Venus_Primary_C_ExecuteUbergraph_BP_Decal_Venus_Primary");
static_assert(offsetof(BP_Decal_Venus_Primary_C_ExecuteUbergraph_BP_Decal_Venus_Primary, EntryPoint) == 0x000000, "Member 'BP_Decal_Venus_Primary_C_ExecuteUbergraph_BP_Decal_Venus_Primary::EntryPoint' has a wrong offset!");

// Function BP_Decal_Venus_Primary.BP_Decal_Venus_Primary_C.UserConstructionScript
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Decal_Venus_Primary_C_UserConstructionScript final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0008(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0014(0x000C)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorLocalRotation_SweepHitResult;  // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Decal_Venus_Primary_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Decal_Venus_Primary_C_UserConstructionScript");
static_assert(sizeof(BP_Decal_Venus_Primary_C_UserConstructionScript) == 0x0000A8, "Wrong size on BP_Decal_Venus_Primary_C_UserConstructionScript");
static_assert(offsetof(BP_Decal_Venus_Primary_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_Decal_Venus_Primary_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_Venus_Primary_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000004, "Member 'BP_Decal_Venus_Primary_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Decal_Venus_Primary_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000008, "Member 'BP_Decal_Venus_Primary_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_Venus_Primary_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000014, "Member 'BP_Decal_Venus_Primary_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_Venus_Primary_C_UserConstructionScript, CallFunc_K2_AddActorLocalRotation_SweepHitResult) == 0x000020, "Member 'BP_Decal_Venus_Primary_C_UserConstructionScript::CallFunc_K2_AddActorLocalRotation_SweepHitResult' has a wrong offset!");

}

