#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FronEndSkybox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FronEndSkybox.BP_FronEndSkybox_C
// 0x0048 (0x0360 - 0x0318)
class ABP_FronEndSkybox_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Brightness;                                        // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation;                                          // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Contrast;                                          // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Tint;                                              // 0x0344(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Cubemap;                                           // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FronEndSkybox_C">();
	}
	static class ABP_FronEndSkybox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FronEndSkybox_C>();
	}
};
static_assert(alignof(ABP_FronEndSkybox_C) == 0x000008, "Wrong alignment on ABP_FronEndSkybox_C");
static_assert(sizeof(ABP_FronEndSkybox_C) == 0x000360, "Wrong size on ABP_FronEndSkybox_C");
static_assert(offsetof(ABP_FronEndSkybox_C, StaticMesh) == 0x000318, "Member 'ABP_FronEndSkybox_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_FronEndSkybox_C, DefaultSceneRoot) == 0x000320, "Member 'ABP_FronEndSkybox_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FronEndSkybox_C, Scale) == 0x000328, "Member 'ABP_FronEndSkybox_C::Scale' has a wrong offset!");
static_assert(offsetof(ABP_FronEndSkybox_C, Mid) == 0x000330, "Member 'ABP_FronEndSkybox_C::Mid' has a wrong offset!");
static_assert(offsetof(ABP_FronEndSkybox_C, Brightness) == 0x000338, "Member 'ABP_FronEndSkybox_C::Brightness' has a wrong offset!");
static_assert(offsetof(ABP_FronEndSkybox_C, Rotation) == 0x00033C, "Member 'ABP_FronEndSkybox_C::Rotation' has a wrong offset!");
static_assert(offsetof(ABP_FronEndSkybox_C, Contrast) == 0x000340, "Member 'ABP_FronEndSkybox_C::Contrast' has a wrong offset!");
static_assert(offsetof(ABP_FronEndSkybox_C, Tint) == 0x000344, "Member 'ABP_FronEndSkybox_C::Tint' has a wrong offset!");
static_assert(offsetof(ABP_FronEndSkybox_C, Cubemap) == 0x000358, "Member 'ABP_FronEndSkybox_C::Cubemap' has a wrong offset!");

}

