#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FogSheet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FogSheet.BP_FogSheet_C.UserConstructionScript
// 0x0120 (0x0120 - 0x0000)
struct BP_FogSheet_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0xE];                                        // 0x0002(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable2;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable2;                             // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue2;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00E4(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              K2Node_Select2_Default;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              K2Node_Select3_Default;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              K2Node_Select4_Default;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FogSheet_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_FogSheet_C_UserConstructionScript");
static_assert(sizeof(BP_FogSheet_C_UserConstructionScript) == 0x000120, "Wrong size on BP_FogSheet_C_UserConstructionScript");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'BP_FogSheet_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, Temp_bool_Variable2) == 0x000001, "Member 'BP_FogSheet_C_UserConstructionScript::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, Temp_struct_Variable) == 0x000010, "Member 'BP_FogSheet_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, Temp_bool_Variable3) == 0x000040, "Member 'BP_FogSheet_C_UserConstructionScript::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, Temp_bool_Variable4) == 0x000041, "Member 'BP_FogSheet_C_UserConstructionScript::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, Temp_object_Variable) == 0x000050, "Member 'BP_FogSheet_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, Temp_object_Variable2) == 0x000058, "Member 'BP_FogSheet_C_UserConstructionScript::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, Temp_struct_Variable2) == 0x000060, "Member 'BP_FogSheet_C_UserConstructionScript::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue2) == 0x000090, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, K2Node_Select_Default) == 0x000098, "Member 'BP_FogSheet_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A0, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A4, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x0000B0, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x0000B4, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x0000B8, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x0000BC, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakColor_R) == 0x0000C8, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakColor_G) == 0x0000CC, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakColor_B) == 0x0000D0, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakColor_A) == 0x0000D4, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D8, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000DC, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0000E0, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_MakeColor_ReturnValue) == 0x0000E4, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, K2Node_Select2_Default) == 0x0000F8, "Member 'BP_FogSheet_C_UserConstructionScript::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, K2Node_Select3_Default) == 0x000100, "Member 'BP_FogSheet_C_UserConstructionScript::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, K2Node_Select4_Default) == 0x000108, "Member 'BP_FogSheet_C_UserConstructionScript::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000110, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

