#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeroPedestal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_HeroPedestalAttachments_structs.hpp"
#include "OrionGame_structs.hpp"
#include "Enum_HeroHomeWorld_structs.hpp"


namespace SDK::Params
{

// Function BP_HeroPedestal.BP_HeroPedestal_C.SkinChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_HeroPedestal_C_SkinChanged__DelegateSignature final
{
public:
	Enum_HeroHomeWorld                            NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_SkinChanged__DelegateSignature) == 0x000001, "Wrong alignment on BP_HeroPedestal_C_SkinChanged__DelegateSignature");
static_assert(sizeof(BP_HeroPedestal_C_SkinChanged__DelegateSignature) == 0x000001, "Wrong size on BP_HeroPedestal_C_SkinChanged__DelegateSignature");
static_assert(offsetof(BP_HeroPedestal_C_SkinChanged__DelegateSignature, NewParam) == 0x000000, "Member 'BP_HeroPedestal_C_SkinChanged__DelegateSignature::NewParam' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.ExecuteUbergraph_BP_HeroPedestal
// 0x0660 (0x0660 - 0x0000)
struct BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPedestalActorType                            Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPedestalActorType                            Temp_byte_Variable2;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable3;                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable4;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select2_Default;                            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0068(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHeroRotationDelta_DeltaX;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0094(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisKeyEvent_AxisValue3;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue2;         // 0x00BC(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll2;                       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch2;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw2;                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable;                              // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x00F8(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0108(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue2;         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_InputAxisKeyEvent_AxisValue2;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x0138(0x0018)(HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_InputAxisKeyEvent_AxisValue;                // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPedestalActorType                            K2Node_Event_PedestalActorType;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select3_Default;                            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue2;                         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionHeroPedestalAnimInstance*         K2Node_DynamicCast_AsOrion_Hero_Pedestal_Anim_Instance; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x2];                                      // 0x0222(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0230(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue3;                      // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0xC];                                      // 0x0264(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select4_Default;                            // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x02A0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0xC];                                      // 0x02D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TInterpTo_ReturnValue;                    // 0x02E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult2;     // 0x0340(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue2;        // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TransformTransform_ReturnValue; // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA[0x6];                                      // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select5_Default;                            // 0x03D0(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0400(0x0010)(ZeroConstructor, ReferenceParm)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0410(0x0030)(IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Planet_C*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0450(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_Planet_C*                           CallFunc_Array_Get_Item2;                          // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Planet_C*                           K2Node_DynamicCast_AsBP_Planet;                    // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A[0x2];                                      // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x047C(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue2;     // 0x0488(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0494(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x04A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x04B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0538(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult2; // 0x05C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x064A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x064B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D[0x3];                                      // 0x064D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0655(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_656[0x2];                                      // 0x0656(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal) == 0x000010, "Wrong alignment on BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal");
static_assert(sizeof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal) == 0x000660, "Wrong size on BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, EntryPoint) == 0x000000, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_bool_Variable) == 0x000004, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_byte_Variable) == 0x000005, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_bool_Variable2) == 0x000006, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_bool_Variable3) == 0x000007, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_bool_Variable4) == 0x000008, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_bool_Variable5) == 0x000009, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_bool_Variable6) == 0x00000A, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_bool_Variable7) == 0x00000B, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_byte_Variable2) == 0x00000C, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_Select_Default) == 0x00000D, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_SwitchEnum_CmpSuccess) == 0x00000E, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_string_Variable) == 0x000010, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_string_Variable2) == 0x000020, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_string_Variable3) == 0x000030, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_string_Variable3' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_string_Variable4) == 0x000040, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_string_Variable4' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_Select2_Default) == 0x000058, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000068, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_BreakRotator_Roll) == 0x000074, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_BreakRotator_Pitch) == 0x000078, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_BreakRotator_Yaw) == 0x00007C, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_Event_DeltaSeconds) == 0x000080, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_GetHeroRotationDelta_DeltaX) == 0x000084, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_GetHeroRotationDelta_DeltaX' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_FClamp_ReturnValue) == 0x00008C, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_MakeRotator_ReturnValue) == 0x000094, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000A0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0000A4, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_InputAxisKeyEvent_AxisValue3) == 0x0000B0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_InputAxisKeyEvent_AxisValue3' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000B4, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Abs_ReturnValue) == 0x0000B8, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_GetActorRotation_ReturnValue2) == 0x0000BC, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_GetActorRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000C8, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_BreakRotator_Roll2) == 0x0000CC, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_BreakRotator_Roll2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_BreakRotator_Pitch2) == 0x0000D0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_BreakRotator_Pitch2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_BreakRotator_Yaw2) == 0x0000D4, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_BreakRotator_Yaw2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0000D8, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_struct_Variable) == 0x0000E0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_MakeRotator_ReturnValue2) == 0x0000F8, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_MakeRotator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_InputKeyEvent_Key) == 0x000108, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_SetActorRotation_ReturnValue2) == 0x000120, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_SetActorRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_InputAxisKeyEvent_AxisValue2) == 0x000124, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_InputAxisKeyEvent_AxisValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_int_Loop_Counter_Variable) == 0x000128, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_IsValid_ReturnValue) == 0x00012C, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Add_IntInt_ReturnValue) == 0x000130, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_InputKeyEvent_Key2) == 0x000138, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_InputKeyEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_Event_EndPlayReason) == 0x000150, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_IsValid_ReturnValue2) == 0x000151, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000158, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001E0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_InputAxisKeyEvent_AxisValue) == 0x0001E4, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_InputAxisKeyEvent_AxisValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_Event_PedestalActorType) == 0x0001E8, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_Event_PedestalActorType' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0001EC, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0001F0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_int_Array_Index_Variable2) == 0x0001F4, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_Select3_Default) == 0x0001F8, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_FClamp_ReturnValue2) == 0x0001FC, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Abs_ReturnValue2) == 0x000200, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Abs_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_GetAnimInstance_ReturnValue) == 0x000208, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000210, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_DynamicCast_AsOrion_Hero_Pedestal_Anim_Instance) == 0x000218, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_DynamicCast_AsOrion_Hero_Pedestal_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000221, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x000224, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x000228, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Add_FloatFloat_ReturnValue) == 0x00022C, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000230, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_FClamp_ReturnValue3) == 0x000260, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_FClamp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_Select4_Default) == 0x000270, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_GetTransform_ReturnValue) == 0x0002A0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0002D0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_TInterpTo_ReturnValue) == 0x0002E0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_TInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000310, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_SetActorTransform_SweepHitResult2) == 0x000340, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_SetActorTransform_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_SetActorTransform_ReturnValue2) == 0x0003C8, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_SetActorTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_EqualEqual_TransformTransform_ReturnValue) == 0x0003C9, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_EqualEqual_TransformTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_Select5_Default) == 0x0003D0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_GetChildrenComponents_Children) == 0x000400, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_TLerp_ReturnValue) == 0x000410, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Array_Get_Item) == 0x000440, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Array_Length_ReturnValue) == 0x000448, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_GetAllActorsOfClass_OutActors) == 0x000450, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Array_Get_Item2) == 0x000460, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Array_Length_ReturnValue2) == 0x000468, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_DynamicCast_AsBP_Planet) == 0x000470, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_DynamicCast_AsBP_Planet' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_DynamicCast_bSuccess2) == 0x000478, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Less_IntInt_ReturnValue) == 0x000479, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00047C, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_GetComponentRotation_ReturnValue2) == 0x000488, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_GetComponentRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000494, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x0004A0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x0004B0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000538, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult2) == 0x0005C0, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_SwitchEnum2_CmpSuccess) == 0x000648, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_SwitchEnum3_CmpSuccess) == 0x000649, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_SwitchEnum4_CmpSuccess) == 0x00064A, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_SwitchEnum5_CmpSuccess) == 0x00064B, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_SwitchEnum6_CmpSuccess) == 0x00064C, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, Temp_int_Loop_Counter_Variable2) == 0x000650, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, K2Node_SwitchEnum7_CmpSuccess) == 0x000654, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Less_IntInt_ReturnValue2) == 0x000655, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal, CallFunc_Add_IntInt_ReturnValue2) == 0x000658, "Member 'BP_HeroPedestal_C_ExecuteUbergraph_BP_HeroPedestal::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.OnPedestalActorTypeSet
// 0x0001 (0x0001 - 0x0000)
struct BP_HeroPedestal_C_OnPedestalActorTypeSet final
{
public:
	EPedestalActorType                            PedestalActorType_0;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_OnPedestalActorTypeSet) == 0x000001, "Wrong alignment on BP_HeroPedestal_C_OnPedestalActorTypeSet");
static_assert(sizeof(BP_HeroPedestal_C_OnPedestalActorTypeSet) == 0x000001, "Wrong size on BP_HeroPedestal_C_OnPedestalActorTypeSet");
static_assert(offsetof(BP_HeroPedestal_C_OnPedestalActorTypeSet, PedestalActorType_0) == 0x000000, "Member 'BP_HeroPedestal_C_OnPedestalActorTypeSet::PedestalActorType_0' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_10
// 0x0004 (0x0004 - 0x0000)
struct BP_HeroPedestal_C_InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_10 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_10) == 0x000004, "Wrong alignment on BP_HeroPedestal_C_InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_10");
static_assert(sizeof(BP_HeroPedestal_C_InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_10) == 0x000004, "Wrong size on BP_HeroPedestal_C_InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_10");
static_assert(offsetof(BP_HeroPedestal_C_InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_10, AxisValue) == 0x000000, "Member 'BP_HeroPedestal_C_InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent_10::AxisValue' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_HeroPedestal_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_HeroPedestal_C_ReceiveEndPlay");
static_assert(sizeof(BP_HeroPedestal_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_HeroPedestal_C_ReceiveEndPlay");
static_assert(offsetof(BP_HeroPedestal_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_HeroPedestal_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.InpAxisKeyEvt_Gamepad_RightY_K2Node_InputAxisKeyEvent_13
// 0x0004 (0x0004 - 0x0000)
struct BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightY_K2Node_InputAxisKeyEvent_13 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightY_K2Node_InputAxisKeyEvent_13) == 0x000004, "Wrong alignment on BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightY_K2Node_InputAxisKeyEvent_13");
static_assert(sizeof(BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightY_K2Node_InputAxisKeyEvent_13) == 0x000004, "Wrong size on BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightY_K2Node_InputAxisKeyEvent_13");
static_assert(offsetof(BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightY_K2Node_InputAxisKeyEvent_13, AxisValue) == 0x000000, "Member 'BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightY_K2Node_InputAxisKeyEvent_13::AxisValue' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.InpAxisKeyEvt_Gamepad_RightX_K2Node_InputAxisKeyEvent_0
// 0x0004 (0x0004 - 0x0000)
struct BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightX_K2Node_InputAxisKeyEvent_0 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightX_K2Node_InputAxisKeyEvent_0) == 0x000004, "Wrong alignment on BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightX_K2Node_InputAxisKeyEvent_0");
static_assert(sizeof(BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightX_K2Node_InputAxisKeyEvent_0) == 0x000004, "Wrong size on BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightX_K2Node_InputAxisKeyEvent_0");
static_assert(offsetof(BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightX_K2Node_InputAxisKeyEvent_0, AxisValue) == 0x000000, "Member 'BP_HeroPedestal_C_InpAxisKeyEvt_Gamepad_RightX_K2Node_InputAxisKeyEvent_0::AxisValue' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HeroPedestal_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_HeroPedestal_C_ReceiveTick");
static_assert(sizeof(BP_HeroPedestal_C_ReceiveTick) == 0x000004, "Wrong size on BP_HeroPedestal_C_ReceiveTick");
static_assert(offsetof(BP_HeroPedestal_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_HeroPedestal_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1");
static_assert(sizeof(BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1");
static_assert(offsetof(BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'BP_HeroPedestal_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function BP_HeroPedestal.BP_HeroPedestal_C.UserConstructionScript
// 0x0500 (0x0500 - 0x0000)
struct BP_HeroPedestal_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue2;     // 0x0030(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x003C(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll2;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch2;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw2;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x00E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x00F0(0x000C)(IsPlainOldData, NoDestructor)
