#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Impact_Decal_Scorch_Embers_Med

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Impact_Decal_Scorch_Embers_Med.BP_Impact_Decal_Scorch_Embers_Med_C.ExecuteUbergraph_BP_Impact_Decal_Scorch_Embers_Med
// 0x0004 (0x0004 - 0x0000)
struct BP_Impact_Decal_Scorch_Embers_Med_C_ExecuteUbergraph_BP_Impact_Decal_Scorch_Embers_Med final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Impact_Decal_Scorch_Embers_Med_C_ExecuteUbergraph_BP_Impact_Decal_Scorch_Embers_Med) == 0x000004, "Wrong alignment on BP_Impact_Decal_Scorch_Embers_Med_C_ExecuteUbergraph_BP_Impact_Decal_Scorch_Embers_Med");
static_assert(sizeof(BP_Impact_Decal_Scorch_Embers_Med_C_ExecuteUbergraph_BP_Impact_Decal_Scorch_Embers_Med) == 0x000004, "Wrong size on BP_Impact_Decal_Scorch_Embers_Med_C_ExecuteUbergraph_BP_Impact_Decal_Scorch_Embers_Med");
static_assert(offsetof(BP_Impact_Decal_Scorch_Embers_Med_C_ExecuteUbergraph_BP_Impact_Decal_Scorch_Embers_Med, EntryPoint) == 0x000000, "Member 'BP_Impact_Decal_Scorch_Embers_Med_C_ExecuteUbergraph_BP_Impact_Decal_Scorch_Embers_Med::EntryPoint' has a wrong offset!");

// Function BP_Impact_Decal_Scorch_Embers_Med.BP_Impact_Decal_Scorch_Embers_Med_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue2;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript");
static_assert(sizeof(BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript");
static_assert(offsetof(BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000004, "Member 'BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue2) == 0x000008, "Member 'BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00000C, "Member 'BP_Impact_Decal_Scorch_Embers_Med_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

