#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootCrate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ChestandCrate_classes.hpp"
#include "OrionGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LootCrate.BP_LootCrate_C
// 0x0050 (0x0510 - 0x04C0)
class ABP_LootCrate_C final : public ABP_ChestandCrate_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LootCrate_C;                     // 0x04C0(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_LootCrate_LoopingCharge;                         // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Activation_Timeline_EmissivePulsingLights_D167F8EF459C19D032C857B29B7BDD1C; // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Activation_Timeline_EmissiveGlow_D167F8EF459C19D032C857B29B7BDD1C; // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Activation_Timeline__Direction_D167F8EF459C19D032C857B29B7BDD1C; // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Activation_Timeline;                               // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_6E3E9F384BBD9EA5C2A4FD9DFBF7DF09; // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera;                                            // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Key_MID;                                           // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GoldenKey;                                         // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_LootCrate(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Reset();
	void OpenChest(EOrionItemRarity Rarity);
	void InsertKey();
	void Activation_Timeline__Activate_Charge__EventFunc();
	void Activation_Timeline__UpdateFunc();
	void Activation_Timeline__FinishedFunc();
	void Timeline_0__Insert_Key__EventFunc();
	void Timeline_0__Open__EventFunc();
	void Timeline_0__Reset__EventFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();
	void SetGoldenKey(bool IsGolden);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LootCrate_C">();
	}
	static class ABP_LootCrate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LootCrate_C>();
	}
};
static_assert(alignof(ABP_LootCrate_C) == 0x000008, "Wrong alignment on ABP_LootCrate_C");
static_assert(sizeof(ABP_LootCrate_C) == 0x000510, "Wrong size on ABP_LootCrate_C");
static_assert(offsetof(ABP_LootCrate_C, UberGraphFrame_BP_LootCrate_C) == 0x0004C0, "Member 'ABP_LootCrate_C::UberGraphFrame_BP_LootCrate_C' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, P_LootCrate_LoopingCharge) == 0x0004C8, "Member 'ABP_LootCrate_C::P_LootCrate_LoopingCharge' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, Activation_Timeline_EmissivePulsingLights_D167F8EF459C19D032C857B29B7BDD1C) == 0x0004D0, "Member 'ABP_LootCrate_C::Activation_Timeline_EmissivePulsingLights_D167F8EF459C19D032C857B29B7BDD1C' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, Activation_Timeline_EmissiveGlow_D167F8EF459C19D032C857B29B7BDD1C) == 0x0004D4, "Member 'ABP_LootCrate_C::Activation_Timeline_EmissiveGlow_D167F8EF459C19D032C857B29B7BDD1C' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, Activation_Timeline__Direction_D167F8EF459C19D032C857B29B7BDD1C) == 0x0004D8, "Member 'ABP_LootCrate_C::Activation_Timeline__Direction_D167F8EF459C19D032C857B29B7BDD1C' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, Activation_Timeline) == 0x0004E0, "Member 'ABP_LootCrate_C::Activation_Timeline' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, Timeline_0__Direction_6E3E9F384BBD9EA5C2A4FD9DFBF7DF09) == 0x0004E8, "Member 'ABP_LootCrate_C::Timeline_0__Direction_6E3E9F384BBD9EA5C2A4FD9DFBF7DF09' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, Timeline_0) == 0x0004F0, "Member 'ABP_LootCrate_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, Camera) == 0x0004F8, "Member 'ABP_LootCrate_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, Key_MID) == 0x000500, "Member 'ABP_LootCrate_C::Key_MID' has a wrong offset!");
static_assert(offsetof(ABP_LootCrate_C, GoldenKey) == 0x000508, "Member 'ABP_LootCrate_C::GoldenKey' has a wrong offset!");

}

