#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootCrate

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LootCrate.BP_LootCrate_C.ExecuteUbergraph_BP_LootCrate
// 0x0098 (0x0098 - 0x0000)
struct BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionItemRarity                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x0018(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable3;                             // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable4;                             // 0x0038(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable5;                             // 0x0048(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable2;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionItemRarity                              K2Node_Event_Rarity;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select2_Default;                            // 0x007C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate) == 0x000008, "Wrong alignment on BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate");
static_assert(sizeof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate) == 0x000098, "Wrong size on BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, EntryPoint) == 0x000000, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, Temp_byte_Variable) == 0x000004, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, Temp_struct_Variable) == 0x000008, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, Temp_struct_Variable2) == 0x000018, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, Temp_struct_Variable3) == 0x000028, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, Temp_struct_Variable4) == 0x000038, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, Temp_struct_Variable5) == 0x000048, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, Temp_bool_Variable) == 0x000058, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, Temp_object_Variable) == 0x000060, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, Temp_object_Variable2) == 0x000068, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, K2Node_Select_Default) == 0x000070, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, K2Node_Event_Rarity) == 0x000078, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::K2Node_Event_Rarity' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, K2Node_Select2_Default) == 0x00007C, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000090, "Member 'BP_LootCrate_C_ExecuteUbergraph_BP_LootCrate::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_LootCrate.BP_LootCrate_C.OpenChest
// 0x0001 (0x0001 - 0x0000)
struct BP_LootCrate_C_OpenChest final
{
public:
	EOrionItemRarity                              Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootCrate_C_OpenChest) == 0x000001, "Wrong alignment on BP_LootCrate_C_OpenChest");
static_assert(sizeof(BP_LootCrate_C_OpenChest) == 0x000001, "Wrong size on BP_LootCrate_C_OpenChest");
static_assert(offsetof(BP_LootCrate_C_OpenChest, Rarity) == 0x000000, "Member 'BP_LootCrate_C_OpenChest::Rarity' has a wrong offset!");

// Function BP_LootCrate.BP_LootCrate_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_LootCrate_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootCrate_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_LootCrate_C_UserConstructionScript");
static_assert(sizeof(BP_LootCrate_C_UserConstructionScript) == 0x000008, "Wrong size on BP_LootCrate_C_UserConstructionScript");
static_assert(offsetof(BP_LootCrate_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_LootCrate_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_LootCrate.BP_LootCrate_C.SetGoldenKey
// 0x0001 (0x0001 - 0x0000)
struct BP_LootCrate_C_SetGoldenKey final
{
public:
	bool                                          IsGolden;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LootCrate_C_SetGoldenKey) == 0x000001, "Wrong alignment on BP_LootCrate_C_SetGoldenKey");
static_assert(sizeof(BP_LootCrate_C_SetGoldenKey) == 0x000001, "Wrong size on BP_LootCrate_C_SetGoldenKey");
static_assert(offsetof(BP_LootCrate_C_SetGoldenKey, IsGolden) == 0x000000, "Member 'BP_LootCrate_C_SetGoldenKey::IsGolden' has a wrong offset!");

}

