#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NearbyEnemyWarning_Volume

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NearbyEnemyWarning_Volume.BP_NearbyEnemyWarning_Volume_C.ExecuteUbergraph_BP_NearbyEnemyWarning_Volume
// 0x00C0 (0x00C0 - 0x0000)
struct BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue2;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue2;      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0098(0x0008)(NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue2;         // 0x00A0(0x0008)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume) == 0x000008, "Wrong alignment on BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume");
static_assert(sizeof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume) == 0x0000C0, "Wrong size on BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, EntryPoint) == 0x000000, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, Temp_bool_Variable) == 0x000004, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, Temp_bool_Variable2) == 0x000020, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, K2Node_Event_OtherActor) == 0x000028, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000038, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_OnSameTeam_ReturnValue) == 0x000049, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00004A, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_GetOwner_ReturnValue2) == 0x000050, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_GetActorTeam_ReturnValue) == 0x000058, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000060, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2) == 0x000080, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, K2Node_DynamicCast_bSuccess2) == 0x000090, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_OnSameTeam_ReturnValue2) == 0x000091, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_OnSameTeam_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_HasMatchingGameplayTag_ReturnValue2) == 0x000092, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_HasMatchingGameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000098, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_K2_SetTimerDelegate_ReturnValue2) == 0x0000A0, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_K2_SetTimerDelegate_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000AC, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_NearbyEnemyWarning_Volume_C_ExecuteUbergraph_BP_NearbyEnemyWarning_Volume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_NearbyEnemyWarning_Volume.BP_NearbyEnemyWarning_Volume_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_NearbyEnemyWarning_Volume_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NearbyEnemyWarning_Volume_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_NearbyEnemyWarning_Volume_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_NearbyEnemyWarning_Volume_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_NearbyEnemyWarning_Volume_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_NearbyEnemyWarning_Volume_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_NearbyEnemyWarning_Volume_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

