#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAI_Prototype_Melee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OrionCharAI_BipedBot_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OrionCharAI_Prototype_Melee.BP_OrionCharAI_Prototype_Melee_C
// 0x0090 (0x0E90 - 0x0E00)
class ABP_OrionCharAI_Prototype_Melee_C final : public ABP_OrionCharAI_BipedBot_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_OrionCharAI_Prototype_Melee_C;   // 0x0E00(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Armor1;                                            // 0x0E08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Armor2;                                            // 0x0E10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_MinionProto_Armor_ChunksFalling;                 // 0x0E18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_MinionProto_ArmorBreak;                          // 0x0E20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Minion_LastHit_Glow;                             // 0x0E28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Armor4;                                            // 0x0E30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   JuicyCore;                                         // 0x0E38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Armor3;                                            // 0x0E40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flesh;                                             // 0x0E48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_EmissiveLerp_144FE1AF42CC314B0C25F0B899B27609; // 0x0E50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_144FE1AF42CC314B0C25F0B899B27609; // 0x0E54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E55[0x3];                                      // 0x0E55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0E58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           ArmorMeshes;                                       // 0x0E60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               Armor_Mat1;                                        // 0x0E70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Armor_Mat2;                                        // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Armor_Mat3;                                        // 0x0E80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cracked;                                           // 0x0E88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Broken;                                            // 0x0E89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BreakOff();
	void CrackOn();
	void GameplayCue_Death(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Damage(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OrionCharAI_Prototype_Melee_C">();
	}
	static class ABP_OrionCharAI_Prototype_Melee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OrionCharAI_Prototype_Melee_C>();
	}
};
static_assert(alignof(ABP_OrionCharAI_Prototype_Melee_C) == 0x000010, "Wrong alignment on ABP_OrionCharAI_Prototype_Melee_C");
static_assert(sizeof(ABP_OrionCharAI_Prototype_Melee_C) == 0x000E90, "Wrong size on ABP_OrionCharAI_Prototype_Melee_C");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, UberGraphFrame_BP_OrionCharAI_Prototype_Melee_C) == 0x000E00, "Member 'ABP_OrionCharAI_Prototype_Melee_C::UberGraphFrame_BP_OrionCharAI_Prototype_Melee_C' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Armor1) == 0x000E08, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Armor1' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Armor2) == 0x000E10, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Armor2' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, P_MinionProto_Armor_ChunksFalling) == 0x000E18, "Member 'ABP_OrionCharAI_Prototype_Melee_C::P_MinionProto_Armor_ChunksFalling' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, P_MinionProto_ArmorBreak) == 0x000E20, "Member 'ABP_OrionCharAI_Prototype_Melee_C::P_MinionProto_ArmorBreak' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, P_Minion_LastHit_Glow) == 0x000E28, "Member 'ABP_OrionCharAI_Prototype_Melee_C::P_Minion_LastHit_Glow' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Armor4) == 0x000E30, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Armor4' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, JuicyCore) == 0x000E38, "Member 'ABP_OrionCharAI_Prototype_Melee_C::JuicyCore' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Armor3) == 0x000E40, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Armor3' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Flesh) == 0x000E48, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Flesh' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Timeline_0_EmissiveLerp_144FE1AF42CC314B0C25F0B899B27609) == 0x000E50, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Timeline_0_EmissiveLerp_144FE1AF42CC314B0C25F0B899B27609' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Timeline_0__Direction_144FE1AF42CC314B0C25F0B899B27609) == 0x000E54, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Timeline_0__Direction_144FE1AF42CC314B0C25F0B899B27609' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Timeline_0) == 0x000E58, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, ArmorMeshes) == 0x000E60, "Member 'ABP_OrionCharAI_Prototype_Melee_C::ArmorMeshes' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Armor_Mat1) == 0x000E70, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Armor_Mat1' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Armor_Mat2) == 0x000E78, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Armor_Mat2' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Armor_Mat3) == 0x000E80, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Armor_Mat3' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Cracked) == 0x000E88, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Cracked' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Prototype_Melee_C, Broken) == 0x000E89, "Member 'ABP_OrionCharAI_Prototype_Melee_C::Broken' has a wrong offset!");

}

