#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAISpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OrionCharAISpawner.BP_OrionCharAISpawner_C
// 0x0058 (0x0738 - 0x06E0)
class ABP_OrionCharAISpawner_C : public AOrionCharAISpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E0(0x0008)(Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow1;                                            // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender1;                                       // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBox;                                      // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         SpawnedGameplayEffectsToApply;                     // 0x0710(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UClass*>                         SpawnedGameplayEffectsToApply_Supers;              // 0x0720(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          SpawnSuperWave;                                    // 0x0730(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SpawnSiegeWave;                                    // 0x0731(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_OrionCharAISpawner(int32 EntryPoint);
	void OnPostSpawnedAI(class AOrionCharAI* SpawnedAI);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OrionCharAISpawner_C">();
	}
	static class ABP_OrionCharAISpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OrionCharAISpawner_C>();
	}
};
static_assert(alignof(ABP_OrionCharAISpawner_C) == 0x000008, "Wrong alignment on ABP_OrionCharAISpawner_C");
static_assert(sizeof(ABP_OrionCharAISpawner_C) == 0x000738, "Wrong size on ABP_OrionCharAISpawner_C");
static_assert(offsetof(ABP_OrionCharAISpawner_C, UberGraphFrame) == 0x0006E0, "Member 'ABP_OrionCharAISpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAISpawner_C, Arrow1) == 0x0006E8, "Member 'ABP_OrionCharAISpawner_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAISpawner_C, StaticMesh2) == 0x0006F0, "Member 'ABP_OrionCharAISpawner_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAISpawner_C, StaticMesh1) == 0x0006F8, "Member 'ABP_OrionCharAISpawner_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAISpawner_C, TextRender1) == 0x000700, "Member 'ABP_OrionCharAISpawner_C::TextRender1' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAISpawner_C, CollisionBox) == 0x000708, "Member 'ABP_OrionCharAISpawner_C::CollisionBox' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAISpawner_C, SpawnedGameplayEffectsToApply) == 0x000710, "Member 'ABP_OrionCharAISpawner_C::SpawnedGameplayEffectsToApply' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAISpawner_C, SpawnedGameplayEffectsToApply_Supers) == 0x000720, "Member 'ABP_OrionCharAISpawner_C::SpawnedGameplayEffectsToApply_Supers' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAISpawner_C, SpawnSuperWave) == 0x000730, "Member 'ABP_OrionCharAISpawner_C::SpawnSuperWave' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAISpawner_C, SpawnSiegeWave) == 0x000731, "Member 'ABP_OrionCharAISpawner_C::SpawnSiegeWave' has a wrong offset!");

}

