#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAI_Dragon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OrionCharAI_JungleCreep_BaseBuff_classes.hpp"
#include "OrionGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OrionCharAI_Dragon.BP_OrionCharAI_Dragon_C
// 0x0020 (0x0DA0 - 0x0D80)
class ABP_OrionCharAI_Dragon_C final : public ABP_OrionCharAI_JungleCreep_BaseBuff_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D80(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_ToApplyToTeamOnDeath;                           // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_toApplyDragonRoarSound;                         // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OrionCharAI_Dragon(int32 EntryPoint);
	void OnDeath_Bind(class AOrionChar* DeadChar, class AController* Killer, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OrionCharAI_Dragon_C">();
	}
	static class ABP_OrionCharAI_Dragon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OrionCharAI_Dragon_C>();
	}
};
static_assert(alignof(ABP_OrionCharAI_Dragon_C) == 0x000010, "Wrong alignment on ABP_OrionCharAI_Dragon_C");
static_assert(sizeof(ABP_OrionCharAI_Dragon_C) == 0x000DA0, "Wrong size on ABP_OrionCharAI_Dragon_C");
static_assert(offsetof(ABP_OrionCharAI_Dragon_C, UberGraphFrame) == 0x000D80, "Member 'ABP_OrionCharAI_Dragon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Dragon_C, GE_ToApplyToTeamOnDeath) == 0x000D88, "Member 'ABP_OrionCharAI_Dragon_C::GE_ToApplyToTeamOnDeath' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Dragon_C, GE_toApplyDragonRoarSound) == 0x000D90, "Member 'ABP_OrionCharAI_Dragon_C::GE_toApplyDragonRoarSound' has a wrong offset!");

}

