#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAI_JungleCreep_PrimeHelix_V2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function BP_OrionCharAI_JungleCreep_PrimeHelix_V2.BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C.ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2
// 0x03E0 (0x03E0 - 0x0000)
struct BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PrimeHelix_SpawnComet_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GSM_BaseMOBA_C*                     K2Node_DynamicCast_AsBP_GSM_Base_MOBA;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0098(0x0020)()
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             K2Node_CustomEvent_DeadChar;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_Killer;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IOrionTeamActorInterface> K2Node_DynamicCast_AsOrion_Team_Actor_Interface;   // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionPlayerState_Game*                 K2Node_DynamicCast_AsOrion_Player_State_Game;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    Temp_byte_Variable;                                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionTeamInfo*                         CallFunc_GetTeamByIndex_ReturnValue;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFinishedSpawning_ReturnValue;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AController*>                    CallFunc_GetPlayerArray_ReturnValue;               // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	class AController*                            CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionPlayerState_Game*                 K2Node_DynamicCast_AsOrion_Player_State_Game2;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0144(0x0008)(NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0150(0x00B8)(ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             K2Node_DynamicCast_AsOrion_Char;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x021C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0228(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0234(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0240(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0280(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Prime_Helix_PrimaryFire_ImpactFX_C* CallFunc_FinishSpawningActor_ReturnValue2;         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AOrionChar* DeadChar, class AController* Killer, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate;              // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0338(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0348(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2) == 0x000010, "Wrong alignment on BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2");
static_assert(sizeof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2) == 0x0003E0, "Wrong size on BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, EntryPoint) == 0x000000, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_BreakVector_X) == 0x000008, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_BreakVector_Y) == 0x00000C, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_BreakVector_Z) == 0x000010, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_MakeVector_ReturnValue) == 0x000064, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_GetGameState_ReturnValue) == 0x000070, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_AsBP_GSM_Base_MOBA) == 0x000078, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_AsBP_GSM_Base_MOBA' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_HasAuthority_ReturnValue) == 0x000081, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000098, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_EvaluateCurveTableRow_OutResult) == 0x0000B8, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_EvaluateCurveTableRow_OutXY) == 0x0000BC, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_CustomEvent_DeadChar) == 0x0000C0, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_CustomEvent_DeadChar' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_CustomEvent_Killer) == 0x0000C8, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_CustomEvent_DamageCauser) == 0x0000D0, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_GetActorTeam_ReturnValue) == 0x0000D8, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_AsOrion_Team_Actor_Interface) == 0x0000E0, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_AsOrion_Team_Actor_Interface' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_bSuccess2) == 0x0000F0, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_GetTeamNum_ReturnValue) == 0x0000F1, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_SwitchEnum_CmpSuccess) == 0x0000F2, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_AsOrion_Player_State_Game) == 0x0000F8, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_AsOrion_Player_State_Game' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_bSuccess3) == 0x000100, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, Temp_byte_Variable) == 0x000101, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_GetTeamByIndex_ReturnValue) == 0x000108, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_GetTeamByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_HasFinishedSpawning_ReturnValue) == 0x000110, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_HasFinishedSpawning_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_GetPlayerArray_ReturnValue) == 0x000118, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_GetPlayerArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_Array_Get_Item) == 0x000128, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_AsOrion_Player_State_Game2) == 0x000138, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_AsOrion_Player_State_Game2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_bSuccess4) == 0x000140, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_IsDead_ReturnValue) == 0x000141, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_IsValid_ReturnValue) == 0x000142, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000144, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_GameplayCueEvent_EventType) == 0x00014C, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_GameplayCueEvent_Parameters) == 0x000150, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000208, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_AsOrion_Char) == 0x000210, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_AsOrion_Char' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_DynamicCast_bSuccess5) == 0x000218, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00021C, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_GetSocketLocation_ReturnValue) == 0x000228, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000234, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_MakeRotFromX_ReturnValue) == 0x000240, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_MakeTransform_ReturnValue) == 0x000250, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000280, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2) == 0x000308, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_FinishSpawningActor_ReturnValue2) == 0x000310, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_FinishSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, Temp_int_Loop_Counter_Variable) == 0x000318, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, K2Node_CreateDelegate_OutputDelegate) == 0x000320, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_Less_IntInt_ReturnValue) == 0x000330, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_Add_IntInt_ReturnValue) == 0x000334, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_VLerp_ReturnValue) == 0x000338, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000348, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0003D0, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_OrionCharAI_JungleCreep_PrimeHelix_V2.BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C.GameplayCue.PrimeHelix.PrimaryAttack
// 0x00C0 (0x00C0 - 0x0000)
struct BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_GameplayCue_PrimeHelix_PrimaryAttack final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_GameplayCue_PrimeHelix_PrimaryAttack) == 0x000008, "Wrong alignment on BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_GameplayCue_PrimeHelix_PrimaryAttack");
static_assert(sizeof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_GameplayCue_PrimeHelix_PrimaryAttack) == 0x0000C0, "Wrong size on BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_GameplayCue_PrimeHelix_PrimaryAttack");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_GameplayCue_PrimeHelix_PrimaryAttack, EventType) == 0x000000, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_GameplayCue_PrimeHelix_PrimaryAttack::EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_GameplayCue_PrimeHelix_PrimaryAttack, Parameters) == 0x000008, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_GameplayCue_PrimeHelix_PrimaryAttack::Parameters' has a wrong offset!");

// Function BP_OrionCharAI_JungleCreep_PrimeHelix_V2.BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C.OnDeath_Bind
// 0x0018 (0x0018 - 0x0000)
struct BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_OnDeath_Bind final
{
public:
	class AOrionChar*                             DeadChar;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_OnDeath_Bind) == 0x000008, "Wrong alignment on BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_OnDeath_Bind");
static_assert(sizeof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_OnDeath_Bind) == 0x000018, "Wrong size on BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_OnDeath_Bind");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_OnDeath_Bind, DeadChar) == 0x000000, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_OnDeath_Bind::DeadChar' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_OnDeath_Bind, Killer) == 0x000008, "Member 'BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C_OnDeath_Bind::Killer' has a wrong offset!");
