#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAI_Core_Boss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_OrionCharAI_JungleCreep_BaseBuff_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OrionCharAI_Core_Boss.BP_OrionCharAI_Core_Boss_C
// 0x0090 (0x0E10 - 0x0D80)
class ABP_OrionCharAI_Core_Boss_C final : public ABP_OrionCharAI_JungleCreep_BaseBuff_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D80(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_PrimeHelix_Attack;                               // 0x0D88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_PrimeHelix_LandingImpact;                        // 0x0D90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnFall_Timeline_FallTime_ACDA34194230A263683F9E80DA63E6C2; // 0x0D98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SpawnFall_Timeline__Direction_ACDA34194230A263683F9E80DA63E6C2; // 0x0D9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9D[0x3];                                      // 0x0D9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SpawnFall_Timeline;                                // 0x0DA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PrimeHelix_SpawnComet_C*            PH_SpawnComet;                                     // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLocation;                                       // 0x0DB0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnHeightOffset;                                 // 0x0DBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnXOffset;                                      // 0x0DC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SonicDelay;                                        // 0x0DC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnBPkillDelay;                                  // 0x0DC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HealthLessThan25Percent;                           // 0x0DCC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HealthIsZero;                                      // 0x0DCD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DCE[0x2];                                      // 0x0DCE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Health50Percent;                                   // 0x0DD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HealthLessThan50Percent;                           // 0x0DD4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD5[0x3];                                      // 0x0DD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Health25Percent;                                   // 0x0DD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DDC[0x4];                                      // 0x0DDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_Core_Critical_Alarm;                            // 0x0DE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CriticalDialogDelay;                               // 0x0DE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DEC[0x4];                                      // 0x0DEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_Core_Alarm;                                     // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageDialogDelay;                                 // 0x0DF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DFC[0x4];                                      // 0x0DFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_Core_Under_Attack_VO;                           // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Core_Critical_VO;                               // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OrionCharAI_Core_Boss(int32 EntryPoint);
	void ReceiveBeginPlay();
	void GameplayCue_PrimeHelix_PrimaryAttack(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void SpawnFall_Timeline__SonicBoom__EventFunc();
	void SpawnFall_Timeline__UpdateFunc();
	void SpawnFall_Timeline__FinishedFunc();
	void UserConstructionScript();
	void CheckHealthPercentage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OrionCharAI_Core_Boss_C">();
	}
	static class ABP_OrionCharAI_Core_Boss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OrionCharAI_Core_Boss_C>();
	}
};
static_assert(alignof(ABP_OrionCharAI_Core_Boss_C) == 0x000010, "Wrong alignment on ABP_OrionCharAI_Core_Boss_C");
static_assert(sizeof(ABP_OrionCharAI_Core_Boss_C) == 0x000E10, "Wrong size on ABP_OrionCharAI_Core_Boss_C");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, UberGraphFrame) == 0x000D80, "Member 'ABP_OrionCharAI_Core_Boss_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, P_PrimeHelix_Attack) == 0x000D88, "Member 'ABP_OrionCharAI_Core_Boss_C::P_PrimeHelix_Attack' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, P_PrimeHelix_LandingImpact) == 0x000D90, "Member 'ABP_OrionCharAI_Core_Boss_C::P_PrimeHelix_LandingImpact' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, SpawnFall_Timeline_FallTime_ACDA34194230A263683F9E80DA63E6C2) == 0x000D98, "Member 'ABP_OrionCharAI_Core_Boss_C::SpawnFall_Timeline_FallTime_ACDA34194230A263683F9E80DA63E6C2' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, SpawnFall_Timeline__Direction_ACDA34194230A263683F9E80DA63E6C2) == 0x000D9C, "Member 'ABP_OrionCharAI_Core_Boss_C::SpawnFall_Timeline__Direction_ACDA34194230A263683F9E80DA63E6C2' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, SpawnFall_Timeline) == 0x000DA0, "Member 'ABP_OrionCharAI_Core_Boss_C::SpawnFall_Timeline' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, PH_SpawnComet) == 0x000DA8, "Member 'ABP_OrionCharAI_Core_Boss_C::PH_SpawnComet' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, EndLocation) == 0x000DB0, "Member 'ABP_OrionCharAI_Core_Boss_C::EndLocation' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, SpawnHeightOffset) == 0x000DBC, "Member 'ABP_OrionCharAI_Core_Boss_C::SpawnHeightOffset' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, SpawnXOffset) == 0x000DC0, "Member 'ABP_OrionCharAI_Core_Boss_C::SpawnXOffset' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, SonicDelay) == 0x000DC4, "Member 'ABP_OrionCharAI_Core_Boss_C::SonicDelay' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, SpawnBPkillDelay) == 0x000DC8, "Member 'ABP_OrionCharAI_Core_Boss_C::SpawnBPkillDelay' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, HealthLessThan25Percent) == 0x000DCC, "Member 'ABP_OrionCharAI_Core_Boss_C::HealthLessThan25Percent' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, HealthIsZero) == 0x000DCD, "Member 'ABP_OrionCharAI_Core_Boss_C::HealthIsZero' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, Health50Percent) == 0x000DD0, "Member 'ABP_OrionCharAI_Core_Boss_C::Health50Percent' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, HealthLessThan50Percent) == 0x000DD4, "Member 'ABP_OrionCharAI_Core_Boss_C::HealthLessThan50Percent' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, Health25Percent) == 0x000DD8, "Member 'ABP_OrionCharAI_Core_Boss_C::Health25Percent' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, GE_Core_Critical_Alarm) == 0x000DE0, "Member 'ABP_OrionCharAI_Core_Boss_C::GE_Core_Critical_Alarm' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, CriticalDialogDelay) == 0x000DE8, "Member 'ABP_OrionCharAI_Core_Boss_C::CriticalDialogDelay' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, GE_Core_Alarm) == 0x000DF0, "Member 'ABP_OrionCharAI_Core_Boss_C::GE_Core_Alarm' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, DamageDialogDelay) == 0x000DF8, "Member 'ABP_OrionCharAI_Core_Boss_C::DamageDialogDelay' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, GE_Core_Under_Attack_VO) == 0x000E00, "Member 'ABP_OrionCharAI_Core_Boss_C::GE_Core_Under_Attack_VO' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_Core_Boss_C, GE_Core_Critical_VO) == 0x000E08, "Member 'ABP_OrionCharAI_Core_Boss_C::GE_Core_Critical_VO' has a wrong offset!");

}

