#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAI_BipedBot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OrionCharAI_BipedBot.BP_OrionCharAI_BipedBot_C
// 0x0020 (0x0E00 - 0x0DE0)
class ABP_OrionCharAI_BipedBot_C : public AOrionCharAI_Minion
{
public:
	uint8                                         Pad_DD8[0x8];                                      // 0x0DD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0DE0(0x0008)(Transient, DuplicateTransient)
	class USoundCue*                              SFX_HoverBotBeamAttack;                            // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              SFX_HoverBotBeamAttackImpact;                      // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MinionImpactFX;                                    // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OrionCharAI_BipedBot(int32 EntryPoint);
	void GameplayCue_Minion_LastHitVulnerable(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Damage_DoT(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Damage(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OrionCharAI_BipedBot_C">();
	}
	static class ABP_OrionCharAI_BipedBot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OrionCharAI_BipedBot_C>();
	}
};
static_assert(alignof(ABP_OrionCharAI_BipedBot_C) == 0x000010, "Wrong alignment on ABP_OrionCharAI_BipedBot_C");
static_assert(sizeof(ABP_OrionCharAI_BipedBot_C) == 0x000E00, "Wrong size on ABP_OrionCharAI_BipedBot_C");
static_assert(offsetof(ABP_OrionCharAI_BipedBot_C, UberGraphFrame) == 0x000DE0, "Member 'ABP_OrionCharAI_BipedBot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_BipedBot_C, SFX_HoverBotBeamAttack) == 0x000DE8, "Member 'ABP_OrionCharAI_BipedBot_C::SFX_HoverBotBeamAttack' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_BipedBot_C, SFX_HoverBotBeamAttackImpact) == 0x000DF0, "Member 'ABP_OrionCharAI_BipedBot_C::SFX_HoverBotBeamAttackImpact' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_BipedBot_C, MinionImpactFX) == 0x000DF8, "Member 'ABP_OrionCharAI_BipedBot_C::MinionImpactFX' has a wrong offset!");

}

