#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAI_BipedBot

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_OrionCharAI_BipedBot.BP_OrionCharAI_BipedBot_C.ExecuteUbergraph_BP_OrionCharAI_BipedBot
// 0x0240 (0x0240 - 0x0000)
struct BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType3;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters3;               // 0x0008(0x00B8)(ContainsInstancedReference)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType2;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters2;               // 0x00C8(0x00B8)(ContainsInstancedReference)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0188(0x00B8)(ContainsInstancedReference)
};
static_assert(alignof(BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot) == 0x000008, "Wrong alignment on BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot");
static_assert(sizeof(BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot) == 0x000240, "Wrong size on BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot, EntryPoint) == 0x000000, "Member 'BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot, K2Node_GameplayCueEvent_EventType3) == 0x000004, "Member 'BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot::K2Node_GameplayCueEvent_EventType3' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot, K2Node_GameplayCueEvent_Parameters3) == 0x000008, "Member 'BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot::K2Node_GameplayCueEvent_Parameters3' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot, K2Node_GameplayCueEvent_EventType2) == 0x0000C0, "Member 'BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot::K2Node_GameplayCueEvent_EventType2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot, K2Node_GameplayCueEvent_Parameters2) == 0x0000C8, "Member 'BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot::K2Node_GameplayCueEvent_Parameters2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot, K2Node_GameplayCueEvent_EventType) == 0x000180, "Member 'BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot, K2Node_GameplayCueEvent_Parameters) == 0x000188, "Member 'BP_OrionCharAI_BipedBot_C_ExecuteUbergraph_BP_OrionCharAI_BipedBot::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");

// Function BP_OrionCharAI_BipedBot.BP_OrionCharAI_BipedBot_C.GameplayCue.Minion.LastHitVulnerable
// 0x00C0 (0x00C0 - 0x0000)
struct BP_OrionCharAI_BipedBot_C_GameplayCue_Minion_LastHitVulnerable final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_OrionCharAI_BipedBot_C_GameplayCue_Minion_LastHitVulnerable) == 0x000008, "Wrong alignment on BP_OrionCharAI_BipedBot_C_GameplayCue_Minion_LastHitVulnerable");
static_assert(sizeof(BP_OrionCharAI_BipedBot_C_GameplayCue_Minion_LastHitVulnerable) == 0x0000C0, "Wrong size on BP_OrionCharAI_BipedBot_C_GameplayCue_Minion_LastHitVulnerable");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_GameplayCue_Minion_LastHitVulnerable, EventType) == 0x000000, "Member 'BP_OrionCharAI_BipedBot_C_GameplayCue_Minion_LastHitVulnerable::EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_GameplayCue_Minion_LastHitVulnerable, Parameters) == 0x000008, "Member 'BP_OrionCharAI_BipedBot_C_GameplayCue_Minion_LastHitVulnerable::Parameters' has a wrong offset!");

// Function BP_OrionCharAI_BipedBot.BP_OrionCharAI_BipedBot_C.GameplayCue.Damage.DoT
// 0x00C0 (0x00C0 - 0x0000)
struct BP_OrionCharAI_BipedBot_C_GameplayCue_Damage_DoT final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_OrionCharAI_BipedBot_C_GameplayCue_Damage_DoT) == 0x000008, "Wrong alignment on BP_OrionCharAI_BipedBot_C_GameplayCue_Damage_DoT");
static_assert(sizeof(BP_OrionCharAI_BipedBot_C_GameplayCue_Damage_DoT) == 0x0000C0, "Wrong size on BP_OrionCharAI_BipedBot_C_GameplayCue_Damage_DoT");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_GameplayCue_Damage_DoT, EventType) == 0x000000, "Member 'BP_OrionCharAI_BipedBot_C_GameplayCue_Damage_DoT::EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_GameplayCue_Damage_DoT, Parameters) == 0x000008, "Member 'BP_OrionCharAI_BipedBot_C_GameplayCue_Damage_DoT::Parameters' has a wrong offset!");

// Function BP_OrionCharAI_BipedBot.BP_OrionCharAI_BipedBot_C.GameplayCue.Damage
// 0x00C0 (0x00C0 - 0x0000)
struct BP_OrionCharAI_BipedBot_C_GameplayCue_Damage final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_OrionCharAI_BipedBot_C_GameplayCue_Damage) == 0x000008, "Wrong alignment on BP_OrionCharAI_BipedBot_C_GameplayCue_Damage");
static_assert(sizeof(BP_OrionCharAI_BipedBot_C_GameplayCue_Damage) == 0x0000C0, "Wrong size on BP_OrionCharAI_BipedBot_C_GameplayCue_Damage");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_GameplayCue_Damage, EventType) == 0x000000, "Member 'BP_OrionCharAI_BipedBot_C_GameplayCue_Damage::EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_BipedBot_C_GameplayCue_Damage, Parameters) == 0x000008, "Member 'BP_OrionCharAI_BipedBot_C_GameplayCue_Damage::Parameters' has a wrong offset!");

}

