#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prime_Helix_SpecialAttack1_MarkedVol

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Prime_Helix_SpecialAttack1_MarkedVol.BP_Prime_Helix_SpecialAttack1_MarkedVol_C
// 0x0050 (0x0438 - 0x03E8)
class ABP_Prime_Helix_SpecialAttack1_MarkedVol_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CollisionSphere;                                   // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeHit;                                    // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionFilterAndEffectsContainer        SpecialAttack1Damage;                              // 0x0418(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Prime_Helix_SpecialAttack1_MarkedVol(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Prime_Helix_SpecialAttack1_MarkedVol_C">();
	}
	static class ABP_Prime_Helix_SpecialAttack1_MarkedVol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Prime_Helix_SpecialAttack1_MarkedVol_C>();
	}
};
static_assert(alignof(ABP_Prime_Helix_SpecialAttack1_MarkedVol_C) == 0x000008, "Wrong alignment on ABP_Prime_Helix_SpecialAttack1_MarkedVol_C");
static_assert(sizeof(ABP_Prime_Helix_SpecialAttack1_MarkedVol_C) == 0x000438, "Wrong size on ABP_Prime_Helix_SpecialAttack1_MarkedVol_C");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_MarkedVol_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_Prime_Helix_SpecialAttack1_MarkedVol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_MarkedVol_C, OrionGameplayVolume) == 0x0003F0, "Member 'ABP_Prime_Helix_SpecialAttack1_MarkedVol_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_MarkedVol_C, Decal) == 0x0003F8, "Member 'ABP_Prime_Helix_SpecialAttack1_MarkedVol_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_MarkedVol_C, CollisionSphere) == 0x000400, "Member 'ABP_Prime_Helix_SpecialAttack1_MarkedVol_C::CollisionSphere' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_MarkedVol_C, DefaultSceneRoot) == 0x000408, "Member 'ABP_Prime_Helix_SpecialAttack1_MarkedVol_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_MarkedVol_C, DelayBeforeHit) == 0x000410, "Member 'ABP_Prime_Helix_SpecialAttack1_MarkedVol_C::DelayBeforeHit' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_MarkedVol_C, SpecialAttack1Damage) == 0x000418, "Member 'ABP_Prime_Helix_SpecialAttack1_MarkedVol_C::SpecialAttack1Damage' has a wrong offset!");

}

