#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prime_Helix_V2_SpecialAttack2

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Prime_Helix_V2_SpecialAttack2.BP_Prime_Helix_V2_SpecialAttack2_C.ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2
// 0x0008 (0x0008 - 0x0000)
struct BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2) == 0x000004, "Wrong alignment on BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2");
static_assert(sizeof(BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2) == 0x000008, "Wrong size on BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2");
static_assert(offsetof(BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2, EntryPoint) == 0x000000, "Member 'BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2::Temp_bool_IsClosed_Variable' has a wrong offset!");

}

