#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prime_Helix_PrimaryFire_BeamVol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Prime_Helix_PrimaryFire_BeamVol.BP_Prime_Helix_PrimaryFire_BeamVol_C
// 0x0020 (0x0408 - 0x03E8)
class ABP_Prime_Helix_PrimaryFire_BeamVol_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxCollision;                                      // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Prime_Helix_PrimaryFire_BeamVol(int32 EntryPoint);
	void FireBeam();
	void ReceiveBeginPlay();
	void StopBeam();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Prime_Helix_PrimaryFire_BeamVol_C">();
	}
	static class ABP_Prime_Helix_PrimaryFire_BeamVol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Prime_Helix_PrimaryFire_BeamVol_C>();
	}
};
static_assert(alignof(ABP_Prime_Helix_PrimaryFire_BeamVol_C) == 0x000008, "Wrong alignment on ABP_Prime_Helix_PrimaryFire_BeamVol_C");
static_assert(sizeof(ABP_Prime_Helix_PrimaryFire_BeamVol_C) == 0x000408, "Wrong size on ABP_Prime_Helix_PrimaryFire_BeamVol_C");
static_assert(offsetof(ABP_Prime_Helix_PrimaryFire_BeamVol_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_Prime_Helix_PrimaryFire_BeamVol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_PrimaryFire_BeamVol_C, Arrow) == 0x0003F0, "Member 'ABP_Prime_Helix_PrimaryFire_BeamVol_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_PrimaryFire_BeamVol_C, OrionGameplayVolume) == 0x0003F8, "Member 'ABP_Prime_Helix_PrimaryFire_BeamVol_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_PrimaryFire_BeamVol_C, BoxCollision) == 0x000400, "Member 'ABP_Prime_Helix_PrimaryFire_BeamVol_C::BoxCollision' has a wrong offset!");

}

