#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prime_Helix_SpecialAttack1_DamVol

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Prime_Helix_SpecialAttack1_DamVol.BP_Prime_Helix_SpecialAttack1_DamVol_C
// 0x0050 (0x0438 - 0x03E8)
class ABP_Prime_Helix_SpecialAttack1_DamVol_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class USphereComponent*                       CollisionSphere;                                   // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeHit;                                    // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionFilterAndEffectsContainer        SpecialAttack1Damage;                              // 0x0408(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                ParticleInitLoc;                                   // 0x0428(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Prime_Helix_SpecialAttack1_DamVol(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Prime_Helix_SpecialAttack1_DamVol_C">();
	}
	static class ABP_Prime_Helix_SpecialAttack1_DamVol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Prime_Helix_SpecialAttack1_DamVol_C>();
	}
};
static_assert(alignof(ABP_Prime_Helix_SpecialAttack1_DamVol_C) == 0x000008, "Wrong alignment on ABP_Prime_Helix_SpecialAttack1_DamVol_C");
static_assert(sizeof(ABP_Prime_Helix_SpecialAttack1_DamVol_C) == 0x000438, "Wrong size on ABP_Prime_Helix_SpecialAttack1_DamVol_C");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_DamVol_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_Prime_Helix_SpecialAttack1_DamVol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_DamVol_C, CollisionSphere) == 0x0003F0, "Member 'ABP_Prime_Helix_SpecialAttack1_DamVol_C::CollisionSphere' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_DamVol_C, DefaultSceneRoot) == 0x0003F8, "Member 'ABP_Prime_Helix_SpecialAttack1_DamVol_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_DamVol_C, DelayBeforeHit) == 0x000400, "Member 'ABP_Prime_Helix_SpecialAttack1_DamVol_C::DelayBeforeHit' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_DamVol_C, SpecialAttack1Damage) == 0x000408, "Member 'ABP_Prime_Helix_SpecialAttack1_DamVol_C::SpecialAttack1Damage' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_SpecialAttack1_DamVol_C, ParticleInitLoc) == 0x000428, "Member 'ABP_Prime_Helix_SpecialAttack1_DamVol_C::ParticleInitLoc' has a wrong offset!");

}

