#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTDecorator_IsAtHealth

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTDecorator_IsAtHealth.BTDecorator_IsAtHealth_C.PerformConditionCheckAI
// 0x0030 (0x0030 - 0x0000)
struct BTDecorator_IsAtHealth_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionAIBot*                            K2Node_DynamicCast_AsOrion_AIBot;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEnergyPercent_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTDecorator_IsAtHealth_C_PerformConditionCheckAI");
static_assert(sizeof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI) == 0x000030, "Wrong size on BTDecorator_IsAtHealth_C_PerformConditionCheckAI");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, K2Node_DynamicCast_AsOrion_AIBot) == 0x000018, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::K2Node_DynamicCast_AsOrion_AIBot' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, CallFunc_GetEnergyPercent_ReturnValue) == 0x000024, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::CallFunc_GetEnergyPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, CallFunc_GetHealthPercent_ReturnValue) == 0x000028, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, CallFunc_GreaterEqual_FloatFloat_ReturnValue2) == 0x00002D, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::CallFunc_GreaterEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x00002E, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsAtHealth_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue) == 0x00002F, "Member 'BTDecorator_IsAtHealth_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

