#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_BodyguardNeedRecall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_BodyguardNeedRecall.BTService_BodyguardNeedRecall_C
// 0x0080 (0x0118 - 0x0098)
class UBTService_BodyguardNeedRecall_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 DestinationBBKey;                                  // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 ObservedActor;                                     // 0x00C8(0x0028)(Edit, BlueprintVisible)
	class AOrionCharHero*                         VIP;                                               // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TagsToCheck;                                       // 0x00F8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BTService_BodyguardNeedRecall(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTService_BodyguardNeedRecall_C">();
	}
	static class UBTService_BodyguardNeedRecall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_BodyguardNeedRecall_C>();
	}
};
static_assert(alignof(UBTService_BodyguardNeedRecall_C) == 0x000008, "Wrong alignment on UBTService_BodyguardNeedRecall_C");
static_assert(sizeof(UBTService_BodyguardNeedRecall_C) == 0x000118, "Wrong size on UBTService_BodyguardNeedRecall_C");
static_assert(offsetof(UBTService_BodyguardNeedRecall_C, UberGraphFrame) == 0x000098, "Member 'UBTService_BodyguardNeedRecall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTService_BodyguardNeedRecall_C, DestinationBBKey) == 0x0000A0, "Member 'UBTService_BodyguardNeedRecall_C::DestinationBBKey' has a wrong offset!");
static_assert(offsetof(UBTService_BodyguardNeedRecall_C, ObservedActor) == 0x0000C8, "Member 'UBTService_BodyguardNeedRecall_C::ObservedActor' has a wrong offset!");
static_assert(offsetof(UBTService_BodyguardNeedRecall_C, VIP) == 0x0000F0, "Member 'UBTService_BodyguardNeedRecall_C::VIP' has a wrong offset!");
static_assert(offsetof(UBTService_BodyguardNeedRecall_C, TagsToCheck) == 0x0000F8, "Member 'UBTService_BodyguardNeedRecall_C::TagsToCheck' has a wrong offset!");

}

