#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_BodyguardNeedRecall

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTService_BodyguardNeedRecall.BTService_BodyguardNeedRecall_C.ExecuteUbergraph_BTService_BodyguardNeedRecall
// 0x0068 (0x0068 - 0x0000)
struct BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController2;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn2;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall) == 0x000008, "Wrong alignment on BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall");
static_assert(sizeof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall) == 0x000068, "Wrong size on BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, EntryPoint) == 0x000000, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, K2Node_Event_OwnerController) == 0x000008, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000018, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000028, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000038, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000048, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, K2Node_Event_OwnerController2) == 0x000050, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::K2Node_Event_OwnerController2' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, K2Node_Event_ControlledPawn2) == 0x000058, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::K2Node_Event_ControlledPawn2' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'BTService_BodyguardNeedRecall_C_ExecuteUbergraph_BTService_BodyguardNeedRecall::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BTService_BodyguardNeedRecall.BTService_BodyguardNeedRecall_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTService_BodyguardNeedRecall_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_BodyguardNeedRecall_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTService_BodyguardNeedRecall_C_ReceiveActivationAI");
static_assert(sizeof(BTService_BodyguardNeedRecall_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTService_BodyguardNeedRecall_C_ReceiveActivationAI");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTService_BodyguardNeedRecall_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTService_BodyguardNeedRecall_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTService_BodyguardNeedRecall.BTService_BodyguardNeedRecall_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTService_BodyguardNeedRecall_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_BodyguardNeedRecall_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTService_BodyguardNeedRecall_C_ReceiveTickAI");
static_assert(sizeof(BTService_BodyguardNeedRecall_C_ReceiveTickAI) == 0x000018, "Wrong size on BTService_BodyguardNeedRecall_C_ReceiveTickAI");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTService_BodyguardNeedRecall_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTService_BodyguardNeedRecall_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_BodyguardNeedRecall_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTService_BodyguardNeedRecall_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

