#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_Bot_UpdateEnemy

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BTService_Bot_UpdateEnemy.BTService_Bot_UpdateEnemy_C.ExecuteUbergraph_BTService_Bot_UpdateEnemy
// 0x0098 (0x0098 - 0x0000)
struct BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UEnvQuery*                              CallFunc_K2_GetEnemySelectionQuery_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsSafeToApproachOffensiveLaneGoal_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsInsideTurret_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionAIBot*                            K2Node_DynamicCast_AsOrion_AIBot;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetResultsAsActors_ReturnValue;           // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             K2Node_DynamicCast_AsOrion_Char;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy) == 0x000008, "Wrong alignment on BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy");
static_assert(sizeof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy) == 0x000098, "Wrong size on BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, EntryPoint) == 0x000000, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_K2_GetEnemySelectionQuery_ReturnValue) == 0x000018, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_K2_GetEnemySelectionQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_K2_IsSafeToApproachOffensiveLaneGoal_ReturnValue) == 0x000020, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_K2_IsSafeToApproachOffensiveLaneGoal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_K2_IsInsideTurret_ReturnValue) == 0x000021, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_K2_IsInsideTurret_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_Event_OwnerController) == 0x000028, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_Event_ControlledPawn) == 0x000030, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_DynamicCast_AsOrion_AIBot) == 0x000040, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_DynamicCast_AsOrion_AIBot' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_CustomEvent_QueryInstance) == 0x000050, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_CustomEvent_QueryStatus) == 0x000058, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_GetResultsAsActors_ReturnValue) == 0x000060, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_GetResultsAsActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_Array_Get_Item) == 0x000070, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_DynamicCast_AsOrion_Char) == 0x000078, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_DynamicCast_AsOrion_Char' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, K2Node_DynamicCast_bSuccess2) == 0x000080, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_RunEQSQuery_ReturnValue) == 0x000088, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy, CallFunc_IsValid_ReturnValue2) == 0x000090, "Member 'BTService_Bot_UpdateEnemy_C_ExecuteUbergraph_BTService_Bot_UpdateEnemy::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function BTService_Bot_UpdateEnemy.BTService_Bot_UpdateEnemy_C.QueryDone
// 0x0010 (0x0010 - 0x0000)
struct BTService_Bot_UpdateEnemy_C_QueryDone final
{
public:
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_Bot_UpdateEnemy_C_QueryDone) == 0x000008, "Wrong alignment on BTService_Bot_UpdateEnemy_C_QueryDone");
static_assert(sizeof(BTService_Bot_UpdateEnemy_C_QueryDone) == 0x000010, "Wrong size on BTService_Bot_UpdateEnemy_C_QueryDone");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_QueryDone, QueryInstance) == 0x000000, "Member 'BTService_Bot_UpdateEnemy_C_QueryDone::QueryInstance' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_QueryDone, QueryStatus) == 0x000008, "Member 'BTService_Bot_UpdateEnemy_C_QueryDone::QueryStatus' has a wrong offset!");

// Function BTService_Bot_UpdateEnemy.BTService_Bot_UpdateEnemy_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTService_Bot_UpdateEnemy_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_Bot_UpdateEnemy_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTService_Bot_UpdateEnemy_C_ReceiveTickAI");
static_assert(sizeof(BTService_Bot_UpdateEnemy_C_ReceiveTickAI) == 0x000018, "Wrong size on BTService_Bot_UpdateEnemy_C_ReceiveTickAI");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTService_Bot_UpdateEnemy_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTService_Bot_UpdateEnemy_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_Bot_UpdateEnemy_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTService_Bot_UpdateEnemy_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

