#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_UseTeamComm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_UseTeamComm.BTTask_UseTeamComm_C
// 0x0010 (0x00B0 - 0x00A0)
class UBTTask_UseTeamComm_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	bool                                          UseCurrentObjectiveConfirm;                        // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EAITeamCommEvent                              Event;                                             // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_UseTeamComm(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_UseTeamComm_C">();
	}
	static class UBTTask_UseTeamComm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_UseTeamComm_C>();
	}
};
static_assert(alignof(UBTTask_UseTeamComm_C) == 0x000008, "Wrong alignment on UBTTask_UseTeamComm_C");
static_assert(sizeof(UBTTask_UseTeamComm_C) == 0x0000B0, "Wrong size on UBTTask_UseTeamComm_C");
static_assert(offsetof(UBTTask_UseTeamComm_C, UberGraphFrame) == 0x0000A0, "Member 'UBTTask_UseTeamComm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_UseTeamComm_C, UseCurrentObjectiveConfirm) == 0x0000A8, "Member 'UBTTask_UseTeamComm_C::UseCurrentObjectiveConfirm' has a wrong offset!");
static_assert(offsetof(UBTTask_UseTeamComm_C, Event) == 0x0000A9, "Member 'UBTTask_UseTeamComm_C::Event' has a wrong offset!");

}

