#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfirmationRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConfirmationRoot.ConfirmationRoot_C
// 0x0070 (0x0570 - 0x0500)
class UConfirmationRoot_C final : public UOrionDialogWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Enter_;                                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       _Default_Button__Accept;                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       _Default_Button__Cancel;                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       _Default_Button__Decline;                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        _Orion_Text__Message_Body;                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             _Text__Error_Header;                               // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        OrionTextCountdown;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        OrionTextTitle;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherHeader;                                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         EndTime;                                           // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClosing;                                         // 0x0554(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimeoutTimerHandle;                                // 0x0558(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsInErrorMode;                                     // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ConfirmationRoot(int32 EntryPoint);
	void OnActivated();
	void OnDeactivated();
	void BndEvt___Default_Button__Cancel_K2Node_ComponentBoundEvent_811_OrionBaseButtonClicked__DelegateSignature(class UOrionBaseButton* Button);
	void BndEvt___Default_Button__Decline_K2Node_ComponentBoundEvent_212_OrionBaseButtonClicked__DelegateSignature(class UOrionBaseButton* Button);
	void BndEvt___Default_Button__Accept_K2Node_ComponentBoundEvent_205_OrionBaseButtonClicked__DelegateSignature(class UOrionBaseButton* Button);
	void Destruct();
	void Construct();
	void OnKill();
	void OnShow();
	class FText Get_Timer();
	ESlateVisibility Is_Timer_Visible();
	void UpdateButton(class UDefaultButton_C* Button, class FText& Text);
	void HandleResult(EOrionDialogResult Result);
	void HandleTimeOut();
	void SetErrorMode(bool InErrorMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConfirmationRoot_C">();
	}
	static class UConfirmationRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfirmationRoot_C>();
	}
};
static_assert(alignof(UConfirmationRoot_C) == 0x000010, "Wrong alignment on UConfirmationRoot_C");
static_assert(sizeof(UConfirmationRoot_C) == 0x000570, "Wrong size on UConfirmationRoot_C");
static_assert(offsetof(UConfirmationRoot_C, UberGraphFrame) == 0x000500, "Member 'UConfirmationRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, Enter_) == 0x000508, "Member 'UConfirmationRoot_C::Enter_' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, _Default_Button__Accept) == 0x000510, "Member 'UConfirmationRoot_C::_Default_Button__Accept' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, _Default_Button__Cancel) == 0x000518, "Member 'UConfirmationRoot_C::_Default_Button__Cancel' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, _Default_Button__Decline) == 0x000520, "Member 'UConfirmationRoot_C::_Default_Button__Decline' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, _Orion_Text__Message_Body) == 0x000528, "Member 'UConfirmationRoot_C::_Orion_Text__Message_Body' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, _Text__Error_Header) == 0x000530, "Member 'UConfirmationRoot_C::_Text__Error_Header' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, OrionTextCountdown) == 0x000538, "Member 'UConfirmationRoot_C::OrionTextCountdown' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, OrionTextTitle) == 0x000540, "Member 'UConfirmationRoot_C::OrionTextTitle' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, SwitcherHeader) == 0x000548, "Member 'UConfirmationRoot_C::SwitcherHeader' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, EndTime) == 0x000550, "Member 'UConfirmationRoot_C::EndTime' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, IsClosing) == 0x000554, "Member 'UConfirmationRoot_C::IsClosing' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, TimeoutTimerHandle) == 0x000558, "Member 'UConfirmationRoot_C::TimeoutTimerHandle' has a wrong offset!");
static_assert(offsetof(UConfirmationRoot_C, IsInErrorMode) == 0x000560, "Member 'UConfirmationRoot_C::IsInErrorMode' has a wrong offset!");

}

