#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Core_v4_AOE

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Core_v4_AOE.Core_v4_AOE_C.ExecuteUbergraph_Core_v4_AOE
// 0x0380 (0x0380 - 0x0000)
struct Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GSM_BaseMOBA_C*                     K2Node_DynamicCast_AsBP_GSM_Base_MOBA;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttackRadius_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    K2Node_Event_NewTeamIdx;                           // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Delay;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FObjectiveDependency                   CallFunc_Array_Get_Item;                           // 0x0080(0x0030)()
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SentryTurret_C*                     K2Node_DynamicCast_AsBP_Sentry_Turret;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item2;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_SentryTurret_C* Objective)> K2Node_CreateDelegate_OutputDelegate;              // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FObjectiveDependency                   CallFunc_Array_Get_Item3;                          // 0x00F0(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SentryTurret_C*                     K2Node_DynamicCast_AsBP_Sentry_Turret2;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FObjectiveDependency                   CallFunc_Array_Get_Item4;                          // 0x0138(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SentryTurret_C*                     K2Node_DynamicCast_AsBP_Sentry_Turret3;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x01C8(0x00B8)(ContainsInstancedReference)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0280(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x028C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0298(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0xC];                                      // 0x02A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02B0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Decal_CoreDestroyed_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x030C(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageInstigator;                     // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2; // 0x0320(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item5;                          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue3; // 0x0338(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue4; // 0x0340(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue5; // 0x0348(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue2;                // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GSM_BaseMOBA_C*                     K2Node_DynamicCast_AsBP_GSM_Base_MOBA2;            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOn;                                  // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0363(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0365(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0366(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_367[0x1];                                      // 0x0367(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEffectiveAttackRange_ReturnValue;      // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SentryTurret_C*                     K2Node_CustomEvent_Objective;                      // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE) == 0x000010, "Wrong alignment on Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE");
static_assert(sizeof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE) == 0x000380, "Wrong size on Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, EntryPoint) == 0x000000, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::EntryPoint' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Loop_Counter_Variable2) == 0x000014, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Add_IntInt_ReturnValue2) == 0x00001C, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Array_Index_Variable2) == 0x000020, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Loop_Counter_Variable3) == 0x000028, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Loop_Counter_Variable4) == 0x00002C, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Add_IntInt_ReturnValue3) == 0x000030, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Add_IntInt_ReturnValue4) == 0x000034, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Array_Index_Variable3) == 0x000038, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_GetGameState_ReturnValue) == 0x000040, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_AsBP_GSM_Base_MOBA) == 0x000048, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_AsBP_GSM_Base_MOBA' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_GetAttackRadius_ReturnValue) == 0x000054, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_GetAttackRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000058, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Conv_FloatToVector_ReturnValue) == 0x00005C, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_IsValid_ReturnValue2) == 0x000069, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_Event_NewTeamIdx) == 0x00006A, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_Event_NewTeamIdx' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_CustomEvent_Delay) == 0x000074, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Loop_Counter_Variable5) == 0x000078, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Get_Item) == 0x000080, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Add_IntInt_ReturnValue5) == 0x0000B0, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_AsBP_Sentry_Turret) == 0x0000B8, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_AsBP_Sentry_Turret' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_bSuccess2) == 0x0000C0, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Length_ReturnValue2) == 0x0000C4, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Less_IntInt_ReturnValue2) == 0x0000C8, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Array_Index_Variable4) == 0x0000CC, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Get_Item2) == 0x0000D0, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Length_ReturnValue3) == 0x0000D8, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Less_IntInt_ReturnValue3) == 0x0000DC, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_CreateDelegate_OutputDelegate) == 0x0000E0, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Get_Item3) == 0x0000F0, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Length_ReturnValue4) == 0x000120, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_AsBP_Sentry_Turret2) == 0x000128, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_AsBP_Sentry_Turret2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_bSuccess3) == 0x000130, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Less_IntInt_ReturnValue4) == 0x000131, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BooleanAND_ReturnValue) == 0x000132, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_HasAuthority_ReturnValue) == 0x000133, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Get_Item4) == 0x000138, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Length_ReturnValue5) == 0x000168, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_AsBP_Sentry_Turret3) == 0x000170, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_AsBP_Sentry_Turret3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_bSuccess4) == 0x000178, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Less_IntInt_ReturnValue5) == 0x000179, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000180, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000190, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_GameplayCueEvent_EventType) == 0x0001C0, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_GameplayCueEvent_Parameters) == 0x0001C8, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BreakTransform_Location) == 0x000280, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BreakTransform_Rotation) == 0x00028C, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BreakTransform_Scale) == 0x000298, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_MakeTransform_ReturnValue) == 0x0002B0, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002E0, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002E8, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002F0, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000300, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_IsValid_ReturnValue3) == 0x000308, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00030C, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_Event_Damage) == 0x000314, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_Event_DamageInstigator) == 0x000318, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_Event_DamageInstigator' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2) == 0x000320, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, Temp_int_Array_Index_Variable5) == 0x000328, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_Array_Get_Item5) == 0x000330, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue3) == 0x000338, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue4) == 0x000340, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue5) == 0x000348, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_GetGameState_ReturnValue2) == 0x000350, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_GetGameState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_AsBP_GSM_Base_MOBA2) == 0x000358, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_AsBP_GSM_Base_MOBA2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_DynamicCast_bSuccess5) == 0x000360, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_Event_bOn) == 0x000361, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_Event_bOn' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_IsValid_ReturnValue4) == 0x000362, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_IsValid_ReturnValue5) == 0x000363, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_IsValid_ReturnValue6) == 0x000364, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_IsValid_ReturnValue7) == 0x000365, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_HasAuthority_ReturnValue2) == 0x000366, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, CallFunc_GetEffectiveAttackRange_ReturnValue) == 0x000368, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::CallFunc_GetEffectiveAttackRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE, K2Node_CustomEvent_Objective) == 0x000370, "Member 'Core_v4_AOE_C_ExecuteUbergraph_Core_v4_AOE::K2Node_CustomEvent_Objective' has a wrong offset!");

// Function Core_v4_AOE.Core_v4_AOE_C.SentryDestroyed_Bind
// 0x0008 (0x0008 - 0x0000)
struct Core_v4_AOE_C_SentryDestroyed_Bind final
{
public:
	class ABP_SentryTurret_C*                     Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Core_v4_AOE_C_SentryDestroyed_Bind) == 0x000008, "Wrong alignment on Core_v4_AOE_C_SentryDestroyed_Bind");
static_assert(sizeof(Core_v4_AOE_C_SentryDestroyed_Bind) == 0x000008, "Wrong size on Core_v4_AOE_C_SentryDestroyed_Bind");
static_assert(offsetof(Core_v4_AOE_C_SentryDestroyed_Bind, Objective) == 0x000000, "Member 'Core_v4_AOE_C_SentryDestroyed_Bind::Objective' has a wrong offset!");

// Function Core_v4_AOE.Core_v4_AOE_C.OnBackdoorProtectionChanged
// 0x0001 (0x0001 - 0x0000)
struct Core_v4_AOE_C_OnBackdoorProtectionChanged final
{
public:
	bool                                          bOn;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Core_v4_AOE_C_OnBackdoorProtectionChanged) == 0x000001, "Wrong alignment on Core_v4_AOE_C_OnBackdoorProtectionChanged");
static_assert(sizeof(Core_v4_AOE_C_OnBackdoorProtectionChanged) == 0x000001, "Wrong size on Core_v4_AOE_C_OnBackdoorProtectionChanged");
static_assert(offsetof(Core_v4_AOE_C_OnBackdoorProtectionChanged, bOn) == 0x000000, "Member 'Core_v4_AOE_C_OnBackdoorProtectionChanged::bOn' has a wrong offset!");

// Function Core_v4_AOE.Core_v4_AOE_C.OnDamageTaken
// 0x0010 (0x0010 - 0x0000)
struct Core_v4_AOE_C_OnDamageTaken final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageInstigator;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Core_v4_AOE_C_OnDamageTaken) == 0x000008, "Wrong alignment on Core_v4_AOE_C_OnDamageTaken");
static_assert(sizeof(Core_v4_AOE_C_OnDamageTaken) == 0x000010, "Wrong size on Core_v4_AOE_C_OnDamageTaken");
static_assert(offsetof(Core_v4_AOE_C_OnDamageTaken, Damage) == 0x000000, "Member 'Core_v4_AOE_C_OnDamageTaken::Damage' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_OnDamageTaken, DamageInstigator) == 0x000008, "Member 'Core_v4_AOE_C_OnDamageTaken::DamageInstigator' has a wrong offset!");

// Function Core_v4_AOE.Core_v4_AOE_C.GameplayCue.Damage.Core
// 0x00C0 (0x00C0 - 0x0000)
struct Core_v4_AOE_C_GameplayCue_Damage_Core final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Core_v4_AOE_C_GameplayCue_Damage_Core) == 0x000008, "Wrong alignment on Core_v4_AOE_C_GameplayCue_Damage_Core");
static_assert(sizeof(Core_v4_AOE_C_GameplayCue_Damage_Core) == 0x0000C0, "Wrong size on Core_v4_AOE_C_GameplayCue_Damage_Core");
static_assert(offsetof(Core_v4_AOE_C_GameplayCue_Damage_Core, EventType) == 0x000000, "Member 'Core_v4_AOE_C_GameplayCue_Damage_Core::EventType' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_GameplayCue_Damage_Core, Parameters) == 0x000008, "Member 'Core_v4_AOE_C_GameplayCue_Damage_Core::Parameters' has a wrong offset!");

// Function Core_v4_AOE.Core_v4_AOE_C.WarmUpRunes
// 0x0004 (0x0004 - 0x0000)
struct Core_v4_AOE_C_WarmUpRunes final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Core_v4_AOE_C_WarmUpRunes) == 0x000004, "Wrong alignment on Core_v4_AOE_C_WarmUpRunes");
static_assert(sizeof(Core_v4_AOE_C_WarmUpRunes) == 0x000004, "Wrong size on Core_v4_AOE_C_WarmUpRunes");
static_assert(offsetof(Core_v4_AOE_C_WarmUpRunes, Delay) == 0x000000, "Member 'Core_v4_AOE_C_WarmUpRunes::Delay' has a wrong offset!");

// Function Core_v4_AOE.Core_v4_AOE_C.OnTeamChanged
// 0x0001 (0x0001 - 0x0000)
struct Core_v4_AOE_C_OnTeamChanged final
{
public:
	EOrionTeam                                    NewTeamIdx;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Core_v4_AOE_C_OnTeamChanged) == 0x000001, "Wrong alignment on Core_v4_AOE_C_OnTeamChanged");
static_assert(sizeof(Core_v4_AOE_C_OnTeamChanged) == 0x000001, "Wrong size on Core_v4_AOE_C_OnTeamChanged");
static_assert(offsetof(Core_v4_AOE_C_OnTeamChanged, NewTeamIdx) == 0x000000, "Member 'Core_v4_AOE_C_OnTeamChanged::NewTeamIdx' has a wrong offset!");

// Function Core_v4_AOE.Core_v4_AOE_C.UserConstructionScript
// 0x00E8 (0x00E8 - 0x0000)
struct Core_v4_AOE_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item2;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item3;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item4;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue3; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Name_ReturnValue;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Core_v4_AOE_C_UserConstructionScript) == 0x000008, "Wrong alignment on Core_v4_AOE_C_UserConstructionScript");
static_assert(sizeof(Core_v4_AOE_C_UserConstructionScript) == 0x0000E8, "Wrong size on Core_v4_AOE_C_UserConstructionScript");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'Core_v4_AOE_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, Temp_int_Loop_Counter_Variable2) == 0x000004, "Member 'Core_v4_AOE_C_UserConstructionScript::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue2) == 0x00000C, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Core_v4_AOE_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, Temp_int_Loop_Counter_Variable3) == 0x000014, "Member 'Core_v4_AOE_C_UserConstructionScript::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue3) == 0x000018, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, Temp_int_Array_Index_Variable2) == 0x00001C, "Member 'Core_v4_AOE_C_UserConstructionScript::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, Temp_int_Loop_Counter_Variable4) == 0x000020, "Member 'Core_v4_AOE_C_UserConstructionScript::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue4) == 0x000024, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, Temp_int_Array_Index_Variable3) == 0x000028, "Member 'Core_v4_AOE_C_UserConstructionScript::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, Temp_int_Array_Index_Variable4) == 0x00002C, "Member 'Core_v4_AOE_C_UserConstructionScript::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_GetTeamNum_ReturnValue) == 0x000038, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000040, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Array_Get_Item2) == 0x000048, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue2) == 0x000054, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue2) == 0x000059, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Array_Get_Item3) == 0x000060, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000068, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000070, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_GetMaterials_ReturnValue) == 0x000078, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Array_Get_Item4) == 0x000088, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue3) == 0x000090, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue3) == 0x000098, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue3) == 0x0000A0, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x0000A4, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue4) == 0x0000A8, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue4) == 0x0000AC, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_BuildString_Name_ReturnValue) == 0x0000B0, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_BuildString_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue) == 0x0000C0, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x0000C8, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_EvaluateCurveTableRow_OutResult) == 0x0000C9, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(Core_v4_AOE_C_UserConstructionScript, CallFunc_EvaluateCurveTableRow_OutXY) == 0x0000CC, "Member 'Core_v4_AOE_C_UserConstructionScript::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
