#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Core_SingleTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OrionDamageableObjectiveCoreSingleTarget_classes.hpp"
#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Core_SingleTarget.Core_SingleTarget_C
// 0x0180 (0x0B50 - 0x09D0)
class ACore_SingleTarget_C final : public ABP_OrionDamageableObjectiveCoreSingleTarget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(Transient, DuplicateTransient)
	class UAudioComponent*                        Core_Firing_AudioComp;                             // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Core_Meshes_Scene;                                 // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CoreCollision;                                     // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Core_AttackAlarm_Cue;                              // 0x09F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_BackdoorProtection_Looping;                      // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_BackdoorProtection_Removed;                      // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Core_SwirlingRings_Sound;                          // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Core_Scene;                                        // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Core_Destroyed_Aniticpation;                     // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Core_Destroyed_SecondaryBlast;                   // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Core_Destroyed_Linger;                           // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_CoreDestroyed_MainBlast;                         // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Core_PyramidOnly;                               // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Core;                                           // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CoreGlow;                                          // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_EmissiveRamp_9B4851D747CBFA3436B39E8363B9F150; // 0x0A58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_9B4851D747CBFA3436B39E8363B9F150; // 0x0A5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5D[0x3];                                      // 0x0A5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_EmissiveRamp_6876B8A441B1919CEFFAB6A7B79704C2; // 0x0A68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_6876B8A441B1919CEFFAB6A7B79704C2; // 0x0A6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6D[0x3];                                      // 0x0A6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AStaticMeshActor*>               GroundMeshes;                                      // 0x0A78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	TArray<class UMaterialInstanceDynamic*>       GroundMeshes_MIDs;                                 // 0x0A88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             Core_Materials_For_Team;                           // 0x0A98(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FName                                   EmissiveBrightness_Name;                           // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CoreGlow_MID;                                      // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Core_Glow_Material;                                // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Core_Material;                                     // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dead;                                              // 0x0AC8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          DEBUG_TEAM_COLOR;                                  // 0x0AC9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ACA[0x6];                                      // 0x0ACA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TeamColor_Name;                                    // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TeamColorValue_Name;                               // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WarmUpRunesDelay;                                  // 0x0AE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE4[0x4];                                      // 0x0AE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             RunesWarmupSound;                                  // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CriticalAlarmComp;                                 // 0x0AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Core_TakeDamage;                                // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HealthIsZero;                                      // 0x0B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HealthLessThan25Percent;                           // 0x0B01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HealthLessThan50Percent;                           // 0x0B02(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CriticalVOPlayed;                                  // 0x0B03(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CriticalAlarmTimerSet;                             // 0x0B04(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DamageAlarmTimerSet;                               // 0x0B05(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B06[0x2];                                      // 0x0B06(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Health50Percent;                                   // 0x0B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Health25Percent;                                   // 0x0B0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CriticalDialogDelay;                               // 0x0B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageDialogDelay;                                 // 0x0B14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Core_Critical_Alarm;                            // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Core_Alarm;                                     // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Core_Critical_VO;                               // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Core_Under_Attack_VO;                           // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AlarmSoundComp;                                    // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DamageNumberPopsName;                              // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TEMP_Shield_Value_MID;                             // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Core_SingleTarget(int32 EntryPoint);
	void OnBackdoorProtectionChanged(bool bOn);
	void OnSelfRevive();
	void CoreFinale();
	void FadeOutRunes();
	void DoDeath();
	void SentryDestroyed_Bind(class ABP_SentryTurret_C* Objective);
	void OnDamageTaken(float Damage, class AActor* DamageInstigator);
	void GameplayCue_Damage_Core(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void BREAK_InhibitorStatusCheck();
	void OnTeamChanged(EOrionTeam NewTeamIdx);
	void OnDeath();
	void ReceiveBeginPlay();
	void WarmUpRunes(float Delay);
	void ObjectiveStartUp();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();
	void Core_ConstructionScript();
	void HandleTeamColors_ConstructionScript(EOrionTeam TeamNum_0);
	void OnRep_Dead();
	void HandleTeamColors(EOrionTeam TeamNum_0);
	void CheckHealthPercentage();
	struct FVector GetNumberPopLocation(const struct FVector& HitLocation);
	void GetAimTargetSensingLocation(struct FVector* AimPosition);
	void GetTargetingLocation(struct FVector* OutPosition);
	TArray<class UMeshComponent*> GetHighlightableMeshes();
	class UMeshComponent* GetBaseAttackingMesh();

	TSoftObjectPtr<class UObject> GetIcon() const;
	class UCapsuleComponent* GetCollisionCapsuleComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Core_SingleTarget_C">();
	}
	static class ACore_SingleTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACore_SingleTarget_C>();
	}
};
static_assert(alignof(ACore_SingleTarget_C) == 0x000008, "Wrong alignment on ACore_SingleTarget_C");
static_assert(sizeof(ACore_SingleTarget_C) == 0x000B50, "Wrong size on ACore_SingleTarget_C");
static_assert(offsetof(ACore_SingleTarget_C, UberGraphFrame) == 0x0009D0, "Member 'ACore_SingleTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Core_Firing_AudioComp) == 0x0009D8, "Member 'ACore_SingleTarget_C::Core_Firing_AudioComp' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Core_Meshes_Scene) == 0x0009E0, "Member 'ACore_SingleTarget_C::Core_Meshes_Scene' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, CoreCollision) == 0x0009E8, "Member 'ACore_SingleTarget_C::CoreCollision' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Core_AttackAlarm_Cue) == 0x0009F0, "Member 'ACore_SingleTarget_C::Core_AttackAlarm_Cue' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, P_BackdoorProtection_Looping) == 0x0009F8, "Member 'ACore_SingleTarget_C::P_BackdoorProtection_Looping' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, P_BackdoorProtection_Removed) == 0x000A00, "Member 'ACore_SingleTarget_C::P_BackdoorProtection_Removed' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Core_SwirlingRings_Sound) == 0x000A08, "Member 'ACore_SingleTarget_C::Core_SwirlingRings_Sound' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Arrow) == 0x000A10, "Member 'ACore_SingleTarget_C::Arrow' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Core_Scene) == 0x000A18, "Member 'ACore_SingleTarget_C::Core_Scene' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, P_Core_Destroyed_Aniticpation) == 0x000A20, "Member 'ACore_SingleTarget_C::P_Core_Destroyed_Aniticpation' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, P_Core_Destroyed_SecondaryBlast) == 0x000A28, "Member 'ACore_SingleTarget_C::P_Core_Destroyed_SecondaryBlast' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, P_Core_Destroyed_Linger) == 0x000A30, "Member 'ACore_SingleTarget_C::P_Core_Destroyed_Linger' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, P_CoreDestroyed_MainBlast) == 0x000A38, "Member 'ACore_SingleTarget_C::P_CoreDestroyed_MainBlast' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, SK_Core_PyramidOnly) == 0x000A40, "Member 'ACore_SingleTarget_C::SK_Core_PyramidOnly' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, SK_Core) == 0x000A48, "Member 'ACore_SingleTarget_C::SK_Core' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, CoreGlow) == 0x000A50, "Member 'ACore_SingleTarget_C::CoreGlow' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Timeline_1_EmissiveRamp_9B4851D747CBFA3436B39E8363B9F150) == 0x000A58, "Member 'ACore_SingleTarget_C::Timeline_1_EmissiveRamp_9B4851D747CBFA3436B39E8363B9F150' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Timeline_1__Direction_9B4851D747CBFA3436B39E8363B9F150) == 0x000A5C, "Member 'ACore_SingleTarget_C::Timeline_1__Direction_9B4851D747CBFA3436B39E8363B9F150' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Timeline_1) == 0x000A60, "Member 'ACore_SingleTarget_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Timeline_0_EmissiveRamp_6876B8A441B1919CEFFAB6A7B79704C2) == 0x000A68, "Member 'ACore_SingleTarget_C::Timeline_0_EmissiveRamp_6876B8A441B1919CEFFAB6A7B79704C2' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Timeline_0__Direction_6876B8A441B1919CEFFAB6A7B79704C2) == 0x000A6C, "Member 'ACore_SingleTarget_C::Timeline_0__Direction_6876B8A441B1919CEFFAB6A7B79704C2' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Timeline_0) == 0x000A70, "Member 'ACore_SingleTarget_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, GroundMeshes) == 0x000A78, "Member 'ACore_SingleTarget_C::GroundMeshes' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, GroundMeshes_MIDs) == 0x000A88, "Member 'ACore_SingleTarget_C::GroundMeshes_MIDs' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Core_Materials_For_Team) == 0x000A98, "Member 'ACore_SingleTarget_C::Core_Materials_For_Team' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, EmissiveBrightness_Name) == 0x000AA8, "Member 'ACore_SingleTarget_C::EmissiveBrightness_Name' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, CoreGlow_MID) == 0x000AB0, "Member 'ACore_SingleTarget_C::CoreGlow_MID' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Core_Glow_Material) == 0x000AB8, "Member 'ACore_SingleTarget_C::Core_Glow_Material' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Core_Material) == 0x000AC0, "Member 'ACore_SingleTarget_C::Core_Material' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Dead) == 0x000AC8, "Member 'ACore_SingleTarget_C::Dead' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, DEBUG_TEAM_COLOR) == 0x000AC9, "Member 'ACore_SingleTarget_C::DEBUG_TEAM_COLOR' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, TeamColor_Name) == 0x000AD0, "Member 'ACore_SingleTarget_C::TeamColor_Name' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, TeamColorValue_Name) == 0x000AD8, "Member 'ACore_SingleTarget_C::TeamColorValue_Name' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, WarmUpRunesDelay) == 0x000AE0, "Member 'ACore_SingleTarget_C::WarmUpRunesDelay' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, RunesWarmupSound) == 0x000AE8, "Member 'ACore_SingleTarget_C::RunesWarmupSound' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, CriticalAlarmComp) == 0x000AF0, "Member 'ACore_SingleTarget_C::CriticalAlarmComp' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, GE_Core_TakeDamage) == 0x000AF8, "Member 'ACore_SingleTarget_C::GE_Core_TakeDamage' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, HealthIsZero) == 0x000B00, "Member 'ACore_SingleTarget_C::HealthIsZero' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, HealthLessThan25Percent) == 0x000B01, "Member 'ACore_SingleTarget_C::HealthLessThan25Percent' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, HealthLessThan50Percent) == 0x000B02, "Member 'ACore_SingleTarget_C::HealthLessThan50Percent' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, CriticalVOPlayed) == 0x000B03, "Member 'ACore_SingleTarget_C::CriticalVOPlayed' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, CriticalAlarmTimerSet) == 0x000B04, "Member 'ACore_SingleTarget_C::CriticalAlarmTimerSet' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, DamageAlarmTimerSet) == 0x000B05, "Member 'ACore_SingleTarget_C::DamageAlarmTimerSet' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Health50Percent) == 0x000B08, "Member 'ACore_SingleTarget_C::Health50Percent' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, Health25Percent) == 0x000B0C, "Member 'ACore_SingleTarget_C::Health25Percent' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, CriticalDialogDelay) == 0x000B10, "Member 'ACore_SingleTarget_C::CriticalDialogDelay' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, DamageDialogDelay) == 0x000B14, "Member 'ACore_SingleTarget_C::DamageDialogDelay' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, GE_Core_Critical_Alarm) == 0x000B18, "Member 'ACore_SingleTarget_C::GE_Core_Critical_Alarm' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, GE_Core_Alarm) == 0x000B20, "Member 'ACore_SingleTarget_C::GE_Core_Alarm' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, GE_Core_Critical_VO) == 0x000B28, "Member 'ACore_SingleTarget_C::GE_Core_Critical_VO' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, GE_Core_Under_Attack_VO) == 0x000B30, "Member 'ACore_SingleTarget_C::GE_Core_Under_Attack_VO' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, AlarmSoundComp) == 0x000B38, "Member 'ACore_SingleTarget_C::AlarmSoundComp' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, DamageNumberPopsName) == 0x000B40, "Member 'ACore_SingleTarget_C::DamageNumberPopsName' has a wrong offset!");
static_assert(offsetof(ACore_SingleTarget_C, TEMP_Shield_Value_MID) == 0x000B48, "Member 'ACore_SingleTarget_C::TEMP_Shield_Value_MID' has a wrong offset!");

}

