#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoreCombined_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CoreCombined_AnimBP.CoreCombined_AnimBP_C
// 0x1030 (0x1410 - 0x03E0)
class UCoreCombined_AnimBP_C final : public UOrionAnimInstanceDamageableCore
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_CF606CFC4E44969508CBE7868C0CA56C; // 0x03E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D693709A43DEF0F14C306AB7DBFED4BD; // 0x0430(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E9581D8A42084B54E528269B16E40CB9; // 0x04B0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88D8161F4261561504AFF8B7A96F23CE; // 0x0530(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17978E024D3451B9FA85BC8C0C3A2AAB; // 0x05B0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1FAF9D9A4C5354BE1AF28FBA9CAFB968; // 0x0630(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B447747D42497910AF215F87826B464B; // 0x06B0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8DA0C64C4820F6CFB64C318A29E2B550; // 0x0720(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4208249D4C4B7D2CCD4103A0DE40E7ED; // 0x0768(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14A50A2746ECBA3B1797EC912F1D2778; // 0x0848(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_704DF09E4680DBA1A7327C92CB418292; // 0x08B8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_7D8956734C70350F02D4BAA9F8001337; // 0x0928(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_CE42CCD143B3B5D4255289BF7515CA05; // 0x0970(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_71941EAC4BD294EA0F9CC4B768D36A0A; // 0x0A50(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8EDDD9064B218ED0DB2E5B8C1EC6E015; // 0x0AC0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_6E5EAFD04E0C9F4EA90E3584B2A7D124; // 0x0B30(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_87179E39437731128AB443ADE39FA856; // 0x0B78(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8201151A4BBDE46A56AE7FAD56B7C161; // 0x0C58(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5864505645F176F8AB216B9561AC9992; // 0x0CC8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_BA67EBBF4B21C893995BE8B81C8BCED1; // 0x0D38(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FFCFAB314C3A544E1C17509198151051; // 0x0D80(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_73C8A732491AD3A77AD41185ACD88986; // 0x0DF0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D9D76A68449C776F7376F4B554AF2845; // 0x0E38(0x00D8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_75B7449B4A7BF2779854D6B3E7BC91D2; // 0x0F10(0x0048)()
	uint8                                         Pad_F58[0x8];                                      // 0x0F58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_F1B034C8466AFF4E9825EB8A93214C48; // 0x0F60(0x01A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_ED681E224BF18B831F646FAD57C60EA0; // 0x1100(0x0048)()
	uint8                                         Pad_1148[0x8];                                     // 0x1148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_504A510E4BEFE5D56D81E8AC9D4EA967; // 0x1150(0x01A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_FE154EDB4F8B474A3D61CDA9A1F15551; // 0x12F0(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_0251D66F4989A322713F248463160BB4; // 0x13A8(0x0068)()

public:
	void ExecuteUbergraph_CoreCombined_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CoreCombined_AnimBP_AnimGraphNode_LayeredBoneBlend_CE42CCD143B3B5D4255289BF7515CA05();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CoreCombined_AnimBP_AnimGraphNode_LookAt_504A510E4BEFE5D56D81E8AC9D4EA967();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CoreCombined_AnimBP_AnimGraphNode_LookAt_F1B034C8466AFF4E9825EB8A93214C48();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CoreCombined_AnimBP_AnimGraphNode_ModifyBone_FE154EDB4F8B474A3D61CDA9A1F15551();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CoreCombined_AnimBP_AnimGraphNode_SequencePlayer_14A50A2746ECBA3B1797EC912F1D2778();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CoreCombined_AnimBP_AnimGraphNode_SequencePlayer_5864505645F176F8AB216B9561AC9992();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CoreCombined_AnimBP_AnimGraphNode_SequencePlayer_71941EAC4BD294EA0F9CC4B768D36A0A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CoreCombined_AnimBP_AnimGraphNode_TransitionResult_17978E024D3451B9FA85BC8C0C3A2AAB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CoreCombined_AnimBP_AnimGraphNode_TransitionResult_E9581D8A42084B54E528269B16E40CB9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CoreCombined_AnimBP_C">();
	}
	static class UCoreCombined_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoreCombined_AnimBP_C>();
	}
};
static_assert(alignof(UCoreCombined_AnimBP_C) == 0x000010, "Wrong alignment on UCoreCombined_AnimBP_C");
static_assert(sizeof(UCoreCombined_AnimBP_C) == 0x001410, "Wrong size on UCoreCombined_AnimBP_C");
static_assert(offsetof(UCoreCombined_AnimBP_C, UberGraphFrame) == 0x0003E0, "Member 'UCoreCombined_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_Root_CF606CFC4E44969508CBE7868C0CA56C) == 0x0003E8, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_Root_CF606CFC4E44969508CBE7868C0CA56C' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_TransitionResult_D693709A43DEF0F14C306AB7DBFED4BD) == 0x000430, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_TransitionResult_D693709A43DEF0F14C306AB7DBFED4BD' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_TransitionResult_E9581D8A42084B54E528269B16E40CB9) == 0x0004B0, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_TransitionResult_E9581D8A42084B54E528269B16E40CB9' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_TransitionResult_88D8161F4261561504AFF8B7A96F23CE) == 0x000530, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_TransitionResult_88D8161F4261561504AFF8B7A96F23CE' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_TransitionResult_17978E024D3451B9FA85BC8C0C3A2AAB) == 0x0005B0, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_TransitionResult_17978E024D3451B9FA85BC8C0C3A2AAB' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_TransitionResult_1FAF9D9A4C5354BE1AF28FBA9CAFB968) == 0x000630, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_TransitionResult_1FAF9D9A4C5354BE1AF28FBA9CAFB968' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_SequencePlayer_B447747D42497910AF215F87826B464B) == 0x0006B0, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_SequencePlayer_B447747D42497910AF215F87826B464B' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_StateResult_8DA0C64C4820F6CFB64C318A29E2B550) == 0x000720, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_StateResult_8DA0C64C4820F6CFB64C318A29E2B550' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_LayeredBoneBlend_4208249D4C4B7D2CCD4103A0DE40E7ED) == 0x000768, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_LayeredBoneBlend_4208249D4C4B7D2CCD4103A0DE40E7ED' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_SequencePlayer_14A50A2746ECBA3B1797EC912F1D2778) == 0x000848, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_SequencePlayer_14A50A2746ECBA3B1797EC912F1D2778' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_SequencePlayer_704DF09E4680DBA1A7327C92CB418292) == 0x0008B8, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_SequencePlayer_704DF09E4680DBA1A7327C92CB418292' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_StateResult_7D8956734C70350F02D4BAA9F8001337) == 0x000928, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_StateResult_7D8956734C70350F02D4BAA9F8001337' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_LayeredBoneBlend_CE42CCD143B3B5D4255289BF7515CA05) == 0x000970, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_LayeredBoneBlend_CE42CCD143B3B5D4255289BF7515CA05' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_SequencePlayer_71941EAC4BD294EA0F9CC4B768D36A0A) == 0x000A50, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_SequencePlayer_71941EAC4BD294EA0F9CC4B768D36A0A' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_SequencePlayer_8EDDD9064B218ED0DB2E5B8C1EC6E015) == 0x000AC0, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_SequencePlayer_8EDDD9064B218ED0DB2E5B8C1EC6E015' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_StateResult_6E5EAFD04E0C9F4EA90E3584B2A7D124) == 0x000B30, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_StateResult_6E5EAFD04E0C9F4EA90E3584B2A7D124' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_LayeredBoneBlend_87179E39437731128AB443ADE39FA856) == 0x000B78, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_LayeredBoneBlend_87179E39437731128AB443ADE39FA856' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_SequencePlayer_8201151A4BBDE46A56AE7FAD56B7C161) == 0x000C58, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_SequencePlayer_8201151A4BBDE46A56AE7FAD56B7C161' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_SequencePlayer_5864505645F176F8AB216B9561AC9992) == 0x000CC8, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_SequencePlayer_5864505645F176F8AB216B9561AC9992' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_StateResult_BA67EBBF4B21C893995BE8B81C8BCED1) == 0x000D38, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_StateResult_BA67EBBF4B21C893995BE8B81C8BCED1' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_SequencePlayer_FFCFAB314C3A544E1C17509198151051) == 0x000D80, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_SequencePlayer_FFCFAB314C3A544E1C17509198151051' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_StateResult_73C8A732491AD3A77AD41185ACD88986) == 0x000DF0, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_StateResult_73C8A732491AD3A77AD41185ACD88986' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_StateMachine_D9D76A68449C776F7376F4B554AF2845) == 0x000E38, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_StateMachine_D9D76A68449C776F7376F4B554AF2845' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_LocalToComponentSpace_75B7449B4A7BF2779854D6B3E7BC91D2) == 0x000F10, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_LocalToComponentSpace_75B7449B4A7BF2779854D6B3E7BC91D2' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_LookAt_F1B034C8466AFF4E9825EB8A93214C48) == 0x000F60, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_LookAt_F1B034C8466AFF4E9825EB8A93214C48' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_ED681E224BF18B831F646FAD57C60EA0) == 0x001100, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_ED681E224BF18B831F646FAD57C60EA0' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_LookAt_504A510E4BEFE5D56D81E8AC9D4EA967) == 0x001150, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_LookAt_504A510E4BEFE5D56D81E8AC9D4EA967' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_ModifyBone_FE154EDB4F8B474A3D61CDA9A1F15551) == 0x0012F0, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_ModifyBone_FE154EDB4F8B474A3D61CDA9A1F15551' has a wrong offset!");
static_assert(offsetof(UCoreCombined_AnimBP_C, AnimGraphNode_Slot_0251D66F4989A322713F248463160BB4) == 0x0013A8, "Member 'UCoreCombined_AnimBP_C::AnimGraphNode_Slot_0251D66F4989A322713F248463160BB4' has a wrong offset!");

}

