#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeckWarningIcon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function DeckWarningIcon.DeckWarningIcon_C.ExecuteUbergraph_DeckWarningIcon
// 0x0140 (0x0140 - 0x0000)
struct DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent2;                          // 0x0040(0x0070)()
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue2;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D0(0x0070)()
};
static_assert(alignof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon) == 0x000008, "Wrong alignment on DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon");
static_assert(sizeof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon) == 0x000140, "Wrong size on DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, EntryPoint) == 0x000000, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, K2Node_Event_MyGeometry) == 0x000004, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, K2Node_Event_MouseEvent2) == 0x000040, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::K2Node_Event_MouseEvent2' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, CallFunc_PauseAnimation_ReturnValue) == 0x0000B0, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, CallFunc_GetEndTime_ReturnValue) == 0x0000B4, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000B8, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000BC, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, CallFunc_GetStartTime_ReturnValue) == 0x0000C0, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, CallFunc_SelectFloat_ReturnValue) == 0x0000C4, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, CallFunc_PauseAnimation_ReturnValue2) == 0x0000C8, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::CallFunc_PauseAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000CC, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon, K2Node_Event_MouseEvent) == 0x0000D0, "Member 'DeckWarningIcon_C_ExecuteUbergraph_DeckWarningIcon::K2Node_Event_MouseEvent' has a wrong offset!");

// Function DeckWarningIcon.DeckWarningIcon_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct DeckWarningIcon_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(DeckWarningIcon_C_OnMouseEnter) == 0x000008, "Wrong alignment on DeckWarningIcon_C_OnMouseEnter");
static_assert(sizeof(DeckWarningIcon_C_OnMouseEnter) == 0x0000A8, "Wrong size on DeckWarningIcon_C_OnMouseEnter");
static_assert(offsetof(DeckWarningIcon_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'DeckWarningIcon_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(DeckWarningIcon_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'DeckWarningIcon_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function DeckWarningIcon.DeckWarningIcon_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct DeckWarningIcon_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(DeckWarningIcon_C_OnMouseLeave) == 0x000008, "Wrong alignment on DeckWarningIcon_C_OnMouseLeave");
static_assert(sizeof(DeckWarningIcon_C_OnMouseLeave) == 0x000070, "Wrong size on DeckWarningIcon_C_OnMouseLeave");
static_assert(offsetof(DeckWarningIcon_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'DeckWarningIcon_C_OnMouseLeave::MouseEvent' has a wrong offset!");

}

