#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEnd_SingleHeroSpotlight_Short

#include "Basic.hpp"

#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FrontEnd_SingleHeroSpotlight_Short.FrontEnd_SingleHeroSpotlight_Short_C
// 0x0018 (0x0400 - 0x03E8)
class AFrontEnd_SingleHeroSpotlight_Short_C final : public AOrionBaseActor
{
public:
	class UArrowComponent*                        Arrow;                                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEnd_SingleHeroSpotlight_Short_C">();
	}
	static class AFrontEnd_SingleHeroSpotlight_Short_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontEnd_SingleHeroSpotlight_Short_C>();
	}
};
static_assert(alignof(AFrontEnd_SingleHeroSpotlight_Short_C) == 0x000008, "Wrong alignment on AFrontEnd_SingleHeroSpotlight_Short_C");
static_assert(sizeof(AFrontEnd_SingleHeroSpotlight_Short_C) == 0x000400, "Wrong size on AFrontEnd_SingleHeroSpotlight_Short_C");
static_assert(offsetof(AFrontEnd_SingleHeroSpotlight_Short_C, Arrow) == 0x0003E8, "Member 'AFrontEnd_SingleHeroSpotlight_Short_C::Arrow' has a wrong offset!");
static_assert(offsetof(AFrontEnd_SingleHeroSpotlight_Short_C, SpotLight) == 0x0003F0, "Member 'AFrontEnd_SingleHeroSpotlight_Short_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AFrontEnd_SingleHeroSpotlight_Short_C, DefaultSceneRoot) == 0x0003F8, "Member 'AFrontEnd_SingleHeroSpotlight_Short_C::DefaultSceneRoot' has a wrong offset!");

}

