#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEndManager_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FrontEndManager_Blueprint.FrontEndManager_Blueprint_C.ExecuteUbergraph_FrontEndManager_Blueprint
// 0x0190 (0x0190 - 0x0000)
struct FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NewScene)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* Widget, class FName MenuCategory)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class ACameraActor*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class ACameraActor*                           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00AC(0x000C)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionHeroData*                         K2Node_CustomEvent_HeroData;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionSkinItemDefinition*               K2Node_CustomEvent_SkinToShow;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuContext*                           CallFunc_GetContext_ReturnValue;                   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UOrionHeroData* HeroData, class UOrionSkinItemDefinition* SkinToShow)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint) == 0x000010, "Wrong alignment on FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint");
static_assert(sizeof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint) == 0x000190, "Wrong size on FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, EntryPoint) == 0x000000, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, Temp_int_Array_Index_Variable) == 0x000004, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_GetAllActorsOfClass_OutActors) == 0x000038, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_Array_Get_Item) == 0x000048, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_GetObjectName_ReturnValue) == 0x000058, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_Contains_ReturnValue) == 0x000068, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_GetTransform_ReturnValue) == 0x000070, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A0, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000AC, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, Temp_int_Loop_Counter_Variable) == 0x0000B8, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, K2Node_CustomEvent_HeroData) == 0x0000C0, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::K2Node_CustomEvent_HeroData' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, K2Node_CustomEvent_SkinToShow) == 0x0000C8, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::K2Node_CustomEvent_SkinToShow' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_Add_IntInt_ReturnValue) == 0x0000D4, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_BooleanAND_ReturnValue) == 0x0000D8, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000E0, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000168, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_GetContext_ReturnValue) == 0x000170, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint, K2Node_CreateDelegate_OutputDelegate3) == 0x000180, "Member 'FrontEndManager_Blueprint_C_ExecuteUbergraph_FrontEndManager_Blueprint::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function FrontEndManager_Blueprint.FrontEndManager_Blueprint_C.HeroDetail
// 0x0010 (0x0010 - 0x0000)
struct FrontEndManager_Blueprint_C_HeroDetail final
{
public:
	class UOrionHeroData*                         HeroData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionSkinItemDefinition*               SkinToShow;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndManager_Blueprint_C_HeroDetail) == 0x000008, "Wrong alignment on FrontEndManager_Blueprint_C_HeroDetail");
static_assert(sizeof(FrontEndManager_Blueprint_C_HeroDetail) == 0x000010, "Wrong size on FrontEndManager_Blueprint_C_HeroDetail");
static_assert(offsetof(FrontEndManager_Blueprint_C_HeroDetail, HeroData) == 0x000000, "Member 'FrontEndManager_Blueprint_C_HeroDetail::HeroData' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_HeroDetail, SkinToShow) == 0x000008, "Member 'FrontEndManager_Blueprint_C_HeroDetail::SkinToShow' has a wrong offset!");

// Function FrontEndManager_Blueprint.FrontEndManager_Blueprint_C.Handle Scene Changed
// 0x0018 (0x0018 - 0x0000)
struct FrontEndManager_Blueprint_C_Handle_Scene_Changed final
{
public:
	class FName                                   Scene;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetScene_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndManager_Blueprint_C_Handle_Scene_Changed) == 0x000008, "Wrong alignment on FrontEndManager_Blueprint_C_Handle_Scene_Changed");
static_assert(sizeof(FrontEndManager_Blueprint_C_Handle_Scene_Changed) == 0x000018, "Wrong size on FrontEndManager_Blueprint_C_Handle_Scene_Changed");
static_assert(offsetof(FrontEndManager_Blueprint_C_Handle_Scene_Changed, Scene) == 0x000000, "Member 'FrontEndManager_Blueprint_C_Handle_Scene_Changed::Scene' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_Handle_Scene_Changed, CallFunc_GetScene_ReturnValue) == 0x000008, "Member 'FrontEndManager_Blueprint_C_Handle_Scene_Changed::CallFunc_GetScene_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_Handle_Scene_Changed, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'FrontEndManager_Blueprint_C_Handle_Scene_Changed::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function FrontEndManager_Blueprint.FrontEndManager_Blueprint_C.On Category Changed
// 0x00B8 (0x00B8 - 0x0000)
struct FrontEndManager_Blueprint_C_On_Category_Changed final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewParam;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionPlayerController_Base*            CallFunc_GetLocalPlayerController_Base_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FrontEndManager_Blueprint_C_On_Category_Changed) == 0x000008, "Wrong alignment on FrontEndManager_Blueprint_C_On_Category_Changed");
static_assert(sizeof(FrontEndManager_Blueprint_C_On_Category_Changed) == 0x0000B8, "Wrong size on FrontEndManager_Blueprint_C_On_Category_Changed");
static_assert(offsetof(FrontEndManager_Blueprint_C_On_Category_Changed, Widget) == 0x000000, "Member 'FrontEndManager_Blueprint_C_On_Category_Changed::Widget' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_On_Category_Changed, NewParam) == 0x000008, "Member 'FrontEndManager_Blueprint_C_On_Category_Changed::NewParam' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_On_Category_Changed, CallFunc_GetLocalPlayerController_Base_ReturnValue) == 0x000010, "Member 'FrontEndManager_Blueprint_C_On_Category_Changed::CallFunc_GetLocalPlayerController_Base_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_On_Category_Changed, CallFunc_GetViewTarget_ReturnValue) == 0x000018, "Member 'FrontEndManager_Blueprint_C_On_Category_Changed::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_On_Category_Changed, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'FrontEndManager_Blueprint_C_On_Category_Changed::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_On_Category_Changed, CallFunc_K2_AddActorWorldOffset_SweepHitResult) == 0x000030, "Member 'FrontEndManager_Blueprint_C_On_Category_Changed::CallFunc_K2_AddActorWorldOffset_SweepHitResult' has a wrong offset!");

// Function FrontEndManager_Blueprint.FrontEndManager_Blueprint_C.UpdateFauxLensEffects
// 0x0140 (0x0140 - 0x0000)
struct FrontEndManager_Blueprint_C_UpdateFauxLensEffects final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable2;                             // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AStaticMeshActor*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0054(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorRelativeTransform_SweepHitResult; // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects) == 0x000010, "Wrong alignment on FrontEndManager_Blueprint_C_UpdateFauxLensEffects");
static_assert(sizeof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects) == 0x000140, "Wrong size on FrontEndManager_Blueprint_C_UpdateFauxLensEffects");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, Temp_bool_Variable) == 0x000000, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, Temp_struct_Variable) == 0x000004, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, Temp_struct_Variable2) == 0x000010, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000028, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_GetFOVAngle_ReturnValue) == 0x000040, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_Array_Get_Item) == 0x000048, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_Less_FloatFloat_ReturnValue) == 0x000050, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_ComponentHasTag_ReturnValue) == 0x000051, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, K2Node_Select_Default) == 0x000054, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_Lerp_ReturnValue) == 0x000068, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndManager_Blueprint_C_UpdateFauxLensEffects, CallFunc_K2_SetActorRelativeTransform_SweepHitResult) == 0x0000B0, "Member 'FrontEndManager_Blueprint_C_UpdateFauxLensEffects::CallFunc_K2_SetActorRelativeTransform_SweepHitResult' has a wrong offset!");

}

