#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEndCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FrontEndCard.FrontEndCard_C
// 0x0048 (0x0A98 - 0x0A50)
class UFrontEndCard_C final : public UOrionFrontEndCard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A50(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0A58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0A60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Affordable_Glow;                             // 0x0A68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedLighten;                             // 0x0A70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Swipe;                                       // 0x0A78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             CardSelectSound;                                   // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CardDeselectSound;                                 // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimateOnHover;                                    // 0x0A90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_FrontEndCard(int32 EntryPoint);
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnSelected();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnProgressFillComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEndCard_C">();
	}
	static class UFrontEndCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontEndCard_C>();
	}
};
static_assert(alignof(UFrontEndCard_C) == 0x000008, "Wrong alignment on UFrontEndCard_C");
static_assert(sizeof(UFrontEndCard_C) == 0x000A98, "Wrong size on UFrontEndCard_C");
static_assert(offsetof(UFrontEndCard_C, UberGraphFrame) == 0x000A50, "Member 'UFrontEndCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFrontEndCard_C, Selected) == 0x000A58, "Member 'UFrontEndCard_C::Selected' has a wrong offset!");
static_assert(offsetof(UFrontEndCard_C, Hover) == 0x000A60, "Member 'UFrontEndCard_C::Hover' has a wrong offset!");
static_assert(offsetof(UFrontEndCard_C, Image_Affordable_Glow) == 0x000A68, "Member 'UFrontEndCard_C::Image_Affordable_Glow' has a wrong offset!");
static_assert(offsetof(UFrontEndCard_C, Image_SelectedLighten) == 0x000A70, "Member 'UFrontEndCard_C::Image_SelectedLighten' has a wrong offset!");
static_assert(offsetof(UFrontEndCard_C, Image_Swipe) == 0x000A78, "Member 'UFrontEndCard_C::Image_Swipe' has a wrong offset!");
static_assert(offsetof(UFrontEndCard_C, CardSelectSound) == 0x000A80, "Member 'UFrontEndCard_C::CardSelectSound' has a wrong offset!");
static_assert(offsetof(UFrontEndCard_C, CardDeselectSound) == 0x000A88, "Member 'UFrontEndCard_C::CardDeselectSound' has a wrong offset!");
static_assert(offsetof(UFrontEndCard_C, AnimateOnHover) == 0x000A90, "Member 'UFrontEndCard_C::AnimateOnHover' has a wrong offset!");

}

