#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEndManager_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FrontEndManager_Blueprint.FrontEndManager_Blueprint_C
// 0x00B8 (0x0430 - 0x0378)
class AFrontEndManager_Blueprint_C final : public AFrontEndManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetAmount;                                      // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                HeroCameraOrigin;                                  // 0x038C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               HeroRotationOrigin;                                // 0x0398(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A4[0xC];                                      // 0x03A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             HeroCamOriginalTransform;                          // 0x03B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ACameraActor*                           HeroCamera;                                        // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             HeroFaceViewTransform;                             // 0x03F0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         BlendValue;                                        // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendSpeed;                                        // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeroCamOriginalFOV;                                // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FrontEndManager_Blueprint(int32 EntryPoint);
	void Event_UpdateFauxLensEffect();
	void HeroDetail(class UOrionHeroData* HeroData, class UOrionSkinItemDefinition* SkinToShow);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Handle_Scene_Changed(class FName Scene);
	void On_Category_Changed(class UUserWidget* Widget, class FName NewParam);
	void UpdateFauxLensEffects();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEndManager_Blueprint_C">();
	}
	static class AFrontEndManager_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontEndManager_Blueprint_C>();
	}
};
static_assert(alignof(AFrontEndManager_Blueprint_C) == 0x000010, "Wrong alignment on AFrontEndManager_Blueprint_C");
static_assert(sizeof(AFrontEndManager_Blueprint_C) == 0x000430, "Wrong size on AFrontEndManager_Blueprint_C");
static_assert(offsetof(AFrontEndManager_Blueprint_C, UberGraphFrame) == 0x000378, "Member 'AFrontEndManager_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, DefaultSceneRoot) == 0x000380, "Member 'AFrontEndManager_Blueprint_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, OffsetAmount) == 0x000388, "Member 'AFrontEndManager_Blueprint_C::OffsetAmount' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, HeroCameraOrigin) == 0x00038C, "Member 'AFrontEndManager_Blueprint_C::HeroCameraOrigin' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, HeroRotationOrigin) == 0x000398, "Member 'AFrontEndManager_Blueprint_C::HeroRotationOrigin' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, HeroCamOriginalTransform) == 0x0003B0, "Member 'AFrontEndManager_Blueprint_C::HeroCamOriginalTransform' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, HeroCamera) == 0x0003E0, "Member 'AFrontEndManager_Blueprint_C::HeroCamera' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, HeroFaceViewTransform) == 0x0003F0, "Member 'AFrontEndManager_Blueprint_C::HeroFaceViewTransform' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, BlendValue) == 0x000420, "Member 'AFrontEndManager_Blueprint_C::BlendValue' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, BlendSpeed) == 0x000424, "Member 'AFrontEndManager_Blueprint_C::BlendSpeed' has a wrong offset!");
static_assert(offsetof(AFrontEndManager_Blueprint_C, HeroCamOriginalFOV) == 0x000428, "Member 'AFrontEndManager_Blueprint_C::HeroCamOriginalFOV' has a wrong offset!");

}

