#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_Gold_PrimaryAttack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C.ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack
// 0x0188 (0x0188 - 0x0000)
struct GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0008(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0038(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0068(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOrionAbilityMontageContainer>  K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	struct FOrionAbilityMontageContainer          CallFunc_Array_Get_Item;                           // 0x0158(0x0010)()
	float                                         CallFunc_K2_GetBestMontageForAttackSpeed_OutPlayRate; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_K2_GetBestMontageForAttackSpeed_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack) == 0x000008, "Wrong alignment on GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack");
static_assert(sizeof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack) == 0x000188, "Wrong size on GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, EntryPoint) == 0x000000, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CustomEvent_Targets2) == 0x000008, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CustomEvent_Targets) == 0x000038, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, Temp_struct_Variable) == 0x000068, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_StartTargeting_ReturnValue) == 0x000088, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CustomEvent_NotifyName6) == 0x000098, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A0, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CustomEvent_NotifyName5) == 0x0000B0, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate4) == 0x0000B8, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CustomEvent_NotifyName4) == 0x0000C8, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate5) == 0x0000D0, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CustomEvent_NotifyName3) == 0x0000E0, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate6) == 0x0000E8, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CustomEvent_NotifyName2) == 0x0000F8, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate7) == 0x000100, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CustomEvent_NotifyName) == 0x000110, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate8) == 0x000118, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, Temp_name_Variable) == 0x000128, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000130, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, K2Node_MakeArray_Array) == 0x000138, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000148, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_Array_Get_Item) == 0x000158, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_K2_GetBestMontageForAttackSpeed_OutPlayRate) == 0x000168, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_K2_GetBestMontageForAttackSpeed_OutPlayRate' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_K2_GetBestMontageForAttackSpeed_ReturnValue) == 0x000170, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_K2_GetBestMontageForAttackSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000178, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack, CallFunc_IsValid_ReturnValue2) == 0x000180, "Member 'GA_Buff_Gold_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C.Cancelled_E7B86EA84984694E31D659AC2514E6D8
// 0x0020 (0x0020 - 0x0000)
struct GA_Buff_Gold_PrimaryAttack_C_Cancelled_E7B86EA84984694E31D659AC2514E6D8 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Buff_Gold_PrimaryAttack_C_Cancelled_E7B86EA84984694E31D659AC2514E6D8) == 0x000008, "Wrong alignment on GA_Buff_Gold_PrimaryAttack_C_Cancelled_E7B86EA84984694E31D659AC2514E6D8");
static_assert(sizeof(GA_Buff_Gold_PrimaryAttack_C_Cancelled_E7B86EA84984694E31D659AC2514E6D8) == 0x000020, "Wrong size on GA_Buff_Gold_PrimaryAttack_C_Cancelled_E7B86EA84984694E31D659AC2514E6D8");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_Cancelled_E7B86EA84984694E31D659AC2514E6D8, Targets) == 0x000000, "Member 'GA_Buff_Gold_PrimaryAttack_C_Cancelled_E7B86EA84984694E31D659AC2514E6D8::Targets' has a wrong offset!");

// Function GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C.Confirmed_E7B86EA84984694E31D659AC2514E6D8
// 0x0020 (0x0020 - 0x0000)
struct GA_Buff_Gold_PrimaryAttack_C_Confirmed_E7B86EA84984694E31D659AC2514E6D8 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Buff_Gold_PrimaryAttack_C_Confirmed_E7B86EA84984694E31D659AC2514E6D8) == 0x000008, "Wrong alignment on GA_Buff_Gold_PrimaryAttack_C_Confirmed_E7B86EA84984694E31D659AC2514E6D8");
static_assert(sizeof(GA_Buff_Gold_PrimaryAttack_C_Confirmed_E7B86EA84984694E31D659AC2514E6D8) == 0x000020, "Wrong size on GA_Buff_Gold_PrimaryAttack_C_Confirmed_E7B86EA84984694E31D659AC2514E6D8");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_Confirmed_E7B86EA84984694E31D659AC2514E6D8, Targets) == 0x000000, "Member 'GA_Buff_Gold_PrimaryAttack_C_Confirmed_E7B86EA84984694E31D659AC2514E6D8::Targets' has a wrong offset!");

// Function GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C.OnBlendOut_0DCFD75043AB4FC79A8AC58407987B24
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Gold_PrimaryAttack_C_OnBlendOut_0DCFD75043AB4FC79A8AC58407987B24 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Gold_PrimaryAttack_C_OnBlendOut_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong alignment on GA_Buff_Gold_PrimaryAttack_C_OnBlendOut_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(sizeof(GA_Buff_Gold_PrimaryAttack_C_OnBlendOut_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong size on GA_Buff_Gold_PrimaryAttack_C_OnBlendOut_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_OnBlendOut_0DCFD75043AB4FC79A8AC58407987B24, NotifyName) == 0x000000, "Member 'GA_Buff_Gold_PrimaryAttack_C_OnBlendOut_0DCFD75043AB4FC79A8AC58407987B24::NotifyName' has a wrong offset!");

// Function GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C.OnCancelled_0DCFD75043AB4FC79A8AC58407987B24
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Gold_PrimaryAttack_C_OnCancelled_0DCFD75043AB4FC79A8AC58407987B24 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Gold_PrimaryAttack_C_OnCancelled_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong alignment on GA_Buff_Gold_PrimaryAttack_C_OnCancelled_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(sizeof(GA_Buff_Gold_PrimaryAttack_C_OnCancelled_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong size on GA_Buff_Gold_PrimaryAttack_C_OnCancelled_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_OnCancelled_0DCFD75043AB4FC79A8AC58407987B24, NotifyName) == 0x000000, "Member 'GA_Buff_Gold_PrimaryAttack_C_OnCancelled_0DCFD75043AB4FC79A8AC58407987B24::NotifyName' has a wrong offset!");

// Function GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C.OnCompleted_0DCFD75043AB4FC79A8AC58407987B24
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Gold_PrimaryAttack_C_OnCompleted_0DCFD75043AB4FC79A8AC58407987B24 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Gold_PrimaryAttack_C_OnCompleted_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong alignment on GA_Buff_Gold_PrimaryAttack_C_OnCompleted_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(sizeof(GA_Buff_Gold_PrimaryAttack_C_OnCompleted_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong size on GA_Buff_Gold_PrimaryAttack_C_OnCompleted_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_OnCompleted_0DCFD75043AB4FC79A8AC58407987B24, NotifyName) == 0x000000, "Member 'GA_Buff_Gold_PrimaryAttack_C_OnCompleted_0DCFD75043AB4FC79A8AC58407987B24::NotifyName' has a wrong offset!");

// Function GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C.OnInterrupted_0DCFD75043AB4FC79A8AC58407987B24
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Gold_PrimaryAttack_C_OnInterrupted_0DCFD75043AB4FC79A8AC58407987B24 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Gold_PrimaryAttack_C_OnInterrupted_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong alignment on GA_Buff_Gold_PrimaryAttack_C_OnInterrupted_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(sizeof(GA_Buff_Gold_PrimaryAttack_C_OnInterrupted_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong size on GA_Buff_Gold_PrimaryAttack_C_OnInterrupted_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_OnInterrupted_0DCFD75043AB4FC79A8AC58407987B24, NotifyName) == 0x000000, "Member 'GA_Buff_Gold_PrimaryAttack_C_OnInterrupted_0DCFD75043AB4FC79A8AC58407987B24::NotifyName' has a wrong offset!");

// Function GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C.OnNotifyBegin_0DCFD75043AB4FC79A8AC58407987B24
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Gold_PrimaryAttack_C_OnNotifyBegin_0DCFD75043AB4FC79A8AC58407987B24 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Gold_PrimaryAttack_C_OnNotifyBegin_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong alignment on GA_Buff_Gold_PrimaryAttack_C_OnNotifyBegin_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(sizeof(GA_Buff_Gold_PrimaryAttack_C_OnNotifyBegin_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong size on GA_Buff_Gold_PrimaryAttack_C_OnNotifyBegin_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_OnNotifyBegin_0DCFD75043AB4FC79A8AC58407987B24, NotifyName) == 0x000000, "Member 'GA_Buff_Gold_PrimaryAttack_C_OnNotifyBegin_0DCFD75043AB4FC79A8AC58407987B24::NotifyName' has a wrong offset!");

// Function GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C.OnNotifyEnd_0DCFD75043AB4FC79A8AC58407987B24
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Gold_PrimaryAttack_C_OnNotifyEnd_0DCFD75043AB4FC79A8AC58407987B24 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Gold_PrimaryAttack_C_OnNotifyEnd_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong alignment on GA_Buff_Gold_PrimaryAttack_C_OnNotifyEnd_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(sizeof(GA_Buff_Gold_PrimaryAttack_C_OnNotifyEnd_0DCFD75043AB4FC79A8AC58407987B24) == 0x000008, "Wrong size on GA_Buff_Gold_PrimaryAttack_C_OnNotifyEnd_0DCFD75043AB4FC79A8AC58407987B24");
static_assert(offsetof(GA_Buff_Gold_PrimaryAttack_C_OnNotifyEnd_0DCFD75043AB4FC79A8AC58407987B24, NotifyName) == 0x000000, "Member 'GA_Buff_Gold_PrimaryAttack_C_OnNotifyEnd_0DCFD75043AB4FC79A8AC58407987B24::NotifyName' has a wrong offset!");

}

