#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_Black_PrimaryAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Buff_Black_PrimaryAttack.GA_Buff_Black_PrimaryAttack_C
// 0x0050 (0x0BC0 - 0x0B70)
class UGA_Buff_Black_PrimaryAttack_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           Uppercut;                                          // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           BigSmash;                                          // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Attack2;                                           // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Attack1;                                           // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionAbilityMontageContainer          Punch01;                                           // 0x0B98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOrionAbilityMontageContainer          Punch02;                                           // 0x0BA8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 DamageGE;                                          // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Buff_Black_PrimaryAttack(int32 EntryPoint);
	void Cancelled_1B92E6D14D6F204C17232DB406C7E8C8(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_1B92E6D14D6F204C17232DB406C7E8C8(const struct FGameplayAbilityTargetDataHandle& Targets);
	void K2_ActivateAbility();
	void OnBlendOut_210B0AB641EDF148468944A3813D491B(class FName NotifyName);
	void OnCancelled_210B0AB641EDF148468944A3813D491B(class FName NotifyName);
	void OnCompleted_210B0AB641EDF148468944A3813D491B(class FName NotifyName);
	void OnInterrupted_210B0AB641EDF148468944A3813D491B(class FName NotifyName);
	void OnNotifyBegin_210B0AB641EDF148468944A3813D491B(class FName NotifyName);
	void OnNotifyEnd_210B0AB641EDF148468944A3813D491B(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Buff_Black_PrimaryAttack_C">();
	}
	static class UGA_Buff_Black_PrimaryAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Buff_Black_PrimaryAttack_C>();
	}
};
static_assert(alignof(UGA_Buff_Black_PrimaryAttack_C) == 0x000010, "Wrong alignment on UGA_Buff_Black_PrimaryAttack_C");
static_assert(sizeof(UGA_Buff_Black_PrimaryAttack_C) == 0x000BC0, "Wrong size on UGA_Buff_Black_PrimaryAttack_C");
static_assert(offsetof(UGA_Buff_Black_PrimaryAttack_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Buff_Black_PrimaryAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Black_PrimaryAttack_C, Uppercut) == 0x000B78, "Member 'UGA_Buff_Black_PrimaryAttack_C::Uppercut' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Black_PrimaryAttack_C, BigSmash) == 0x000B80, "Member 'UGA_Buff_Black_PrimaryAttack_C::BigSmash' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Black_PrimaryAttack_C, Attack2) == 0x000B88, "Member 'UGA_Buff_Black_PrimaryAttack_C::Attack2' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Black_PrimaryAttack_C, Attack1) == 0x000B90, "Member 'UGA_Buff_Black_PrimaryAttack_C::Attack1' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Black_PrimaryAttack_C, Punch01) == 0x000B98, "Member 'UGA_Buff_Black_PrimaryAttack_C::Punch01' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Black_PrimaryAttack_C, Punch02) == 0x000BA8, "Member 'UGA_Buff_Black_PrimaryAttack_C::Punch02' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Black_PrimaryAttack_C, DamageGE) == 0x000BB8, "Member 'UGA_Buff_Black_PrimaryAttack_C::DamageGE' has a wrong offset!");

}

