#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_Jungle_Explode

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Buff_Jungle_Explode.GA_Buff_Jungle_Explode_C.ExecuteUbergraph_GA_Buff_Jungle_Explode
// 0x01D0 (0x01D0 - 0x0000)
struct GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Source;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0010(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0048(0x0018)()
	class AActor*                                 Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0068(0x0040)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00A8(0x0020)()
	EOrionTeam                                    Temp_byte_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IOrionTeamActorInterface> K2Node_DynamicCast_AsOrion_Team_Actor_Interface;   // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionAbilityTargetDataFilter          K2Node_MakeStruct_OrionAbilityTargetDataFilter;    // 0x0148(0x0030)()
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeOrionFilterHandle_ReturnValue;        // 0x0178(0x0010)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue3; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEffectApplied_Self* CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_SphereAroundActor_ReturnValue;            // 0x0198(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2; // 0x01B8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode) == 0x000008, "Wrong alignment on GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode");
static_assert(sizeof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode) == 0x0001D0, "Wrong size on GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, EntryPoint) == 0x000000, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_CustomEvent_Source) == 0x000008, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_CustomEvent_SpecHandle) == 0x000010, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_CustomEvent_ActiveHandle) == 0x000028, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, Temp_struct_Variable) == 0x000040, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, Temp_struct_Variable2) == 0x000048, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, Temp_object_Variable) == 0x000060, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_MakeStruct_GameplayTagRequirements) == 0x000068, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000A8, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, Temp_byte_Variable) == 0x0000C8, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_CreateDelegate_OutputDelegate2) == 0x0000D0, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000E0, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_CreateDelegate_OutputDelegate3) == 0x0000F0, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000100, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_DynamicCast_AsOrion_Team_Actor_Interface) == 0x000108, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_DynamicCast_AsOrion_Team_Actor_Interface' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000120, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_GetTeamNum_ReturnValue) == 0x000128, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_ActorHasTag_ReturnValue) == 0x000129, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000130, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000138, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_IsValid_ReturnValue2) == 0x000141, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, K2Node_MakeStruct_OrionAbilityTargetDataFilter) == 0x000148, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::K2Node_MakeStruct_OrionAbilityTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_MakeOrionFilterHandle_ReturnValue) == 0x000178, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_MakeOrionFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_GetAvatarActorFromActorInfo_ReturnValue3) == 0x000188, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_GetAvatarActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue) == 0x000190, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_SphereAroundActor_ReturnValue) == 0x000198, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_SphereAroundActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2) == 0x0001B8, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode, CallFunc_IsValid_ReturnValue3) == 0x0001C8, "Member 'GA_Buff_Jungle_Explode_C_ExecuteUbergraph_GA_Buff_Jungle_Explode::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function GA_Buff_Jungle_Explode.GA_Buff_Jungle_Explode_C.OnApplied_37BC74B7472DB862667CDABB424AD0CE
// 0x0028 (0x0028 - 0x0000)
struct GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE) == 0x000008, "Wrong alignment on GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE");
static_assert(sizeof(GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE) == 0x000028, "Wrong size on GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE, Source) == 0x000000, "Member 'GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE::Source' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE, SpecHandle) == 0x000008, "Member 'GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE, ActiveHandle) == 0x000020, "Member 'GA_Buff_Jungle_Explode_C_OnApplied_37BC74B7472DB862667CDABB424AD0CE::ActiveHandle' has a wrong offset!");

}

