#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_Blue_PrimaryAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Buff_Blue_PrimaryAttack_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           Fire;                                              // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FireA;                                             // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FireB;                                             // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Buff_Blue_PrimaryAttack(int32 EntryPoint);
	void FailedToSpawn_CE1F20C5494D039F7419C888C89B9BE3(class AOrionProjectile* SpawnedProjectile);
	void K2_ActivateAbility();
	void NotAuthority_CE1F20C5494D039F7419C888C89B9BE3(class AOrionProjectile* SpawnedProjectile);
	void OnBlendOut_29ED4B38410B27C8CC2E3A8CF49C4FFB(class FName NotifyName);
	void OnBlendOut_CEA65A7A483D5251D5519BA8B922DE3B(class FName NotifyName);
	void OnBlendOut_EE75F5AA4723D93C1B9E01B42B8EC2A1(class FName NotifyName);
	void OnCancelled_29ED4B38410B27C8CC2E3A8CF49C4FFB(class FName NotifyName);
	void OnCancelled_CEA65A7A483D5251D5519BA8B922DE3B(class FName NotifyName);
	void OnCancelled_EE75F5AA4723D93C1B9E01B42B8EC2A1(class FName NotifyName);
	void OnCompleted_29ED4B38410B27C8CC2E3A8CF49C4FFB(class FName NotifyName);
	void OnCompleted_CEA65A7A483D5251D5519BA8B922DE3B(class FName NotifyName);
	void OnCompleted_EE75F5AA4723D93C1B9E01B42B8EC2A1(class FName NotifyName);
	void OnInterrupted_29ED4B38410B27C8CC2E3A8CF49C4FFB(class FName NotifyName);
	void OnInterrupted_CEA65A7A483D5251D5519BA8B922DE3B(class FName NotifyName);
	void OnInterrupted_EE75F5AA4723D93C1B9E01B42B8EC2A1(class FName NotifyName);
	void OnNotifyBegin_29ED4B38410B27C8CC2E3A8CF49C4FFB(class FName NotifyName);
	void OnNotifyBegin_CEA65A7A483D5251D5519BA8B922DE3B(class FName NotifyName);
	void OnNotifyBegin_EE75F5AA4723D93C1B9E01B42B8EC2A1(class FName NotifyName);
	void OnNotifyEnd_29ED4B38410B27C8CC2E3A8CF49C4FFB(class FName NotifyName);
	void OnNotifyEnd_CEA65A7A483D5251D5519BA8B922DE3B(class FName NotifyName);
	void OnNotifyEnd_EE75F5AA4723D93C1B9E01B42B8EC2A1(class FName NotifyName);
	void PreSpawned_CE1F20C5494D039F7419C888C89B9BE3(class AOrionProjectile* SpawnedProjectile);
	void Success_CE1F20C5494D039F7419C888C89B9BE3(class AOrionProjectile* SpawnedProjectile);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Buff_Blue_PrimaryAttack_C">();
	}
	static class UGA_Buff_Blue_PrimaryAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Buff_Blue_PrimaryAttack_C>();
	}
};
static_assert(alignof(UGA_Buff_Blue_PrimaryAttack_C) == 0x000010, "Wrong alignment on UGA_Buff_Blue_PrimaryAttack_C");
static_assert(sizeof(UGA_Buff_Blue_PrimaryAttack_C) == 0x000B90, "Wrong size on UGA_Buff_Blue_PrimaryAttack_C");
static_assert(offsetof(UGA_Buff_Blue_PrimaryAttack_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Buff_Blue_PrimaryAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Blue_PrimaryAttack_C, Fire) == 0x000B78, "Member 'UGA_Buff_Blue_PrimaryAttack_C::Fire' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Blue_PrimaryAttack_C, FireA) == 0x000B80, "Member 'UGA_Buff_Blue_PrimaryAttack_C::FireA' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Blue_PrimaryAttack_C, FireB) == 0x000B88, "Member 'UGA_Buff_Blue_PrimaryAttack_C::FireB' has a wrong offset!");

}

