#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_Jungle_Black

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Buff_Jungle_Black.GA_Buff_Jungle_Black_C.ExecuteUbergraph_GA_Buff_Jungle_Black
// 0x0200 (0x0200 - 0x0000)
struct GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC2;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo2;                    // 0x0010(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle2;                    // 0x0038(0x0018)()
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0060(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable2;                             // 0x0078(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00C0(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x0108(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0130(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable3;                             // 0x0148(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable4;                             // 0x0160(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable2;                             // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue2;  // 0x0198(0x0020)()
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2; // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionAuraHandle                       CallFunc_BeginAura_ReturnValue;                    // 0x01E4(0x0004)(NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageDealt_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageDealt_ReturnValue2;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black) == 0x000008, "Wrong alignment on GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black");
static_assert(sizeof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black) == 0x000200, "Wrong size on GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, EntryPoint) == 0x000000, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, K2Node_CustomEvent_AuxillaryASC2) == 0x000008, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::K2Node_CustomEvent_AuxillaryASC2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, K2Node_CustomEvent_DamageInfo2) == 0x000010, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::K2Node_CustomEvent_DamageInfo2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, K2Node_CustomEvent_SpecHandle2) == 0x000038, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::K2Node_CustomEvent_SpecHandle2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, Temp_struct_Variable) == 0x000060, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, Temp_struct_Variable2) == 0x000078, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, Temp_object_Variable) == 0x0000A0, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, K2Node_CreateDelegate_OutputDelegate2) == 0x0000A8, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_GetOwner_ReturnValue) == 0x0000B8, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000C0, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000E0, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, K2Node_CreateDelegate_OutputDelegate3) == 0x0000F0, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, K2Node_CustomEvent_AuxillaryASC) == 0x000100, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, K2Node_CustomEvent_DamageInfo) == 0x000108, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, K2Node_CustomEvent_SpecHandle) == 0x000130, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, Temp_struct_Variable3) == 0x000148, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, Temp_struct_Variable4) == 0x000160, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, Temp_object_Variable2) == 0x000188, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_GetOwner_ReturnValue2) == 0x000190, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_AbilityTargetDataFromActor_ReturnValue2) == 0x000198, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_AbilityTargetDataFromActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0001B8, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2) == 0x0001C0, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_IsValid_ReturnValue) == 0x0001D0, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001D8, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_ActorHasTag_ReturnValue) == 0x0001E0, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_BeginAura_ReturnValue) == 0x0001E4, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_BeginAura_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_WaitDamageDealt_ReturnValue) == 0x0001E8, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_WaitDamageDealt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_WaitDamageDealt_ReturnValue2) == 0x0001F0, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_WaitDamageDealt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_IsValid_ReturnValue2) == 0x0001F8, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black, CallFunc_IsValid_ReturnValue3) == 0x0001F9, "Member 'GA_Buff_Jungle_Black_C_ExecuteUbergraph_GA_Buff_Jungle_Black::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function GA_Buff_Jungle_Black.GA_Buff_Jungle_Black_C.OnDamage_6FD35FB648A0036498EF72A98070142B
// 0x0048 (0x0048 - 0x0000)
struct GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B) == 0x000008, "Wrong alignment on GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B");
static_assert(sizeof(GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B) == 0x000048, "Wrong size on GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B");
static_assert(offsetof(GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B, AuxillaryASC) == 0x000000, "Member 'GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B, DamageInfo) == 0x000008, "Member 'GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B, SpecHandle) == 0x000030, "Member 'GA_Buff_Jungle_Black_C_OnDamage_6FD35FB648A0036498EF72A98070142B::SpecHandle' has a wrong offset!");

// Function GA_Buff_Jungle_Black.GA_Buff_Jungle_Black_C.OnDamage_B331E934405E5671543B27BE2DCB9BB1
// 0x0048 (0x0048 - 0x0000)
struct GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1 final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1) == 0x000008, "Wrong alignment on GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1");
static_assert(sizeof(GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1) == 0x000048, "Wrong size on GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1");
static_assert(offsetof(GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1, AuxillaryASC) == 0x000000, "Member 'GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1, DamageInfo) == 0x000008, "Member 'GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1, SpecHandle) == 0x000030, "Member 'GA_Buff_Jungle_Black_C_OnDamage_B331E934405E5671543B27BE2DCB9BB1::SpecHandle' has a wrong offset!");

}

