#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_BloodDamageAura

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Aura_BloodDamageAura.GA_Card_Aura_BloodDamageAura_C.ExecuteUbergraph_GA_Card_Aura_BloodDamageAura
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bMatchesComparison, float CurrentValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bMatchesComparison;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_CurrentValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue2;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FOrionAuraHandle                       CallFunc_BeginAura_ReturnValue;                    // 0x00C0(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue2;             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAttributeChangeThreshold* CallFunc_WaitForAttributeChangeThreshold_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura) == 0x000008, "Wrong alignment on GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura");
static_assert(sizeof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura) == 0x0000E0, "Wrong size on GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, EntryPoint) == 0x000000, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_StartAbilityState_ReturnValue) == 0x000008, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, K2Node_CustomEvent_bMatchesComparison) == 0x000021, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::K2Node_CustomEvent_bMatchesComparison' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, K2Node_CustomEvent_CurrentValue) == 0x000024, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::K2Node_CustomEvent_CurrentValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, Temp_float_Variable) == 0x000028, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, Temp_bool_Variable) == 0x00002C, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000040, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_IsValid_ReturnValue2) == 0x000058, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000060, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, Temp_bool_Variable2) == 0x000068, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_IsValid_ReturnValue3) == 0x000069, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x00006A, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_GetAbilityLevel_ReturnValue) == 0x00006C, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000070, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_GetValueAtLevel_ReturnValue) == 0x000074, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_K2_CommitAbilityCooldown_ReturnValue2) == 0x000078, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_K2_CommitAbilityCooldown_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000080, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, K2Node_CreateDelegate_OutputDelegate4) == 0x000088, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000098, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000A9, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, K2Node_CreateDelegate_OutputDelegate5) == 0x0000B0, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_BeginAura_ReturnValue) == 0x0000C0, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_BeginAura_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_GetAbilityLevel_ReturnValue2) == 0x0000C4, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x0000C8, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_GetValueAtLevel_ReturnValue2) == 0x0000CC, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_GetValueAtLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_WaitForAttributeChangeThreshold_ReturnValue) == 0x0000D0, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_WaitForAttributeChangeThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura, CallFunc_IsValid_ReturnValue4) == 0x0000D8, "Member 'GA_Card_Aura_BloodDamageAura_C_ExecuteUbergraph_GA_Card_Aura_BloodDamageAura::CallFunc_IsValid_ReturnValue4' has a wrong offset!");

// Function GA_Card_Aura_BloodDamageAura.GA_Card_Aura_BloodDamageAura_C.OnChange_DDB768C5449FD106827E5680BD36663D
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Aura_BloodDamageAura_C_OnChange_DDB768C5449FD106827E5680BD36663D final
{
public:
	bool                                          bMatchesComparison;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentValue;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_BloodDamageAura_C_OnChange_DDB768C5449FD106827E5680BD36663D) == 0x000004, "Wrong alignment on GA_Card_Aura_BloodDamageAura_C_OnChange_DDB768C5449FD106827E5680BD36663D");
static_assert(sizeof(GA_Card_Aura_BloodDamageAura_C_OnChange_DDB768C5449FD106827E5680BD36663D) == 0x000008, "Wrong size on GA_Card_Aura_BloodDamageAura_C_OnChange_DDB768C5449FD106827E5680BD36663D");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_OnChange_DDB768C5449FD106827E5680BD36663D, bMatchesComparison) == 0x000000, "Member 'GA_Card_Aura_BloodDamageAura_C_OnChange_DDB768C5449FD106827E5680BD36663D::bMatchesComparison' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_OnChange_DDB768C5449FD106827E5680BD36663D, CurrentValue) == 0x000004, "Member 'GA_Card_Aura_BloodDamageAura_C_OnChange_DDB768C5449FD106827E5680BD36663D::CurrentValue' has a wrong offset!");

// Function GA_Card_Aura_BloodDamageAura.GA_Card_Aura_BloodDamageAura_C.K2_CanActivateAbility
// 0x0080 (0x0080 - 0x0000)
struct GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CanActivate;                                       // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility) == 0x000080, "Wrong size on GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility, CanActivate) == 0x000061, "Member 'GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility::CanActivate' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000068, "Member 'GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility, CallFunc_GetHealth_ReturnValue) == 0x000074, "Member 'GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000078, "Member 'GA_Card_Aura_BloodDamageAura_C_K2_CanActivateAbility::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

