#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ExecutionersRush_CDReset

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_ExecutionersRush_CDReset.GA_Card_ExecutionersRush_CDReset_C.ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset
// 0x0128 (0x0128 - 0x0000)
struct GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewValue4;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor4;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext4;          // 0x0030(0x0018)()
	int32                                         K2Node_CustomEvent_NewValue3;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor3;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext3;          // 0x0058(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewValue2;                      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor2;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext2;          // 0x0090(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext;           // 0x00C8(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectContextHandle           Temp_struct_Variable;                              // 0x00F0(0x0018)()
	class AActor*                                 Temp_object_Variable;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_AddPlayerScoreListener* CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset) == 0x000008, "Wrong alignment on GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset");
static_assert(sizeof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset) == 0x000128, "Wrong size on GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, EntryPoint) == 0x000000, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_NewValue4) == 0x000020, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_NewValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_KilledActor4) == 0x000028, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_KilledActor4' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_KillingEffectContext4) == 0x000030, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_KillingEffectContext4' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_NewValue3) == 0x000048, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_NewValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_KilledActor3) == 0x000050, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_KilledActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_KillingEffectContext3) == 0x000058, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_KillingEffectContext3' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CreateDelegate_OutputDelegate2) == 0x000070, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_NewValue2) == 0x000080, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_NewValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_KilledActor2) == 0x000088, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_KilledActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_KillingEffectContext2) == 0x000090, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_KillingEffectContext2' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A8, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_NewValue) == 0x0000B8, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_KilledActor) == 0x0000C0, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CustomEvent_KillingEffectContext) == 0x0000C8, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CustomEvent_KillingEffectContext' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, K2Node_CreateDelegate_OutputDelegate4) == 0x0000E0, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, Temp_struct_Variable) == 0x0000F0, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, Temp_object_Variable) == 0x000108, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, Temp_int_Variable) == 0x000110, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue) == 0x000118, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'GA_Card_ExecutionersRush_CDReset_C_ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Card_ExecutionersRush_CDReset.GA_Card_ExecutionersRush_CDReset_C.OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F) == 0x000008, "Wrong alignment on GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F");
static_assert(sizeof(GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F) == 0x000028, "Wrong size on GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F, NewValue) == 0x000000, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F, KilledActor) == 0x000008, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F, KillingEffectContext) == 0x000010, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F::KillingEffectContext' has a wrong offset!");

// Function GA_Card_ExecutionersRush_CDReset.GA_Card_ExecutionersRush_CDReset_C.OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F) == 0x000008, "Wrong alignment on GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F");
static_assert(sizeof(GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F) == 0x000028, "Wrong size on GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F, NewValue) == 0x000000, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F, KilledActor) == 0x000008, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F, KillingEffectContext) == 0x000010, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F::KillingEffectContext' has a wrong offset!");

// Function GA_Card_ExecutionersRush_CDReset.GA_Card_ExecutionersRush_CDReset_C.OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F) == 0x000008, "Wrong alignment on GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F");
static_assert(sizeof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F) == 0x000028, "Wrong size on GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F, NewValue) == 0x000000, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F, KilledActor) == 0x000008, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F, KillingEffectContext) == 0x000010, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F::KillingEffectContext' has a wrong offset!");

// Function GA_Card_ExecutionersRush_CDReset.GA_Card_ExecutionersRush_CDReset_C.OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F) == 0x000008, "Wrong alignment on GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F");
static_assert(sizeof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F) == 0x000028, "Wrong size on GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F, NewValue) == 0x000000, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F, KilledActor) == 0x000008, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F, KillingEffectContext) == 0x000010, "Member 'GA_Card_ExecutionersRush_CDReset_C_OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F::KillingEffectContext' has a wrong offset!");

}

