#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_CarriedBuff_BurnStructureOnHit

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_CarriedBuff_BurnStructureOnHit.GA_CarriedBuff_BurnStructureOnHit_C.ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit
// 0x0108 (0x0108 - 0x0000)
struct GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0010(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0048(0x0018)()
	class AActor*                                 Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionAbilityTargetDataFilter          K2Node_MakeStruct_OrionAbilityTargetDataFilter;    // 0x0068(0x0030)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0098(0x0020)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	TScriptInterface<class IOrionTeamActorInterface> K2Node_DynamicCast_AsOrion_Team_Actor_Interface;   // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    Temp_byte_Variable;                                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeOrionFilterHandle_ReturnValue;        // 0x00E8(0x0010)()
	class UAbilityTask_WaitGameplayEffectApplied_Target* CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit) == 0x000008, "Wrong alignment on GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit");
static_assert(sizeof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit) == 0x000108, "Wrong size on GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, EntryPoint) == 0x000000, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, K2Node_CustomEvent_Target) == 0x000008, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, K2Node_CustomEvent_SpecHandle) == 0x000010, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, K2Node_CustomEvent_ActiveHandle) == 0x000028, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, Temp_struct_Variable) == 0x000040, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, Temp_struct_Variable2) == 0x000048, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, Temp_object_Variable) == 0x000060, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, K2Node_MakeStruct_OrionAbilityTargetDataFilter) == 0x000068, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::K2Node_MakeStruct_OrionAbilityTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000098, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000B8, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000C0, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, K2Node_DynamicCast_AsOrion_Team_Actor_Interface) == 0x0000D0, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::K2Node_DynamicCast_AsOrion_Team_Actor_Interface' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, Temp_byte_Variable) == 0x0000E1, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, CallFunc_GetTeamNum_ReturnValue) == 0x0000E2, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, CallFunc_MakeOrionFilterHandle_ReturnValue) == 0x0000E8, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::CallFunc_MakeOrionFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue) == 0x0000F8, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_CarriedBuff_BurnStructureOnHit.GA_CarriedBuff_BurnStructureOnHit_C.OnApplied_5096090645BC58FAB37B5CACC775BEF7
// 0x0028 (0x0028 - 0x0000)
struct GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7 final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7) == 0x000008, "Wrong alignment on GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7");
static_assert(sizeof(GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7) == 0x000028, "Wrong size on GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7, Target) == 0x000000, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7::Target' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7, SpecHandle) == 0x000008, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7, ActiveHandle) == 0x000020, "Member 'GA_CarriedBuff_BurnStructureOnHit_C_OnApplied_5096090645BC58FAB37B5CACC775BEF7::ActiveHandle' has a wrong offset!");

}

