#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_SacrificialAura

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Aura_SacrificialAura.GA_Card_Aura_SacrificialAura_C.ExecuteUbergraph_GA_Card_Aura_SacrificialAura
// 0x05A0 (0x05A0 - 0x0000)
struct GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate5;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate6;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate8;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload2;                       // 0x00E8(0x00A8)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0190(0x00A8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue2;           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate9;             // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0258(0x00A8)()
	struct FGameplayEventData                     Temp_struct_Variable2;                             // 0x0300(0x00A8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue3;           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable3;                             // 0x03C0(0x00A8)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0480(0x0030)(IsPlainOldData, NoDestructor)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA[0x6];                                      // 0x04CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload3;                       // 0x04D0(0x00A8)()
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x057C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0584(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_585[0x3];                                      // 0x0585(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate10;            // 0x0588(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x0598(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura) == 0x000010, "Wrong alignment on GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura");
static_assert(sizeof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura) == 0x0005A0, "Wrong size on GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, EntryPoint) == 0x000000, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000008, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_StartAbilityState_ReturnValue) == 0x000038, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_IsValid_ReturnValue2) == 0x000040, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000058, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_IsValid_ReturnValue3) == 0x000070, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CustomEvent_SpawnedActor3) == 0x000078, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CustomEvent_SpawnedActor2) == 0x000080, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate5) == 0x000088, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CustomEvent_SpawnedActor) == 0x000098, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate6) == 0x0000A0, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, Temp_object_Variable) == 0x0000B0, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B8, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x0000C8, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate8) == 0x0000D0, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_IsValid_ReturnValue4) == 0x0000E0, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CustomEvent_Payload2) == 0x0000E8, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CustomEvent_Payload2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, Temp_struct_Variable) == 0x000190, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_WaitGameplayEvent_ReturnValue2) == 0x000238, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_WaitGameplayEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_IsValid_ReturnValue5) == 0x000240, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate9) == 0x000248, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CustomEvent_Payload) == 0x000258, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, Temp_struct_Variable2) == 0x000300, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_WaitGameplayEvent_ReturnValue3) == 0x0003A8, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_WaitGameplayEvent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_IsValid_ReturnValue6) == 0x0003B0, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0003B8, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, Temp_struct_Variable3) == 0x0003C0, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000468, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000470, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_DynamicCast_bSuccess) == 0x000478, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_IsValid_ReturnValue7) == 0x000479, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_GetTransform_ReturnValue) == 0x000480, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x0004B0, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_GetActorTeam_ReturnValue) == 0x0004B8, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0004C0, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_BeginSpawningActor_ReturnValue) == 0x0004C8, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_IsValid_ReturnValue8) == 0x0004C9, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CustomEvent_Payload3) == 0x0004D0, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CustomEvent_Payload3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_GetAbilityLevel_ReturnValue) == 0x000578, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00057C, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_IsValid_ReturnValue9) == 0x000584, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, K2Node_CreateDelegate_OutputDelegate10) == 0x000588, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x000598, "Member 'GA_Card_Aura_SacrificialAura_C_ExecuteUbergraph_GA_Card_Aura_SacrificialAura::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");

// Function GA_Card_Aura_SacrificialAura.GA_Card_Aura_SacrificialAura_C.EventReceived_44A76FA74D91FD56D1FDA09FE4E5A4C6
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Card_Aura_SacrificialAura_C_EventReceived_44A76FA74D91FD56D1FDA09FE4E5A4C6 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Aura_SacrificialAura_C_EventReceived_44A76FA74D91FD56D1FDA09FE4E5A4C6) == 0x000008, "Wrong alignment on GA_Card_Aura_SacrificialAura_C_EventReceived_44A76FA74D91FD56D1FDA09FE4E5A4C6");
static_assert(sizeof(GA_Card_Aura_SacrificialAura_C_EventReceived_44A76FA74D91FD56D1FDA09FE4E5A4C6) == 0x0000A8, "Wrong size on GA_Card_Aura_SacrificialAura_C_EventReceived_44A76FA74D91FD56D1FDA09FE4E5A4C6");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_EventReceived_44A76FA74D91FD56D1FDA09FE4E5A4C6, Payload) == 0x000000, "Member 'GA_Card_Aura_SacrificialAura_C_EventReceived_44A76FA74D91FD56D1FDA09FE4E5A4C6::Payload' has a wrong offset!");

// Function GA_Card_Aura_SacrificialAura.GA_Card_Aura_SacrificialAura_C.EventReceived_45F42D02487F650C94A96A8CEAB06348
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Card_Aura_SacrificialAura_C_EventReceived_45F42D02487F650C94A96A8CEAB06348 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Aura_SacrificialAura_C_EventReceived_45F42D02487F650C94A96A8CEAB06348) == 0x000008, "Wrong alignment on GA_Card_Aura_SacrificialAura_C_EventReceived_45F42D02487F650C94A96A8CEAB06348");
static_assert(sizeof(GA_Card_Aura_SacrificialAura_C_EventReceived_45F42D02487F650C94A96A8CEAB06348) == 0x0000A8, "Wrong size on GA_Card_Aura_SacrificialAura_C_EventReceived_45F42D02487F650C94A96A8CEAB06348");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_EventReceived_45F42D02487F650C94A96A8CEAB06348, Payload) == 0x000000, "Member 'GA_Card_Aura_SacrificialAura_C_EventReceived_45F42D02487F650C94A96A8CEAB06348::Payload' has a wrong offset!");

// Function GA_Card_Aura_SacrificialAura.GA_Card_Aura_SacrificialAura_C.EventReceived_BEAABF3A457EE80E9CEBD4853BE83F5A
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Card_Aura_SacrificialAura_C_EventReceived_BEAABF3A457EE80E9CEBD4853BE83F5A final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Aura_SacrificialAura_C_EventReceived_BEAABF3A457EE80E9CEBD4853BE83F5A) == 0x000008, "Wrong alignment on GA_Card_Aura_SacrificialAura_C_EventReceived_BEAABF3A457EE80E9CEBD4853BE83F5A");
static_assert(sizeof(GA_Card_Aura_SacrificialAura_C_EventReceived_BEAABF3A457EE80E9CEBD4853BE83F5A) == 0x0000A8, "Wrong size on GA_Card_Aura_SacrificialAura_C_EventReceived_BEAABF3A457EE80E9CEBD4853BE83F5A");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_EventReceived_BEAABF3A457EE80E9CEBD4853BE83F5A, Payload) == 0x000000, "Member 'GA_Card_Aura_SacrificialAura_C_EventReceived_BEAABF3A457EE80E9CEBD4853BE83F5A::Payload' has a wrong offset!");

// Function GA_Card_Aura_SacrificialAura.GA_Card_Aura_SacrificialAura_C.FailedToSpawn_FE14877B4FE8A789BC3FD298794A2E1D
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Aura_SacrificialAura_C_FailedToSpawn_FE14877B4FE8A789BC3FD298794A2E1D final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_SacrificialAura_C_FailedToSpawn_FE14877B4FE8A789BC3FD298794A2E1D) == 0x000008, "Wrong alignment on GA_Card_Aura_SacrificialAura_C_FailedToSpawn_FE14877B4FE8A789BC3FD298794A2E1D");
static_assert(sizeof(GA_Card_Aura_SacrificialAura_C_FailedToSpawn_FE14877B4FE8A789BC3FD298794A2E1D) == 0x000008, "Wrong size on GA_Card_Aura_SacrificialAura_C_FailedToSpawn_FE14877B4FE8A789BC3FD298794A2E1D");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_FailedToSpawn_FE14877B4FE8A789BC3FD298794A2E1D, SpawnedActor) == 0x000000, "Member 'GA_Card_Aura_SacrificialAura_C_FailedToSpawn_FE14877B4FE8A789BC3FD298794A2E1D::SpawnedActor' has a wrong offset!");

// Function GA_Card_Aura_SacrificialAura.GA_Card_Aura_SacrificialAura_C.NotAuthority_FE14877B4FE8A789BC3FD298794A2E1D
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Aura_SacrificialAura_C_NotAuthority_FE14877B4FE8A789BC3FD298794A2E1D final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_SacrificialAura_C_NotAuthority_FE14877B4FE8A789BC3FD298794A2E1D) == 0x000008, "Wrong alignment on GA_Card_Aura_SacrificialAura_C_NotAuthority_FE14877B4FE8A789BC3FD298794A2E1D");
static_assert(sizeof(GA_Card_Aura_SacrificialAura_C_NotAuthority_FE14877B4FE8A789BC3FD298794A2E1D) == 0x000008, "Wrong size on GA_Card_Aura_SacrificialAura_C_NotAuthority_FE14877B4FE8A789BC3FD298794A2E1D");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_NotAuthority_FE14877B4FE8A789BC3FD298794A2E1D, SpawnedActor) == 0x000000, "Member 'GA_Card_Aura_SacrificialAura_C_NotAuthority_FE14877B4FE8A789BC3FD298794A2E1D::SpawnedActor' has a wrong offset!");

// Function GA_Card_Aura_SacrificialAura.GA_Card_Aura_SacrificialAura_C.Success_FE14877B4FE8A789BC3FD298794A2E1D
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Aura_SacrificialAura_C_Success_FE14877B4FE8A789BC3FD298794A2E1D final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_SacrificialAura_C_Success_FE14877B4FE8A789BC3FD298794A2E1D) == 0x000008, "Wrong alignment on GA_Card_Aura_SacrificialAura_C_Success_FE14877B4FE8A789BC3FD298794A2E1D");
static_assert(sizeof(GA_Card_Aura_SacrificialAura_C_Success_FE14877B4FE8A789BC3FD298794A2E1D) == 0x000008, "Wrong size on GA_Card_Aura_SacrificialAura_C_Success_FE14877B4FE8A789BC3FD298794A2E1D");
static_assert(offsetof(GA_Card_Aura_SacrificialAura_C_Success_FE14877B4FE8A789BC3FD298794A2E1D, SpawnedActor) == 0x000000, "Member 'GA_Card_Aura_SacrificialAura_C_Success_FE14877B4FE8A789BC3FD298794A2E1D::SpawnedActor' has a wrong offset!");

}

