#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ToxicHorde

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_ToxicHorde.GA_Card_ToxicHorde_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_ToxicHorde_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 DamageImmuneForSwap;                               // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HealthDegen;                                       // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BonusDamageTaken;                                  // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_ToxicHorde(int32 EntryPoint);
	void Cancelled_8DA46C7247BB2064C7CC06AB4074FD36(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_8DA46C7247BB2064C7CC06AB4074FD36(const struct FGameplayAbilityTargetDataHandle& Targets);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_ToxicHorde_C">();
	}
	static class UGA_Card_ToxicHorde_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_ToxicHorde_C>();
	}
};
static_assert(alignof(UGA_Card_ToxicHorde_C) == 0x000010, "Wrong alignment on UGA_Card_ToxicHorde_C");
static_assert(sizeof(UGA_Card_ToxicHorde_C) == 0x000B90, "Wrong size on UGA_Card_ToxicHorde_C");
static_assert(offsetof(UGA_Card_ToxicHorde_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_ToxicHorde_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_ToxicHorde_C, DamageImmuneForSwap) == 0x000B78, "Member 'UGA_Card_ToxicHorde_C::DamageImmuneForSwap' has a wrong offset!");
static_assert(offsetof(UGA_Card_ToxicHorde_C, HealthDegen) == 0x000B80, "Member 'UGA_Card_ToxicHorde_C::HealthDegen' has a wrong offset!");
static_assert(offsetof(UGA_Card_ToxicHorde_C, BonusDamageTaken) == 0x000B88, "Member 'UGA_Card_ToxicHorde_C::BonusDamageTaken' has a wrong offset!");

}

