#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_MinionsBuffMe

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_MinionsBuffMe.GA_Card_MinionsBuffMe_C.ExecuteUbergraph_GA_Card_MinionsBuffMe
// 0x0100 (0x0100 - 0x0000)
struct GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00D4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe) == 0x000010, "Wrong alignment on GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe");
static_assert(sizeof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe) == 0x000100, "Wrong size on GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, EntryPoint) == 0x000000, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, K2Node_CustomEvent_SpawnedActor3) == 0x000018, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, K2Node_CustomEvent_SpawnedActor2) == 0x000020, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, K2Node_CustomEvent_SpawnedActor) == 0x000038, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, Temp_object_Variable) == 0x000050, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, K2Node_CreateDelegate_OutputDelegate5) == 0x000068, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_StartAbilityState_ReturnValue) == 0x000078, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000088, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000090, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_GetTransform_ReturnValue) == 0x0000A0, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_GetAbilityLevel_ReturnValue) == 0x0000D0, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000D4, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x0000E0, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0000E8, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_BeginSpawningActor_ReturnValue) == 0x0000F0, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_IsValid_ReturnValue2) == 0x0000F1, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe, CallFunc_IsValid_ReturnValue3) == 0x0000F2, "Member 'GA_Card_MinionsBuffMe_C_ExecuteUbergraph_GA_Card_MinionsBuffMe::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function GA_Card_MinionsBuffMe.GA_Card_MinionsBuffMe_C.FailedToSpawn_775E53D74BEF94E82FEDCEB8EEACB030
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_MinionsBuffMe_C_FailedToSpawn_775E53D74BEF94E82FEDCEB8EEACB030 final
{
public:
	class AActor*                                 SpawnedActor_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_MinionsBuffMe_C_FailedToSpawn_775E53D74BEF94E82FEDCEB8EEACB030) == 0x000008, "Wrong alignment on GA_Card_MinionsBuffMe_C_FailedToSpawn_775E53D74BEF94E82FEDCEB8EEACB030");
static_assert(sizeof(GA_Card_MinionsBuffMe_C_FailedToSpawn_775E53D74BEF94E82FEDCEB8EEACB030) == 0x000008, "Wrong size on GA_Card_MinionsBuffMe_C_FailedToSpawn_775E53D74BEF94E82FEDCEB8EEACB030");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_FailedToSpawn_775E53D74BEF94E82FEDCEB8EEACB030, SpawnedActor_0) == 0x000000, "Member 'GA_Card_MinionsBuffMe_C_FailedToSpawn_775E53D74BEF94E82FEDCEB8EEACB030::SpawnedActor_0' has a wrong offset!");

// Function GA_Card_MinionsBuffMe.GA_Card_MinionsBuffMe_C.NotAuthority_775E53D74BEF94E82FEDCEB8EEACB030
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_MinionsBuffMe_C_NotAuthority_775E53D74BEF94E82FEDCEB8EEACB030 final
{
public:
	class AActor*                                 SpawnedActor_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_MinionsBuffMe_C_NotAuthority_775E53D74BEF94E82FEDCEB8EEACB030) == 0x000008, "Wrong alignment on GA_Card_MinionsBuffMe_C_NotAuthority_775E53D74BEF94E82FEDCEB8EEACB030");
static_assert(sizeof(GA_Card_MinionsBuffMe_C_NotAuthority_775E53D74BEF94E82FEDCEB8EEACB030) == 0x000008, "Wrong size on GA_Card_MinionsBuffMe_C_NotAuthority_775E53D74BEF94E82FEDCEB8EEACB030");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_NotAuthority_775E53D74BEF94E82FEDCEB8EEACB030, SpawnedActor_0) == 0x000000, "Member 'GA_Card_MinionsBuffMe_C_NotAuthority_775E53D74BEF94E82FEDCEB8EEACB030::SpawnedActor_0' has a wrong offset!");

// Function GA_Card_MinionsBuffMe.GA_Card_MinionsBuffMe_C.Success_775E53D74BEF94E82FEDCEB8EEACB030
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_MinionsBuffMe_C_Success_775E53D74BEF94E82FEDCEB8EEACB030 final
{
public:
	class AActor*                                 SpawnedActor_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_MinionsBuffMe_C_Success_775E53D74BEF94E82FEDCEB8EEACB030) == 0x000008, "Wrong alignment on GA_Card_MinionsBuffMe_C_Success_775E53D74BEF94E82FEDCEB8EEACB030");
static_assert(sizeof(GA_Card_MinionsBuffMe_C_Success_775E53D74BEF94E82FEDCEB8EEACB030) == 0x000008, "Wrong size on GA_Card_MinionsBuffMe_C_Success_775E53D74BEF94E82FEDCEB8EEACB030");
static_assert(offsetof(GA_Card_MinionsBuffMe_C_Success_775E53D74BEF94E82FEDCEB8EEACB030, SpawnedActor_0) == 0x000000, "Member 'GA_Card_MinionsBuffMe_C_Success_775E53D74BEF94E82FEDCEB8EEACB030::SpawnedActor_0' has a wrong offset!");

}

