#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_Parent

#include "Basic.hpp"

#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Aura_Parent.GA_Card_Aura_Parent_C.ExecuteUbergraph_GA_Card_Aura_Parent
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionAuraHandle                       CallFunc_BeginAura_ReturnValue;                    // 0x009C(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent) == 0x000008, "Wrong alignment on GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent");
static_assert(sizeof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent) == 0x0000A0, "Wrong size on GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, EntryPoint) == 0x000000, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000008, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000028, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, Temp_bool_Variable) == 0x000030, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_IsValid_ReturnValue2) == 0x000031, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_StartAbilityState_ReturnValue) == 0x000058, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_IsValid_ReturnValue3) == 0x000060, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_GetAbilityLevel_ReturnValue) == 0x000064, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000068, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x00006C, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, K2Node_CreateDelegate_OutputDelegate4) == 0x000070, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000080, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000088, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000099, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent, CallFunc_BeginAura_ReturnValue) == 0x00009C, "Member 'GA_Card_Aura_Parent_C_ExecuteUbergraph_GA_Card_Aura_Parent::CallFunc_BeginAura_ReturnValue' has a wrong offset!");

}

