#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Hamstring

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Hamstring.GA_Card_Hamstring_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_Hamstring_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_SlowEnemy;                                      // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Projectile;                                        // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GameplayCue;                                       // 0x0B88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Hamstring(int32 EntryPoint);
	void Cancelled_743AED6A4D48C6F003E43B894FFCF768(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_743AED6A4D48C6F003E43B894FFCF768(const struct FGameplayAbilityTargetDataHandle& Targets);
	void FailedToSpawn_2724337A474DB5B419AB29821958F18D(class AOrionProjectile* SpawnedProjectile);
	void K2_ActivateAbility();
	void NotAuthority_2724337A474DB5B419AB29821958F18D(class AOrionProjectile* SpawnedProjectile);
	void PreSpawned_2724337A474DB5B419AB29821958F18D(class AOrionProjectile* SpawnedProjectile);
	void Success_2724337A474DB5B419AB29821958F18D(class AOrionProjectile* SpawnedProjectile);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Hamstring_C">();
	}
	static class UGA_Card_Hamstring_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Hamstring_C>();
	}
};
static_assert(alignof(UGA_Card_Hamstring_C) == 0x000010, "Wrong alignment on UGA_Card_Hamstring_C");
static_assert(sizeof(UGA_Card_Hamstring_C) == 0x000B90, "Wrong size on UGA_Card_Hamstring_C");
static_assert(offsetof(UGA_Card_Hamstring_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Hamstring_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Hamstring_C, GE_SlowEnemy) == 0x000B78, "Member 'UGA_Card_Hamstring_C::GE_SlowEnemy' has a wrong offset!");
static_assert(offsetof(UGA_Card_Hamstring_C, Projectile) == 0x000B80, "Member 'UGA_Card_Hamstring_C::Projectile' has a wrong offset!");
static_assert(offsetof(UGA_Card_Hamstring_C, GameplayCue) == 0x000B88, "Member 'UGA_Card_Hamstring_C::GameplayCue' has a wrong offset!");

}

