#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_SacrificialAura

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Aura_SacrificialAura.GA_Card_Aura_SacrificialAura_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_Aura_SacrificialAura_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	bool                                          DamageCD;                                          // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B79[0x7];                                      // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            PestilenceAuraGC;                                  // 0x0B88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Aura_SacrificialAura(int32 EntryPoint);
	void Added_C2ED07C04CFDFDC76E797690E3EC25A9();
	void EventReceived_44A76FA74D91FD56D1FDA09FE4E5A4C6(const struct FGameplayEventData& Payload);
	void EventReceived_45F42D02487F650C94A96A8CEAB06348(const struct FGameplayEventData& Payload);
	void EventReceived_BEAABF3A457EE80E9CEBD4853BE83F5A(const struct FGameplayEventData& Payload);
	void FailedToSpawn_FE14877B4FE8A789BC3FD298794A2E1D(class AActor* SpawnedActor);
	void K2_ActivateAbility();
	void NotAuthority_FE14877B4FE8A789BC3FD298794A2E1D(class AActor* SpawnedActor);
	void OnStateEnded_4F8189954DEBE839F452F6AA40DE7D22();
	void OnStateInterrupted_4F8189954DEBE839F452F6AA40DE7D22();
	void Removed_872B511849813F8E4500679A91DE8E44();
	void Success_FE14877B4FE8A789BC3FD298794A2E1D(class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Aura_SacrificialAura_C">();
	}
	static class UGA_Card_Aura_SacrificialAura_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Aura_SacrificialAura_C>();
	}
};
static_assert(alignof(UGA_Card_Aura_SacrificialAura_C) == 0x000010, "Wrong alignment on UGA_Card_Aura_SacrificialAura_C");
static_assert(sizeof(UGA_Card_Aura_SacrificialAura_C) == 0x000B90, "Wrong size on UGA_Card_Aura_SacrificialAura_C");
static_assert(offsetof(UGA_Card_Aura_SacrificialAura_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Aura_SacrificialAura_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_SacrificialAura_C, DamageCD) == 0x000B78, "Member 'UGA_Card_Aura_SacrificialAura_C::DamageCD' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_SacrificialAura_C, Actor) == 0x000B80, "Member 'UGA_Card_Aura_SacrificialAura_C::Actor' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_SacrificialAura_C, PestilenceAuraGC) == 0x000B88, "Member 'UGA_Card_Aura_SacrificialAura_C::PestilenceAuraGC' has a wrong offset!");

}

