#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_GroupPower

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_GroupPower.GA_Card_GroupPower_C.ExecuteUbergraph_GA_Card_GroupPower
// 0x03F0 (0x03F0 - 0x0000)
struct GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload2;                       // 0x0088(0x00A8)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0130(0x00A8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate6;             // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x01F8(0x00A8)()
	struct FGameplayEventData                     Temp_struct_Variable2;                             // 0x02A0(0x00A8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue2;           // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0380(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate8;             // 0x03C8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E3[0x1];                                      // 0x03E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x03E4(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower) == 0x000010, "Wrong alignment on GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower");
static_assert(sizeof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower) == 0x0003F0, "Wrong size on GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, EntryPoint) == 0x000000, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CustomEvent_SpawnedActor3) == 0x000008, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CustomEvent_SpawnedActor2) == 0x000010, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CustomEvent_SpawnedActor) == 0x000028, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, Temp_object_Variable) == 0x000040, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_StartAbilityState_ReturnValue) == 0x000068, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CreateDelegate_OutputDelegate5) == 0x000078, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CustomEvent_Payload2) == 0x000088, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CustomEvent_Payload2' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, Temp_struct_Variable) == 0x000130, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0001D8, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_IsValid_ReturnValue2) == 0x0001E0, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CreateDelegate_OutputDelegate6) == 0x0001E8, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CustomEvent_Payload) == 0x0001F8, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, Temp_struct_Variable2) == 0x0002A0, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_WaitGameplayEvent_ReturnValue2) == 0x000348, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_WaitGameplayEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_IsValid_ReturnValue3) == 0x000350, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CreateDelegate_OutputDelegate7) == 0x000358, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_WaitNetSync_ReturnValue) == 0x000368, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000370, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_GetTransform_ReturnValue) == 0x000380, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_IsValid_ReturnValue4) == 0x0003B0, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0003B8, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x0003C0, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, K2Node_CreateDelegate_OutputDelegate8) == 0x0003C8, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0003D8, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_BeginSpawningActor_ReturnValue) == 0x0003E0, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_IsValid_ReturnValue5) == 0x0003E1, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_IsValid_ReturnValue6) == 0x0003E2, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0003E4, "Member 'GA_Card_GroupPower_C_ExecuteUbergraph_GA_Card_GroupPower::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Card_GroupPower.GA_Card_GroupPower_C.EventReceived_6236BF09444FCE66BB16FFB67B822FCB
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Card_GroupPower_C_EventReceived_6236BF09444FCE66BB16FFB67B822FCB final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_GroupPower_C_EventReceived_6236BF09444FCE66BB16FFB67B822FCB) == 0x000008, "Wrong alignment on GA_Card_GroupPower_C_EventReceived_6236BF09444FCE66BB16FFB67B822FCB");
static_assert(sizeof(GA_Card_GroupPower_C_EventReceived_6236BF09444FCE66BB16FFB67B822FCB) == 0x0000A8, "Wrong size on GA_Card_GroupPower_C_EventReceived_6236BF09444FCE66BB16FFB67B822FCB");
static_assert(offsetof(GA_Card_GroupPower_C_EventReceived_6236BF09444FCE66BB16FFB67B822FCB, Payload) == 0x000000, "Member 'GA_Card_GroupPower_C_EventReceived_6236BF09444FCE66BB16FFB67B822FCB::Payload' has a wrong offset!");

// Function GA_Card_GroupPower.GA_Card_GroupPower_C.EventReceived_A6345B36412AF179E78C8B977EB20393
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Card_GroupPower_C_EventReceived_A6345B36412AF179E78C8B977EB20393 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_GroupPower_C_EventReceived_A6345B36412AF179E78C8B977EB20393) == 0x000008, "Wrong alignment on GA_Card_GroupPower_C_EventReceived_A6345B36412AF179E78C8B977EB20393");
static_assert(sizeof(GA_Card_GroupPower_C_EventReceived_A6345B36412AF179E78C8B977EB20393) == 0x0000A8, "Wrong size on GA_Card_GroupPower_C_EventReceived_A6345B36412AF179E78C8B977EB20393");
static_assert(offsetof(GA_Card_GroupPower_C_EventReceived_A6345B36412AF179E78C8B977EB20393, Payload) == 0x000000, "Member 'GA_Card_GroupPower_C_EventReceived_A6345B36412AF179E78C8B977EB20393::Payload' has a wrong offset!");

// Function GA_Card_GroupPower.GA_Card_GroupPower_C.FailedToSpawn_2D913F4E4C9B325D4A073EAEBDC811C2
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_GroupPower_C_FailedToSpawn_2D913F4E4C9B325D4A073EAEBDC811C2 final
{
public:
	class AActor*                                 SpawnedActor_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_GroupPower_C_FailedToSpawn_2D913F4E4C9B325D4A073EAEBDC811C2) == 0x000008, "Wrong alignment on GA_Card_GroupPower_C_FailedToSpawn_2D913F4E4C9B325D4A073EAEBDC811C2");
static_assert(sizeof(GA_Card_GroupPower_C_FailedToSpawn_2D913F4E4C9B325D4A073EAEBDC811C2) == 0x000008, "Wrong size on GA_Card_GroupPower_C_FailedToSpawn_2D913F4E4C9B325D4A073EAEBDC811C2");
static_assert(offsetof(GA_Card_GroupPower_C_FailedToSpawn_2D913F4E4C9B325D4A073EAEBDC811C2, SpawnedActor_0) == 0x000000, "Member 'GA_Card_GroupPower_C_FailedToSpawn_2D913F4E4C9B325D4A073EAEBDC811C2::SpawnedActor_0' has a wrong offset!");

// Function GA_Card_GroupPower.GA_Card_GroupPower_C.NotAuthority_2D913F4E4C9B325D4A073EAEBDC811C2
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_GroupPower_C_NotAuthority_2D913F4E4C9B325D4A073EAEBDC811C2 final
{
public:
	class AActor*                                 SpawnedActor_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_GroupPower_C_NotAuthority_2D913F4E4C9B325D4A073EAEBDC811C2) == 0x000008, "Wrong alignment on GA_Card_GroupPower_C_NotAuthority_2D913F4E4C9B325D4A073EAEBDC811C2");
static_assert(sizeof(GA_Card_GroupPower_C_NotAuthority_2D913F4E4C9B325D4A073EAEBDC811C2) == 0x000008, "Wrong size on GA_Card_GroupPower_C_NotAuthority_2D913F4E4C9B325D4A073EAEBDC811C2");
static_assert(offsetof(GA_Card_GroupPower_C_NotAuthority_2D913F4E4C9B325D4A073EAEBDC811C2, SpawnedActor_0) == 0x000000, "Member 'GA_Card_GroupPower_C_NotAuthority_2D913F4E4C9B325D4A073EAEBDC811C2::SpawnedActor_0' has a wrong offset!");

// Function GA_Card_GroupPower.GA_Card_GroupPower_C.Success_2D913F4E4C9B325D4A073EAEBDC811C2
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_GroupPower_C_Success_2D913F4E4C9B325D4A073EAEBDC811C2 final
{
public:
	class AActor*                                 SpawnedActor_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_GroupPower_C_Success_2D913F4E4C9B325D4A073EAEBDC811C2) == 0x000008, "Wrong alignment on GA_Card_GroupPower_C_Success_2D913F4E4C9B325D4A073EAEBDC811C2");
static_assert(sizeof(GA_Card_GroupPower_C_Success_2D913F4E4C9B325D4A073EAEBDC811C2) == 0x000008, "Wrong size on GA_Card_GroupPower_C_Success_2D913F4E4C9B325D4A073EAEBDC811C2");
static_assert(offsetof(GA_Card_GroupPower_C_Success_2D913F4E4C9B325D4A073EAEBDC811C2, SpawnedActor_0) == 0x000000, "Member 'GA_Card_GroupPower_C_Success_2D913F4E4C9B325D4A073EAEBDC811C2::SpawnedActor_0' has a wrong offset!");

}

