#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Core_Boss_SpecialAttack

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.ExecuteUbergraph_GA_Core_Boss_SpecialAttack
// 0x0590 (0x0590 - 0x0000)
struct GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor9;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor8;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor7;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor6;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate9;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor5;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate10;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor4;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate11;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable2;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors2;  // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate12;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate13;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate14;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable3;                             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate16;            // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate17;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate18;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue2;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate19;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionCharAI_JungleBoss*                K2Node_DynamicCast_AsOrion_Char_AI_Jungle_Boss;    // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             CallFunc_GetBestTarget_ReturnValue;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0290(0x0018)()
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x02B0(0x0030)(IsPlainOldData, NoDestructor)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_TagSplitGameplayEffectSpecBetweenActors_AppliedEffectHandles; // 0x02E0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2; // 0x02F0(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x030C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0318(0x0018)()
	float                                         CallFunc_BreakVector_X;                            // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeOrionTargetData_ReturnValue;          // 0x0370(0x0020)()
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0398(0x00B8)(ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0450(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0460(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue3; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue2;    // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_OrionCharAI_Core_Boss_C*            K2Node_DynamicCast_AsBP_Orion_Char_AI_Core_Boss;   // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor2;         // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue2;          // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x04C0(0x0030)(IsPlainOldData, NoDestructor)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue3;    // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor3;         // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue3;          // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0502(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_503[0x1];                                      // 0x0503(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue4;                // 0x0510(0x0030)(IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeOrionTargetData_ReturnValue2;         // 0x0540(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0560(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack) == 0x000010, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack) == 0x000590, "Wrong size on GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, EntryPoint) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_SpawnedActor9) == 0x000008, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_SpawnedActor9' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_SpawnedActor8) == 0x000010, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_SpawnedActor8' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_SpawnedActor7) == 0x000028, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_SpawnedActor7' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, Temp_object_Variable) == 0x000040, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_NotifyName6) == 0x000058, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_NotifyName5) == 0x000060, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate4) == 0x000068, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_NotifyName4) == 0x000078, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate5) == 0x000080, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_NotifyName3) == 0x000090, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate6) == 0x000098, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_NotifyName2) == 0x0000A8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_NotifyName) == 0x0000C0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate8) == 0x0000C8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, Temp_name_Variable) == 0x0000D8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_SpawnedActor6) == 0x0000E0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_SpawnedActor6' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate9) == 0x0000E8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_SpawnedActor5) == 0x0000F8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_SpawnedActor5' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate10) == 0x000100, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_SpawnedActor4) == 0x000110, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_SpawnedActor4' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate11) == 0x000118, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, Temp_object_Variable2) == 0x000128, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000130, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetOverlappingActors_OverlappingActors2) == 0x000140, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetOverlappingActors_OverlappingActors2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_Array_Length_ReturnValue2) == 0x000154, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000158, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetTransform_ReturnValue) == 0x000160, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x000190, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate12) == 0x000198, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0001A8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_BeginSpawningActor_ReturnValue) == 0x0001B0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_IsValid_ReturnValue) == 0x0001B1, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_SpawnedActor3) == 0x0001B8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_SpawnedActor2) == 0x0001C0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate13) == 0x0001C8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CustomEvent_SpawnedActor) == 0x0001D8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate14) == 0x0001E0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, Temp_object_Variable3) == 0x0001F0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate15) == 0x0001F8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate16) == 0x000208, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_StartAbilityState_ReturnValue) == 0x000218, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate17) == 0x000220, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_IsValid_ReturnValue2) == 0x000230, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate18) == 0x000238, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate18' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_StartAbilityState_ReturnValue2) == 0x000248, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_StartAbilityState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_CreateDelegate_OutputDelegate19) == 0x000250, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_CreateDelegate_OutputDelegate19' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_IsValid_ReturnValue3) == 0x000260, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000268, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_DynamicCast_AsOrion_Char_AI_Jungle_Boss) == 0x000270, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_DynamicCast_AsOrion_Char_AI_Jungle_Boss' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_IsValid_ReturnValue4) == 0x000279, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetBestTarget_ReturnValue) == 0x000280, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetBestTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000288, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000290, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetTransform_ReturnValue2) == 0x0002B0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_TagSplitGameplayEffectSpecBetweenActors_AppliedEffectHandles) == 0x0002E0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_TagSplitGameplayEffectSpecBetweenActors_AppliedEffectHandles' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2) == 0x0002F0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000308, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00030C, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000318, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_BreakVector_X) == 0x000330, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_BreakVector_Y) == 0x000334, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_BreakVector_Z) == 0x000338, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetTransform_ReturnValue3) == 0x000340, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_MakeOrionTargetData_ReturnValue) == 0x000370, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_MakeOrionTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000390, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000398, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_MakeVector_ReturnValue) == 0x000450, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_MakeTransform_ReturnValue) == 0x000460, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue3) == 0x000490, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_SpawnOrionActorTransform_ReturnValue2) == 0x000498, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_SpawnOrionActorTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_DynamicCast_AsBP_Orion_Char_AI_Core_Boss) == 0x0004A0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_DynamicCast_AsBP_Orion_Char_AI_Core_Boss' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, K2Node_DynamicCast_bSuccess2) == 0x0004A8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_BeginSpawningActor_SpawnedActor2) == 0x0004B0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_BeginSpawningActor_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_BeginSpawningActor_ReturnValue2) == 0x0004B8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_BeginSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetSocketTransform_ReturnValue) == 0x0004C0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_SpawnOrionActorTransform_ReturnValue3) == 0x0004F0, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_SpawnOrionActorTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_BeginSpawningActor_SpawnedActor3) == 0x0004F8, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_BeginSpawningActor_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_BeginSpawningActor_ReturnValue3) == 0x000500, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_BeginSpawningActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_IsValid_ReturnValue5) == 0x000501, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_IsValid_ReturnValue6) == 0x000502, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, Temp_int_Array_Index_Variable) == 0x000504, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_Array_Get_Item) == 0x000508, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_GetTransform_ReturnValue4) == 0x000510, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_GetTransform_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_MakeOrionTargetData_ReturnValue2) == 0x000540, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_MakeOrionTargetData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000560, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000570, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000578, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_IsValid_ReturnValue7) == 0x000580, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, Temp_int_Loop_Counter_Variable) == 0x000584, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_Less_IntInt_ReturnValue) == 0x000588, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack, CallFunc_Add_IntInt_ReturnValue) == 0x00058C, "Member 'GA_Core_Boss_SpecialAttack_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.FailedToSpawn_2EDAC6F4437B35B68060969E32F0B5F5
// 0x0008 (0x0008 - 0x0000)
struct GA_Core_Boss_SpecialAttack_C_FailedToSpawn_2EDAC6F4437B35B68060969E32F0B5F5 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_FailedToSpawn_2EDAC6F4437B35B68060969E32F0B5F5) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_FailedToSpawn_2EDAC6F4437B35B68060969E32F0B5F5");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_FailedToSpawn_2EDAC6F4437B35B68060969E32F0B5F5) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_FailedToSpawn_2EDAC6F4437B35B68060969E32F0B5F5");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_FailedToSpawn_2EDAC6F4437B35B68060969E32F0B5F5, SpawnedActor) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_FailedToSpawn_2EDAC6F4437B35B68060969E32F0B5F5::SpawnedActor' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.FailedToSpawn_52DEBDC044C283234BFD3AA6F0C7DCE5
// 0x0008 (0x0008 - 0x0000)
struct GA_Core_Boss_SpecialAttack_C_FailedToSpawn_52DEBDC044C283234BFD3AA6F0C7DCE5 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_FailedToSpawn_52DEBDC044C283234BFD3AA6F0C7DCE5) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_FailedToSpawn_52DEBDC044C283234BFD3AA6F0C7DCE5");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_FailedToSpawn_52DEBDC044C283234BFD3AA6F0C7DCE5) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_FailedToSpawn_52DEBDC044C283234BFD3AA6F0C7DCE5");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_FailedToSpawn_52DEBDC044C283234BFD3AA6F0C7DCE5, SpawnedActor) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_FailedToSpawn_52DEBDC044C283234BFD3AA6F0C7DCE5::SpawnedActor' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.FailedToSpawn_63993A844F7F947AA0FA2AB177BCF12E
// 0x0008 (0x0008 - 0x0000)
struct GA_Core_Boss_SpecialAttack_C_FailedToSpawn_63993A844F7F947AA0FA2AB177BCF12E final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_FailedToSpawn_63993A844F7F947AA0FA2AB177BCF12E) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_FailedToSpawn_63993A844F7F947AA0FA2AB177BCF12E");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_FailedToSpawn_63993A844F7F947AA0FA2AB177BCF12E) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_FailedToSpawn_63993A844F7F947AA0FA2AB177BCF12E");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_FailedToSpawn_63993A844F7F947AA0FA2AB177BCF12E, SpawnedActor) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_FailedToSpawn_63993A844F7F947AA0FA2AB177BCF12E::SpawnedActor' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.NotAuthority_2EDAC6F4437B35B68060969E32F0B5F5
// 0x0008 (0x0008 - 0x0000)
struct GA_Core_Boss_SpecialAttack_C_NotAuthority_2EDAC6F4437B35B68060969E32F0B5F5 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_NotAuthority_2EDAC6F4437B35B68060969E32F0B5F5) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_NotAuthority_2EDAC6F4437B35B68060969E32F0B5F5");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_NotAuthority_2EDAC6F4437B35B68060969E32F0B5F5) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_NotAuthority_2EDAC6F4437B35B68060969E32F0B5F5");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_NotAuthority_2EDAC6F4437B35B68060969E32F0B5F5, SpawnedActor) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_NotAuthority_2EDAC6F4437B35B68060969E32F0B5F5::SpawnedActor' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.NotAuthority_52DEBDC044C283234BFD3AA6F0C7DCE5
// 0x0008 (0x0008 - 0x0000)
struct GA_Core_Boss_SpecialAttack_C_NotAuthority_52DEBDC044C283234BFD3AA6F0C7DCE5 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_NotAuthority_52DEBDC044C283234BFD3AA6F0C7DCE5) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_NotAuthority_52DEBDC044C283234BFD3AA6F0C7DCE5");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_NotAuthority_52DEBDC044C283234BFD3AA6F0C7DCE5) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_NotAuthority_52DEBDC044C283234BFD3AA6F0C7DCE5");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_NotAuthority_52DEBDC044C283234BFD3AA6F0C7DCE5, SpawnedActor) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_NotAuthority_52DEBDC044C283234BFD3AA6F0C7DCE5::SpawnedActor' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.NotAuthority_63993A844F7F947AA0FA2AB177BCF12E
// 0x0008 (0x0008 - 0x0000)
struct GA_Core_Boss_SpecialAttack_C_NotAuthority_63993A844F7F947AA0FA2AB177BCF12E final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_NotAuthority_63993A844F7F947AA0FA2AB177BCF12E) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_NotAuthority_63993A844F7F947AA0FA2AB177BCF12E");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_NotAuthority_63993A844F7F947AA0FA2AB177BCF12E) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_NotAuthority_63993A844F7F947AA0FA2AB177BCF12E");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_NotAuthority_63993A844F7F947AA0FA2AB177BCF12E, SpawnedActor) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_NotAuthority_63993A844F7F947AA0FA2AB177BCF12E::SpawnedActor' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.OnBlendOut_83DBD5894402957DAAB6019505B50B57
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack_C_OnBlendOut_83DBD5894402957DAAB6019505B50B57 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_OnBlendOut_83DBD5894402957DAAB6019505B50B57) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_OnBlendOut_83DBD5894402957DAAB6019505B50B57");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_OnBlendOut_83DBD5894402957DAAB6019505B50B57) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_OnBlendOut_83DBD5894402957DAAB6019505B50B57");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_OnBlendOut_83DBD5894402957DAAB6019505B50B57, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_OnBlendOut_83DBD5894402957DAAB6019505B50B57::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.OnCancelled_83DBD5894402957DAAB6019505B50B57
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack_C_OnCancelled_83DBD5894402957DAAB6019505B50B57 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_OnCancelled_83DBD5894402957DAAB6019505B50B57) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_OnCancelled_83DBD5894402957DAAB6019505B50B57");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_OnCancelled_83DBD5894402957DAAB6019505B50B57) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_OnCancelled_83DBD5894402957DAAB6019505B50B57");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_OnCancelled_83DBD5894402957DAAB6019505B50B57, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_OnCancelled_83DBD5894402957DAAB6019505B50B57::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.OnCompleted_83DBD5894402957DAAB6019505B50B57
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack_C_OnCompleted_83DBD5894402957DAAB6019505B50B57 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_OnCompleted_83DBD5894402957DAAB6019505B50B57) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_OnCompleted_83DBD5894402957DAAB6019505B50B57");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_OnCompleted_83DBD5894402957DAAB6019505B50B57) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_OnCompleted_83DBD5894402957DAAB6019505B50B57");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_OnCompleted_83DBD5894402957DAAB6019505B50B57, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_OnCompleted_83DBD5894402957DAAB6019505B50B57::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.OnInterrupted_83DBD5894402957DAAB6019505B50B57
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack_C_OnInterrupted_83DBD5894402957DAAB6019505B50B57 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack_C_OnInterrupted_83DBD5894402957DAAB6019505B50B57) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack_C_OnInterrupted_83DBD5894402957DAAB6019505B50B57");
static_assert(sizeof(GA_Core_Boss_SpecialAttack_C_OnInterrupted_83DBD5894402957DAAB6019505B50B57) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack_C_OnInterrupted_83DBD5894402957DAAB6019505B50B57");
static_assert(offsetof(GA_Core_Boss_SpecialAttack_C_OnInterrupted_83DBD5894402957DAAB6019505B50B57, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack_C_OnInterrupted_83DBD5894402957DAAB6019505B50B57::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack.GA_Core_Boss_SpecialAttack_C.OnNotifyBegin_83DBD5894402957DAAB6019505B50B57
// 0x0008 (0x0008 - 0x0000)
