#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Metamorphosis

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Metamorphosis.GA_Card_Metamorphosis_C.ExecuteUbergraph_GA_Card_Metamorphosis
// 0x0120 (0x0120 - 0x0000)
struct GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0008(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0038(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0068(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnProjectile*      CallFunc_SpawnProjectile_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       CallFunc_BeginSpawningActor_SpawnedActor;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile4;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile3;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile2;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate6;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       Temp_object_Variable;                              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis");
static_assert(sizeof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis) == 0x000120, "Wrong size on GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, EntryPoint) == 0x000000, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CustomEvent_Targets2) == 0x000008, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CustomEvent_Targets) == 0x000038, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, Temp_struct_Variable) == 0x000068, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, CallFunc_StartTargeting_ReturnValue) == 0x000088, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, CallFunc_SpawnProjectile_ReturnValue) == 0x000098, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0000A0, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, CallFunc_BeginSpawningActor_ReturnValue) == 0x0000A8, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, CallFunc_IsValid_ReturnValue2) == 0x0000A9, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CustomEvent_SpawnedProjectile4) == 0x0000B0, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CustomEvent_SpawnedProjectile4' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B8, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CreateDelegate_OutputDelegate4) == 0x0000C8, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CustomEvent_SpawnedProjectile3) == 0x0000D8, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CustomEvent_SpawnedProjectile3' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CustomEvent_SpawnedProjectile2) == 0x0000E0, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CustomEvent_SpawnedProjectile2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CreateDelegate_OutputDelegate5) == 0x0000E8, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CreateDelegate_OutputDelegate6) == 0x0000F8, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, K2Node_CustomEvent_SpawnedProjectile) == 0x000108, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::K2Node_CustomEvent_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, Temp_object_Variable) == 0x000110, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis, CallFunc_K2_CommitAbility_ReturnValue) == 0x000118, "Member 'GA_Card_Metamorphosis_C_ExecuteUbergraph_GA_Card_Metamorphosis::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_Card_Metamorphosis.GA_Card_Metamorphosis_C.Success_A6A0A2BD4169C85E8ACE2C80CB47DD59
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Metamorphosis_C_Success_A6A0A2BD4169C85E8ACE2C80CB47DD59 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Metamorphosis_C_Success_A6A0A2BD4169C85E8ACE2C80CB47DD59) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_C_Success_A6A0A2BD4169C85E8ACE2C80CB47DD59");
static_assert(sizeof(GA_Card_Metamorphosis_C_Success_A6A0A2BD4169C85E8ACE2C80CB47DD59) == 0x000008, "Wrong size on GA_Card_Metamorphosis_C_Success_A6A0A2BD4169C85E8ACE2C80CB47DD59");
static_assert(offsetof(GA_Card_Metamorphosis_C_Success_A6A0A2BD4169C85E8ACE2C80CB47DD59, SpawnedProjectile) == 0x000000, "Member 'GA_Card_Metamorphosis_C_Success_A6A0A2BD4169C85E8ACE2C80CB47DD59::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_Metamorphosis.GA_Card_Metamorphosis_C.PreSpawned_A6A0A2BD4169C85E8ACE2C80CB47DD59
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Metamorphosis_C_PreSpawned_A6A0A2BD4169C85E8ACE2C80CB47DD59 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Metamorphosis_C_PreSpawned_A6A0A2BD4169C85E8ACE2C80CB47DD59) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_C_PreSpawned_A6A0A2BD4169C85E8ACE2C80CB47DD59");
static_assert(sizeof(GA_Card_Metamorphosis_C_PreSpawned_A6A0A2BD4169C85E8ACE2C80CB47DD59) == 0x000008, "Wrong size on GA_Card_Metamorphosis_C_PreSpawned_A6A0A2BD4169C85E8ACE2C80CB47DD59");
static_assert(offsetof(GA_Card_Metamorphosis_C_PreSpawned_A6A0A2BD4169C85E8ACE2C80CB47DD59, SpawnedProjectile) == 0x000000, "Member 'GA_Card_Metamorphosis_C_PreSpawned_A6A0A2BD4169C85E8ACE2C80CB47DD59::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_Metamorphosis.GA_Card_Metamorphosis_C.NotAuthority_A6A0A2BD4169C85E8ACE2C80CB47DD59
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Metamorphosis_C_NotAuthority_A6A0A2BD4169C85E8ACE2C80CB47DD59 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Metamorphosis_C_NotAuthority_A6A0A2BD4169C85E8ACE2C80CB47DD59) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_C_NotAuthority_A6A0A2BD4169C85E8ACE2C80CB47DD59");
static_assert(sizeof(GA_Card_Metamorphosis_C_NotAuthority_A6A0A2BD4169C85E8ACE2C80CB47DD59) == 0x000008, "Wrong size on GA_Card_Metamorphosis_C_NotAuthority_A6A0A2BD4169C85E8ACE2C80CB47DD59");
static_assert(offsetof(GA_Card_Metamorphosis_C_NotAuthority_A6A0A2BD4169C85E8ACE2C80CB47DD59, SpawnedProjectile) == 0x000000, "Member 'GA_Card_Metamorphosis_C_NotAuthority_A6A0A2BD4169C85E8ACE2C80CB47DD59::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_Metamorphosis.GA_Card_Metamorphosis_C.FailedToSpawn_A6A0A2BD4169C85E8ACE2C80CB47DD59
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Metamorphosis_C_FailedToSpawn_A6A0A2BD4169C85E8ACE2C80CB47DD59 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Metamorphosis_C_FailedToSpawn_A6A0A2BD4169C85E8ACE2C80CB47DD59) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_C_FailedToSpawn_A6A0A2BD4169C85E8ACE2C80CB47DD59");
static_assert(sizeof(GA_Card_Metamorphosis_C_FailedToSpawn_A6A0A2BD4169C85E8ACE2C80CB47DD59) == 0x000008, "Wrong size on GA_Card_Metamorphosis_C_FailedToSpawn_A6A0A2BD4169C85E8ACE2C80CB47DD59");
static_assert(offsetof(GA_Card_Metamorphosis_C_FailedToSpawn_A6A0A2BD4169C85E8ACE2C80CB47DD59, SpawnedProjectile) == 0x000000, "Member 'GA_Card_Metamorphosis_C_FailedToSpawn_A6A0A2BD4169C85E8ACE2C80CB47DD59::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_Metamorphosis.GA_Card_Metamorphosis_C.Confirmed_2ECDAFC6420499302D72DB87AB1A55ED
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_Metamorphosis_C_Confirmed_2ECDAFC6420499302D72DB87AB1A55ED final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_Metamorphosis_C_Confirmed_2ECDAFC6420499302D72DB87AB1A55ED) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_C_Confirmed_2ECDAFC6420499302D72DB87AB1A55ED");
static_assert(sizeof(GA_Card_Metamorphosis_C_Confirmed_2ECDAFC6420499302D72DB87AB1A55ED) == 0x000020, "Wrong size on GA_Card_Metamorphosis_C_Confirmed_2ECDAFC6420499302D72DB87AB1A55ED");
static_assert(offsetof(GA_Card_Metamorphosis_C_Confirmed_2ECDAFC6420499302D72DB87AB1A55ED, Targets) == 0x000000, "Member 'GA_Card_Metamorphosis_C_Confirmed_2ECDAFC6420499302D72DB87AB1A55ED::Targets' has a wrong offset!");

// Function GA_Card_Metamorphosis.GA_Card_Metamorphosis_C.Cancelled_2ECDAFC6420499302D72DB87AB1A55ED
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_Metamorphosis_C_Cancelled_2ECDAFC6420499302D72DB87AB1A55ED final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_Metamorphosis_C_Cancelled_2ECDAFC6420499302D72DB87AB1A55ED) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_C_Cancelled_2ECDAFC6420499302D72DB87AB1A55ED");
static_assert(sizeof(GA_Card_Metamorphosis_C_Cancelled_2ECDAFC6420499302D72DB87AB1A55ED) == 0x000020, "Wrong size on GA_Card_Metamorphosis_C_Cancelled_2ECDAFC6420499302D72DB87AB1A55ED");
static_assert(offsetof(GA_Card_Metamorphosis_C_Cancelled_2ECDAFC6420499302D72DB87AB1A55ED, Targets) == 0x000000, "Member 'GA_Card_Metamorphosis_C_Cancelled_2ECDAFC6420499302D72DB87AB1A55ED::Targets' has a wrong offset!");

// Function GA_Card_Metamorphosis.GA_Card_Metamorphosis_C.K2_CanActivateAbility
// 0x0080 (0x0080 - 0x0000)
struct GA_Card_Metamorphosis_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CanActivate_Local;                                 // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEnergy_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Metamorphosis_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Card_Metamorphosis_C_K2_CanActivateAbility) == 0x000080, "Wrong size on GA_Card_Metamorphosis_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Card_Metamorphosis_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Card_Metamorphosis_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Card_Metamorphosis_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Card_Metamorphosis_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_K2_CanActivateAbility, CanActivate_Local) == 0x000061, "Member 'GA_Card_Metamorphosis_C_K2_CanActivateAbility::CanActivate_Local' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_K2_CanActivateAbility, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000068, "Member 'GA_Card_Metamorphosis_C_K2_CanActivateAbility::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_Card_Metamorphosis_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_K2_CanActivateAbility, CallFunc_GetEnergy_ReturnValue) == 0x000074, "Member 'GA_Card_Metamorphosis_C_K2_CanActivateAbility::CallFunc_GetEnergy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_C_K2_CanActivateAbility, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000078, "Member 'GA_Card_Metamorphosis_C_K2_CanActivateAbility::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

