#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Core_Boss_PrimaryAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Core_Boss_PrimaryAttack.GA_Core_Boss_PrimaryAttack_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Core_Boss_PrimaryAttack_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           PrimaryFire_Montage;                               // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DoDamageName;                                      // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             CurrentTarget;                                     // 0x0B88(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Core_Boss_PrimaryAttack(int32 EntryPoint);
	void FailedToSpawn_48BA6BA44F49D0A2CA41A38D214FA160(class AActor* SpawnedActor);
	void K2_ActivateAbility();
	void NotAuthority_48BA6BA44F49D0A2CA41A38D214FA160(class AActor* SpawnedActor);
	void OnBlendOut_628DAD8E46E954A60E2D9AABC4C7D70B(class FName NotifyName);
	void OnCancelled_628DAD8E46E954A60E2D9AABC4C7D70B(class FName NotifyName);
	void OnCompleted_628DAD8E46E954A60E2D9AABC4C7D70B(class FName NotifyName);
	void OnInterrupted_628DAD8E46E954A60E2D9AABC4C7D70B(class FName NotifyName);
	void OnNotifyBegin_628DAD8E46E954A60E2D9AABC4C7D70B(class FName NotifyName);
	void OnNotifyEnd_628DAD8E46E954A60E2D9AABC4C7D70B(class FName NotifyName);
	void Success_48BA6BA44F49D0A2CA41A38D214FA160(class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Core_Boss_PrimaryAttack_C">();
	}
	static class UGA_Core_Boss_PrimaryAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Core_Boss_PrimaryAttack_C>();
	}
};
static_assert(alignof(UGA_Core_Boss_PrimaryAttack_C) == 0x000010, "Wrong alignment on UGA_Core_Boss_PrimaryAttack_C");
static_assert(sizeof(UGA_Core_Boss_PrimaryAttack_C) == 0x000B90, "Wrong size on UGA_Core_Boss_PrimaryAttack_C");
static_assert(offsetof(UGA_Core_Boss_PrimaryAttack_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Core_Boss_PrimaryAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_PrimaryAttack_C, PrimaryFire_Montage) == 0x000B78, "Member 'UGA_Core_Boss_PrimaryAttack_C::PrimaryFire_Montage' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_PrimaryAttack_C, DoDamageName) == 0x000B80, "Member 'UGA_Core_Boss_PrimaryAttack_C::DoDamageName' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_PrimaryAttack_C, CurrentTarget) == 0x000B88, "Member 'UGA_Core_Boss_PrimaryAttack_C::CurrentTarget' has a wrong offset!");

}

