#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ManaRegFromEnemyMana

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_ManaRegFromEnemyMana.GA_Card_ManaRegFromEnemyMana_C
// 0x0070 (0x0BE0 - 0x0B70)
class UGA_Card_ManaRegFromEnemyMana_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTagRequirements               ManaListenTag;                                     // 0x0B78(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOrionFilterAndEffectsContainer        OverlapChars;                                      // 0x0BB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_ManaRegFromEnemyMana_C">();
	}
	static class UGA_Card_ManaRegFromEnemyMana_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_ManaRegFromEnemyMana_C>();
	}
};
static_assert(alignof(UGA_Card_ManaRegFromEnemyMana_C) == 0x000010, "Wrong alignment on UGA_Card_ManaRegFromEnemyMana_C");
static_assert(sizeof(UGA_Card_ManaRegFromEnemyMana_C) == 0x000BE0, "Wrong size on UGA_Card_ManaRegFromEnemyMana_C");
static_assert(offsetof(UGA_Card_ManaRegFromEnemyMana_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_ManaRegFromEnemyMana_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_ManaRegFromEnemyMana_C, ManaListenTag) == 0x000B78, "Member 'UGA_Card_ManaRegFromEnemyMana_C::ManaListenTag' has a wrong offset!");
static_assert(offsetof(UGA_Card_ManaRegFromEnemyMana_C, OverlapChars) == 0x000BB8, "Member 'UGA_Card_ManaRegFromEnemyMana_C::OverlapChars' has a wrong offset!");

}

