#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Core_Boss_SpecialAttack3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Core_Boss_SpecialAttack3.GA_Core_Boss_SpecialAttack3_C
// 0x0050 (0x0BC0 - 0x0B70)
class UGA_Core_Boss_SpecialAttack3_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class AActor*                                 SpawnedVolume;                                     // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AbilityDuration;                                   // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpecialAttackAnimationIndex;                       // 0x0B84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpecialAttackTime;                                 // 0x0B88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8C[0x4];                                      // 0x0B8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         SegmentArray;                                      // 0x0B90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AOrionChar*                             CurrentTarget;                                     // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartDamage_Name;                                  // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PrimaryAttack_Montage;                             // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Core_Boss_SpecialAttack3(int32 EntryPoint);
	void FailedToSpawn_12ADA30B4F7418D8007BC08158E5ADE0(class AActor* SpawnedActor);
	void K2_ActivateAbility();
	void K2_OnEndAbility();
	void NotAuthority_12ADA30B4F7418D8007BC08158E5ADE0(class AActor* SpawnedActor);
	void OnBlendOut_3BE486D04E2B0E11DD3FE697B1BD673C(class FName NotifyName);
	void OnCancelled_3BE486D04E2B0E11DD3FE697B1BD673C(class FName NotifyName);
	void OnCompleted_3BE486D04E2B0E11DD3FE697B1BD673C(class FName NotifyName);
	void OnCompleted_7242428D476CCF13C35011BB46DA0C3E();
	void OnInterrupted_3BE486D04E2B0E11DD3FE697B1BD673C(class FName NotifyName);
	void OnNotifyBegin_3BE486D04E2B0E11DD3FE697B1BD673C(class FName NotifyName);
	void OnNotifyEnd_3BE486D04E2B0E11DD3FE697B1BD673C(class FName NotifyName);
	void OnStateEnded_3186B05049BFAF65B6ECAEBA66896AF2();
	void OnStateEnded_FC24817D47BF7C728CB95D84168E150A();
	void OnStateInterrupted_3186B05049BFAF65B6ECAEBA66896AF2();
	void OnStateInterrupted_FC24817D47BF7C728CB95D84168E150A();
	void Success_12ADA30B4F7418D8007BC08158E5ADE0(class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Core_Boss_SpecialAttack3_C">();
	}
	static class UGA_Core_Boss_SpecialAttack3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Core_Boss_SpecialAttack3_C>();
	}
};
static_assert(alignof(UGA_Core_Boss_SpecialAttack3_C) == 0x000010, "Wrong alignment on UGA_Core_Boss_SpecialAttack3_C");
static_assert(sizeof(UGA_Core_Boss_SpecialAttack3_C) == 0x000BC0, "Wrong size on UGA_Core_Boss_SpecialAttack3_C");
static_assert(offsetof(UGA_Core_Boss_SpecialAttack3_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Core_Boss_SpecialAttack3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_SpecialAttack3_C, SpawnedVolume) == 0x000B78, "Member 'UGA_Core_Boss_SpecialAttack3_C::SpawnedVolume' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_SpecialAttack3_C, AbilityDuration) == 0x000B80, "Member 'UGA_Core_Boss_SpecialAttack3_C::AbilityDuration' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_SpecialAttack3_C, SpecialAttackAnimationIndex) == 0x000B84, "Member 'UGA_Core_Boss_SpecialAttack3_C::SpecialAttackAnimationIndex' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_SpecialAttack3_C, SpecialAttackTime) == 0x000B88, "Member 'UGA_Core_Boss_SpecialAttack3_C::SpecialAttackTime' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_SpecialAttack3_C, SegmentArray) == 0x000B90, "Member 'UGA_Core_Boss_SpecialAttack3_C::SegmentArray' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_SpecialAttack3_C, CurrentTarget) == 0x000BA0, "Member 'UGA_Core_Boss_SpecialAttack3_C::CurrentTarget' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_SpecialAttack3_C, StartDamage_Name) == 0x000BA8, "Member 'UGA_Core_Boss_SpecialAttack3_C::StartDamage_Name' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_SpecialAttack3_C, PrimaryAttack_Montage) == 0x000BB0, "Member 'UGA_Core_Boss_SpecialAttack3_C::PrimaryAttack_Montage' has a wrong offset!");

}

