#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_OverhealingShields

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_OverhealingShields.GA_Card_OverhealingShields_C.ExecuteUbergraph_GA_Card_OverhealingShields
// 0x01F8 (0x01F8 - 0x0000)
struct GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Source;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0010(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0048(0x0018)()
	float                                         CallFunc_GetModifiedAttributeMagnitude_ReturnValue; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x00B0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue3; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue2;           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute3; // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue3;           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute4; // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue4;           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0118(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ShieldsToApply;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue4; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute5; // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue5;           // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue5; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute6; // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue6;           // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute7; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue7;           // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue6; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute8; // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue8;           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0198(0x0040)(ContainsInstancedReference)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEffectApplied_Self* CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields) == 0x000008, "Wrong alignment on GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields");
static_assert(sizeof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields) == 0x0001F8, "Wrong size on GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, EntryPoint) == 0x000000, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, K2Node_CustomEvent_Source) == 0x000008, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, K2Node_CustomEvent_SpecHandle) == 0x000010, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, K2Node_CustomEvent_ActiveHandle) == 0x000028, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, Temp_struct_Variable) == 0x000040, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, Temp_struct_Variable2) == 0x000048, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetModifiedAttributeMagnitude_ReturnValue) == 0x000060, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetModifiedAttributeMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, Temp_object_Variable) == 0x000068, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, K2Node_CreateDelegate_OutputDelegate2) == 0x000070, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, K2Node_CreateDelegate_OutputDelegate3) == 0x000088, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, K2Node_CreateDelegate_OutputDelegate4) == 0x000098, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_StartAbilityState_ReturnValue) == 0x0000A8, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x0000B0, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000D0, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0000D8, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_ReturnValue) == 0x0000DC, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0000E0, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetAvatarActorFromActorInfo_ReturnValue3) == 0x0000E8, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetAvatarActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2) == 0x0000F0, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_ReturnValue2) == 0x0000F4, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute3) == 0x0000F8, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute3' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_ReturnValue3) == 0x0000FC, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000100, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute4) == 0x000104, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute4' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_ReturnValue4) == 0x000108, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00010C, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00010D, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000110, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Add_FloatFloat_ReturnValue) == 0x000114, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000118, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000130, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, K2Node_CustomEvent_ShieldsToApply) == 0x000138, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::K2Node_CustomEvent_ShieldsToApply' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetAvatarActorFromActorInfo_ReturnValue4) == 0x000140, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetAvatarActorFromActorInfo_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute5) == 0x000148, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute5' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_ReturnValue5) == 0x00014C, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000150, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetAvatarActorFromActorInfo_ReturnValue5) == 0x000158, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetAvatarActorFromActorInfo_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000160, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute6) == 0x000161, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute6' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_ReturnValue6) == 0x000164, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute7) == 0x000168, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute7' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_ReturnValue7) == 0x00016C, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GreaterEqual_FloatFloat_ReturnValue2) == 0x000170, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GreaterEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000174, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetAvatarActorFromActorInfo_ReturnValue6) == 0x000178, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetAvatarActorFromActorInfo_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute8) == 0x000180, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute8' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetFloatAttribute_ReturnValue8) == 0x000184, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetFloatAttribute_ReturnValue8' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000188, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x00018C, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Greater_FloatFloat_ReturnValue3) == 0x000190, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Greater_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetAbilityLevel_ReturnValue) == 0x000194, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetActorInfo_ReturnValue) == 0x000198, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001D8, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_GetValueAtLevel_ReturnValue) == 0x0001DC, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0001E0, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue) == 0x0001E8, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields, CallFunc_IsValid_ReturnValue2) == 0x0001F0, "Member 'GA_Card_OverhealingShields_C_ExecuteUbergraph_GA_Card_OverhealingShields::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function GA_Card_OverhealingShields.GA_Card_OverhealingShields_C.ApplyShieldsBasedOnHealing
// 0x0004 (0x0004 - 0x0000)
struct GA_Card_OverhealingShields_C_ApplyShieldsBasedOnHealing final
{
public:
	float                                         ShieldsToApply_0;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_OverhealingShields_C_ApplyShieldsBasedOnHealing) == 0x000004, "Wrong alignment on GA_Card_OverhealingShields_C_ApplyShieldsBasedOnHealing");
static_assert(sizeof(GA_Card_OverhealingShields_C_ApplyShieldsBasedOnHealing) == 0x000004, "Wrong size on GA_Card_OverhealingShields_C_ApplyShieldsBasedOnHealing");
static_assert(offsetof(GA_Card_OverhealingShields_C_ApplyShieldsBasedOnHealing, ShieldsToApply_0) == 0x000000, "Member 'GA_Card_OverhealingShields_C_ApplyShieldsBasedOnHealing::ShieldsToApply_0' has a wrong offset!");

// Function GA_Card_OverhealingShields.GA_Card_OverhealingShields_C.OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_OverhealingShields_C_OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_OverhealingShields_C_OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF) == 0x000008, "Wrong alignment on GA_Card_OverhealingShields_C_OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF");
static_assert(sizeof(GA_Card_OverhealingShields_C_OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF) == 0x000028, "Wrong size on GA_Card_OverhealingShields_C_OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF");
static_assert(offsetof(GA_Card_OverhealingShields_C_OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF, Source) == 0x000000, "Member 'GA_Card_OverhealingShields_C_OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF::Source' has a wrong offset!");
static_assert(offsetof(GA_Card_OverhealingShields_C_OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF, SpecHandle) == 0x000008, "Member 'GA_Card_OverhealingShields_C_OnApplied_9C7A653D4E9BEE35410E4B8D8A1E57EF::SpecHandle' has a wrong offset!");
