#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_FearlessBlood_CleanUp

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Card_FearlessBlood_CleanUp.GA_Card_FearlessBlood_CleanUp_C.ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp) == 0x000008, "Wrong alignment on GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp");
static_assert(sizeof(GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp) == 0x000028, "Wrong size on GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp");
static_assert(offsetof(GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp, EntryPoint) == 0x000000, "Member 'GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000018, "Member 'GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Card_FearlessBlood_CleanUp_C_ExecuteUbergraph_GA_Card_FearlessBlood_CleanUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

