#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_AbilityMimic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_AbilityMimic.GA_Card_AbilityMimic_C
// 0x01E0 (0x0D50 - 0x0B70)
class UGA_Card_AbilityMimic_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            LastHandle;                                        // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LastStartTime;                                     // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0xC];                                      // 0x0B84(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectQuery                   OwningTagQuerry;                                   // 0x0B90(0x0170)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         DurationToUseAsCD;                                 // 0x0D00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DurationMultiplier;                                // 0x0D04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              StoredCooldownSpec;                                // 0x0D08(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DurationValue;                                     // 0x0D20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_AbilityMimic(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_AbilityMimic_C">();
	}
	static class UGA_Card_AbilityMimic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_AbilityMimic_C>();
	}
};
static_assert(alignof(UGA_Card_AbilityMimic_C) == 0x000010, "Wrong alignment on UGA_Card_AbilityMimic_C");
static_assert(sizeof(UGA_Card_AbilityMimic_C) == 0x000D50, "Wrong size on UGA_Card_AbilityMimic_C");
static_assert(offsetof(UGA_Card_AbilityMimic_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_AbilityMimic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_AbilityMimic_C, LastHandle) == 0x000B78, "Member 'UGA_Card_AbilityMimic_C::LastHandle' has a wrong offset!");
static_assert(offsetof(UGA_Card_AbilityMimic_C, LastStartTime) == 0x000B80, "Member 'UGA_Card_AbilityMimic_C::LastStartTime' has a wrong offset!");
static_assert(offsetof(UGA_Card_AbilityMimic_C, OwningTagQuerry) == 0x000B90, "Member 'UGA_Card_AbilityMimic_C::OwningTagQuerry' has a wrong offset!");
static_assert(offsetof(UGA_Card_AbilityMimic_C, DurationToUseAsCD) == 0x000D00, "Member 'UGA_Card_AbilityMimic_C::DurationToUseAsCD' has a wrong offset!");
static_assert(offsetof(UGA_Card_AbilityMimic_C, DurationMultiplier) == 0x000D04, "Member 'UGA_Card_AbilityMimic_C::DurationMultiplier' has a wrong offset!");
static_assert(offsetof(UGA_Card_AbilityMimic_C, StoredCooldownSpec) == 0x000D08, "Member 'UGA_Card_AbilityMimic_C::StoredCooldownSpec' has a wrong offset!");
static_assert(offsetof(UGA_Card_AbilityMimic_C, DurationValue) == 0x000D20, "Member 'UGA_Card_AbilityMimic_C::DurationValue' has a wrong offset!");

}

