#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Metamorphosis

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Metamorphosis.GA_Card_Metamorphosis_C
// 0x0040 (0x0BB0 - 0x0B70)
class UGA_Card_Metamorphosis_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class USkeletalMesh*                          IllusionMesh;                                      // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          OriginalMesh;                                      // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OriginalAnimInstance;                              // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 IllusionAnimInstance;                              // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 IllusionBP;                                        // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CooldownReductionTotal;                            // 0x0BA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PercentPerPipToReduceCooldown;                     // 0x0BAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Metamorphosis(int32 EntryPoint);
	void K2_ActivateAbility();
	void Success_A6A0A2BD4169C85E8ACE2C80CB47DD59(class AOrionProjectile* SpawnedProjectile);
	void PreSpawned_A6A0A2BD4169C85E8ACE2C80CB47DD59(class AOrionProjectile* SpawnedProjectile);
	void NotAuthority_A6A0A2BD4169C85E8ACE2C80CB47DD59(class AOrionProjectile* SpawnedProjectile);
	void FailedToSpawn_A6A0A2BD4169C85E8ACE2C80CB47DD59(class AOrionProjectile* SpawnedProjectile);
	void Confirmed_2ECDAFC6420499302D72DB87AB1A55ED(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Cancelled_2ECDAFC6420499302D72DB87AB1A55ED(const struct FGameplayAbilityTargetDataHandle& Targets);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Metamorphosis_C">();
	}
	static class UGA_Card_Metamorphosis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Metamorphosis_C>();
	}
};
static_assert(alignof(UGA_Card_Metamorphosis_C) == 0x000010, "Wrong alignment on UGA_Card_Metamorphosis_C");
static_assert(sizeof(UGA_Card_Metamorphosis_C) == 0x000BB0, "Wrong size on UGA_Card_Metamorphosis_C");
static_assert(offsetof(UGA_Card_Metamorphosis_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Metamorphosis_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_C, IllusionMesh) == 0x000B78, "Member 'UGA_Card_Metamorphosis_C::IllusionMesh' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_C, OriginalMesh) == 0x000B80, "Member 'UGA_Card_Metamorphosis_C::OriginalMesh' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_C, OriginalAnimInstance) == 0x000B88, "Member 'UGA_Card_Metamorphosis_C::OriginalAnimInstance' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_C, IllusionAnimInstance) == 0x000B90, "Member 'UGA_Card_Metamorphosis_C::IllusionAnimInstance' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_C, IllusionBP) == 0x000B98, "Member 'UGA_Card_Metamorphosis_C::IllusionBP' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_C, TargetActor) == 0x000BA0, "Member 'UGA_Card_Metamorphosis_C::TargetActor' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_C, CooldownReductionTotal) == 0x000BA8, "Member 'UGA_Card_Metamorphosis_C::CooldownReductionTotal' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_C, PercentPerPipToReduceCooldown) == 0x000BAC, "Member 'UGA_Card_Metamorphosis_C::PercentPerPipToReduceCooldown' has a wrong offset!");

}

