#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ShadowWard

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_ShadowWard.GA_Card_ShadowWard_C.ExecuteUbergraph_GA_Card_ShadowWard
// 0x0128 (0x0128 - 0x0000)
struct GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0008(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0038(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0068(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTargetData_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate3;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate4;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate5;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Temp_object_Variable;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionPlayerState_Game*                 K2Node_DynamicCast_AsOrion_Player_State_Game;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard) == 0x000008, "Wrong alignment on GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard");
static_assert(sizeof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard) == 0x000128, "Wrong size on GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, EntryPoint) == 0x000000, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CustomEvent_Targets2) == 0x000008, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CustomEvent_Targets) == 0x000038, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, Temp_struct_Variable) == 0x000068, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, CallFunc_StartTargeting_ReturnValue) == 0x000088, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, CallFunc_SpawnOrionActorTargetData_ReturnValue) == 0x000098, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::CallFunc_SpawnOrionActorTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0000A0, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, CallFunc_BeginSpawningActor_ReturnValue) == 0x0000A8, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B0, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, CallFunc_IsValid_ReturnValue2) == 0x0000C0, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CustomEvent_SpawnedActor3) == 0x0000C8, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CustomEvent_SpawnedActor2) == 0x0000D0, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CreateDelegate_OutputDelegate4) == 0x0000D8, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CreateDelegate_OutputDelegate5) == 0x0000E8, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_CustomEvent_SpawnedActor) == 0x0000F8, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, Temp_object_Variable) == 0x000100, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, CallFunc_K2_CommitAbility_ReturnValue) == 0x000108, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000110, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_DynamicCast_AsOrion_Player_State_Game) == 0x000118, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_DynamicCast_AsOrion_Player_State_Game' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard, CallFunc_GetActorTeam_ReturnValue) == 0x000121, "Member 'GA_Card_ShadowWard_C_ExecuteUbergraph_GA_Card_ShadowWard::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");

// Function GA_Card_ShadowWard.GA_Card_ShadowWard_C.Cancelled_99BDA9EA45BDD965F24D7989CF2D9BC9
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ShadowWard_C_Cancelled_99BDA9EA45BDD965F24D7989CF2D9BC9 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ShadowWard_C_Cancelled_99BDA9EA45BDD965F24D7989CF2D9BC9) == 0x000008, "Wrong alignment on GA_Card_ShadowWard_C_Cancelled_99BDA9EA45BDD965F24D7989CF2D9BC9");
static_assert(sizeof(GA_Card_ShadowWard_C_Cancelled_99BDA9EA45BDD965F24D7989CF2D9BC9) == 0x000020, "Wrong size on GA_Card_ShadowWard_C_Cancelled_99BDA9EA45BDD965F24D7989CF2D9BC9");
static_assert(offsetof(GA_Card_ShadowWard_C_Cancelled_99BDA9EA45BDD965F24D7989CF2D9BC9, Targets) == 0x000000, "Member 'GA_Card_ShadowWard_C_Cancelled_99BDA9EA45BDD965F24D7989CF2D9BC9::Targets' has a wrong offset!");

// Function GA_Card_ShadowWard.GA_Card_ShadowWard_C.Confirmed_99BDA9EA45BDD965F24D7989CF2D9BC9
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ShadowWard_C_Confirmed_99BDA9EA45BDD965F24D7989CF2D9BC9 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ShadowWard_C_Confirmed_99BDA9EA45BDD965F24D7989CF2D9BC9) == 0x000008, "Wrong alignment on GA_Card_ShadowWard_C_Confirmed_99BDA9EA45BDD965F24D7989CF2D9BC9");
static_assert(sizeof(GA_Card_ShadowWard_C_Confirmed_99BDA9EA45BDD965F24D7989CF2D9BC9) == 0x000020, "Wrong size on GA_Card_ShadowWard_C_Confirmed_99BDA9EA45BDD965F24D7989CF2D9BC9");
static_assert(offsetof(GA_Card_ShadowWard_C_Confirmed_99BDA9EA45BDD965F24D7989CF2D9BC9, Targets) == 0x000000, "Member 'GA_Card_ShadowWard_C_Confirmed_99BDA9EA45BDD965F24D7989CF2D9BC9::Targets' has a wrong offset!");

// Function GA_Card_ShadowWard.GA_Card_ShadowWard_C.FailedToSpawn_BB9B494943D1EE1229451BB9ECCD1415
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ShadowWard_C_FailedToSpawn_BB9B494943D1EE1229451BB9ECCD1415 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ShadowWard_C_FailedToSpawn_BB9B494943D1EE1229451BB9ECCD1415) == 0x000008, "Wrong alignment on GA_Card_ShadowWard_C_FailedToSpawn_BB9B494943D1EE1229451BB9ECCD1415");
static_assert(sizeof(GA_Card_ShadowWard_C_FailedToSpawn_BB9B494943D1EE1229451BB9ECCD1415) == 0x000008, "Wrong size on GA_Card_ShadowWard_C_FailedToSpawn_BB9B494943D1EE1229451BB9ECCD1415");
static_assert(offsetof(GA_Card_ShadowWard_C_FailedToSpawn_BB9B494943D1EE1229451BB9ECCD1415, SpawnedActor) == 0x000000, "Member 'GA_Card_ShadowWard_C_FailedToSpawn_BB9B494943D1EE1229451BB9ECCD1415::SpawnedActor' has a wrong offset!");

// Function GA_Card_ShadowWard.GA_Card_ShadowWard_C.NotAuthority_BB9B494943D1EE1229451BB9ECCD1415
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ShadowWard_C_NotAuthority_BB9B494943D1EE1229451BB9ECCD1415 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ShadowWard_C_NotAuthority_BB9B494943D1EE1229451BB9ECCD1415) == 0x000008, "Wrong alignment on GA_Card_ShadowWard_C_NotAuthority_BB9B494943D1EE1229451BB9ECCD1415");
static_assert(sizeof(GA_Card_ShadowWard_C_NotAuthority_BB9B494943D1EE1229451BB9ECCD1415) == 0x000008, "Wrong size on GA_Card_ShadowWard_C_NotAuthority_BB9B494943D1EE1229451BB9ECCD1415");
static_assert(offsetof(GA_Card_ShadowWard_C_NotAuthority_BB9B494943D1EE1229451BB9ECCD1415, SpawnedActor) == 0x000000, "Member 'GA_Card_ShadowWard_C_NotAuthority_BB9B494943D1EE1229451BB9ECCD1415::SpawnedActor' has a wrong offset!");

// Function GA_Card_ShadowWard.GA_Card_ShadowWard_C.Success_BB9B494943D1EE1229451BB9ECCD1415
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ShadowWard_C_Success_BB9B494943D1EE1229451BB9ECCD1415 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ShadowWard_C_Success_BB9B494943D1EE1229451BB9ECCD1415) == 0x000008, "Wrong alignment on GA_Card_ShadowWard_C_Success_BB9B494943D1EE1229451BB9ECCD1415");
static_assert(sizeof(GA_Card_ShadowWard_C_Success_BB9B494943D1EE1229451BB9ECCD1415) == 0x000008, "Wrong size on GA_Card_ShadowWard_C_Success_BB9B494943D1EE1229451BB9ECCD1415");
static_assert(offsetof(GA_Card_ShadowWard_C_Success_BB9B494943D1EE1229451BB9ECCD1415, SpawnedActor) == 0x000000, "Member 'GA_Card_ShadowWard_C_Success_BB9B494943D1EE1229451BB9ECCD1415::SpawnedActor' has a wrong offset!");

}

