#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Counterattack

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Counterattack.GA_Card_Counterattack_C.ExecuteUbergraph_GA_Card_Counterattack
// 0x0140 (0x0140 - 0x0000)
struct GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x0010(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0038(0x0018)()
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0060(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable2;                             // 0x0078(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00B0(0x0020)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageTaken_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0100(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0118(0x0018)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack) == 0x000008, "Wrong alignment on GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack");
static_assert(sizeof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack) == 0x000140, "Wrong size on GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, EntryPoint) == 0x000000, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, K2Node_CustomEvent_AuxillaryASC) == 0x000008, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, K2Node_CustomEvent_DamageInfo) == 0x000010, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, K2Node_CustomEvent_SpecHandle) == 0x000038, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, Temp_struct_Variable) == 0x000060, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, Temp_struct_Variable2) == 0x000078, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, Temp_object_Variable) == 0x0000A0, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000B0, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D0, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_WaitDamageTaken_ReturnValue) == 0x0000D8, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_WaitDamageTaken_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_Abs_ReturnValue) == 0x0000E0, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_IsValid_ReturnValue) == 0x0000E4, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_GetAbilityLevel_ReturnValue) == 0x0000E8, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_GetAbilityLevel_ReturnValue2) == 0x0000EC, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000F0, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x0000F4, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000F8, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000100, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000118, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000130, "Member 'GA_Card_Counterattack_C_ExecuteUbergraph_GA_Card_Counterattack::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

// Function GA_Card_Counterattack.GA_Card_Counterattack_C.OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221 final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221) == 0x000008, "Wrong alignment on GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221");
static_assert(sizeof(GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221) == 0x000048, "Wrong size on GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221");
static_assert(offsetof(GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221, AuxillaryASC) == 0x000000, "Member 'GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221, DamageInfo) == 0x000008, "Member 'GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221, SpecHandle) == 0x000030, "Member 'GA_Card_Counterattack_C_OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221::SpecHandle' has a wrong offset!");

}

