#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Dmg_Drains_Mana_When_LowHP

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Dmg_Drains_Mana_When_LowHP.GA_Card_Dmg_Drains_Mana_When_LowHP_C.ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP
// 0x0248 (0x0248 - 0x0000)
struct GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0040)(ContainsInstancedReference)
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x0050(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle2;                    // 0x0078(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0090(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable2;                             // 0x00A8(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Source;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x00F0(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable3;                             // 0x0108(0x0018)()
	class AActor*                                 Temp_object_Variable2;                             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitKilled*           CallFunc_WaitOwnerKilled_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0168(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2; // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue2;           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate4;             // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageTaken_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue2;                // 0x01D0(0x0040)(ContainsInstancedReference)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0220(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0238(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue2;  // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP) == 0x000008, "Wrong alignment on GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP");
static_assert(sizeof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP) == 0x000248, "Wrong size on GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, EntryPoint) == 0x000000, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, K2Node_CustomEvent_AuxillaryASC) == 0x000048, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, K2Node_CustomEvent_DamageInfo) == 0x000050, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, K2Node_CustomEvent_SpecHandle2) == 0x000078, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::K2Node_CustomEvent_SpecHandle2' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, Temp_struct_Variable) == 0x000090, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, Temp_struct_Variable2) == 0x0000A8, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, Temp_object_Variable) == 0x0000D0, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, K2Node_CustomEvent_Source) == 0x0000E8, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, K2Node_CustomEvent_SpecHandle) == 0x0000F0, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, Temp_struct_Variable3) == 0x000108, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, Temp_object_Variable2) == 0x000120, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_WaitOwnerKilled_ReturnValue) == 0x000128, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_WaitOwnerKilled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, K2Node_CreateDelegate_OutputDelegate2) == 0x000130, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, K2Node_CreateDelegate_OutputDelegate3) == 0x000148, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_StartAbilityState_ReturnValue) == 0x000158, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_IsValid_ReturnValue2) == 0x000160, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000168, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000180, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000188, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000190, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetFloatAttribute_ReturnValue) == 0x000194, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000198, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001A0, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2) == 0x0001A4, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetFloatAttribute_ReturnValue2) == 0x0001A8, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetFloatAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001AC, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001AD, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, K2Node_CreateDelegate_OutputDelegate4) == 0x0001B0, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_WaitDamageTaken_ReturnValue) == 0x0001C0, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_WaitDamageTaken_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0001C8, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_IsValid_ReturnValue3) == 0x0001C9, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetActorInfo_ReturnValue2) == 0x0001D0, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetAbilityLevel_ReturnValue) == 0x000210, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000214, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000218, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000220, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000238, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_GetValueAtLevel_ReturnValue) == 0x000240, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP, CallFunc_RemoveActiveGameplayEffect_ReturnValue2) == 0x000244, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_ExecuteUbergraph_GA_Card_Dmg_Drains_Mana_When_LowHP::CallFunc_RemoveActiveGameplayEffect_ReturnValue2' has a wrong offset!");

// Function GA_Card_Dmg_Drains_Mana_When_LowHP.GA_Card_Dmg_Drains_Mana_When_LowHP_C.OnDamage_054B543046EAAC0287496C990D344B72
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72 final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72) == 0x000008, "Wrong alignment on GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72");
static_assert(sizeof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72) == 0x000048, "Wrong size on GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72, AuxillaryASC) == 0x000000, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72, DamageInfo) == 0x000008, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72, SpecHandle) == 0x000030, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnDamage_054B543046EAAC0287496C990D344B72::SpecHandle' has a wrong offset!");

// Function GA_Card_Dmg_Drains_Mana_When_LowHP.GA_Card_Dmg_Drains_Mana_When_LowHP_C.OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC) == 0x000008, "Wrong alignment on GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC");
static_assert(sizeof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC) == 0x000020, "Wrong size on GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC, Source) == 0x000000, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC::Source' has a wrong offset!");
static_assert(offsetof(GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC, SpecHandle) == 0x000008, "Member 'GA_Card_Dmg_Drains_Mana_When_LowHP_C_OnKilled_159756EA472CD4BAEA1BB5A7A60E87AC::SpecHandle' has a wrong offset!");

}

