#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_OnCritical_GainShadowPlane

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_OnCritical_GainShadowPlane.GA_Card_OnCritical_GainShadowPlane_C.ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane
// 0x0190 (0x0190 - 0x0000)
struct GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo2;     // 0x0008(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo;      // 0x0038(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectRemovalInfo             Temp_struct_Variable;                              // 0x0068(0x0020)()
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility2;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UGameplayAbility*                       Temp_object_Variable;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAbilityCommit*         CallFunc_WaitForAbilityCommit_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       Temp_object_Variable2;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAbilityCommit*         CallFunc_WaitForAbilityCommit_ReturnValue2;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x00F0(0x0040)(ContainsInstancedReference)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEffectRemoved* CallFunc_WaitForGameplayEffectRemoved_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane) == 0x000008, "Wrong alignment on GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane");
static_assert(sizeof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane) == 0x000190, "Wrong size on GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, EntryPoint) == 0x000000, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_GetAbilityLevel_ReturnValue) == 0x000004, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_CustomEvent_GameplayEffectRemovalInfo2) == 0x000008, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_CustomEvent_GameplayEffectRemovalInfo2' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_CustomEvent_GameplayEffectRemovalInfo) == 0x000038, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_CustomEvent_GameplayEffectRemovalInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, Temp_struct_Variable) == 0x000068, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, Temp_bool_Variable) == 0x000088, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_CustomEvent_ActivatedAbility2) == 0x000090, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_CustomEvent_ActivatedAbility2' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_CreateDelegate_OutputDelegate3) == 0x000098, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, Temp_object_Variable) == 0x0000A8, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_WaitForAbilityCommit_ReturnValue) == 0x0000B0, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_WaitForAbilityCommit_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_CreateDelegate_OutputDelegate4) == 0x0000C0, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_CustomEvent_ActivatedAbility) == 0x0000D0, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, Temp_object_Variable2) == 0x0000D8, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_WaitForAbilityCommit_ReturnValue2) == 0x0000E0, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_WaitForAbilityCommit_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_IsValid_ReturnValue2) == 0x0000E8, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_GetActorInfo_ReturnValue) == 0x0000F0, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000130, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_WaitForGameplayEffectRemoved_ReturnValue) == 0x000138, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_WaitForGameplayEffectRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_IsValid_ReturnValue3) == 0x000140, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000141, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000148, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000150, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, K2Node_CreateDelegate_OutputDelegate5) == 0x000168, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000178, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000180, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane, CallFunc_IsValid_ReturnValue4) == 0x000188, "Member 'GA_Card_OnCritical_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnCritical_GainShadowPlane::CallFunc_IsValid_ReturnValue4' has a wrong offset!");

// Function GA_Card_OnCritical_GainShadowPlane.GA_Card_OnCritical_GainShadowPlane_C.InvalidHandle_AEAA9FAE406C89CB7EC68998A1869974
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_OnCritical_GainShadowPlane_C_InvalidHandle_AEAA9FAE406C89CB7EC68998A1869974 final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_OnCritical_GainShadowPlane_C_InvalidHandle_AEAA9FAE406C89CB7EC68998A1869974) == 0x000008, "Wrong alignment on GA_Card_OnCritical_GainShadowPlane_C_InvalidHandle_AEAA9FAE406C89CB7EC68998A1869974");
static_assert(sizeof(GA_Card_OnCritical_GainShadowPlane_C_InvalidHandle_AEAA9FAE406C89CB7EC68998A1869974) == 0x000020, "Wrong size on GA_Card_OnCritical_GainShadowPlane_C_InvalidHandle_AEAA9FAE406C89CB7EC68998A1869974");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_InvalidHandle_AEAA9FAE406C89CB7EC68998A1869974, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA_Card_OnCritical_GainShadowPlane_C_InvalidHandle_AEAA9FAE406C89CB7EC68998A1869974::GameplayEffectRemovalInfo' has a wrong offset!");

// Function GA_Card_OnCritical_GainShadowPlane.GA_Card_OnCritical_GainShadowPlane_C.OnCommit_4065A13E42A9121CD2543A8F5C2A06B4
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_OnCritical_GainShadowPlane_C_OnCommit_4065A13E42A9121CD2543A8F5C2A06B4 final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_OnCritical_GainShadowPlane_C_OnCommit_4065A13E42A9121CD2543A8F5C2A06B4) == 0x000008, "Wrong alignment on GA_Card_OnCritical_GainShadowPlane_C_OnCommit_4065A13E42A9121CD2543A8F5C2A06B4");
static_assert(sizeof(GA_Card_OnCritical_GainShadowPlane_C_OnCommit_4065A13E42A9121CD2543A8F5C2A06B4) == 0x000008, "Wrong size on GA_Card_OnCritical_GainShadowPlane_C_OnCommit_4065A13E42A9121CD2543A8F5C2A06B4");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_OnCommit_4065A13E42A9121CD2543A8F5C2A06B4, ActivatedAbility) == 0x000000, "Member 'GA_Card_OnCritical_GainShadowPlane_C_OnCommit_4065A13E42A9121CD2543A8F5C2A06B4::ActivatedAbility' has a wrong offset!");

// Function GA_Card_OnCritical_GainShadowPlane.GA_Card_OnCritical_GainShadowPlane_C.OnCommit_6E41440B4EBDF02672CF47A344CA8869
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_OnCritical_GainShadowPlane_C_OnCommit_6E41440B4EBDF02672CF47A344CA8869 final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_OnCritical_GainShadowPlane_C_OnCommit_6E41440B4EBDF02672CF47A344CA8869) == 0x000008, "Wrong alignment on GA_Card_OnCritical_GainShadowPlane_C_OnCommit_6E41440B4EBDF02672CF47A344CA8869");
static_assert(sizeof(GA_Card_OnCritical_GainShadowPlane_C_OnCommit_6E41440B4EBDF02672CF47A344CA8869) == 0x000008, "Wrong size on GA_Card_OnCritical_GainShadowPlane_C_OnCommit_6E41440B4EBDF02672CF47A344CA8869");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_OnCommit_6E41440B4EBDF02672CF47A344CA8869, ActivatedAbility) == 0x000000, "Member 'GA_Card_OnCritical_GainShadowPlane_C_OnCommit_6E41440B4EBDF02672CF47A344CA8869::ActivatedAbility' has a wrong offset!");

// Function GA_Card_OnCritical_GainShadowPlane.GA_Card_OnCritical_GainShadowPlane_C.OnRemoved_AEAA9FAE406C89CB7EC68998A1869974
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_OnCritical_GainShadowPlane_C_OnRemoved_AEAA9FAE406C89CB7EC68998A1869974 final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_OnCritical_GainShadowPlane_C_OnRemoved_AEAA9FAE406C89CB7EC68998A1869974) == 0x000008, "Wrong alignment on GA_Card_OnCritical_GainShadowPlane_C_OnRemoved_AEAA9FAE406C89CB7EC68998A1869974");
static_assert(sizeof(GA_Card_OnCritical_GainShadowPlane_C_OnRemoved_AEAA9FAE406C89CB7EC68998A1869974) == 0x000020, "Wrong size on GA_Card_OnCritical_GainShadowPlane_C_OnRemoved_AEAA9FAE406C89CB7EC68998A1869974");
static_assert(offsetof(GA_Card_OnCritical_GainShadowPlane_C_OnRemoved_AEAA9FAE406C89CB7EC68998A1869974, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA_Card_OnCritical_GainShadowPlane_C_OnRemoved_AEAA9FAE406C89CB7EC68998A1869974::GameplayEffectRemovalInfo' has a wrong offset!");

}

