#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_RampingSpells

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_RampingSpells.GA_Card_RampingSpells_C.ExecuteUbergraph_GA_Card_RampingSpells
// 0x0150 (0x0150 - 0x0000)
struct GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionAbilityTargetDataFilter          K2Node_MakeStruct_OrionAbilityTargetDataFilter;    // 0x0008(0x0030)()
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0040(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0078(0x0018)()
	class AActor*                                 Temp_object_Variable;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0098(0x0040)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00D8(0x0020)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    Temp_byte_Variable;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IOrionTeamActorInterface> K2Node_DynamicCast_AsOrion_Team_Actor_Interface;   // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeOrionFilterHandle_ReturnValue;        // 0x0120(0x0010)()
	class UAbilityTask_WaitGameplayEffectApplied_Target* CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells) == 0x000008, "Wrong alignment on GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells");
static_assert(sizeof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells) == 0x000150, "Wrong size on GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, EntryPoint) == 0x000000, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, K2Node_MakeStruct_OrionAbilityTargetDataFilter) == 0x000008, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::K2Node_MakeStruct_OrionAbilityTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, K2Node_CustomEvent_Target) == 0x000038, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, K2Node_CustomEvent_SpecHandle) == 0x000040, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, K2Node_CustomEvent_ActiveHandle) == 0x000058, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, Temp_struct_Variable) == 0x000070, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, Temp_struct_Variable2) == 0x000078, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, Temp_object_Variable) == 0x000090, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, K2Node_MakeStruct_GameplayTagRequirements) == 0x000098, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000D8, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000F8, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, Temp_byte_Variable) == 0x000100, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, K2Node_DynamicCast_AsOrion_Team_Actor_Interface) == 0x000108, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::K2Node_DynamicCast_AsOrion_Team_Actor_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, CallFunc_GetTeamNum_ReturnValue) == 0x000119, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, CallFunc_MakeOrionFilterHandle_ReturnValue) == 0x000120, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::CallFunc_MakeOrionFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue) == 0x000130, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, CallFunc_GetAbilityLevel_ReturnValue) == 0x00013C, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000140, "Member 'GA_Card_RampingSpells_C_ExecuteUbergraph_GA_Card_RampingSpells::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Card_RampingSpells.GA_Card_RampingSpells_C.OnApplied_EC3ED76D4363ABF0DFFCB2921826903B
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B) == 0x000008, "Wrong alignment on GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B");
static_assert(sizeof(GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B) == 0x000028, "Wrong size on GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B");
static_assert(offsetof(GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B, Target) == 0x000000, "Member 'GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B::Target' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B, SpecHandle) == 0x000008, "Member 'GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B, ActiveHandle) == 0x000020, "Member 'GA_Card_RampingSpells_C_OnApplied_EC3ED76D4363ABF0DFFCB2921826903B::ActiveHandle' has a wrong offset!");

}

