#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ManaRecovery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_ManaRecovery.GA_Card_ManaRecovery_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_ManaRecovery_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_ToApply;                                        // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_ThatWasApplied;                                 // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_ManaRecovery(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnStateEnded_8F7E326F463F239398D7DDBAC1380E5B();
	void OnStateInterrupted_8F7E326F463F239398D7DDBAC1380E5B();
	void OnChange_AC79AE624BF4AF82C582628DA7601DCE(bool bMatchesComparison, float CurrentRatio);
	void OnRemoved_A763E87147C4DB6E94C2EEADDCC5C29F(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
	void InvalidHandle_A763E87147C4DB6E94C2EEADDCC5C29F(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_ManaRecovery_C">();
	}
	static class UGA_Card_ManaRecovery_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_ManaRecovery_C>();
	}
};
static_assert(alignof(UGA_Card_ManaRecovery_C) == 0x000010, "Wrong alignment on UGA_Card_ManaRecovery_C");
static_assert(sizeof(UGA_Card_ManaRecovery_C) == 0x000B90, "Wrong size on UGA_Card_ManaRecovery_C");
static_assert(offsetof(UGA_Card_ManaRecovery_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_ManaRecovery_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_ManaRecovery_C, GE_ToApply) == 0x000B78, "Member 'UGA_Card_ManaRecovery_C::GE_ToApply' has a wrong offset!");
static_assert(offsetof(UGA_Card_ManaRecovery_C, GE_ThatWasApplied) == 0x000B80, "Member 'UGA_Card_ManaRecovery_C::GE_ThatWasApplied' has a wrong offset!");

}

