#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ExecutionersRush

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_ExecutionersRush.GA_Card_ExecutionersRush_C.ExecuteUbergraph_GA_Card_ExecutionersRush
// 0x0108 (0x0108 - 0x0000)
struct GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float TimeWaited, const struct FVector& Acceleration)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_TimeWaited;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Acceleration;                   // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_WaitInputPress_WithState* CallFunc_WaitInputPress_WithState_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00CC(0x000C)(IsPlainOldData, NoDestructor)
	class UAbilityTask_ApplyRootMotionJumpForce*  CallFunc_ApplyRootMotionJumpForce_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush) == 0x000008, "Wrong alignment on GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush");
static_assert(sizeof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush) == 0x000108, "Wrong size on GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, EntryPoint) == 0x000000, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, K2Node_CustomEvent_TimeWaited) == 0x000028, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::K2Node_CustomEvent_TimeWaited' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, K2Node_CustomEvent_Acceleration) == 0x00002C, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::K2Node_CustomEvent_Acceleration' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, Temp_struct_Variable) == 0x000038, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, Temp_float_Variable) == 0x000044, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_BreakVector_X) == 0x000048, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_BreakVector_Y) == 0x00004C, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_BreakVector_Z) == 0x000050, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_WaitInputPress_WithState_ReturnValue) == 0x000058, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_WaitInputPress_WithState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_VSizeSquared_ReturnValue) == 0x00006C, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_Less_FloatFloat_ReturnValue) == 0x000070, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, K2Node_CreateDelegate_OutputDelegate4) == 0x000088, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000098, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000A0, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x0000A8, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000B4, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_SelectVector_ReturnValue) == 0x0000C0, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000CC, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_ApplyRootMotionJumpForce_ReturnValue) == 0x0000D8, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_ApplyRootMotionJumpForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, K2Node_CreateDelegate_OutputDelegate5) == 0x0000E0, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_IsValid_ReturnValue2) == 0x0000F0, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_StartAbilityState_ReturnValue) == 0x0000F8, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush, CallFunc_IsValid_ReturnValue3) == 0x000100, "Member 'GA_Card_ExecutionersRush_C_ExecuteUbergraph_GA_Card_ExecutionersRush::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function GA_Card_ExecutionersRush.GA_Card_ExecutionersRush_C.OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7
// 0x0010 (0x0010 - 0x0000)
struct GA_Card_ExecutionersRush_C_OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7 final
{
public:
	float                                         TimeWaited;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Acceleration;                                      // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ExecutionersRush_C_OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7) == 0x000004, "Wrong alignment on GA_Card_ExecutionersRush_C_OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7");
static_assert(sizeof(GA_Card_ExecutionersRush_C_OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7) == 0x000010, "Wrong size on GA_Card_ExecutionersRush_C_OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7");
static_assert(offsetof(GA_Card_ExecutionersRush_C_OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7, TimeWaited) == 0x000000, "Member 'GA_Card_ExecutionersRush_C_OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7::TimeWaited' has a wrong offset!");
static_assert(offsetof(GA_Card_ExecutionersRush_C_OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7, Acceleration) == 0x000004, "Member 'GA_Card_ExecutionersRush_C_OnPress_7BF7F73446E9EEF62B7AEAB2BAEFDBC7::Acceleration' has a wrong offset!");

}

