#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_RevealCriticalTargets

#include "Basic.hpp"

#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_RevealCriticalTargets.GA_Card_RevealCriticalTargets_C.ExecuteUbergraph_GA_Card_RevealCriticalTargets
// 0x0038 (0x0038 - 0x0000)
struct GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionAuraHandle                       CallFunc_BeginAura_ReturnValue;                    // 0x0034(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets) == 0x000008, "Wrong alignment on GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets");
static_assert(sizeof(GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets) == 0x000038, "Wrong size on GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets");
static_assert(offsetof(GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets, EntryPoint) == 0x000000, "Member 'GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets, CallFunc_StartAbilityState_ReturnValue) == 0x000018, "Member 'GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets, CallFunc_BeginAura_ReturnValue) == 0x000034, "Member 'GA_Card_RevealCriticalTargets_C_ExecuteUbergraph_GA_Card_RevealCriticalTargets::CallFunc_BeginAura_ReturnValue' has a wrong offset!");

}

