#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_SiphonSpeed

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_SiphonSpeed.GA_Card_SiphonSpeed_C.ExecuteUbergraph_GA_Card_SiphonSpeed
// 0x0120 (0x0120 - 0x0000)
struct GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x0020(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0048(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0060(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable2;                             // 0x0078(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00C0(0x0020)()
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageDealt_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed) == 0x000008, "Wrong alignment on GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed");
static_assert(sizeof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed) == 0x000120, "Wrong size on GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, EntryPoint) == 0x000000, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, K2Node_CustomEvent_AuxillaryASC) == 0x000018, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, K2Node_CustomEvent_DamageInfo) == 0x000020, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, K2Node_CustomEvent_SpecHandle) == 0x000048, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, Temp_struct_Variable) == 0x000060, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, Temp_struct_Variable2) == 0x000078, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, Temp_object_Variable) == 0x0000A0, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, K2Node_CreateDelegate_OutputDelegate2) == 0x0000A8, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_GetOwner_ReturnValue) == 0x0000B8, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000C0, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_WaitDelay_ReturnValue) == 0x0000E0, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_WaitDamageDealt_ReturnValue) == 0x0000E8, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_WaitDamageDealt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_IsValid_ReturnValue2) == 0x0000F1, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_GetAbilityLevel_ReturnValue) == 0x0000F4, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000F8, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000100, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_GetAbilityLevel_ReturnValue2) == 0x000110, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000114, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_GetValueAtLevel_ReturnValue) == 0x000118, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_K2_CommitAbility_ReturnValue) == 0x00011C, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00011D, "Member 'GA_Card_SiphonSpeed_C_ExecuteUbergraph_GA_Card_SiphonSpeed::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Card_SiphonSpeed.GA_Card_SiphonSpeed_C.OnDamage_E437A28B40F0C7F6769323988C819E1C
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C) == 0x000008, "Wrong alignment on GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C");
static_assert(sizeof(GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C) == 0x000048, "Wrong size on GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C");
static_assert(offsetof(GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C, AuxillaryASC) == 0x000000, "Member 'GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C, DamageInfo) == 0x000008, "Member 'GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C, SpecHandle) == 0x000030, "Member 'GA_Card_SiphonSpeed_C_OnDamage_E437A28B40F0C7F6769323988C819E1C::SpecHandle' has a wrong offset!");

}

