#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_SacrificialLink

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_SacrificialLink.GA_Card_SacrificialLink_C
// 0x0080 (0x0BF0 - 0x0B70)
class UGA_Card_SacrificialLink_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 TargetingCamera;                                   // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LinkRange;                                         // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnedLink;                                       // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_HealthReduction;                                // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               TagForDamageGE;                                    // 0x0B98(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            DamageGE;                                          // 0x0BD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_HealthReductionSelf;                            // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_SacrificialLink(int32 EntryPoint);
	void TetherBroken(class AActor* Actor, EEndPlayReason EndPlayReason);
	void Blocked_28F6FD7E4166448E0E587A89227D44CB(const struct FGameplayEffectSpecHandle& BlockedSpec, const struct FActiveGameplayEffectHandle& ImmunityGameplayEffectHandle);
	void Blocked_7E1A2DD84F59D2EF18C6508610B90CCD(const struct FGameplayEffectSpecHandle& BlockedSpec, const struct FActiveGameplayEffectHandle& ImmunityGameplayEffectHandle);
	void Cancelled_E833971D4E34400BAD1902B43FA02C65(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_E833971D4E34400BAD1902B43FA02C65(const struct FGameplayAbilityTargetDataHandle& Targets);
	void FailedToSpawn_2C074FCF462C43F0EB9794821319367A(class AActor* SpawnedActor);
	void K2_ActivateAbility();
	void NotAuthority_2C074FCF462C43F0EB9794821319367A(class AActor* SpawnedActor);
	void OnStateEnded_C3D70A214AA9D817E46E80AB013CBE61();
	void OnStateInterrupted_C3D70A214AA9D817E46E80AB013CBE61();
	void Removed_02FA7E9741F179FDA53E0592B5696F8C();
	void Removed_C9E3F339499A588BA99ACFA5D7E21B9B();
	void Success_2C074FCF462C43F0EB9794821319367A(class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_SacrificialLink_C">();
	}
	static class UGA_Card_SacrificialLink_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_SacrificialLink_C>();
	}
};
static_assert(alignof(UGA_Card_SacrificialLink_C) == 0x000010, "Wrong alignment on UGA_Card_SacrificialLink_C");
static_assert(sizeof(UGA_Card_SacrificialLink_C) == 0x000BF0, "Wrong size on UGA_Card_SacrificialLink_C");
static_assert(offsetof(UGA_Card_SacrificialLink_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_SacrificialLink_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_SacrificialLink_C, TargetingCamera) == 0x000B78, "Member 'UGA_Card_SacrificialLink_C::TargetingCamera' has a wrong offset!");
static_assert(offsetof(UGA_Card_SacrificialLink_C, LinkRange) == 0x000B80, "Member 'UGA_Card_SacrificialLink_C::LinkRange' has a wrong offset!");
static_assert(offsetof(UGA_Card_SacrificialLink_C, SpawnedLink) == 0x000B88, "Member 'UGA_Card_SacrificialLink_C::SpawnedLink' has a wrong offset!");
static_assert(offsetof(UGA_Card_SacrificialLink_C, GE_HealthReduction) == 0x000B90, "Member 'UGA_Card_SacrificialLink_C::GE_HealthReduction' has a wrong offset!");
static_assert(offsetof(UGA_Card_SacrificialLink_C, TagForDamageGE) == 0x000B98, "Member 'UGA_Card_SacrificialLink_C::TagForDamageGE' has a wrong offset!");
static_assert(offsetof(UGA_Card_SacrificialLink_C, DamageGE) == 0x000BD8, "Member 'UGA_Card_SacrificialLink_C::DamageGE' has a wrong offset!");
static_assert(offsetof(UGA_Card_SacrificialLink_C, GE_HealthReductionSelf) == 0x000BE0, "Member 'UGA_Card_SacrificialLink_C::GE_HealthReductionSelf' has a wrong offset!");

}

