#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Standard_StasisEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Standard_StasisEffect.GA_Card_Standard_StasisEffect_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_Standard_StasisEffect_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class FName                                   RootMotionName;                                    // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Stasis_GE;                                         // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DurationOfStasisEffect;                            // 0x0B88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Standard_StasisEffect(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnStateEnded_904701C54F2B92228593BD9D95B68687();
	void OnStateInterrupted_904701C54F2B92228593BD9D95B68687();
	void OnTimedOut_3D73B89F4B05FA5E52A7CDB31FB777F9();
	void OnTimedOutAndDestinationReached_3D73B89F4B05FA5E52A7CDB31FB777F9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Standard_StasisEffect_C">();
	}
	static class UGA_Card_Standard_StasisEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Standard_StasisEffect_C>();
	}
};
static_assert(alignof(UGA_Card_Standard_StasisEffect_C) == 0x000010, "Wrong alignment on UGA_Card_Standard_StasisEffect_C");
static_assert(sizeof(UGA_Card_Standard_StasisEffect_C) == 0x000B90, "Wrong size on UGA_Card_Standard_StasisEffect_C");
static_assert(offsetof(UGA_Card_Standard_StasisEffect_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Standard_StasisEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Standard_StasisEffect_C, RootMotionName) == 0x000B78, "Member 'UGA_Card_Standard_StasisEffect_C::RootMotionName' has a wrong offset!");
static_assert(offsetof(UGA_Card_Standard_StasisEffect_C, Stasis_GE) == 0x000B80, "Member 'UGA_Card_Standard_StasisEffect_C::Stasis_GE' has a wrong offset!");
static_assert(offsetof(UGA_Card_Standard_StasisEffect_C, DurationOfStasisEffect) == 0x000B88, "Member 'UGA_Card_Standard_StasisEffect_C::DurationOfStasisEffect' has a wrong offset!");

}

