#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_IceBurst

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_IceBurst.GA_Card_IceBurst_C.ExecuteUbergraph_GA_Card_IceBurst
// 0x0138 (0x0138 - 0x0000)
struct GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x0010(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0038(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0050(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable2;                             // 0x0068(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00B8(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageDealt_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_SphereAroundActor_ReturnValue;            // 0x0100(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2; // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst) == 0x000008, "Wrong alignment on GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst");
static_assert(sizeof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst) == 0x000138, "Wrong size on GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, EntryPoint) == 0x000000, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, K2Node_CustomEvent_AuxillaryASC) == 0x000008, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, K2Node_CustomEvent_DamageInfo) == 0x000010, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, K2Node_CustomEvent_SpecHandle) == 0x000038, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, Temp_struct_Variable) == 0x000050, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, Temp_struct_Variable2) == 0x000068, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, Temp_object_Variable) == 0x000090, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue) == 0x0000B0, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000B8, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000D8, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_GetAbilityLevel_ReturnValue) == 0x0000E8, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000EC, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000F0, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_WaitDamageDealt_ReturnValue) == 0x0000F8, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_WaitDamageDealt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_SphereAroundActor_ReturnValue) == 0x000100, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_SphereAroundActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2) == 0x000120, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst, CallFunc_K2_CommitAbility_ReturnValue) == 0x000131, "Member 'GA_Card_IceBurst_C_ExecuteUbergraph_GA_Card_IceBurst::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_Card_IceBurst.GA_Card_IceBurst_C.OnDamage_23DE6F254332FED4F83A22A3116EEC5E
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E) == 0x000008, "Wrong alignment on GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E");
static_assert(sizeof(GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E) == 0x000048, "Wrong size on GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E");
static_assert(offsetof(GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E, AuxillaryASC) == 0x000000, "Member 'GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E, DamageInfo) == 0x000008, "Member 'GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E, SpecHandle) == 0x000030, "Member 'GA_Card_IceBurst_C_OnDamage_23DE6F254332FED4F83A22A3116EEC5E::SpecHandle' has a wrong offset!");

}

