#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_GagOrder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_GagOrder.GA_Card_GagOrder_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_GagOrder_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           GameplayCue;                                       // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_ToApply;                                        // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_GagOrder(int32 EntryPoint);
	void Cancelled_EB91821A4E6353598C67EC85895C4C5C(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_EB91821A4E6353598C67EC85895C4C5C(const struct FGameplayAbilityTargetDataHandle& Targets);
	void K2_ActivateAbility();
	void OnStateEnded_A7C0228B4F1390F42DDB25BAC9B4A0DD();
	void OnStateInterrupted_A7C0228B4F1390F42DDB25BAC9B4A0DD();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_GagOrder_C">();
	}
	static class UGA_Card_GagOrder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_GagOrder_C>();
	}
};
static_assert(alignof(UGA_Card_GagOrder_C) == 0x000010, "Wrong alignment on UGA_Card_GagOrder_C");
static_assert(sizeof(UGA_Card_GagOrder_C) == 0x000B90, "Wrong size on UGA_Card_GagOrder_C");
static_assert(offsetof(UGA_Card_GagOrder_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_GagOrder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_GagOrder_C, GameplayCue) == 0x000B78, "Member 'UGA_Card_GagOrder_C::GameplayCue' has a wrong offset!");
static_assert(offsetof(UGA_Card_GagOrder_C, GE_ToApply) == 0x000B80, "Member 'UGA_Card_GagOrder_C::GE_ToApply' has a wrong offset!");

}

