#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_PBAOE_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_PBAOE_Parent.GA_Card_PBAOE_Parent_C.ExecuteUbergraph_GA_Card_PBAOE_Parent
// 0x0068 (0x0068 - 0x0000)
struct GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRowHandle_OutResult;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRowHandle_OutXY;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_SphereAroundActor_ReturnValue;            // 0x0018(0x0020)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2; // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent) == 0x000008, "Wrong alignment on GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent");
static_assert(sizeof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent) == 0x000068, "Wrong size on GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, EntryPoint) == 0x000000, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_GetAbilityLevel_ReturnValue) == 0x000004, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_EvaluateCurveTableRowHandle_OutResult) == 0x000010, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_EvaluateCurveTableRowHandle_OutResult' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_EvaluateCurveTableRowHandle_OutXY) == 0x000014, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_EvaluateCurveTableRowHandle_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_SphereAroundActor_ReturnValue) == 0x000018, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_SphereAroundActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000038, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000040, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2) == 0x000050, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_IsValidClass_ReturnValue) == 0x000060, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, K2Node_SwitchEnum_CmpSuccess) == 0x000061, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent, CallFunc_K2_CommitAbility_ReturnValue) == 0x000062, "Member 'GA_Card_PBAOE_Parent_C_ExecuteUbergraph_GA_Card_PBAOE_Parent::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

}

