#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_PrimeBuff

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Aura_PrimeBuff.GA_Card_Aura_PrimeBuff_C
// 0x0060 (0x0BD0 - 0x0B70)
class UGA_Card_Aura_PrimeBuff_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FOrionFilterAndEffectsContainer        FilterAndEffects;                                  // 0x0B78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         AuraRadius;                                        // 0x0B98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           PrimeBuffTag;                                      // 0x0BC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Aura_PrimeBuff(int32 EntryPoint);
	void Added_9DC397BD40A8EF884E7AEBA6EFAE6207();
	void K2_ActivateAbility();
	void OnApplied_D9B60F364036EF76204502B496E301DD(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);
	void OnStateEnded_2B0871304D4FF6A4E62D3AA0B5295ADB();
	void OnStateInterrupted_2B0871304D4FF6A4E62D3AA0B5295ADB();
	void Removed_04C2247146E0C2ACAB0A788E2CBB9F3F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Aura_PrimeBuff_C">();
	}
	static class UGA_Card_Aura_PrimeBuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Aura_PrimeBuff_C>();
	}
};
static_assert(alignof(UGA_Card_Aura_PrimeBuff_C) == 0x000010, "Wrong alignment on UGA_Card_Aura_PrimeBuff_C");
static_assert(sizeof(UGA_Card_Aura_PrimeBuff_C) == 0x000BD0, "Wrong size on UGA_Card_Aura_PrimeBuff_C");
static_assert(offsetof(UGA_Card_Aura_PrimeBuff_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Aura_PrimeBuff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_PrimeBuff_C, FilterAndEffects) == 0x000B78, "Member 'UGA_Card_Aura_PrimeBuff_C::FilterAndEffects' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_PrimeBuff_C, AuraRadius) == 0x000B98, "Member 'UGA_Card_Aura_PrimeBuff_C::AuraRadius' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_PrimeBuff_C, PrimeBuffTag) == 0x000BC0, "Member 'UGA_Card_Aura_PrimeBuff_C::PrimeBuffTag' has a wrong offset!");

}

