#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_SharedWisdom

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_SharedWisdom.GA_Card_SharedWisdom_C.ExecuteUbergraph_GA_Card_SharedWisdom
// 0x0400 (0x0400 - 0x0000)
struct GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload2;                       // 0x0098(0x00A8)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0140(0x00A8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate7;             // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0208(0x00A8)()
	struct FGameplayEventData                     Temp_struct_Variable2;                             // 0x02B0(0x00A8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue2;           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0368(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0390(0x0030)(IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x03DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DB[0x5];                                      // 0x03DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x03EC(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom) == 0x000010, "Wrong alignment on GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom");
static_assert(sizeof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom) == 0x000400, "Wrong size on GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, EntryPoint) == 0x000000, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CustomEvent_SpawnedActor3) == 0x000008, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CustomEvent_SpawnedActor2) == 0x000020, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CustomEvent_SpawnedActor) == 0x000038, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, Temp_object_Variable) == 0x000050, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CreateDelegate_OutputDelegate5) == 0x000068, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_StartAbilityState_ReturnValue) == 0x000078, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CreateDelegate_OutputDelegate6) == 0x000080, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CustomEvent_Payload2) == 0x000098, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CustomEvent_Payload2' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, Temp_struct_Variable) == 0x000140, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0001E8, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_IsValid_ReturnValue2) == 0x0001F0, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CreateDelegate_OutputDelegate7) == 0x0001F8, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CustomEvent_Payload) == 0x000208, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, Temp_struct_Variable2) == 0x0002B0, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_WaitGameplayEvent_ReturnValue2) == 0x000358, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_WaitGameplayEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_IsValid_ReturnValue3) == 0x000360, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, K2Node_CreateDelegate_OutputDelegate8) == 0x000368, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_WaitNetSync_ReturnValue) == 0x000378, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000380, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_GetTransform_ReturnValue) == 0x000390, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_GetActorTeam_ReturnValue) == 0x0003C0, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x0003C8, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0003D0, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_BeginSpawningActor_ReturnValue) == 0x0003D8, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_IsValid_ReturnValue4) == 0x0003D9, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_IsValid_ReturnValue5) == 0x0003DA, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0003E0, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_IsValid_ReturnValue6) == 0x0003E8, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0003EC, "Member 'GA_Card_SharedWisdom_C_ExecuteUbergraph_GA_Card_SharedWisdom::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Card_SharedWisdom.GA_Card_SharedWisdom_C.EventReceived_1DDCDE4F46E76670F1B154B5DCF3D2D1
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Card_SharedWisdom_C_EventReceived_1DDCDE4F46E76670F1B154B5DCF3D2D1 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_SharedWisdom_C_EventReceived_1DDCDE4F46E76670F1B154B5DCF3D2D1) == 0x000008, "Wrong alignment on GA_Card_SharedWisdom_C_EventReceived_1DDCDE4F46E76670F1B154B5DCF3D2D1");
static_assert(sizeof(GA_Card_SharedWisdom_C_EventReceived_1DDCDE4F46E76670F1B154B5DCF3D2D1) == 0x0000A8, "Wrong size on GA_Card_SharedWisdom_C_EventReceived_1DDCDE4F46E76670F1B154B5DCF3D2D1");
static_assert(offsetof(GA_Card_SharedWisdom_C_EventReceived_1DDCDE4F46E76670F1B154B5DCF3D2D1, Payload) == 0x000000, "Member 'GA_Card_SharedWisdom_C_EventReceived_1DDCDE4F46E76670F1B154B5DCF3D2D1::Payload' has a wrong offset!");

// Function GA_Card_SharedWisdom.GA_Card_SharedWisdom_C.EventReceived_A95A34DE4407131AC731D9901B0B837F
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Card_SharedWisdom_C_EventReceived_A95A34DE4407131AC731D9901B0B837F final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_SharedWisdom_C_EventReceived_A95A34DE4407131AC731D9901B0B837F) == 0x000008, "Wrong alignment on GA_Card_SharedWisdom_C_EventReceived_A95A34DE4407131AC731D9901B0B837F");
static_assert(sizeof(GA_Card_SharedWisdom_C_EventReceived_A95A34DE4407131AC731D9901B0B837F) == 0x0000A8, "Wrong size on GA_Card_SharedWisdom_C_EventReceived_A95A34DE4407131AC731D9901B0B837F");
static_assert(offsetof(GA_Card_SharedWisdom_C_EventReceived_A95A34DE4407131AC731D9901B0B837F, Payload) == 0x000000, "Member 'GA_Card_SharedWisdom_C_EventReceived_A95A34DE4407131AC731D9901B0B837F::Payload' has a wrong offset!");

// Function GA_Card_SharedWisdom.GA_Card_SharedWisdom_C.FailedToSpawn_B143DB6845AC5231001EC3A424575F8C
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_SharedWisdom_C_FailedToSpawn_B143DB6845AC5231001EC3A424575F8C final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_SharedWisdom_C_FailedToSpawn_B143DB6845AC5231001EC3A424575F8C) == 0x000008, "Wrong alignment on GA_Card_SharedWisdom_C_FailedToSpawn_B143DB6845AC5231001EC3A424575F8C");
static_assert(sizeof(GA_Card_SharedWisdom_C_FailedToSpawn_B143DB6845AC5231001EC3A424575F8C) == 0x000008, "Wrong size on GA_Card_SharedWisdom_C_FailedToSpawn_B143DB6845AC5231001EC3A424575F8C");
static_assert(offsetof(GA_Card_SharedWisdom_C_FailedToSpawn_B143DB6845AC5231001EC3A424575F8C, SpawnedActor) == 0x000000, "Member 'GA_Card_SharedWisdom_C_FailedToSpawn_B143DB6845AC5231001EC3A424575F8C::SpawnedActor' has a wrong offset!");

// Function GA_Card_SharedWisdom.GA_Card_SharedWisdom_C.NotAuthority_B143DB6845AC5231001EC3A424575F8C
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_SharedWisdom_C_NotAuthority_B143DB6845AC5231001EC3A424575F8C final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_SharedWisdom_C_NotAuthority_B143DB6845AC5231001EC3A424575F8C) == 0x000008, "Wrong alignment on GA_Card_SharedWisdom_C_NotAuthority_B143DB6845AC5231001EC3A424575F8C");
static_assert(sizeof(GA_Card_SharedWisdom_C_NotAuthority_B143DB6845AC5231001EC3A424575F8C) == 0x000008, "Wrong size on GA_Card_SharedWisdom_C_NotAuthority_B143DB6845AC5231001EC3A424575F8C");
static_assert(offsetof(GA_Card_SharedWisdom_C_NotAuthority_B143DB6845AC5231001EC3A424575F8C, SpawnedActor) == 0x000000, "Member 'GA_Card_SharedWisdom_C_NotAuthority_B143DB6845AC5231001EC3A424575F8C::SpawnedActor' has a wrong offset!");

// Function GA_Card_SharedWisdom.GA_Card_SharedWisdom_C.Success_B143DB6845AC5231001EC3A424575F8C
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_SharedWisdom_C_Success_B143DB6845AC5231001EC3A424575F8C final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_SharedWisdom_C_Success_B143DB6845AC5231001EC3A424575F8C) == 0x000008, "Wrong alignment on GA_Card_SharedWisdom_C_Success_B143DB6845AC5231001EC3A424575F8C");
static_assert(sizeof(GA_Card_SharedWisdom_C_Success_B143DB6845AC5231001EC3A424575F8C) == 0x000008, "Wrong size on GA_Card_SharedWisdom_C_Success_B143DB6845AC5231001EC3A424575F8C");
static_assert(offsetof(GA_Card_SharedWisdom_C_Success_B143DB6845AC5231001EC3A424575F8C, SpawnedActor) == 0x000000, "Member 'GA_Card_SharedWisdom_C_Success_B143DB6845AC5231001EC3A424575F8C::SpawnedActor' has a wrong offset!");

}

