#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Chain_Lightning

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Chain_Lightning.GA_Card_Chain_Lightning_C.ExecuteUbergraph_GA_Card_Chain_Lightning
// 0x0110 (0x0110 - 0x0000)
struct GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetCardTargets_ReturnValue;               // 0x0008(0x0020)()
	class AActor*                                 CallFunc_GetPrimaryActorFromTargetData_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate3;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00E4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning) == 0x000010, "Wrong alignment on GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning");
static_assert(sizeof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning) == 0x000110, "Wrong size on GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, EntryPoint) == 0x000000, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_GetCardTargets_ReturnValue) == 0x000008, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_GetCardTargets_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_GetPrimaryActorFromTargetData_ReturnValue) == 0x000028, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_GetPrimaryActorFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, K2Node_CustomEvent_SpawnedActor3) == 0x000070, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x000078, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000080, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_BeginSpawningActor_ReturnValue) == 0x000088, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, K2Node_CreateDelegate_OutputDelegate2) == 0x000090, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, K2Node_CustomEvent_SpawnedActor2) == 0x0000A8, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, K2Node_CustomEvent_SpawnedActor) == 0x0000B0, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B8, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, Temp_object_Variable) == 0x0000C8, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, Temp_bool_Variable) == 0x0000D0, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000D8, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_GetActorTeam_ReturnValue) == 0x0000E0, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000E4, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0000F0, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000F8, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000109, "Member 'GA_Card_Chain_Lightning_C_ExecuteUbergraph_GA_Card_Chain_Lightning::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function GA_Card_Chain_Lightning.GA_Card_Chain_Lightning_C.FailedToSpawn_CED839724F6166F7875E39B72E2C6159
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Chain_Lightning_C_FailedToSpawn_CED839724F6166F7875E39B72E2C6159 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Chain_Lightning_C_FailedToSpawn_CED839724F6166F7875E39B72E2C6159) == 0x000008, "Wrong alignment on GA_Card_Chain_Lightning_C_FailedToSpawn_CED839724F6166F7875E39B72E2C6159");
static_assert(sizeof(GA_Card_Chain_Lightning_C_FailedToSpawn_CED839724F6166F7875E39B72E2C6159) == 0x000008, "Wrong size on GA_Card_Chain_Lightning_C_FailedToSpawn_CED839724F6166F7875E39B72E2C6159");
static_assert(offsetof(GA_Card_Chain_Lightning_C_FailedToSpawn_CED839724F6166F7875E39B72E2C6159, SpawnedActor) == 0x000000, "Member 'GA_Card_Chain_Lightning_C_FailedToSpawn_CED839724F6166F7875E39B72E2C6159::SpawnedActor' has a wrong offset!");

// Function GA_Card_Chain_Lightning.GA_Card_Chain_Lightning_C.NotAuthority_CED839724F6166F7875E39B72E2C6159
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Chain_Lightning_C_NotAuthority_CED839724F6166F7875E39B72E2C6159 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Chain_Lightning_C_NotAuthority_CED839724F6166F7875E39B72E2C6159) == 0x000008, "Wrong alignment on GA_Card_Chain_Lightning_C_NotAuthority_CED839724F6166F7875E39B72E2C6159");
static_assert(sizeof(GA_Card_Chain_Lightning_C_NotAuthority_CED839724F6166F7875E39B72E2C6159) == 0x000008, "Wrong size on GA_Card_Chain_Lightning_C_NotAuthority_CED839724F6166F7875E39B72E2C6159");
static_assert(offsetof(GA_Card_Chain_Lightning_C_NotAuthority_CED839724F6166F7875E39B72E2C6159, SpawnedActor) == 0x000000, "Member 'GA_Card_Chain_Lightning_C_NotAuthority_CED839724F6166F7875E39B72E2C6159::SpawnedActor' has a wrong offset!");

// Function GA_Card_Chain_Lightning.GA_Card_Chain_Lightning_C.Success_CED839724F6166F7875E39B72E2C6159
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Chain_Lightning_C_Success_CED839724F6166F7875E39B72E2C6159 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Chain_Lightning_C_Success_CED839724F6166F7875E39B72E2C6159) == 0x000008, "Wrong alignment on GA_Card_Chain_Lightning_C_Success_CED839724F6166F7875E39B72E2C6159");
static_assert(sizeof(GA_Card_Chain_Lightning_C_Success_CED839724F6166F7875E39B72E2C6159) == 0x000008, "Wrong size on GA_Card_Chain_Lightning_C_Success_CED839724F6166F7875E39B72E2C6159");
static_assert(offsetof(GA_Card_Chain_Lightning_C_Success_CED839724F6166F7875E39B72E2C6159, SpawnedActor) == 0x000000, "Member 'GA_Card_Chain_Lightning_C_Success_CED839724F6166F7875E39B72E2C6159::SpawnedActor' has a wrong offset!");

}

