#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ArmoredShadowWard

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_ArmoredShadowWard.GA_Card_ArmoredShadowWard_C.ExecuteUbergraph_GA_Card_ArmoredShadowWard
// 0x0118 (0x0118 - 0x0000)
struct GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0008(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0038(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0068(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionVisionWard*                       K2Node_CustomEvent_SpawnedWard3;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionVisionWard* SpawnedWard)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionVisionWard*                       K2Node_CustomEvent_SpawnedWard2;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionVisionWard* SpawnedWard)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionVisionWard*                       K2Node_CustomEvent_SpawnedWard;                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionVisionWard* SpawnedWard)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionVisionWard*                       Temp_object_Variable;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionPlayerState_Game*                 K2Node_DynamicCast_AsOrion_Player_State_Game;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnWard*            CallFunc_SpawnWard_ReturnValue;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionVisionWard*                       CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard) == 0x000008, "Wrong alignment on GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard");
static_assert(sizeof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard) == 0x000118, "Wrong size on GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, EntryPoint) == 0x000000, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CustomEvent_Targets2) == 0x000008, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CustomEvent_Targets) == 0x000038, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, Temp_struct_Variable) == 0x000068, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, CallFunc_StartTargeting_ReturnValue) == 0x000088, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CustomEvent_SpawnedWard3) == 0x000098, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CustomEvent_SpawnedWard3' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A0, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CustomEvent_SpawnedWard2) == 0x0000B0, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CustomEvent_SpawnedWard2' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CreateDelegate_OutputDelegate4) == 0x0000B8, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CustomEvent_SpawnedWard) == 0x0000C8, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CustomEvent_SpawnedWard' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_CreateDelegate_OutputDelegate5) == 0x0000D0, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, Temp_object_Variable) == 0x0000E0, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0000E8, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_DynamicCast_AsOrion_Player_State_Game) == 0x0000F0, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_DynamicCast_AsOrion_Player_State_Game' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000F9, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, CallFunc_GetActorTeam_ReturnValue) == 0x0000FA, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, CallFunc_SpawnWard_ReturnValue) == 0x000100, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::CallFunc_SpawnWard_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000108, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, CallFunc_BeginSpawningActor_ReturnValue) == 0x000110, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard, CallFunc_IsValid_ReturnValue2) == 0x000111, "Member 'GA_Card_ArmoredShadowWard_C_ExecuteUbergraph_GA_Card_ArmoredShadowWard::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function GA_Card_ArmoredShadowWard.GA_Card_ArmoredShadowWard_C.Cancelled_38CBAF614746EC5FD97C5CA8245F8315
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ArmoredShadowWard_C_Cancelled_38CBAF614746EC5FD97C5CA8245F8315 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ArmoredShadowWard_C_Cancelled_38CBAF614746EC5FD97C5CA8245F8315) == 0x000008, "Wrong alignment on GA_Card_ArmoredShadowWard_C_Cancelled_38CBAF614746EC5FD97C5CA8245F8315");
static_assert(sizeof(GA_Card_ArmoredShadowWard_C_Cancelled_38CBAF614746EC5FD97C5CA8245F8315) == 0x000020, "Wrong size on GA_Card_ArmoredShadowWard_C_Cancelled_38CBAF614746EC5FD97C5CA8245F8315");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_Cancelled_38CBAF614746EC5FD97C5CA8245F8315, Targets) == 0x000000, "Member 'GA_Card_ArmoredShadowWard_C_Cancelled_38CBAF614746EC5FD97C5CA8245F8315::Targets' has a wrong offset!");

// Function GA_Card_ArmoredShadowWard.GA_Card_ArmoredShadowWard_C.Confirmed_38CBAF614746EC5FD97C5CA8245F8315
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ArmoredShadowWard_C_Confirmed_38CBAF614746EC5FD97C5CA8245F8315 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ArmoredShadowWard_C_Confirmed_38CBAF614746EC5FD97C5CA8245F8315) == 0x000008, "Wrong alignment on GA_Card_ArmoredShadowWard_C_Confirmed_38CBAF614746EC5FD97C5CA8245F8315");
static_assert(sizeof(GA_Card_ArmoredShadowWard_C_Confirmed_38CBAF614746EC5FD97C5CA8245F8315) == 0x000020, "Wrong size on GA_Card_ArmoredShadowWard_C_Confirmed_38CBAF614746EC5FD97C5CA8245F8315");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_Confirmed_38CBAF614746EC5FD97C5CA8245F8315, Targets) == 0x000000, "Member 'GA_Card_ArmoredShadowWard_C_Confirmed_38CBAF614746EC5FD97C5CA8245F8315::Targets' has a wrong offset!");

// Function GA_Card_ArmoredShadowWard.GA_Card_ArmoredShadowWard_C.FailedToSpawn_32CA5A014CE57E88751804A9765C0A58
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ArmoredShadowWard_C_FailedToSpawn_32CA5A014CE57E88751804A9765C0A58 final
{
public:
	class AOrionVisionWard*                       SpawnedWard;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ArmoredShadowWard_C_FailedToSpawn_32CA5A014CE57E88751804A9765C0A58) == 0x000008, "Wrong alignment on GA_Card_ArmoredShadowWard_C_FailedToSpawn_32CA5A014CE57E88751804A9765C0A58");
static_assert(sizeof(GA_Card_ArmoredShadowWard_C_FailedToSpawn_32CA5A014CE57E88751804A9765C0A58) == 0x000008, "Wrong size on GA_Card_ArmoredShadowWard_C_FailedToSpawn_32CA5A014CE57E88751804A9765C0A58");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_FailedToSpawn_32CA5A014CE57E88751804A9765C0A58, SpawnedWard) == 0x000000, "Member 'GA_Card_ArmoredShadowWard_C_FailedToSpawn_32CA5A014CE57E88751804A9765C0A58::SpawnedWard' has a wrong offset!");

// Function GA_Card_ArmoredShadowWard.GA_Card_ArmoredShadowWard_C.NotAuthority_32CA5A014CE57E88751804A9765C0A58
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ArmoredShadowWard_C_NotAuthority_32CA5A014CE57E88751804A9765C0A58 final
{
public:
	class AOrionVisionWard*                       SpawnedWard;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ArmoredShadowWard_C_NotAuthority_32CA5A014CE57E88751804A9765C0A58) == 0x000008, "Wrong alignment on GA_Card_ArmoredShadowWard_C_NotAuthority_32CA5A014CE57E88751804A9765C0A58");
static_assert(sizeof(GA_Card_ArmoredShadowWard_C_NotAuthority_32CA5A014CE57E88751804A9765C0A58) == 0x000008, "Wrong size on GA_Card_ArmoredShadowWard_C_NotAuthority_32CA5A014CE57E88751804A9765C0A58");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_NotAuthority_32CA5A014CE57E88751804A9765C0A58, SpawnedWard) == 0x000000, "Member 'GA_Card_ArmoredShadowWard_C_NotAuthority_32CA5A014CE57E88751804A9765C0A58::SpawnedWard' has a wrong offset!");

// Function GA_Card_ArmoredShadowWard.GA_Card_ArmoredShadowWard_C.Success_32CA5A014CE57E88751804A9765C0A58
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ArmoredShadowWard_C_Success_32CA5A014CE57E88751804A9765C0A58 final
{
public:
	class AOrionVisionWard*                       SpawnedWard;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ArmoredShadowWard_C_Success_32CA5A014CE57E88751804A9765C0A58) == 0x000008, "Wrong alignment on GA_Card_ArmoredShadowWard_C_Success_32CA5A014CE57E88751804A9765C0A58");
static_assert(sizeof(GA_Card_ArmoredShadowWard_C_Success_32CA5A014CE57E88751804A9765C0A58) == 0x000008, "Wrong size on GA_Card_ArmoredShadowWard_C_Success_32CA5A014CE57E88751804A9765C0A58");
static_assert(offsetof(GA_Card_ArmoredShadowWard_C_Success_32CA5A014CE57E88751804A9765C0A58, SpawnedWard) == 0x000000, "Member 'GA_Card_ArmoredShadowWard_C_Success_32CA5A014CE57E88751804A9765C0A58::SpawnedWard' has a wrong offset!");

}

