#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Core_Boss_Spawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Core_Boss_Spawn.GA_Core_Boss_Spawn_C
// 0x0030 (0x0BA0 - 0x0B70)
class UGA_Core_Boss_Spawn_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           LandingAnim;                                       // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            InvulnerabilityGE;                                 // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Invulnerability;                                // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FallDuration;                                      // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Core_Boss_Spawn(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnBlendOut_0A0FBD5E480D67C6A07B84ADAAC82737(class FName NotifyName);
	void OnCancelled_0A0FBD5E480D67C6A07B84ADAAC82737(class FName NotifyName);
	void OnCompleted_0A0FBD5E480D67C6A07B84ADAAC82737(class FName NotifyName);
	void OnInterrupted_0A0FBD5E480D67C6A07B84ADAAC82737(class FName NotifyName);
	void OnNotifyBegin_0A0FBD5E480D67C6A07B84ADAAC82737(class FName NotifyName);
	void OnNotifyEnd_0A0FBD5E480D67C6A07B84ADAAC82737(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Core_Boss_Spawn_C">();
	}
	static class UGA_Core_Boss_Spawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Core_Boss_Spawn_C>();
	}
};
static_assert(alignof(UGA_Core_Boss_Spawn_C) == 0x000010, "Wrong alignment on UGA_Core_Boss_Spawn_C");
static_assert(sizeof(UGA_Core_Boss_Spawn_C) == 0x000BA0, "Wrong size on UGA_Core_Boss_Spawn_C");
static_assert(offsetof(UGA_Core_Boss_Spawn_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Core_Boss_Spawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_Spawn_C, LandingAnim) == 0x000B78, "Member 'UGA_Core_Boss_Spawn_C::LandingAnim' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_Spawn_C, InvulnerabilityGE) == 0x000B80, "Member 'UGA_Core_Boss_Spawn_C::InvulnerabilityGE' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_Spawn_C, GE_Invulnerability) == 0x000B88, "Member 'UGA_Core_Boss_Spawn_C::GE_Invulnerability' has a wrong offset!");
static_assert(offsetof(UGA_Core_Boss_Spawn_C, FallDuration) == 0x000B90, "Member 'UGA_Core_Boss_Spawn_C::FallDuration' has a wrong offset!");

}

