#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_CarriedBuff_BurnStructureOnHit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_CarriedBuff_BurnStructureOnHit.GA_CarriedBuff_BurnStructureOnHit_C
// 0x0090 (0x0C00 - 0x0B70)
class UGA_CarriedBuff_BurnStructureOnHit_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTagRequirements               Source_Tags;                                       // 0x0B78(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagRequirements               Target_Tags;                                       // 0x0BB8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_CarriedBuff_BurnStructureOnHit(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnApplied_5096090645BC58FAB37B5CACC775BEF7(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_CarriedBuff_BurnStructureOnHit_C">();
	}
	static class UGA_CarriedBuff_BurnStructureOnHit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_CarriedBuff_BurnStructureOnHit_C>();
	}
};
static_assert(alignof(UGA_CarriedBuff_BurnStructureOnHit_C) == 0x000010, "Wrong alignment on UGA_CarriedBuff_BurnStructureOnHit_C");
static_assert(sizeof(UGA_CarriedBuff_BurnStructureOnHit_C) == 0x000C00, "Wrong size on UGA_CarriedBuff_BurnStructureOnHit_C");
static_assert(offsetof(UGA_CarriedBuff_BurnStructureOnHit_C, UberGraphFrame) == 0x000B70, "Member 'UGA_CarriedBuff_BurnStructureOnHit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_CarriedBuff_BurnStructureOnHit_C, Source_Tags) == 0x000B78, "Member 'UGA_CarriedBuff_BurnStructureOnHit_C::Source_Tags' has a wrong offset!");
static_assert(offsetof(UGA_CarriedBuff_BurnStructureOnHit_C, Target_Tags) == 0x000BB8, "Member 'UGA_CarriedBuff_BurnStructureOnHit_C::Target_Tags' has a wrong offset!");

}

