#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ManaBomb

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_ManaBomb.GA_Card_ManaBomb_C
// 0x0080 (0x0BF0 - 0x0B70)
class UGA_Card_ManaBomb_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GEToApply;                                         // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurveTableRowHandle                   Radius;                                            // 0x0B80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FOrionActorFilter                      TargetFilter;                                      // 0x0B90(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_ManaBomb(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_ManaBomb_C">();
	}
	static class UGA_Card_ManaBomb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_ManaBomb_C>();
	}
};
static_assert(alignof(UGA_Card_ManaBomb_C) == 0x000010, "Wrong alignment on UGA_Card_ManaBomb_C");
static_assert(sizeof(UGA_Card_ManaBomb_C) == 0x000BF0, "Wrong size on UGA_Card_ManaBomb_C");
static_assert(offsetof(UGA_Card_ManaBomb_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_ManaBomb_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_ManaBomb_C, GEToApply) == 0x000B78, "Member 'UGA_Card_ManaBomb_C::GEToApply' has a wrong offset!");
static_assert(offsetof(UGA_Card_ManaBomb_C, Radius) == 0x000B80, "Member 'UGA_Card_ManaBomb_C::Radius' has a wrong offset!");
static_assert(offsetof(UGA_Card_ManaBomb_C, TargetFilter) == 0x000B90, "Member 'UGA_Card_ManaBomb_C::TargetFilter' has a wrong offset!");

}

