#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_SplitPusher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Aura_SplitPusher.GA_Card_Aura_SplitPusher_C.ExecuteUbergraph_GA_Card_Aura_SplitPusher
// 0x0160 (0x0160 - 0x0000)
struct GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue3; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionAuraHandle                       CallFunc_BeginAura_ReturnValue;                    // 0x0140(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher) == 0x000010, "Wrong alignment on GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher");
static_assert(sizeof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher) == 0x000160, "Wrong size on GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, EntryPoint) == 0x000000, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CustomEvent_SpawnedActor3) == 0x000008, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CustomEvent_SpawnedActor2) == 0x000020, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CustomEvent_SpawnedActor) == 0x000038, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, Temp_object_Variable) == 0x000050, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CreateDelegate_OutputDelegate5) == 0x000068, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_StartAbilityState_ReturnValue) == 0x000078, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CreateDelegate_OutputDelegate6) == 0x000088, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000098, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, Temp_bool_Variable) == 0x0000A0, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_IsValid_ReturnValue2) == 0x0000A1, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_CreateDelegate_OutputDelegate7) == 0x0000A8, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0000B8, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_GetTransform_ReturnValue) == 0x0000D0, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_GetActorTeam_ReturnValue) == 0x000100, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x000108, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000110, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_BeginSpawningActor_ReturnValue) == 0x000118, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_IsValid_ReturnValue3) == 0x000119, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_IsValid_ReturnValue4) == 0x00011A, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000120, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_GetAbilityLevel_ReturnValue) == 0x000128, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00012C, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_GetValueAtLevel_ReturnValue) == 0x000130, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_IsValid_ReturnValue5) == 0x000134, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_GetAvatarActorFromActorInfo_ReturnValue3) == 0x000138, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_GetAvatarActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_BeginAura_ReturnValue) == 0x000140, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_BeginAura_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000148, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000159, "Member 'GA_Card_Aura_SplitPusher_C_ExecuteUbergraph_GA_Card_Aura_SplitPusher::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function GA_Card_Aura_SplitPusher.GA_Card_Aura_SplitPusher_C.FailedToSpawn_C261E43E423AB52F62AA068841703EBF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Aura_SplitPusher_C_FailedToSpawn_C261E43E423AB52F62AA068841703EBF final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_SplitPusher_C_FailedToSpawn_C261E43E423AB52F62AA068841703EBF) == 0x000008, "Wrong alignment on GA_Card_Aura_SplitPusher_C_FailedToSpawn_C261E43E423AB52F62AA068841703EBF");
static_assert(sizeof(GA_Card_Aura_SplitPusher_C_FailedToSpawn_C261E43E423AB52F62AA068841703EBF) == 0x000008, "Wrong size on GA_Card_Aura_SplitPusher_C_FailedToSpawn_C261E43E423AB52F62AA068841703EBF");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_FailedToSpawn_C261E43E423AB52F62AA068841703EBF, SpawnedActor) == 0x000000, "Member 'GA_Card_Aura_SplitPusher_C_FailedToSpawn_C261E43E423AB52F62AA068841703EBF::SpawnedActor' has a wrong offset!");

// Function GA_Card_Aura_SplitPusher.GA_Card_Aura_SplitPusher_C.NotAuthority_C261E43E423AB52F62AA068841703EBF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Aura_SplitPusher_C_NotAuthority_C261E43E423AB52F62AA068841703EBF final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_SplitPusher_C_NotAuthority_C261E43E423AB52F62AA068841703EBF) == 0x000008, "Wrong alignment on GA_Card_Aura_SplitPusher_C_NotAuthority_C261E43E423AB52F62AA068841703EBF");
static_assert(sizeof(GA_Card_Aura_SplitPusher_C_NotAuthority_C261E43E423AB52F62AA068841703EBF) == 0x000008, "Wrong size on GA_Card_Aura_SplitPusher_C_NotAuthority_C261E43E423AB52F62AA068841703EBF");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_NotAuthority_C261E43E423AB52F62AA068841703EBF, SpawnedActor) == 0x000000, "Member 'GA_Card_Aura_SplitPusher_C_NotAuthority_C261E43E423AB52F62AA068841703EBF::SpawnedActor' has a wrong offset!");

// Function GA_Card_Aura_SplitPusher.GA_Card_Aura_SplitPusher_C.Success_C261E43E423AB52F62AA068841703EBF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Aura_SplitPusher_C_Success_C261E43E423AB52F62AA068841703EBF final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_SplitPusher_C_Success_C261E43E423AB52F62AA068841703EBF) == 0x000008, "Wrong alignment on GA_Card_Aura_SplitPusher_C_Success_C261E43E423AB52F62AA068841703EBF");
static_assert(sizeof(GA_Card_Aura_SplitPusher_C_Success_C261E43E423AB52F62AA068841703EBF) == 0x000008, "Wrong size on GA_Card_Aura_SplitPusher_C_Success_C261E43E423AB52F62AA068841703EBF");
static_assert(offsetof(GA_Card_Aura_SplitPusher_C_Success_C261E43E423AB52F62AA068841703EBF, SpawnedActor) == 0x000000, "Member 'GA_Card_Aura_SplitPusher_C_Success_C261E43E423AB52F62AA068841703EBF::SpawnedActor' has a wrong offset!");

}

