#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_Damage_Energy

#include "Basic.hpp"

#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Aura_Damage_Energy.GA_Card_Aura_Damage_Energy_C.ExecuteUbergraph_GA_Card_Aura_Damage_Energy
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FOrionFilterAndEffectsContainer        CallFunc_InitFilterAndEffectsContainer_ReturnValue; // 0x0058(0x0020)()
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionAuraHandle                       CallFunc_BeginAura_ReturnValue;                    // 0x009C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy) == 0x000008, "Wrong alignment on GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy");
static_assert(sizeof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy) == 0x0000A8, "Wrong size on GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, EntryPoint) == 0x000000, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_StartAbilityState_ReturnValue) == 0x000018, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, K2Node_CreateDelegate_OutputDelegate3) == 0x000038, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, K2Node_CreateDelegate_OutputDelegate4) == 0x000048, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_InitFilterAndEffectsContainer_ReturnValue) == 0x000058, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_InitFilterAndEffectsContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000078, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_IsValid_ReturnValue2) == 0x000080, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_GetAbilityLevel_ReturnValue) == 0x000084, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000088, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000090, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_GetValueAtLevel_ReturnValue) == 0x000098, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_BeginAura_ReturnValue) == 0x00009C, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_BeginAura_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy, CallFunc_IsValid_ReturnValue3) == 0x0000A0, "Member 'GA_Card_Aura_Damage_Energy_C_ExecuteUbergraph_GA_Card_Aura_Damage_Energy::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

}

