#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_SiphonSpeed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_SiphonSpeed.GA_Card_SiphonSpeed_C
// 0x00C0 (0x0C30 - 0x0B70)
class UGA_Card_SiphonSpeed_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_AttackSpeedBoost;                               // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageQualifierKeywordsWithContext    BasicAttackQualifiers;                             // 0x0B80(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_AttackSpeedReduction;                           // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxNumberOfHits;                                   // 0x0C00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         NumberOfHits;                                      // 0x0C28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_SiphonSpeed(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnDamage_E437A28B40F0C7F6769323988C819E1C(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle);
	void OnFinish_C3B9B7D54B66BCD11DC46ABEBE36E1C2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_SiphonSpeed_C">();
	}
	static class UGA_Card_SiphonSpeed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_SiphonSpeed_C>();
	}
};
static_assert(alignof(UGA_Card_SiphonSpeed_C) == 0x000010, "Wrong alignment on UGA_Card_SiphonSpeed_C");
static_assert(sizeof(UGA_Card_SiphonSpeed_C) == 0x000C30, "Wrong size on UGA_Card_SiphonSpeed_C");
static_assert(offsetof(UGA_Card_SiphonSpeed_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_SiphonSpeed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_SiphonSpeed_C, GE_AttackSpeedBoost) == 0x000B78, "Member 'UGA_Card_SiphonSpeed_C::GE_AttackSpeedBoost' has a wrong offset!");
static_assert(offsetof(UGA_Card_SiphonSpeed_C, BasicAttackQualifiers) == 0x000B80, "Member 'UGA_Card_SiphonSpeed_C::BasicAttackQualifiers' has a wrong offset!");
static_assert(offsetof(UGA_Card_SiphonSpeed_C, GE_AttackSpeedReduction) == 0x000BF8, "Member 'UGA_Card_SiphonSpeed_C::GE_AttackSpeedReduction' has a wrong offset!");
static_assert(offsetof(UGA_Card_SiphonSpeed_C, MaxNumberOfHits) == 0x000C00, "Member 'UGA_Card_SiphonSpeed_C::MaxNumberOfHits' has a wrong offset!");
static_assert(offsetof(UGA_Card_SiphonSpeed_C, NumberOfHits) == 0x000C28, "Member 'UGA_Card_SiphonSpeed_C::NumberOfHits' has a wrong offset!");

}

