#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_Parent

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Aura_Parent.GA_Card_Aura_Parent_C
// 0x0060 (0x0BD0 - 0x0B70)
class UGA_Card_Aura_Parent_C : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FOrionFilterAndEffectsContainer        Filter;                                            // 0x0B78(0x0020)(Edit, BlueprintVisible)
	struct FScalableFloat                         RadiusValue;                                       // 0x0B98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOrionAuraHandle                       Aura;                                              // 0x0BC0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShadowplaneRemovesAura;                            // 0x0BC4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC5[0x3];                                      // 0x0BC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GameplayCueLoopingAura;                            // 0x0BC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Aura_Parent(int32 EntryPoint);
	void Added_B7647EB344EF04E9C75D8E98BD7EE862();
	void K2_ActivateAbility();
	void OnStateEnded_CD3FCD9B42906F5B1C3BB096DD22D85B();
	void OnStateInterrupted_CD3FCD9B42906F5B1C3BB096DD22D85B();
	void Removed_8B2A272B43C13E3441749A81EDED4D8E();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Aura_Parent_C">();
	}
	static class UGA_Card_Aura_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Aura_Parent_C>();
	}
};
static_assert(alignof(UGA_Card_Aura_Parent_C) == 0x000010, "Wrong alignment on UGA_Card_Aura_Parent_C");
static_assert(sizeof(UGA_Card_Aura_Parent_C) == 0x000BD0, "Wrong size on UGA_Card_Aura_Parent_C");
static_assert(offsetof(UGA_Card_Aura_Parent_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Aura_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Parent_C, Filter) == 0x000B78, "Member 'UGA_Card_Aura_Parent_C::Filter' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Parent_C, RadiusValue) == 0x000B98, "Member 'UGA_Card_Aura_Parent_C::RadiusValue' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Parent_C, Aura) == 0x000BC0, "Member 'UGA_Card_Aura_Parent_C::Aura' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Parent_C, ShadowplaneRemovesAura) == 0x000BC4, "Member 'UGA_Card_Aura_Parent_C::ShadowplaneRemovesAura' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Parent_C, GameplayCueLoopingAura) == 0x000BC8, "Member 'UGA_Card_Aura_Parent_C::GameplayCueLoopingAura' has a wrong offset!");

}

