#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ImmobilityTrap

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.ExecuteUbergraph_GA_Card_ImmobilityTrap
// 0x01C8 (0x01C8 - 0x0000)
struct GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile2;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionAbilityTask_WaitProjectileShutdown* CallFunc_WaitProjectileShutdown_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate5;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate6;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable2;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate8;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x00E0(0x0020)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0100(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate9;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0130(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_SpawnProjectile*      CallFunc_SpawnProjectile_ReturnValue;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTargetData_ReturnValue;    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor2;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue2;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CheckAbilityCost_ReturnValue;          // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile3;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile4;             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate10;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate11;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap) == 0x0001C8, "Wrong size on GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, EntryPoint) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CustomEvent_SpawnedProjectile2) == 0x000008, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CustomEvent_SpawnedProjectile2' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CustomEvent_SpawnedProjectile) == 0x000020, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CustomEvent_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, Temp_object_Variable) == 0x000038, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_WaitProjectileShutdown_ReturnValue) == 0x000050, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_WaitProjectileShutdown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CustomEvent_SpawnedActor3) == 0x000070, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CustomEvent_SpawnedActor2) == 0x000078, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate5) == 0x000080, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CustomEvent_SpawnedActor) == 0x000090, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate6) == 0x000098, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, Temp_object_Variable2) == 0x0000A8, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B0, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_WaitNetSync_ReturnValue) == 0x0000C0, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate8) == 0x0000C8, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_IsValid_ReturnValue2) == 0x0000D8, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CustomEvent_Targets2) == 0x0000E0, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CustomEvent_Targets) == 0x000100, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate9) == 0x000120, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, Temp_struct_Variable) == 0x000130, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_StartTargeting_ReturnValue) == 0x000150, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_SpawnProjectile_ReturnValue) == 0x000158, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000160, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_BeginSpawningActor_ReturnValue) == 0x000168, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_IsValid_ReturnValue3) == 0x000169, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_IsValid_ReturnValue4) == 0x00016A, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_SpawnOrionActorTargetData_ReturnValue) == 0x000170, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_SpawnOrionActorTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_BeginSpawningActor_SpawnedActor2) == 0x000178, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_BeginSpawningActor_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_BeginSpawningActor_ReturnValue2) == 0x000180, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_BeginSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_IsValid_ReturnValue5) == 0x000181, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_K2_CheckAbilityCost_ReturnValue) == 0x000182, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_K2_CheckAbilityCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_K2_CommitAbility_ReturnValue) == 0x000183, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue) == 0x000188, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, CallFunc_GetTeamNum_ReturnValue) == 0x000190, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CustomEvent_SpawnedProjectile3) == 0x000198, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CustomEvent_SpawnedProjectile3' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CustomEvent_SpawnedProjectile4) == 0x0001A0, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CustomEvent_SpawnedProjectile4' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate10) == 0x0001A8, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap, K2Node_CreateDelegate_OutputDelegate11) == 0x0001B8, "Member 'GA_Card_ImmobilityTrap_C_ExecuteUbergraph_GA_Card_ImmobilityTrap::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.Cancelled_501412314D809FCF9A90D2BC59DB4CFA
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ImmobilityTrap_C_Cancelled_501412314D809FCF9A90D2BC59DB4CFA final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_Cancelled_501412314D809FCF9A90D2BC59DB4CFA) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_Cancelled_501412314D809FCF9A90D2BC59DB4CFA");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_Cancelled_501412314D809FCF9A90D2BC59DB4CFA) == 0x000020, "Wrong size on GA_Card_ImmobilityTrap_C_Cancelled_501412314D809FCF9A90D2BC59DB4CFA");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_Cancelled_501412314D809FCF9A90D2BC59DB4CFA, Targets) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_Cancelled_501412314D809FCF9A90D2BC59DB4CFA::Targets' has a wrong offset!");

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.Confirmed_501412314D809FCF9A90D2BC59DB4CFA
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ImmobilityTrap_C_Confirmed_501412314D809FCF9A90D2BC59DB4CFA final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_Confirmed_501412314D809FCF9A90D2BC59DB4CFA) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_Confirmed_501412314D809FCF9A90D2BC59DB4CFA");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_Confirmed_501412314D809FCF9A90D2BC59DB4CFA) == 0x000020, "Wrong size on GA_Card_ImmobilityTrap_C_Confirmed_501412314D809FCF9A90D2BC59DB4CFA");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_Confirmed_501412314D809FCF9A90D2BC59DB4CFA, Targets) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_Confirmed_501412314D809FCF9A90D2BC59DB4CFA::Targets' has a wrong offset!");

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.FailedToSpawn_7451FBBD481E27539C49B8ACA5C94395
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ImmobilityTrap_C_FailedToSpawn_7451FBBD481E27539C49B8ACA5C94395 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_FailedToSpawn_7451FBBD481E27539C49B8ACA5C94395) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_FailedToSpawn_7451FBBD481E27539C49B8ACA5C94395");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_FailedToSpawn_7451FBBD481E27539C49B8ACA5C94395) == 0x000008, "Wrong size on GA_Card_ImmobilityTrap_C_FailedToSpawn_7451FBBD481E27539C49B8ACA5C94395");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_FailedToSpawn_7451FBBD481E27539C49B8ACA5C94395, SpawnedActor) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_FailedToSpawn_7451FBBD481E27539C49B8ACA5C94395::SpawnedActor' has a wrong offset!");

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.FailedToSpawn_986DD7034D98DE957CADECB2450760AF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ImmobilityTrap_C_FailedToSpawn_986DD7034D98DE957CADECB2450760AF final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_FailedToSpawn_986DD7034D98DE957CADECB2450760AF) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_FailedToSpawn_986DD7034D98DE957CADECB2450760AF");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_FailedToSpawn_986DD7034D98DE957CADECB2450760AF) == 0x000008, "Wrong size on GA_Card_ImmobilityTrap_C_FailedToSpawn_986DD7034D98DE957CADECB2450760AF");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_FailedToSpawn_986DD7034D98DE957CADECB2450760AF, SpawnedProjectile) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_FailedToSpawn_986DD7034D98DE957CADECB2450760AF::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.NotAuthority_7451FBBD481E27539C49B8ACA5C94395
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ImmobilityTrap_C_NotAuthority_7451FBBD481E27539C49B8ACA5C94395 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_NotAuthority_7451FBBD481E27539C49B8ACA5C94395) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_NotAuthority_7451FBBD481E27539C49B8ACA5C94395");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_NotAuthority_7451FBBD481E27539C49B8ACA5C94395) == 0x000008, "Wrong size on GA_Card_ImmobilityTrap_C_NotAuthority_7451FBBD481E27539C49B8ACA5C94395");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_NotAuthority_7451FBBD481E27539C49B8ACA5C94395, SpawnedActor) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_NotAuthority_7451FBBD481E27539C49B8ACA5C94395::SpawnedActor' has a wrong offset!");

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.NotAuthority_986DD7034D98DE957CADECB2450760AF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ImmobilityTrap_C_NotAuthority_986DD7034D98DE957CADECB2450760AF final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_NotAuthority_986DD7034D98DE957CADECB2450760AF) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_NotAuthority_986DD7034D98DE957CADECB2450760AF");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_NotAuthority_986DD7034D98DE957CADECB2450760AF) == 0x000008, "Wrong size on GA_Card_ImmobilityTrap_C_NotAuthority_986DD7034D98DE957CADECB2450760AF");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_NotAuthority_986DD7034D98DE957CADECB2450760AF, SpawnedProjectile) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_NotAuthority_986DD7034D98DE957CADECB2450760AF::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.PreSpawned_986DD7034D98DE957CADECB2450760AF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ImmobilityTrap_C_PreSpawned_986DD7034D98DE957CADECB2450760AF final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_PreSpawned_986DD7034D98DE957CADECB2450760AF) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_PreSpawned_986DD7034D98DE957CADECB2450760AF");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_PreSpawned_986DD7034D98DE957CADECB2450760AF) == 0x000008, "Wrong size on GA_Card_ImmobilityTrap_C_PreSpawned_986DD7034D98DE957CADECB2450760AF");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_PreSpawned_986DD7034D98DE957CADECB2450760AF, SpawnedProjectile) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_PreSpawned_986DD7034D98DE957CADECB2450760AF::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.Success_7451FBBD481E27539C49B8ACA5C94395
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ImmobilityTrap_C_Success_7451FBBD481E27539C49B8ACA5C94395 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_Success_7451FBBD481E27539C49B8ACA5C94395) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_Success_7451FBBD481E27539C49B8ACA5C94395");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_Success_7451FBBD481E27539C49B8ACA5C94395) == 0x000008, "Wrong size on GA_Card_ImmobilityTrap_C_Success_7451FBBD481E27539C49B8ACA5C94395");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_Success_7451FBBD481E27539C49B8ACA5C94395, SpawnedActor) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_Success_7451FBBD481E27539C49B8ACA5C94395::SpawnedActor' has a wrong offset!");

// Function GA_Card_ImmobilityTrap.GA_Card_ImmobilityTrap_C.Success_986DD7034D98DE957CADECB2450760AF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ImmobilityTrap_C_Success_986DD7034D98DE957CADECB2450760AF final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ImmobilityTrap_C_Success_986DD7034D98DE957CADECB2450760AF) == 0x000008, "Wrong alignment on GA_Card_ImmobilityTrap_C_Success_986DD7034D98DE957CADECB2450760AF");
static_assert(sizeof(GA_Card_ImmobilityTrap_C_Success_986DD7034D98DE957CADECB2450760AF) == 0x000008, "Wrong size on GA_Card_ImmobilityTrap_C_Success_986DD7034D98DE957CADECB2450760AF");
static_assert(offsetof(GA_Card_ImmobilityTrap_C_Success_986DD7034D98DE957CADECB2450760AF, SpawnedProjectile) == 0x000000, "Member 'GA_Card_ImmobilityTrap_C_Success_986DD7034D98DE957CADECB2450760AF::SpawnedProjectile' has a wrong offset!");

}

