#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Enemy_Death_Ward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Enemy_Death_Ward.GA_Card_Enemy_Death_Ward_C
// 0x0040 (0x0BB0 - 0x0B70)
class UGA_Card_Enemy_Death_Ward_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	TArray<EObjectTypeQuery>                      LineTraceObjects;                                  // 0x0B78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FScalableFloat                         LifeSpan;                                          // 0x0B88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_Enemy_Death_Ward(int32 EntryPoint);
	void FailedToSpawn_2903EC8546D2D550F11F1D850C10B09E(class AActor* SpawnedActor);
	void K2_ActivateAbility();
	void NotAuthority_2903EC8546D2D550F11F1D850C10B09E(class AActor* SpawnedActor);
	void OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext);
	void OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext);
	void OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext);
	void OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext);
	void Success_2903EC8546D2D550F11F1D850C10B09E(class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Enemy_Death_Ward_C">();
	}
	static class UGA_Card_Enemy_Death_Ward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Enemy_Death_Ward_C>();
	}
};
static_assert(alignof(UGA_Card_Enemy_Death_Ward_C) == 0x000010, "Wrong alignment on UGA_Card_Enemy_Death_Ward_C");
static_assert(sizeof(UGA_Card_Enemy_Death_Ward_C) == 0x000BB0, "Wrong size on UGA_Card_Enemy_Death_Ward_C");
static_assert(offsetof(UGA_Card_Enemy_Death_Ward_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Enemy_Death_Ward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Enemy_Death_Ward_C, LineTraceObjects) == 0x000B78, "Member 'UGA_Card_Enemy_Death_Ward_C::LineTraceObjects' has a wrong offset!");
static_assert(offsetof(UGA_Card_Enemy_Death_Ward_C, LifeSpan) == 0x000B88, "Member 'UGA_Card_Enemy_Death_Ward_C::LifeSpan' has a wrong offset!");

}

