#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Counterattack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Counterattack.GA_Card_Counterattack_C
// 0x00C0 (0x0C30 - 0x0B70)
class UGA_Card_Counterattack_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_ToApply;                                        // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PercentToReflect;                                  // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageQualifierKeywordsWithContext    DamageQualifier;                                   // 0x0B88(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ValuePercentToReflect;                             // 0x0C00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FX_Delay;                                          // 0x0C28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Counterattack(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnDamage_316D3DBD4FDE6FF9D3F1C6AFB6C89221(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Counterattack_C">();
	}
	static class UGA_Card_Counterattack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Counterattack_C>();
	}
};
static_assert(alignof(UGA_Card_Counterattack_C) == 0x000010, "Wrong alignment on UGA_Card_Counterattack_C");
static_assert(sizeof(UGA_Card_Counterattack_C) == 0x000C30, "Wrong size on UGA_Card_Counterattack_C");
static_assert(offsetof(UGA_Card_Counterattack_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Counterattack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Counterattack_C, GE_ToApply) == 0x000B78, "Member 'UGA_Card_Counterattack_C::GE_ToApply' has a wrong offset!");
static_assert(offsetof(UGA_Card_Counterattack_C, PercentToReflect) == 0x000B80, "Member 'UGA_Card_Counterattack_C::PercentToReflect' has a wrong offset!");
static_assert(offsetof(UGA_Card_Counterattack_C, DamageQualifier) == 0x000B88, "Member 'UGA_Card_Counterattack_C::DamageQualifier' has a wrong offset!");
static_assert(offsetof(UGA_Card_Counterattack_C, ValuePercentToReflect) == 0x000C00, "Member 'UGA_Card_Counterattack_C::ValuePercentToReflect' has a wrong offset!");
static_assert(offsetof(UGA_Card_Counterattack_C, FX_Delay) == 0x000C28, "Member 'UGA_Card_Counterattack_C::FX_Delay' has a wrong offset!");

}

