#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_FleetFooted

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_FleetFooted.GA_Card_FleetFooted_C.ExecuteUbergraph_GA_Card_FleetFooted
// 0x02A0 (0x02A0 - 0x0000)
struct GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC2;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo2;                    // 0x0040(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle2;                    // 0x0068(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0080(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable2;                             // 0x0098(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageDealt_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x00F0(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0118(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable3;                             // 0x0130(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable4;                             // 0x0148(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable2;                             // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageTaken_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0188(0x0040)(ContainsInstancedReference)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue2;                // 0x01C8(0x0040)(ContainsInstancedReference)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue3;                // 0x0208(0x0040)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue2;  // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue3;  // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_266[0x2];                                      // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0268(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0288(0x0008)(NoDestructor)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue3;             // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted) == 0x000008, "Wrong alignment on GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted");
static_assert(sizeof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted) == 0x0002A0, "Wrong size on GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, EntryPoint) == 0x000000, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x000004, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_StartAbilityState_ReturnValue) == 0x000018, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CustomEvent_AuxillaryASC2) == 0x000038, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CustomEvent_AuxillaryASC2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CustomEvent_DamageInfo2) == 0x000040, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CustomEvent_DamageInfo2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CustomEvent_SpecHandle2) == 0x000068, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CustomEvent_SpecHandle2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, Temp_struct_Variable) == 0x000080, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, Temp_struct_Variable2) == 0x000098, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, Temp_object_Variable) == 0x0000C0, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_WaitDamageDealt_ReturnValue) == 0x0000C8, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_WaitDamageDealt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_IsValid_ReturnValue2) == 0x0000D0, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CreateDelegate_OutputDelegate3) == 0x0000D8, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CustomEvent_AuxillaryASC) == 0x0000E8, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CustomEvent_DamageInfo) == 0x0000F0, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CustomEvent_SpecHandle) == 0x000118, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, Temp_struct_Variable3) == 0x000130, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, Temp_struct_Variable4) == 0x000148, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, Temp_object_Variable2) == 0x000170, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_WaitDamageTaken_ReturnValue) == 0x000178, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_WaitDamageTaken_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_IsValid_ReturnValue3) == 0x000180, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_GetActorInfo_ReturnValue) == 0x000188, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_GetActorInfo_ReturnValue2) == 0x0001C8, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_GetActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_GetActorInfo_ReturnValue3) == 0x000208, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_GetActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CreateDelegate_OutputDelegate4) == 0x000248, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000258, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_GetAbilityLevel_ReturnValue) == 0x00025C, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_GetAbilityLevel_ReturnValue2) == 0x000260, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_RemoveActiveGameplayEffect_ReturnValue2) == 0x000264, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_RemoveActiveGameplayEffect_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_RemoveActiveGameplayEffect_ReturnValue3) == 0x000265, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_RemoveActiveGameplayEffect_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000268, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, K2Node_CreateDelegate_OutputDelegate5) == 0x000270, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x000280, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000288, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_GetAbilityLevel_ReturnValue3) == 0x000290, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_GetAbilityLevel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000294, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted, CallFunc_GetValueAtLevel_ReturnValue) == 0x000298, "Member 'GA_Card_FleetFooted_C_ExecuteUbergraph_GA_Card_FleetFooted::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");

// Function GA_Card_FleetFooted.GA_Card_FleetFooted_C.OnDamage_088212F74B980D68D44A59B439BB4367
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367 final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367) == 0x000008, "Wrong alignment on GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367");
static_assert(sizeof(GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367) == 0x000048, "Wrong size on GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367");
static_assert(offsetof(GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367, AuxillaryASC) == 0x000000, "Member 'GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367, DamageInfo) == 0x000008, "Member 'GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367, SpecHandle) == 0x000030, "Member 'GA_Card_FleetFooted_C_OnDamage_088212F74B980D68D44A59B439BB4367::SpecHandle' has a wrong offset!");

// Function GA_Card_FleetFooted.GA_Card_FleetFooted_C.OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92 final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92) == 0x000008, "Wrong alignment on GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92");
static_assert(sizeof(GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92) == 0x000048, "Wrong size on GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92");
static_assert(offsetof(GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92, AuxillaryASC) == 0x000000, "Member 'GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92, DamageInfo) == 0x000008, "Member 'GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92, SpecHandle) == 0x000030, "Member 'GA_Card_FleetFooted_C_OnDamage_7F3EAB414AB938D713C6DA8DBAF77E92::SpecHandle' has a wrong offset!");

}

