#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Spellslinger

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Spellslinger.GA_Card_Spellslinger_C.ExecuteUbergraph_GA_Card_Spellslinger
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0040)(ContainsInstancedReference)
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAbilityCommit*         CallFunc_WaitForAbilityCommit_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger) == 0x000008, "Wrong alignment on GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger");
static_assert(sizeof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger) == 0x0000B8, "Wrong size on GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, EntryPoint) == 0x000000, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, K2Node_CustomEvent_ActivatedAbility) == 0x000048, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, Temp_object_Variable) == 0x000050, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, CallFunc_WaitForAbilityCommit_ReturnValue) == 0x000058, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::CallFunc_WaitForAbilityCommit_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, K2Node_CreateDelegate_OutputDelegate2) == 0x000078, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, CallFunc_StartAbilityState_ReturnValue) == 0x000088, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, CallFunc_K2_CommitAbility_ReturnValue) == 0x000090, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, CallFunc_IsValid_ReturnValue2) == 0x000091, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, CallFunc_GetAbilityLevel_ReturnValue) == 0x000094, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, K2Node_CreateDelegate_OutputDelegate3) == 0x000098, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0000A8, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000AC, "Member 'GA_Card_Spellslinger_C_ExecuteUbergraph_GA_Card_Spellslinger::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Card_Spellslinger.GA_Card_Spellslinger_C.OnCommit_7DB6562E4C593DFDCE6D3084A8ADA247
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Spellslinger_C_OnCommit_7DB6562E4C593DFDCE6D3084A8ADA247 final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Spellslinger_C_OnCommit_7DB6562E4C593DFDCE6D3084A8ADA247) == 0x000008, "Wrong alignment on GA_Card_Spellslinger_C_OnCommit_7DB6562E4C593DFDCE6D3084A8ADA247");
static_assert(sizeof(GA_Card_Spellslinger_C_OnCommit_7DB6562E4C593DFDCE6D3084A8ADA247) == 0x000008, "Wrong size on GA_Card_Spellslinger_C_OnCommit_7DB6562E4C593DFDCE6D3084A8ADA247");
static_assert(offsetof(GA_Card_Spellslinger_C_OnCommit_7DB6562E4C593DFDCE6D3084A8ADA247, ActivatedAbility) == 0x000000, "Member 'GA_Card_Spellslinger_C_OnCommit_7DB6562E4C593DFDCE6D3084A8ADA247::ActivatedAbility' has a wrong offset!");

}

