#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Bullseye

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Bullseye.GA_Card_Bullseye_C.ExecuteUbergraph_GA_Card_Bullseye
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0008(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0038(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0068(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2; // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye) == 0x000008, "Wrong alignment on GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye");
static_assert(sizeof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye) == 0x0000B8, "Wrong size on GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, EntryPoint) == 0x000000, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, K2Node_CustomEvent_Targets2) == 0x000008, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, K2Node_CustomEvent_Targets) == 0x000038, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, Temp_struct_Variable) == 0x000068, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, CallFunc_StartTargeting_ReturnValue) == 0x000088, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, CallFunc_K2_CommitAbility_ReturnValue) == 0x000091, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, CallFunc_GetAbilityLevel_ReturnValue) == 0x000094, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000098, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2) == 0x0000A8, "Member 'GA_Card_Bullseye_C_ExecuteUbergraph_GA_Card_Bullseye::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2' has a wrong offset!");

// Function GA_Card_Bullseye.GA_Card_Bullseye_C.Cancelled_84DC180C496AAFD364FD98AAA3A3A467
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_Bullseye_C_Cancelled_84DC180C496AAFD364FD98AAA3A3A467 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_Bullseye_C_Cancelled_84DC180C496AAFD364FD98AAA3A3A467) == 0x000008, "Wrong alignment on GA_Card_Bullseye_C_Cancelled_84DC180C496AAFD364FD98AAA3A3A467");
static_assert(sizeof(GA_Card_Bullseye_C_Cancelled_84DC180C496AAFD364FD98AAA3A3A467) == 0x000020, "Wrong size on GA_Card_Bullseye_C_Cancelled_84DC180C496AAFD364FD98AAA3A3A467");
static_assert(offsetof(GA_Card_Bullseye_C_Cancelled_84DC180C496AAFD364FD98AAA3A3A467, Targets) == 0x000000, "Member 'GA_Card_Bullseye_C_Cancelled_84DC180C496AAFD364FD98AAA3A3A467::Targets' has a wrong offset!");

// Function GA_Card_Bullseye.GA_Card_Bullseye_C.Confirmed_84DC180C496AAFD364FD98AAA3A3A467
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_Bullseye_C_Confirmed_84DC180C496AAFD364FD98AAA3A3A467 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_Bullseye_C_Confirmed_84DC180C496AAFD364FD98AAA3A3A467) == 0x000008, "Wrong alignment on GA_Card_Bullseye_C_Confirmed_84DC180C496AAFD364FD98AAA3A3A467");
static_assert(sizeof(GA_Card_Bullseye_C_Confirmed_84DC180C496AAFD364FD98AAA3A3A467) == 0x000020, "Wrong size on GA_Card_Bullseye_C_Confirmed_84DC180C496AAFD364FD98AAA3A3A467");
static_assert(offsetof(GA_Card_Bullseye_C_Confirmed_84DC180C496AAFD364FD98AAA3A3A467, Targets) == 0x000000, "Member 'GA_Card_Bullseye_C_Confirmed_84DC180C496AAFD364FD98AAA3A3A467::Targets' has a wrong offset!");

}

