#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_WhenFullHPSpellVampMana

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_WhenFullHPSpellVampMana.GA_Card_WhenFullHPSpellVampMana_C
// 0x0060 (0x0BD0 - 0x0B70)
class UGA_Card_WhenFullHPSpellVampMana_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            ManaVamp;                                          // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               DamageTag;                                         // 0x0B80(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          FullHP_;                                           // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC1[0x3];                                      // 0x0BC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ManaVampPercent;                                   // 0x0BC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);
	void OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B(bool bMatchesComparison, float CurrentRatio);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_WhenFullHPSpellVampMana_C">();
	}
	static class UGA_Card_WhenFullHPSpellVampMana_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_WhenFullHPSpellVampMana_C>();
	}
};
static_assert(alignof(UGA_Card_WhenFullHPSpellVampMana_C) == 0x000010, "Wrong alignment on UGA_Card_WhenFullHPSpellVampMana_C");
static_assert(sizeof(UGA_Card_WhenFullHPSpellVampMana_C) == 0x000BD0, "Wrong size on UGA_Card_WhenFullHPSpellVampMana_C");
static_assert(offsetof(UGA_Card_WhenFullHPSpellVampMana_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_WhenFullHPSpellVampMana_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_WhenFullHPSpellVampMana_C, ManaVamp) == 0x000B78, "Member 'UGA_Card_WhenFullHPSpellVampMana_C::ManaVamp' has a wrong offset!");
static_assert(offsetof(UGA_Card_WhenFullHPSpellVampMana_C, DamageTag) == 0x000B80, "Member 'UGA_Card_WhenFullHPSpellVampMana_C::DamageTag' has a wrong offset!");
static_assert(offsetof(UGA_Card_WhenFullHPSpellVampMana_C, FullHP_) == 0x000BC0, "Member 'UGA_Card_WhenFullHPSpellVampMana_C::FullHP_' has a wrong offset!");
static_assert(offsetof(UGA_Card_WhenFullHPSpellVampMana_C, ManaVampPercent) == 0x000BC4, "Member 'UGA_Card_WhenFullHPSpellVampMana_C::ManaVampPercent' has a wrong offset!");

}

