#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ExecutionersRush_CDReset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_ExecutionersRush_CDReset.GA_Card_ExecutionersRush_CDReset_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_ExecutionersRush_CDReset_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 TargetingCamera;                                   // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ResetCD;                                           // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_ExecutionersRush_CDReset(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnMinionAssist_FF9CF0FB44109636B8A951B0E1AE6B1F(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext);
	void OnMinionKill_FF9CF0FB44109636B8A951B0E1AE6B1F(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext);
	void OnPlayerAssist_FF9CF0FB44109636B8A951B0E1AE6B1F(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext);
	void OnPlayerKill_FF9CF0FB44109636B8A951B0E1AE6B1F(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_ExecutionersRush_CDReset_C">();
	}
	static class UGA_Card_ExecutionersRush_CDReset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_ExecutionersRush_CDReset_C>();
	}
};
static_assert(alignof(UGA_Card_ExecutionersRush_CDReset_C) == 0x000010, "Wrong alignment on UGA_Card_ExecutionersRush_CDReset_C");
static_assert(sizeof(UGA_Card_ExecutionersRush_CDReset_C) == 0x000B90, "Wrong size on UGA_Card_ExecutionersRush_CDReset_C");
static_assert(offsetof(UGA_Card_ExecutionersRush_CDReset_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_ExecutionersRush_CDReset_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_ExecutionersRush_CDReset_C, TargetingCamera) == 0x000B78, "Member 'UGA_Card_ExecutionersRush_CDReset_C::TargetingCamera' has a wrong offset!");
static_assert(offsetof(UGA_Card_ExecutionersRush_CDReset_C, ResetCD) == 0x000B80, "Member 'UGA_Card_ExecutionersRush_CDReset_C::ResetCD' has a wrong offset!");

}

