#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_LinkAllyToRedirectDmg

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_LinkAllyToRedirectDmg.GA_Card_LinkAllyToRedirectDmg_C.ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg
// 0x0230 (0x0230 - 0x0000)
struct GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionCharHero* Hero, const struct FGameplayTag& HeroTag)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_CustomEvent_Hero;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_HeroTag;                        // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AOrionCharHero*                         Temp_object_Variable2;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitHeroGameplayTag*  CallFunc_WaitHeroGameplayTagRemove_ReturnValue;    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x00C0(0x0020)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue2;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate7;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_CustomEvent_EndPlayReason;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0130(0x0020)(ConstParm)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate8;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate9;             // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x01A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x01B0(0x0020)()
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTargetData_ReturnValue;    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetPrimaryActorFromTargetData_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetPrimaryActorFromTargetData_ReturnValue2; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetPrimaryActorFromTargetData_ReturnValue3; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x021B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0220(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg) == 0x000008, "Wrong alignment on GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg");
static_assert(sizeof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg) == 0x000230, "Wrong size on GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, EntryPoint) == 0x000000, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_SpawnedActor2) == 0x000008, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_SpawnedActor) == 0x000020, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, Temp_object_Variable) == 0x000038, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CreateDelegate_OutputDelegate4) == 0x000050, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CreateDelegate_OutputDelegate5) == 0x000060, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_StartAbilityState_ReturnValue) == 0x000070, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CreateDelegate_OutputDelegate6) == 0x000078, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_Hero) == 0x000090, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_Hero' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_HeroTag) == 0x000098, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_HeroTag' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, Temp_struct_Variable) == 0x0000A0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, Temp_object_Variable2) == 0x0000A8, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_WaitHeroGameplayTagRemove_ReturnValue) == 0x0000B0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_WaitHeroGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000B8, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue2) == 0x0000B9, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_Targets) == 0x0000C0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_K2_CommitAbility_ReturnValue2) == 0x0000E0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_K2_CommitAbility_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue) == 0x0000E8, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetTeamNum_ReturnValue) == 0x0000F0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CreateDelegate_OutputDelegate7) == 0x0000F8, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_Actor) == 0x000108, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_EndPlayReason) == 0x000110, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_EndPlayReason' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000118, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000120, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue3) == 0x000128, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue4) == 0x000129, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue5) == 0x00012A, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_Targets2) == 0x000130, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetAbilityLevel_ReturnValue) == 0x000150, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000158, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000160, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CreateDelegate_OutputDelegate8) == 0x000168, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2) == 0x000178, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_SpawnedActor3) == 0x000180, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_StartTargeting_ReturnValue) == 0x000188, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_CreateDelegate_OutputDelegate9) == 0x000190, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue6) == 0x0001A0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0001A4, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, Temp_struct_Variable2) == 0x0001B0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_SpawnOrionActorTargetData_ReturnValue) == 0x0001D0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_SpawnOrionActorTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetPrimaryActorFromTargetData_ReturnValue) == 0x0001D8, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetPrimaryActorFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0001E0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_BeginSpawningActor_ReturnValue) == 0x0001E8, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x0001F0, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue7) == 0x0001F9, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetPrimaryActorFromTargetData_ReturnValue2) == 0x000200, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetPrimaryActorFromTargetData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x000208, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_GetPrimaryActorFromTargetData_ReturnValue3) == 0x000210, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_GetPrimaryActorFromTargetData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue8) == 0x000218, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000219, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_BooleanOR_ReturnValue) == 0x00021A, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue9) == 0x00021B, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000220, "Member 'GA_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Card_LinkAllyToRedirectDmg.GA_Card_LinkAllyToRedirectDmg_C.TetherBroken
// 0x0010 (0x0010 - 0x0000)
struct GA_Card_LinkAllyToRedirectDmg_C_TetherBroken final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_LinkAllyToRedirectDmg_C_TetherBroken) == 0x000008, "Wrong alignment on GA_Card_LinkAllyToRedirectDmg_C_TetherBroken");
static_assert(sizeof(GA_Card_LinkAllyToRedirectDmg_C_TetherBroken) == 0x000010, "Wrong size on GA_Card_LinkAllyToRedirectDmg_C_TetherBroken");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_TetherBroken, Actor) == 0x000000, "Member 'GA_Card_LinkAllyToRedirectDmg_C_TetherBroken::Actor' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_TetherBroken, EndPlayReason) == 0x000008, "Member 'GA_Card_LinkAllyToRedirectDmg_C_TetherBroken::EndPlayReason' has a wrong offset!");

// Function GA_Card_LinkAllyToRedirectDmg.GA_Card_LinkAllyToRedirectDmg_C.Cancelled_AF58027E464E216E8E3457BE420E256A
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_LinkAllyToRedirectDmg_C_Cancelled_AF58027E464E216E8E3457BE420E256A final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_LinkAllyToRedirectDmg_C_Cancelled_AF58027E464E216E8E3457BE420E256A) == 0x000008, "Wrong alignment on GA_Card_LinkAllyToRedirectDmg_C_Cancelled_AF58027E464E216E8E3457BE420E256A");
static_assert(sizeof(GA_Card_LinkAllyToRedirectDmg_C_Cancelled_AF58027E464E216E8E3457BE420E256A) == 0x000020, "Wrong size on GA_Card_LinkAllyToRedirectDmg_C_Cancelled_AF58027E464E216E8E3457BE420E256A");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_Cancelled_AF58027E464E216E8E3457BE420E256A, Targets) == 0x000000, "Member 'GA_Card_LinkAllyToRedirectDmg_C_Cancelled_AF58027E464E216E8E3457BE420E256A::Targets' has a wrong offset!");

// Function GA_Card_LinkAllyToRedirectDmg.GA_Card_LinkAllyToRedirectDmg_C.Confirmed_AF58027E464E216E8E3457BE420E256A
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_LinkAllyToRedirectDmg_C_Confirmed_AF58027E464E216E8E3457BE420E256A final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_LinkAllyToRedirectDmg_C_Confirmed_AF58027E464E216E8E3457BE420E256A) == 0x000008, "Wrong alignment on GA_Card_LinkAllyToRedirectDmg_C_Confirmed_AF58027E464E216E8E3457BE420E256A");
static_assert(sizeof(GA_Card_LinkAllyToRedirectDmg_C_Confirmed_AF58027E464E216E8E3457BE420E256A) == 0x000020, "Wrong size on GA_Card_LinkAllyToRedirectDmg_C_Confirmed_AF58027E464E216E8E3457BE420E256A");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_Confirmed_AF58027E464E216E8E3457BE420E256A, Targets) == 0x000000, "Member 'GA_Card_LinkAllyToRedirectDmg_C_Confirmed_AF58027E464E216E8E3457BE420E256A::Targets' has a wrong offset!");

// Function GA_Card_LinkAllyToRedirectDmg.GA_Card_LinkAllyToRedirectDmg_C.Event_9B61E1174EF786F1755A13B7AB7E19CA
// 0x0010 (0x0010 - 0x0000)
struct GA_Card_LinkAllyToRedirectDmg_C_Event_9B61E1174EF786F1755A13B7AB7E19CA final
{
public:
	class AOrionCharHero*                         Hero;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HeroTag;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_LinkAllyToRedirectDmg_C_Event_9B61E1174EF786F1755A13B7AB7E19CA) == 0x000008, "Wrong alignment on GA_Card_LinkAllyToRedirectDmg_C_Event_9B61E1174EF786F1755A13B7AB7E19CA");
static_assert(sizeof(GA_Card_LinkAllyToRedirectDmg_C_Event_9B61E1174EF786F1755A13B7AB7E19CA) == 0x000010, "Wrong size on GA_Card_LinkAllyToRedirectDmg_C_Event_9B61E1174EF786F1755A13B7AB7E19CA");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_Event_9B61E1174EF786F1755A13B7AB7E19CA, Hero) == 0x000000, "Member 'GA_Card_LinkAllyToRedirectDmg_C_Event_9B61E1174EF786F1755A13B7AB7E19CA::Hero' has a wrong offset!");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_Event_9B61E1174EF786F1755A13B7AB7E19CA, HeroTag) == 0x000008, "Member 'GA_Card_LinkAllyToRedirectDmg_C_Event_9B61E1174EF786F1755A13B7AB7E19CA::HeroTag' has a wrong offset!");

// Function GA_Card_LinkAllyToRedirectDmg.GA_Card_LinkAllyToRedirectDmg_C.FailedToSpawn_C9194E774E01AED9F2380AB772B92E74
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_LinkAllyToRedirectDmg_C_FailedToSpawn_C9194E774E01AED9F2380AB772B92E74 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_LinkAllyToRedirectDmg_C_FailedToSpawn_C9194E774E01AED9F2380AB772B92E74) == 0x000008, "Wrong alignment on GA_Card_LinkAllyToRedirectDmg_C_FailedToSpawn_C9194E774E01AED9F2380AB772B92E74");
static_assert(sizeof(GA_Card_LinkAllyToRedirectDmg_C_FailedToSpawn_C9194E774E01AED9F2380AB772B92E74) == 0x000008, "Wrong size on GA_Card_LinkAllyToRedirectDmg_C_FailedToSpawn_C9194E774E01AED9F2380AB772B92E74");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_FailedToSpawn_C9194E774E01AED9F2380AB772B92E74, SpawnedActor) == 0x000000, "Member 'GA_Card_LinkAllyToRedirectDmg_C_FailedToSpawn_C9194E774E01AED9F2380AB772B92E74::SpawnedActor' has a wrong offset!");

// Function GA_Card_LinkAllyToRedirectDmg.GA_Card_LinkAllyToRedirectDmg_C.NotAuthority_C9194E774E01AED9F2380AB772B92E74
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_LinkAllyToRedirectDmg_C_NotAuthority_C9194E774E01AED9F2380AB772B92E74 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_LinkAllyToRedirectDmg_C_NotAuthority_C9194E774E01AED9F2380AB772B92E74) == 0x000008, "Wrong alignment on GA_Card_LinkAllyToRedirectDmg_C_NotAuthority_C9194E774E01AED9F2380AB772B92E74");
static_assert(sizeof(GA_Card_LinkAllyToRedirectDmg_C_NotAuthority_C9194E774E01AED9F2380AB772B92E74) == 0x000008, "Wrong size on GA_Card_LinkAllyToRedirectDmg_C_NotAuthority_C9194E774E01AED9F2380AB772B92E74");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_NotAuthority_C9194E774E01AED9F2380AB772B92E74, SpawnedActor) == 0x000000, "Member 'GA_Card_LinkAllyToRedirectDmg_C_NotAuthority_C9194E774E01AED9F2380AB772B92E74::SpawnedActor' has a wrong offset!");

// Function GA_Card_LinkAllyToRedirectDmg.GA_Card_LinkAllyToRedirectDmg_C.Success_C9194E774E01AED9F2380AB772B92E74
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_LinkAllyToRedirectDmg_C_Success_C9194E774E01AED9F2380AB772B92E74 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_LinkAllyToRedirectDmg_C_Success_C9194E774E01AED9F2380AB772B92E74) == 0x000008, "Wrong alignment on GA_Card_LinkAllyToRedirectDmg_C_Success_C9194E774E01AED9F2380AB772B92E74");
static_assert(sizeof(GA_Card_LinkAllyToRedirectDmg_C_Success_C9194E774E01AED9F2380AB772B92E74) == 0x000008, "Wrong size on GA_Card_LinkAllyToRedirectDmg_C_Success_C9194E774E01AED9F2380AB772B92E74");
static_assert(offsetof(GA_Card_LinkAllyToRedirectDmg_C_Success_C9194E774E01AED9F2380AB772B92E74, SpawnedActor) == 0x000000, "Member 'GA_Card_LinkAllyToRedirectDmg_C_Success_C9194E774E01AED9F2380AB772B92E74::SpawnedActor' has a wrong offset!");

}

