#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_UnstablePurification_Passive

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_UnstablePurification_Passive.GA_Card_UnstablePurification_Passive_C.ExecuteUbergraph_GA_Card_UnstablePurification_Passive
// 0x0078 (0x0078 - 0x0000)
struct GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_BlockedSpec;                    // 0x0008(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ImmunityGameplayEffectHandle;   // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEffectSpecHandle& BlockedSpec, const struct FActiveGameplayEffectHandle& ImmunityGameplayEffectHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0040(0x0018)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEffectBlockedImmunity* CallFunc_WaitGameplayEffectBlockedByImmunity_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive) == 0x000008, "Wrong alignment on GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive");
static_assert(sizeof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive) == 0x000078, "Wrong size on GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, EntryPoint) == 0x000000, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, CallFunc_GetAbilityLevel_ReturnValue) == 0x000004, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, K2Node_CustomEvent_BlockedSpec) == 0x000008, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::K2Node_CustomEvent_BlockedSpec' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, K2Node_CustomEvent_ImmunityGameplayEffectHandle) == 0x000020, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::K2Node_CustomEvent_ImmunityGameplayEffectHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, Temp_struct_Variable) == 0x000038, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, Temp_struct_Variable2) == 0x000040, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, Temp_bool_Has_Been_Initd_Variable) == 0x000058, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, Temp_bool_IsClosed_Variable) == 0x000059, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00005C, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, CallFunc_WaitGameplayEffectBlockedByImmunity_ReturnValue) == 0x000068, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::CallFunc_WaitGameplayEffectBlockedByImmunity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'GA_Card_UnstablePurification_Passive_C_ExecuteUbergraph_GA_Card_UnstablePurification_Passive::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Card_UnstablePurification_Passive.GA_Card_UnstablePurification_Passive_C.Blocked_4C5373B1400E47056BEDB7BB0F28A6A8
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_UnstablePurification_Passive_C_Blocked_4C5373B1400E47056BEDB7BB0F28A6A8 final
{
public:
	struct FGameplayEffectSpecHandle              BlockedSpec;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ImmunityGameplayEffectHandle;                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_UnstablePurification_Passive_C_Blocked_4C5373B1400E47056BEDB7BB0F28A6A8) == 0x000008, "Wrong alignment on GA_Card_UnstablePurification_Passive_C_Blocked_4C5373B1400E47056BEDB7BB0F28A6A8");
static_assert(sizeof(GA_Card_UnstablePurification_Passive_C_Blocked_4C5373B1400E47056BEDB7BB0F28A6A8) == 0x000020, "Wrong size on GA_Card_UnstablePurification_Passive_C_Blocked_4C5373B1400E47056BEDB7BB0F28A6A8");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_Blocked_4C5373B1400E47056BEDB7BB0F28A6A8, BlockedSpec) == 0x000000, "Member 'GA_Card_UnstablePurification_Passive_C_Blocked_4C5373B1400E47056BEDB7BB0F28A6A8::BlockedSpec' has a wrong offset!");
static_assert(offsetof(GA_Card_UnstablePurification_Passive_C_Blocked_4C5373B1400E47056BEDB7BB0F28A6A8, ImmunityGameplayEffectHandle) == 0x000018, "Member 'GA_Card_UnstablePurification_Passive_C_Blocked_4C5373B1400E47056BEDB7BB0F28A6A8::ImmunityGameplayEffectHandle' has a wrong offset!");

}

