#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_SplitPusher

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Aura_SplitPusher.GA_Card_Aura_SplitPusher_C
// 0x0060 (0x0BD0 - 0x0B70)
class UGA_Card_Aura_SplitPusher_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FOrionFilterAndEffectsContainer        AuraFilter;                                        // 0x0B78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOrionAuraHandle                       Aura;                                              // 0x0B98(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0B9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ValueRadius;                                       // 0x0BA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 Actor;                                             // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Aura_SplitPusher(int32 EntryPoint);
	void Added_A3F4F2A34FDA8D02C03E7D8A0247CF34();
	void FailedToSpawn_C261E43E423AB52F62AA068841703EBF(class AActor* SpawnedActor);
	void K2_ActivateAbility();
	void NotAuthority_C261E43E423AB52F62AA068841703EBF(class AActor* SpawnedActor);
	void OnStateEnded_0B40D8814946AB4A3FD0A283A5B3BE45();
	void OnStateInterrupted_0B40D8814946AB4A3FD0A283A5B3BE45();
	void Removed_C0DD32B648B141D4160C28BEFAE30CD7();
	void Success_C261E43E423AB52F62AA068841703EBF(class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Aura_SplitPusher_C">();
	}
	static class UGA_Card_Aura_SplitPusher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Aura_SplitPusher_C>();
	}
};
static_assert(alignof(UGA_Card_Aura_SplitPusher_C) == 0x000010, "Wrong alignment on UGA_Card_Aura_SplitPusher_C");
static_assert(sizeof(UGA_Card_Aura_SplitPusher_C) == 0x000BD0, "Wrong size on UGA_Card_Aura_SplitPusher_C");
static_assert(offsetof(UGA_Card_Aura_SplitPusher_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Aura_SplitPusher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_SplitPusher_C, AuraFilter) == 0x000B78, "Member 'UGA_Card_Aura_SplitPusher_C::AuraFilter' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_SplitPusher_C, Aura) == 0x000B98, "Member 'UGA_Card_Aura_SplitPusher_C::Aura' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_SplitPusher_C, Radius) == 0x000B9C, "Member 'UGA_Card_Aura_SplitPusher_C::Radius' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_SplitPusher_C, ValueRadius) == 0x000BA0, "Member 'UGA_Card_Aura_SplitPusher_C::ValueRadius' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_SplitPusher_C, Actor) == 0x000BC8, "Member 'UGA_Card_Aura_SplitPusher_C::Actor' has a wrong offset!");

}

