#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Teleport

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Teleport.GA_Card_Teleport_C
// 0x0030 (0x0BA0 - 0x0B70)
class UGA_Card_Teleport_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	float                                         TeleportChannelTime;                               // 0x0B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7C[0x4];                                      // 0x0B7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CDR_Cancelled;                                     // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_AppliedToTarget;                                // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GENoCardShop;                                      // 0x0B90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnDistanceFromTower;                            // 0x0B98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Teleport(int32 EntryPoint);
	void Cancelled_BB2252FA4B094C296E95509A0549DCEE(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_BB2252FA4B094C296E95509A0549DCEE(const struct FGameplayAbilityTargetDataHandle& Targets);
	void K2_ActivateAbility();
	void OnActivate_F93B108343F732AB9358979233359ABC(class UGameplayAbility* ActivatedAbility);
	void OnFinish_8DE120914288CF9AA2B574963DCA9645();
	void OnKilled_5272A2FD43C8DA77565F329219314BC8(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle);
	void OnStateEnded_E8F80B384F8D75B51D289987AD4AE13D();
	void OnStateInterrupted_E8F80B384F8D75B51D289987AD4AE13D();
	void OnSync_9CA8EF2A4F93226D0B2A11866CE2C950();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Teleport_C">();
	}
	static class UGA_Card_Teleport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Teleport_C>();
	}
};
static_assert(alignof(UGA_Card_Teleport_C) == 0x000010, "Wrong alignment on UGA_Card_Teleport_C");
static_assert(sizeof(UGA_Card_Teleport_C) == 0x000BA0, "Wrong size on UGA_Card_Teleport_C");
static_assert(offsetof(UGA_Card_Teleport_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Teleport_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Teleport_C, TeleportChannelTime) == 0x000B78, "Member 'UGA_Card_Teleport_C::TeleportChannelTime' has a wrong offset!");
static_assert(offsetof(UGA_Card_Teleport_C, CDR_Cancelled) == 0x000B80, "Member 'UGA_Card_Teleport_C::CDR_Cancelled' has a wrong offset!");
static_assert(offsetof(UGA_Card_Teleport_C, GE_AppliedToTarget) == 0x000B88, "Member 'UGA_Card_Teleport_C::GE_AppliedToTarget' has a wrong offset!");
static_assert(offsetof(UGA_Card_Teleport_C, GENoCardShop) == 0x000B90, "Member 'UGA_Card_Teleport_C::GENoCardShop' has a wrong offset!");
static_assert(offsetof(UGA_Card_Teleport_C, SpawnDistanceFromTower) == 0x000B98, "Member 'UGA_Card_Teleport_C::SpawnDistanceFromTower' has a wrong offset!");

}

