#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_Ruthless

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Gem_Ruthless.GA_Gem_Ruthless_C
// 0x00B0 (0x0C20 - 0x0B70)
class UGA_Gem_Ruthless_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FDamageQualifierKeywordsWithContext    Qualifiers;                                        // 0x0B78(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PCTBonusDmg;                                       // 0x0BF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF4[0x4];                                      // 0x0BF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ValuePCTBonusDmg;                                  // 0x0BF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Gem_Ruthless(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnDamage_CCE153A94F0038E71B0AE4A15D224519(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Gem_Ruthless_C">();
	}
	static class UGA_Gem_Ruthless_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Gem_Ruthless_C>();
	}
};
static_assert(alignof(UGA_Gem_Ruthless_C) == 0x000010, "Wrong alignment on UGA_Gem_Ruthless_C");
static_assert(sizeof(UGA_Gem_Ruthless_C) == 0x000C20, "Wrong size on UGA_Gem_Ruthless_C");
static_assert(offsetof(UGA_Gem_Ruthless_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Gem_Ruthless_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Gem_Ruthless_C, Qualifiers) == 0x000B78, "Member 'UGA_Gem_Ruthless_C::Qualifiers' has a wrong offset!");
static_assert(offsetof(UGA_Gem_Ruthless_C, PCTBonusDmg) == 0x000BF0, "Member 'UGA_Gem_Ruthless_C::PCTBonusDmg' has a wrong offset!");
static_assert(offsetof(UGA_Gem_Ruthless_C, ValuePCTBonusDmg) == 0x000BF8, "Member 'UGA_Gem_Ruthless_C::ValuePCTBonusDmg' has a wrong offset!");

}

