#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_ImprovedHealthRegen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Gem_ImprovedHealthRegen.GA_Gem_ImprovedHealthRegen_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Gem_ImprovedHealthRegen_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            RegenGE;                                           // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            OOCRegenGE;                                        // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Gem_ImprovedHealthRegen(int32 EntryPoint);
	void AddStacks();
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Gem_ImprovedHealthRegen_C">();
	}
	static class UGA_Gem_ImprovedHealthRegen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Gem_ImprovedHealthRegen_C>();
	}
};
static_assert(alignof(UGA_Gem_ImprovedHealthRegen_C) == 0x000010, "Wrong alignment on UGA_Gem_ImprovedHealthRegen_C");
static_assert(sizeof(UGA_Gem_ImprovedHealthRegen_C) == 0x000B90, "Wrong size on UGA_Gem_ImprovedHealthRegen_C");
static_assert(offsetof(UGA_Gem_ImprovedHealthRegen_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Gem_ImprovedHealthRegen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Gem_ImprovedHealthRegen_C, RegenGE) == 0x000B78, "Member 'UGA_Gem_ImprovedHealthRegen_C::RegenGE' has a wrong offset!");
static_assert(offsetof(UGA_Gem_ImprovedHealthRegen_C, OOCRegenGE) == 0x000B80, "Member 'UGA_Gem_ImprovedHealthRegen_C::OOCRegenGE' has a wrong offset!");

}

