#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_SpellShield

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Gem_SpellShield.GA_Gem_SpellShield_C.ExecuteUbergraph_GA_Gem_SpellShield
// 0x0190 (0x0190 - 0x0000)
struct GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEffectSpecHandle& BlockedSpec, const struct FActiveGameplayEffectHandle& ImmunityGameplayEffectHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_BlockedSpec2;                   // 0x0028(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ImmunityGameplayEffectHandle2;  // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0050(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEffectSpecHandle& BlockedSpec, const struct FActiveGameplayEffectHandle& ImmunityGameplayEffectHandle)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_BlockedSpec;                    // 0x0098(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ImmunityGameplayEffectHandle;   // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable3;                             // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable4;                             // 0x00C0(0x0018)()
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x00D8(0x0040)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitGameplayEffectBlockedImmunity* CallFunc_WaitGameplayEffectBlockedByImmunity_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0134(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEffectBlockedImmunity* CallFunc_WaitGameplayEffectBlockedByImmunity_ReturnValue2; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield) == 0x000008, "Wrong alignment on GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield");
static_assert(sizeof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield) == 0x000190, "Wrong size on GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, EntryPoint) == 0x000000, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_StartAbilityState_ReturnValue) == 0x000008, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_CustomEvent_BlockedSpec2) == 0x000028, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_CustomEvent_BlockedSpec2' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_CustomEvent_ImmunityGameplayEffectHandle2) == 0x000040, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_CustomEvent_ImmunityGameplayEffectHandle2' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, Temp_struct_Variable) == 0x000048, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, Temp_struct_Variable2) == 0x000050, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_WaitDelay_ReturnValue) == 0x000078, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, Temp_bool_Variable) == 0x000080, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_IsValid_ReturnValue2) == 0x000081, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_CreateDelegate_OutputDelegate3) == 0x000088, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_CustomEvent_BlockedSpec) == 0x000098, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_CustomEvent_BlockedSpec' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_CustomEvent_ImmunityGameplayEffectHandle) == 0x0000B0, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_CustomEvent_ImmunityGameplayEffectHandle' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, Temp_struct_Variable3) == 0x0000B8, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, Temp_struct_Variable4) == 0x0000C0, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_GetActorInfo_ReturnValue) == 0x0000D8, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_CreateDelegate_OutputDelegate4) == 0x000118, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_WaitGameplayEffectBlockedByImmunity_ReturnValue) == 0x000128, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_WaitGameplayEffectBlockedByImmunity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_IsValid_ReturnValue3) == 0x000130, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000134, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x00013C, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000140, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000148, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, K2Node_CreateDelegate_OutputDelegate5) == 0x000160, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000170, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_GetAbilityLevel_ReturnValue) == 0x000174, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x000178, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_WaitGameplayEffectBlockedByImmunity_ReturnValue2) == 0x000180, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_WaitGameplayEffectBlockedByImmunity_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield, CallFunc_IsValid_ReturnValue4) == 0x000188, "Member 'GA_Gem_SpellShield_C_ExecuteUbergraph_GA_Gem_SpellShield::CallFunc_IsValid_ReturnValue4' has a wrong offset!");

// Function GA_Gem_SpellShield.GA_Gem_SpellShield_C.Blocked_B999244746F20D754401B18C401DB5B8
// 0x0020 (0x0020 - 0x0000)
struct GA_Gem_SpellShield_C_Blocked_B999244746F20D754401B18C401DB5B8 final
{
public:
	struct FGameplayEffectSpecHandle              BlockedSpec;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ImmunityGameplayEffectHandle;                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_SpellShield_C_Blocked_B999244746F20D754401B18C401DB5B8) == 0x000008, "Wrong alignment on GA_Gem_SpellShield_C_Blocked_B999244746F20D754401B18C401DB5B8");
static_assert(sizeof(GA_Gem_SpellShield_C_Blocked_B999244746F20D754401B18C401DB5B8) == 0x000020, "Wrong size on GA_Gem_SpellShield_C_Blocked_B999244746F20D754401B18C401DB5B8");
static_assert(offsetof(GA_Gem_SpellShield_C_Blocked_B999244746F20D754401B18C401DB5B8, BlockedSpec) == 0x000000, "Member 'GA_Gem_SpellShield_C_Blocked_B999244746F20D754401B18C401DB5B8::BlockedSpec' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_Blocked_B999244746F20D754401B18C401DB5B8, ImmunityGameplayEffectHandle) == 0x000018, "Member 'GA_Gem_SpellShield_C_Blocked_B999244746F20D754401B18C401DB5B8::ImmunityGameplayEffectHandle' has a wrong offset!");

// Function GA_Gem_SpellShield.GA_Gem_SpellShield_C.Blocked_BA5C2C2645671BAE8F9B05916B9DDC31
// 0x0020 (0x0020 - 0x0000)
struct GA_Gem_SpellShield_C_Blocked_BA5C2C2645671BAE8F9B05916B9DDC31 final
{
public:
	struct FGameplayEffectSpecHandle              BlockedSpec;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ImmunityGameplayEffectHandle;                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_SpellShield_C_Blocked_BA5C2C2645671BAE8F9B05916B9DDC31) == 0x000008, "Wrong alignment on GA_Gem_SpellShield_C_Blocked_BA5C2C2645671BAE8F9B05916B9DDC31");
static_assert(sizeof(GA_Gem_SpellShield_C_Blocked_BA5C2C2645671BAE8F9B05916B9DDC31) == 0x000020, "Wrong size on GA_Gem_SpellShield_C_Blocked_BA5C2C2645671BAE8F9B05916B9DDC31");
static_assert(offsetof(GA_Gem_SpellShield_C_Blocked_BA5C2C2645671BAE8F9B05916B9DDC31, BlockedSpec) == 0x000000, "Member 'GA_Gem_SpellShield_C_Blocked_BA5C2C2645671BAE8F9B05916B9DDC31::BlockedSpec' has a wrong offset!");
static_assert(offsetof(GA_Gem_SpellShield_C_Blocked_BA5C2C2645671BAE8F9B05916B9DDC31, ImmunityGameplayEffectHandle) == 0x000018, "Member 'GA_Gem_SpellShield_C_Blocked_BA5C2C2645671BAE8F9B05916B9DDC31::ImmunityGameplayEffectHandle' has a wrong offset!");

}

