#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_EmpoweredAttacks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Gem_EmpoweredAttacks.GA_Gem_EmpoweredAttacks_C
// 0x0060 (0x0BD0 - 0x0B70)
class UGA_Gem_EmpoweredAttacks_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 DamageGE;                                          // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanActivate;                                       // 0x0B80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B81[0x3];                                      // 0x0B81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            BonusDamageGE;                                     // 0x0B84(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8C[0x4];                                      // 0x0B8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               BasicDamageTags;                                   // 0x0B90(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Gem_EmpoweredAttacks(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnApplied_04C1510644C44C3099AD6FBEDA94E985(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Gem_EmpoweredAttacks_C">();
	}
	static class UGA_Gem_EmpoweredAttacks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Gem_EmpoweredAttacks_C>();
	}
};
static_assert(alignof(UGA_Gem_EmpoweredAttacks_C) == 0x000010, "Wrong alignment on UGA_Gem_EmpoweredAttacks_C");
static_assert(sizeof(UGA_Gem_EmpoweredAttacks_C) == 0x000BD0, "Wrong size on UGA_Gem_EmpoweredAttacks_C");
static_assert(offsetof(UGA_Gem_EmpoweredAttacks_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Gem_EmpoweredAttacks_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Gem_EmpoweredAttacks_C, DamageGE) == 0x000B78, "Member 'UGA_Gem_EmpoweredAttacks_C::DamageGE' has a wrong offset!");
static_assert(offsetof(UGA_Gem_EmpoweredAttacks_C, CanActivate) == 0x000B80, "Member 'UGA_Gem_EmpoweredAttacks_C::CanActivate' has a wrong offset!");
static_assert(offsetof(UGA_Gem_EmpoweredAttacks_C, BonusDamageGE) == 0x000B84, "Member 'UGA_Gem_EmpoweredAttacks_C::BonusDamageGE' has a wrong offset!");
static_assert(offsetof(UGA_Gem_EmpoweredAttacks_C, BasicDamageTags) == 0x000B90, "Member 'UGA_Gem_EmpoweredAttacks_C::BasicDamageTags' has a wrong offset!");

}

