#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_JumpPadMove

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_JumpPadMove.GA_JumpPadMove_C.ExecuteUbergraph_GA_JumpPadMove
// 0x0218 (0x0218 - 0x0000)
struct GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             CallFunc_GetOrionCharFromActorInfo_ReturnValue;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0110(0x0040)(ContainsInstancedReference)
	bool                                          Temp_bool_Variable2;                               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0154(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0160(0x0018)()
	class UObject*                                CallFunc_EffectContextGetSourceObject_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EffectContextIsValid_ReturnValue;         // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_JumpPad_RootMotion_Master_C*        K2Node_DynamicCast_AsBP_Jump_Pad_Root_Motion_Master; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyRootMotionMoveToActorForce* CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_DestinationReached;             // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_TimedOut;                       // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_FinalTargetLocation;            // 0x01B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Hero_C*                             K2Node_DynamicCast_AsBP_Hero;                      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation)> K2Node_CreateDelegate_OutputDelegate11;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue2;                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove) == 0x000008, "Wrong alignment on GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove");
static_assert(sizeof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove) == 0x000218, "Wrong size on GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, EntryPoint) == 0x000000, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_WaitDelay_ReturnValue) == 0x000008, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000028, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_IsValid_ReturnValue2) == 0x000040, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_StartAbilityState_ReturnValue) == 0x000058, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_IsValid_ReturnValue3) == 0x000070, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CustomEvent_NotifyName5) == 0x000078, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate5) == 0x000080, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CustomEvent_NotifyName4) == 0x000090, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate6) == 0x000098, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CustomEvent_NotifyName3) == 0x0000A8, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CustomEvent_NotifyName2) == 0x0000C0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate8) == 0x0000C8, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CustomEvent_NotifyName) == 0x0000D8, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate9) == 0x0000E0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, Temp_name_Variable) == 0x0000F0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, Temp_bool_Variable) == 0x0000F8, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, Temp_bool_IsClosed_Variable) == 0x0000F9, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_GetOrionCharFromActorInfo_ReturnValue) == 0x000100, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_GetOrionCharFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_IsValid_ReturnValue4) == 0x000108, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, Temp_bool_Has_Been_Initd_Variable) == 0x000109, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_GetActorInfo_ReturnValue) == 0x000110, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, Temp_bool_Variable2) == 0x000150, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, Temp_struct_Variable) == 0x000154, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000160, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_EffectContextGetSourceObject_ReturnValue) == 0x000178, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_EffectContextGetSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_EffectContextIsValid_ReturnValue) == 0x000180, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_EffectContextIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_DynamicCast_AsBP_Jump_Pad_Root_Motion_Master) == 0x000188, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_DynamicCast_AsBP_Jump_Pad_Root_Motion_Master' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue) == 0x000198, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate10) == 0x0001A0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_IsValid_ReturnValue5) == 0x0001B0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_IsValid_ReturnValue6) == 0x0001B1, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CustomEvent_DestinationReached) == 0x0001B2, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CustomEvent_DestinationReached' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CustomEvent_TimedOut) == 0x0001B3, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CustomEvent_TimedOut' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CustomEvent_FinalTargetLocation) == 0x0001B4, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CustomEvent_FinalTargetLocation' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001C0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_IsValid_ReturnValue7) == 0x0001C8, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_DynamicCast_AsBP_Hero) == 0x0001D0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_DynamicCast_AsBP_Hero' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_DynamicCast_bSuccess2) == 0x0001D8, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, K2Node_CreateDelegate_OutputDelegate11) == 0x0001E0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0001F0, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0001F8, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_WaitDelay_ReturnValue2) == 0x000200, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_WaitDelay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000208, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_IsValid_ReturnValue8) == 0x000210, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove, CallFunc_IsValid_ReturnValue9) == 0x000211, "Member 'GA_JumpPadMove_C_ExecuteUbergraph_GA_JumpPadMove::CallFunc_IsValid_ReturnValue9' has a wrong offset!");

// Function GA_JumpPadMove.GA_JumpPadMove_C.OnCompleted_E748BE7842606FB887B68E9A87534A64
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JumpPadMove_C_OnCompleted_E748BE7842606FB887B68E9A87534A64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JumpPadMove_C_OnCompleted_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong alignment on GA_JumpPadMove_C_OnCompleted_E748BE7842606FB887B68E9A87534A64");
static_assert(sizeof(GA_JumpPadMove_C_OnCompleted_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong size on GA_JumpPadMove_C_OnCompleted_E748BE7842606FB887B68E9A87534A64");
static_assert(offsetof(GA_JumpPadMove_C_OnCompleted_E748BE7842606FB887B68E9A87534A64, NotifyName) == 0x000000, "Member 'GA_JumpPadMove_C_OnCompleted_E748BE7842606FB887B68E9A87534A64::NotifyName' has a wrong offset!");

// Function GA_JumpPadMove.GA_JumpPadMove_C.OnBlendOut_E748BE7842606FB887B68E9A87534A64
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JumpPadMove_C_OnBlendOut_E748BE7842606FB887B68E9A87534A64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JumpPadMove_C_OnBlendOut_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong alignment on GA_JumpPadMove_C_OnBlendOut_E748BE7842606FB887B68E9A87534A64");
static_assert(sizeof(GA_JumpPadMove_C_OnBlendOut_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong size on GA_JumpPadMove_C_OnBlendOut_E748BE7842606FB887B68E9A87534A64");
static_assert(offsetof(GA_JumpPadMove_C_OnBlendOut_E748BE7842606FB887B68E9A87534A64, NotifyName) == 0x000000, "Member 'GA_JumpPadMove_C_OnBlendOut_E748BE7842606FB887B68E9A87534A64::NotifyName' has a wrong offset!");

// Function GA_JumpPadMove.GA_JumpPadMove_C.OnInterrupted_E748BE7842606FB887B68E9A87534A64
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JumpPadMove_C_OnInterrupted_E748BE7842606FB887B68E9A87534A64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JumpPadMove_C_OnInterrupted_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong alignment on GA_JumpPadMove_C_OnInterrupted_E748BE7842606FB887B68E9A87534A64");
static_assert(sizeof(GA_JumpPadMove_C_OnInterrupted_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong size on GA_JumpPadMove_C_OnInterrupted_E748BE7842606FB887B68E9A87534A64");
static_assert(offsetof(GA_JumpPadMove_C_OnInterrupted_E748BE7842606FB887B68E9A87534A64, NotifyName) == 0x000000, "Member 'GA_JumpPadMove_C_OnInterrupted_E748BE7842606FB887B68E9A87534A64::NotifyName' has a wrong offset!");

// Function GA_JumpPadMove.GA_JumpPadMove_C.OnNotifyBegin_E748BE7842606FB887B68E9A87534A64
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JumpPadMove_C_OnNotifyBegin_E748BE7842606FB887B68E9A87534A64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JumpPadMove_C_OnNotifyBegin_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong alignment on GA_JumpPadMove_C_OnNotifyBegin_E748BE7842606FB887B68E9A87534A64");
static_assert(sizeof(GA_JumpPadMove_C_OnNotifyBegin_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong size on GA_JumpPadMove_C_OnNotifyBegin_E748BE7842606FB887B68E9A87534A64");
static_assert(offsetof(GA_JumpPadMove_C_OnNotifyBegin_E748BE7842606FB887B68E9A87534A64, NotifyName) == 0x000000, "Member 'GA_JumpPadMove_C_OnNotifyBegin_E748BE7842606FB887B68E9A87534A64::NotifyName' has a wrong offset!");

// Function GA_JumpPadMove.GA_JumpPadMove_C.OnNotifyEnd_E748BE7842606FB887B68E9A87534A64
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JumpPadMove_C_OnNotifyEnd_E748BE7842606FB887B68E9A87534A64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JumpPadMove_C_OnNotifyEnd_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong alignment on GA_JumpPadMove_C_OnNotifyEnd_E748BE7842606FB887B68E9A87534A64");
static_assert(sizeof(GA_JumpPadMove_C_OnNotifyEnd_E748BE7842606FB887B68E9A87534A64) == 0x000008, "Wrong size on GA_JumpPadMove_C_OnNotifyEnd_E748BE7842606FB887B68E9A87534A64");
static_assert(offsetof(GA_JumpPadMove_C_OnNotifyEnd_E748BE7842606FB887B68E9A87534A64, NotifyName) == 0x000000, "Member 'GA_JumpPadMove_C_OnNotifyEnd_E748BE7842606FB887B68E9A87534A64::NotifyName' has a wrong offset!");

// Function GA_JumpPadMove.GA_JumpPadMove_C.OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB
// 0x0010 (0x0010 - 0x0000)
struct GA_JumpPadMove_C_OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB final
{
public:
	bool                                          DestinationReached;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TimedOut;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FinalTargetLocation;                               // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JumpPadMove_C_OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB) == 0x000004, "Wrong alignment on GA_JumpPadMove_C_OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB");
static_assert(sizeof(GA_JumpPadMove_C_OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB) == 0x000010, "Wrong size on GA_JumpPadMove_C_OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB");
static_assert(offsetof(GA_JumpPadMove_C_OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB, DestinationReached) == 0x000000, "Member 'GA_JumpPadMove_C_OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB::DestinationReached' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_C_OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB, TimedOut) == 0x000001, "Member 'GA_JumpPadMove_C_OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB::TimedOut' has a wrong offset!");
