#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_JungleBuff_Spawn

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.ExecuteUbergraph_GA_JungleBuff_Spawn
// 0x00B0 (0x00B0 - 0x0000)
struct GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn) == 0x000008, "Wrong alignment on GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn");
static_assert(sizeof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn) == 0x0000B0, "Wrong size on GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, EntryPoint) == 0x000000, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000008, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CustomEvent_NotifyName6) == 0x000028, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CustomEvent_NotifyName5) == 0x000030, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CustomEvent_NotifyName4) == 0x000058, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CustomEvent_NotifyName3) == 0x000060, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CreateDelegate_OutputDelegate4) == 0x000068, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CreateDelegate_OutputDelegate5) == 0x000078, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CustomEvent_NotifyName2) == 0x000088, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CustomEvent_NotifyName) == 0x000090, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, K2Node_CreateDelegate_OutputDelegate6) == 0x000098, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn, Temp_name_Variable) == 0x0000A8, "Member 'GA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn::Temp_name_Variable' has a wrong offset!");

// Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JungleBuff_Spawn_C_OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JungleBuff_Spawn_C_OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong alignment on GA_JungleBuff_Spawn_C_OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(sizeof(GA_JungleBuff_Spawn_C_OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong size on GA_JungleBuff_Spawn_C_OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(offsetof(GA_JungleBuff_Spawn_C_OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54, NotifyName) == 0x000000, "Member 'GA_JungleBuff_Spawn_C_OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54::NotifyName' has a wrong offset!");

// Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JungleBuff_Spawn_C_OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JungleBuff_Spawn_C_OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong alignment on GA_JungleBuff_Spawn_C_OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(sizeof(GA_JungleBuff_Spawn_C_OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong size on GA_JungleBuff_Spawn_C_OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(offsetof(GA_JungleBuff_Spawn_C_OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54, NotifyName) == 0x000000, "Member 'GA_JungleBuff_Spawn_C_OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54::NotifyName' has a wrong offset!");

// Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JungleBuff_Spawn_C_OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JungleBuff_Spawn_C_OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong alignment on GA_JungleBuff_Spawn_C_OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(sizeof(GA_JungleBuff_Spawn_C_OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong size on GA_JungleBuff_Spawn_C_OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(offsetof(GA_JungleBuff_Spawn_C_OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54, NotifyName) == 0x000000, "Member 'GA_JungleBuff_Spawn_C_OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54::NotifyName' has a wrong offset!");

// Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JungleBuff_Spawn_C_OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JungleBuff_Spawn_C_OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong alignment on GA_JungleBuff_Spawn_C_OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(sizeof(GA_JungleBuff_Spawn_C_OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong size on GA_JungleBuff_Spawn_C_OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(offsetof(GA_JungleBuff_Spawn_C_OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54, NotifyName) == 0x000000, "Member 'GA_JungleBuff_Spawn_C_OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54::NotifyName' has a wrong offset!");

// Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JungleBuff_Spawn_C_OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JungleBuff_Spawn_C_OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong alignment on GA_JungleBuff_Spawn_C_OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(sizeof(GA_JungleBuff_Spawn_C_OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong size on GA_JungleBuff_Spawn_C_OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(offsetof(GA_JungleBuff_Spawn_C_OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54, NotifyName) == 0x000000, "Member 'GA_JungleBuff_Spawn_C_OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54::NotifyName' has a wrong offset!");

// Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_JungleBuff_Spawn_C_OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JungleBuff_Spawn_C_OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong alignment on GA_JungleBuff_Spawn_C_OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(sizeof(GA_JungleBuff_Spawn_C_OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54) == 0x000008, "Wrong size on GA_JungleBuff_Spawn_C_OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54");
static_assert(offsetof(GA_JungleBuff_Spawn_C_OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54, NotifyName) == 0x000000, "Member 'GA_JungleBuff_Spawn_C_OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54::NotifyName' has a wrong offset!");

}

