#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_KilledPlayer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_KilledPlayer.GA_KilledPlayer_C.ExecuteUbergraph_GA_KilledPlayer
// 0x0228 (0x0228 - 0x0000)
struct GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewValue3;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor3;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext3;          // 0x0018(0x0018)()
	int32                                         K2Node_CustomEvent_NewValue2;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor2;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext2;          // 0x0040(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext;           // 0x0078(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectContextHandle           Temp_struct_Variable;                              // 0x00A0(0x0018)()
	class AActor*                                 Temp_object_Variable;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_AddPlayerScoreListener* CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewValue4;                      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_KilledActor4;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext4;          // 0x01A8(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate11;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate12;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Hero_C*                             K2Node_DynamicCast_AsBP_Hero;                      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer");
static_assert(sizeof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer) == 0x000228, "Wrong size on GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, EntryPoint) == 0x000000, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NewValue3) == 0x000008, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NewValue3' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_KilledActor3) == 0x000010, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_KilledActor3' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_KillingEffectContext3) == 0x000018, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_KillingEffectContext3' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NewValue2) == 0x000030, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NewValue2' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_KilledActor2) == 0x000038, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_KilledActor2' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_KillingEffectContext2) == 0x000040, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_KillingEffectContext2' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NewValue) == 0x000068, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_KilledActor) == 0x000070, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_KilledActor' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_KillingEffectContext) == 0x000078, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_KillingEffectContext' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate2) == 0x000090, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, Temp_struct_Variable) == 0x0000A0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, Temp_object_Variable) == 0x0000B8, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, Temp_int_Variable) == 0x0000C0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue) == 0x0000C8, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NotifyName6) == 0x0000D8, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate3) == 0x0000E0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NotifyName5) == 0x0000F0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate4) == 0x0000F8, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NotifyName4) == 0x000108, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate5) == 0x000110, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NotifyName3) == 0x000120, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate6) == 0x000128, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NotifyName2) == 0x000138, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate7) == 0x000140, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NotifyName) == 0x000150, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate8) == 0x000158, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, Temp_name_Variable) == 0x000168, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate9) == 0x000170, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_WaitNetSync_ReturnValue) == 0x000180, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate10) == 0x000188, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_IsValid_ReturnValue2) == 0x000198, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_NewValue4) == 0x00019C, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_NewValue4' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_KilledActor4) == 0x0001A0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_KilledActor4' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CustomEvent_KillingEffectContext4) == 0x0001A8, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CustomEvent_KillingEffectContext4' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate11) == 0x0001C0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_CreateDelegate_OutputDelegate12) == 0x0001D0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001E0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue) == 0x0001E8, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_IsValid_ReturnValue3) == 0x0001F0, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_DynamicCast_AsBP_Hero) == 0x0001F8, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_DynamicCast_AsBP_Hero' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000208, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_IsValid_ReturnValue4) == 0x000210, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_IsValid_ReturnValue5) == 0x000211, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_WaitDelay_ReturnValue) == 0x000218, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, CallFunc_IsValid_ReturnValue6) == 0x000220, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer, Temp_bool_Has_Been_Initd_Variable) == 0x000221, "Member 'GA_KilledPlayer_C_ExecuteUbergraph_GA_KilledPlayer::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnBlendOut_85E4D7314684E5EDDCBE90BF79FCAA8A
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_KilledPlayer_C_OnBlendOut_85E4D7314684E5EDDCBE90BF79FCAA8A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_KilledPlayer_C_OnBlendOut_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnBlendOut_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(sizeof(GA_KilledPlayer_C_OnBlendOut_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong size on GA_KilledPlayer_C_OnBlendOut_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(offsetof(GA_KilledPlayer_C_OnBlendOut_85E4D7314684E5EDDCBE90BF79FCAA8A, NotifyName) == 0x000000, "Member 'GA_KilledPlayer_C_OnBlendOut_85E4D7314684E5EDDCBE90BF79FCAA8A::NotifyName' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnCancelled_85E4D7314684E5EDDCBE90BF79FCAA8A
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_KilledPlayer_C_OnCancelled_85E4D7314684E5EDDCBE90BF79FCAA8A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_KilledPlayer_C_OnCancelled_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnCancelled_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(sizeof(GA_KilledPlayer_C_OnCancelled_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong size on GA_KilledPlayer_C_OnCancelled_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(offsetof(GA_KilledPlayer_C_OnCancelled_85E4D7314684E5EDDCBE90BF79FCAA8A, NotifyName) == 0x000000, "Member 'GA_KilledPlayer_C_OnCancelled_85E4D7314684E5EDDCBE90BF79FCAA8A::NotifyName' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnCompleted_85E4D7314684E5EDDCBE90BF79FCAA8A
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_KilledPlayer_C_OnCompleted_85E4D7314684E5EDDCBE90BF79FCAA8A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_KilledPlayer_C_OnCompleted_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnCompleted_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(sizeof(GA_KilledPlayer_C_OnCompleted_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong size on GA_KilledPlayer_C_OnCompleted_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(offsetof(GA_KilledPlayer_C_OnCompleted_85E4D7314684E5EDDCBE90BF79FCAA8A, NotifyName) == 0x000000, "Member 'GA_KilledPlayer_C_OnCompleted_85E4D7314684E5EDDCBE90BF79FCAA8A::NotifyName' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnInterrupted_85E4D7314684E5EDDCBE90BF79FCAA8A
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_KilledPlayer_C_OnInterrupted_85E4D7314684E5EDDCBE90BF79FCAA8A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_KilledPlayer_C_OnInterrupted_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnInterrupted_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(sizeof(GA_KilledPlayer_C_OnInterrupted_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong size on GA_KilledPlayer_C_OnInterrupted_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(offsetof(GA_KilledPlayer_C_OnInterrupted_85E4D7314684E5EDDCBE90BF79FCAA8A, NotifyName) == 0x000000, "Member 'GA_KilledPlayer_C_OnInterrupted_85E4D7314684E5EDDCBE90BF79FCAA8A::NotifyName' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019
// 0x0028 (0x0028 - 0x0000)
struct GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019 final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019");
static_assert(sizeof(GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019) == 0x000028, "Wrong size on GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019");
static_assert(offsetof(GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019, NewValue) == 0x000000, "Member 'GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019::NewValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019, KilledActor) == 0x000008, "Member 'GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019, KillingEffectContext) == 0x000010, "Member 'GA_KilledPlayer_C_OnMinionAssist_2C22F3AC4F27DD144E0FB3847E760019::KillingEffectContext' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019
// 0x0028 (0x0028 - 0x0000)
struct GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019 final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019");
static_assert(sizeof(GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019) == 0x000028, "Wrong size on GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019");
static_assert(offsetof(GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019, NewValue) == 0x000000, "Member 'GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019::NewValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019, KilledActor) == 0x000008, "Member 'GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019, KillingEffectContext) == 0x000010, "Member 'GA_KilledPlayer_C_OnMinionKill_2C22F3AC4F27DD144E0FB3847E760019::KillingEffectContext' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnNotifyBegin_85E4D7314684E5EDDCBE90BF79FCAA8A
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_KilledPlayer_C_OnNotifyBegin_85E4D7314684E5EDDCBE90BF79FCAA8A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_KilledPlayer_C_OnNotifyBegin_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnNotifyBegin_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(sizeof(GA_KilledPlayer_C_OnNotifyBegin_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong size on GA_KilledPlayer_C_OnNotifyBegin_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(offsetof(GA_KilledPlayer_C_OnNotifyBegin_85E4D7314684E5EDDCBE90BF79FCAA8A, NotifyName) == 0x000000, "Member 'GA_KilledPlayer_C_OnNotifyBegin_85E4D7314684E5EDDCBE90BF79FCAA8A::NotifyName' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnNotifyEnd_85E4D7314684E5EDDCBE90BF79FCAA8A
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_KilledPlayer_C_OnNotifyEnd_85E4D7314684E5EDDCBE90BF79FCAA8A final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_KilledPlayer_C_OnNotifyEnd_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnNotifyEnd_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(sizeof(GA_KilledPlayer_C_OnNotifyEnd_85E4D7314684E5EDDCBE90BF79FCAA8A) == 0x000008, "Wrong size on GA_KilledPlayer_C_OnNotifyEnd_85E4D7314684E5EDDCBE90BF79FCAA8A");
static_assert(offsetof(GA_KilledPlayer_C_OnNotifyEnd_85E4D7314684E5EDDCBE90BF79FCAA8A, NotifyName) == 0x000000, "Member 'GA_KilledPlayer_C_OnNotifyEnd_85E4D7314684E5EDDCBE90BF79FCAA8A::NotifyName' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019
// 0x0028 (0x0028 - 0x0000)
struct GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019 final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019");
static_assert(sizeof(GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019) == 0x000028, "Wrong size on GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019");
static_assert(offsetof(GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019, NewValue) == 0x000000, "Member 'GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019::NewValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019, KilledActor) == 0x000008, "Member 'GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019, KillingEffectContext) == 0x000010, "Member 'GA_KilledPlayer_C_OnPlayerAssist_2C22F3AC4F27DD144E0FB3847E760019::KillingEffectContext' has a wrong offset!");

// Function GA_KilledPlayer.GA_KilledPlayer_C.OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019
// 0x0028 (0x0028 - 0x0000)
struct GA_KilledPlayer_C_OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019 final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_KilledPlayer_C_OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019) == 0x000008, "Wrong alignment on GA_KilledPlayer_C_OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019");
static_assert(sizeof(GA_KilledPlayer_C_OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019) == 0x000028, "Wrong size on GA_KilledPlayer_C_OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019");
static_assert(offsetof(GA_KilledPlayer_C_OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019, NewValue) == 0x000000, "Member 'GA_KilledPlayer_C_OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019::NewValue' has a wrong offset!");
static_assert(offsetof(GA_KilledPlayer_C_OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019, KilledActor) == 0x000008, "Member 'GA_KilledPlayer_C_OnPlayerKill_2C22F3AC4F27DD144E0FB3847E760019::KilledActor' has a wrong offset!");
