#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Passive_HealthDanger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Passive_HealthDanger.GA_Passive_HealthDanger_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Passive_HealthDanger_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	float                                         DangerHealthThreshold;                             // 0x0B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAppliedDangerGC;                                  // 0x0B7C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7D[0x3];                                      // 0x0B7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            AppliedDangerHealthEffect;                         // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Passive_HealthDanger(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnChange_32477F9D4E719165F0275BB48A23C8E9(bool bMatchesComparison, float CurrentRatio);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Passive_HealthDanger_C">();
	}
	static class UGA_Passive_HealthDanger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Passive_HealthDanger_C>();
	}
};
static_assert(alignof(UGA_Passive_HealthDanger_C) == 0x000010, "Wrong alignment on UGA_Passive_HealthDanger_C");
static_assert(sizeof(UGA_Passive_HealthDanger_C) == 0x000B90, "Wrong size on UGA_Passive_HealthDanger_C");
static_assert(offsetof(UGA_Passive_HealthDanger_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Passive_HealthDanger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Passive_HealthDanger_C, DangerHealthThreshold) == 0x000B78, "Member 'UGA_Passive_HealthDanger_C::DangerHealthThreshold' has a wrong offset!");
static_assert(offsetof(UGA_Passive_HealthDanger_C, bAppliedDangerGC) == 0x000B7C, "Member 'UGA_Passive_HealthDanger_C::bAppliedDangerGC' has a wrong offset!");
static_assert(offsetof(UGA_Passive_HealthDanger_C, AppliedDangerHealthEffect) == 0x000B80, "Member 'UGA_Passive_HealthDanger_C::AppliedDangerHealthEffect' has a wrong offset!");

}

