#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Passive_HealthDanger

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Passive_HealthDanger.GA_Passive_HealthDanger_C.ExecuteUbergraph_GA_Passive_HealthDanger
// 0x0088 (0x0088 - 0x0000)
struct GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bMatchesComparison;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_CurrentRatio;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bMatchesComparison, float CurrentRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0028(0x0040)(ContainsInstancedReference)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAttributeChangeRatioThreshold* CallFunc_WaitForAttributeChangeRatioThreshold_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger) == 0x000008, "Wrong alignment on GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger");
static_assert(sizeof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger) == 0x000088, "Wrong size on GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, EntryPoint) == 0x000000, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, K2Node_CustomEvent_bMatchesComparison) == 0x000004, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::K2Node_CustomEvent_bMatchesComparison' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, K2Node_CustomEvent_CurrentRatio) == 0x000008, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::K2Node_CustomEvent_CurrentRatio' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, Temp_float_Variable) == 0x000020, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, Temp_bool_Variable) == 0x000024, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, CallFunc_GetActorInfo_ReturnValue) == 0x000028, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000068, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, CallFunc_WaitForAttributeChangeRatioThreshold_ReturnValue) == 0x000070, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::CallFunc_WaitForAttributeChangeRatioThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00007C, "Member 'GA_Passive_HealthDanger_C_ExecuteUbergraph_GA_Passive_HealthDanger::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Passive_HealthDanger.GA_Passive_HealthDanger_C.OnChange_32477F9D4E719165F0275BB48A23C8E9
// 0x0008 (0x0008 - 0x0000)
struct GA_Passive_HealthDanger_C_OnChange_32477F9D4E719165F0275BB48A23C8E9 final
{
public:
	bool                                          bMatchesComparison;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentRatio;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Passive_HealthDanger_C_OnChange_32477F9D4E719165F0275BB48A23C8E9) == 0x000004, "Wrong alignment on GA_Passive_HealthDanger_C_OnChange_32477F9D4E719165F0275BB48A23C8E9");
static_assert(sizeof(GA_Passive_HealthDanger_C_OnChange_32477F9D4E719165F0275BB48A23C8E9) == 0x000008, "Wrong size on GA_Passive_HealthDanger_C_OnChange_32477F9D4E719165F0275BB48A23C8E9");
static_assert(offsetof(GA_Passive_HealthDanger_C_OnChange_32477F9D4E719165F0275BB48A23C8E9, bMatchesComparison) == 0x000000, "Member 'GA_Passive_HealthDanger_C_OnChange_32477F9D4E719165F0275BB48A23C8E9::bMatchesComparison' has a wrong offset!");
static_assert(offsetof(GA_Passive_HealthDanger_C_OnChange_32477F9D4E719165F0275BB48A23C8E9, CurrentRatio) == 0x000004, "Member 'GA_Passive_HealthDanger_C_OnChange_32477F9D4E719165F0275BB48A23C8E9::CurrentRatio' has a wrong offset!");

}

