#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Passive_JungleCamp_BlockedDamageHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Passive_JungleCamp_BlockedDamageHandler.GA_Passive_JungleCamp_BlockedDamageHandler_C
// 0x0050 (0x0BC0 - 0x0B70)
class UGA_Passive_JungleCamp_BlockedDamageHandler_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTagRequirements               RequiredDamageTags;                                // 0x0B78(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Jungle_Immunity_Tag;                               // 0x0BB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Passive_JungleCamp_BlockedDamageHandler(int32 EntryPoint);
	void Blocked_7B40DF9547B53BAEC160A7889C9AC8FE(const struct FGameplayEffectSpecHandle& BlockedSpec, const struct FActiveGameplayEffectHandle& ImmunityGameplayEffectHandle);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Passive_JungleCamp_BlockedDamageHandler_C">();
	}
	static class UGA_Passive_JungleCamp_BlockedDamageHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Passive_JungleCamp_BlockedDamageHandler_C>();
	}
};
static_assert(alignof(UGA_Passive_JungleCamp_BlockedDamageHandler_C) == 0x000010, "Wrong alignment on UGA_Passive_JungleCamp_BlockedDamageHandler_C");
static_assert(sizeof(UGA_Passive_JungleCamp_BlockedDamageHandler_C) == 0x000BC0, "Wrong size on UGA_Passive_JungleCamp_BlockedDamageHandler_C");
static_assert(offsetof(UGA_Passive_JungleCamp_BlockedDamageHandler_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Passive_JungleCamp_BlockedDamageHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Passive_JungleCamp_BlockedDamageHandler_C, RequiredDamageTags) == 0x000B78, "Member 'UGA_Passive_JungleCamp_BlockedDamageHandler_C::RequiredDamageTags' has a wrong offset!");
static_assert(offsetof(UGA_Passive_JungleCamp_BlockedDamageHandler_C, Jungle_Immunity_Tag) == 0x000BB8, "Member 'UGA_Passive_JungleCamp_BlockedDamageHandler_C::Jungle_Immunity_Tag' has a wrong offset!");

}

