#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_RecallToBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_RecallToBase.GA_RecallToBase_C.ExecuteUbergraph_GA_RecallToBase
// 0x0670 (0x0670 - 0x0000)
struct GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0010(0x0018)()
	class AActor*                                 Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Source;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0038(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable3;                             // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable4;                             // 0x0070(0x0018)()
	class AActor*                                 Temp_object_Variable2;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName12;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName11;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName10;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate10;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    Temp_byte_Variable;                                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate13;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate14;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate15;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate16;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate17;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate18;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable2;                               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate19;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate20;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue2;                 // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Hero_C*                             K2Node_DynamicCast_AsBP_Hero;                      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0288(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate21;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitAbilityActivate*       CallFunc_WaitForAbilityActivateWithTagRequirements_ReturnValue; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements2;        // 0x02E8(0x0040)()
	class UGameplayAbility*                       Temp_object_Variable3;                             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements3;        // 0x0330(0x0040)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEffectApplied_Self* CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383[0x5];                                      // 0x0383(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0390(0x0040)(ContainsInstancedReference)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate22;            // 0x03D0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAbilityCommit*         CallFunc_WaitForAbilityCommit_ReturnValue;         // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Hero_C*                             K2Node_DynamicCast_AsBP_Hero2;                     // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRecallCastTime_CastTime;               // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue3; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Hero_C*                             K2Node_DynamicCast_AsBP_Hero3;                     // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRecallCastTime_CastTime2;              // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       Temp_object_Variable4;                             // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x043C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue; // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue2;                // 0x0458(0x0040)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExtraRandomInt_ReturnValue;            // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility2;              // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FindPlayerStart_StartPointActor;          // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindPlayerStart_StartPointLocation;       // 0x04C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindPlayerStart_StartPointRotation;       // 0x04D4(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue12;                    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSpawnLocationForControllerAtStartPoint_OutSpawnLocation; // 0x04E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AbilityTeleportActor_ReturnValue;         // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2[0x6];                                      // 0x04F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate23;            // 0x04F8(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue13;                    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue14;                    // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_512[0x6];                                      // 0x0512(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitCancel*                CallFunc_WaitCancel_ReturnValue;                   // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue15;                    // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue16;                    // 0x052D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E[0x2];                                      // 0x052E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue2; // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue4; // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IOrionTeamActorInterface> K2Node_DynamicCast_AsOrion_Team_Actor_Interface;   // 0x0548(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue17;                    // 0x055A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B[0x5];                                      // 0x055B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionAbilityTargetDataFilter          K2Node_MakeStruct_OrionAbilityTargetDataFilter;    // 0x0568(0x0030)()
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeOrionFilterHandle_ReturnValue;        // 0x0598(0x0010)()
	class UAbilityTask_WaitGameplayEffectApplied_Self* CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue2; // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue18;                    // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue19;                    // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B2[0x6];                                      // 0x05B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate24;            // 0x05B8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Source2;                        // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle2;                    // 0x05D0(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle2;                  // 0x05E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue3;                // 0x05F0(0x0040)(ContainsInstancedReference)
	TDelegate<void(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate25;            // 0x0630(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641[0x3];                                      // 0x0641(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x0644(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue2;  // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D[0x3];                                      // 0x064D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue2;          // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue20;                    // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAttributeChange*       CallFunc_WaitForAttributeChange_ReturnValue;       // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue21;                    // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase) == 0x000008, "Wrong alignment on GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase");
static_assert(sizeof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase) == 0x000670, "Wrong size on GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, EntryPoint) == 0x000000, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_struct_Variable) == 0x000004, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_struct_Variable2) == 0x000010, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_object_Variable) == 0x000028, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_Source) == 0x000030, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_SpecHandle) == 0x000038, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_ActiveHandle) == 0x000050, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_struct_Variable3) == 0x000068, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_struct_Variable4) == 0x000070, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_object_Variable2) == 0x000088, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate2) == 0x000090, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate4) == 0x0000B0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_StartAbilityState_ReturnValue) == 0x0000C0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000C8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetAIController_ReturnValue) == 0x0000D0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate5) == 0x0000D8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_WaitNetSync_ReturnValue) == 0x0000E8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate6) == 0x0000F0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue2) == 0x000100, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName12) == 0x000108, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName12' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName11) == 0x000110, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName11' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate7) == 0x000118, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName10) == 0x000128, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName10' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate8) == 0x000130, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName9) == 0x000140, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate9) == 0x000148, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName8) == 0x000158, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate10) == 0x000160, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName7) == 0x000170, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate11) == 0x000178, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_name_Variable) == 0x000188, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_byte_Variable) == 0x000190, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate12) == 0x000198, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName6) == 0x0001A8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate13) == 0x0001B0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName5) == 0x0001C0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate14) == 0x0001C8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName4) == 0x0001D8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate15) == 0x0001E0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName3) == 0x0001F0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate16) == 0x0001F8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName2) == 0x000208, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate17) == 0x000210, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_NotifyName) == 0x000220, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate18) == 0x000228, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate18' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_name_Variable2) == 0x000238, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate19) == 0x000240, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate19' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate20) == 0x000250, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate20' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_WaitNetSync_ReturnValue2) == 0x000260, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_WaitNetSync_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000268, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue3) == 0x000270, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_DynamicCast_AsBP_Hero) == 0x000278, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_DynamicCast_AsBP_Hero' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_DynamicCast_bSuccess) == 0x000280, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue4) == 0x000281, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_MakeStruct_GameplayTagRequirements) == 0x000288, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate21) == 0x0002C8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate21' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_WaitForAbilityActivateWithTagRequirements_ReturnValue) == 0x0002D8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_WaitForAbilityActivateWithTagRequirements_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_bool_Has_Been_Initd_Variable) == 0x0002E0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue5) == 0x0002E1, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_MakeStruct_GameplayTagRequirements2) == 0x0002E8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_MakeStruct_GameplayTagRequirements2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_object_Variable3) == 0x000328, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_MakeStruct_GameplayTagRequirements3) == 0x000330, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_MakeStruct_GameplayTagRequirements3' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_bool_IsClosed_Variable) == 0x000370, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue) == 0x000378, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue6) == 0x000380, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_bool_IsClosed_Variable2) == 0x000381, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_bool_Has_Been_Initd_Variable2) == 0x000382, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_ActivatedAbility) == 0x000388, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetActorInfo_ReturnValue) == 0x000390, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate22) == 0x0003D0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate22' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0003E0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_WaitForAbilityCommit_ReturnValue) == 0x0003E8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_WaitForAbilityCommit_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue7) == 0x0003F0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue8) == 0x0003F1, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_DynamicCast_AsBP_Hero2) == 0x0003F8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_DynamicCast_AsBP_Hero2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_DynamicCast_bSuccess2) == 0x000400, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetRecallCastTime_CastTime) == 0x000404, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetRecallCastTime_CastTime' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetAvatarActorFromActorInfo_ReturnValue3) == 0x000408, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetAvatarActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue9) == 0x000410, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_DynamicCast_AsBP_Hero3) == 0x000418, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_DynamicCast_AsBP_Hero3' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_DynamicCast_bSuccess3) == 0x000420, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetRecallCastTime_CastTime2) == 0x000424, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetRecallCastTime_CastTime2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, Temp_object_Variable4) == 0x000428, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_WaitDelay_ReturnValue) == 0x000430, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue10) == 0x000438, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00043C, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue) == 0x000448, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue11) == 0x000450, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue11' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetActorInfo_ReturnValue2) == 0x000458, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_Array_Length_ReturnValue) == 0x000498, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetExtraRandomInt_ReturnValue) == 0x00049C, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetExtraRandomInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_Subtract_IntInt_ReturnValue) == 0x0004A0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_Array_Get_Item) == 0x0004A8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0004B0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CustomEvent_ActivatedAbility2) == 0x0004B8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CustomEvent_ActivatedAbility2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_FindPlayerStart_StartPointActor) == 0x0004C0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_FindPlayerStart_StartPointActor' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_FindPlayerStart_StartPointLocation) == 0x0004C8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_FindPlayerStart_StartPointLocation' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_FindPlayerStart_StartPointRotation) == 0x0004D4, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_FindPlayerStart_StartPointRotation' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue12) == 0x0004E0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue12' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetSpawnLocationForControllerAtStartPoint_OutSpawnLocation) == 0x0004E4, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetSpawnLocationForControllerAtStartPoint_OutSpawnLocation' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_AbilityTeleportActor_ReturnValue) == 0x0004F0, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_AbilityTeleportActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x0004F1, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_CreateDelegate_OutputDelegate23) == 0x0004F8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_CreateDelegate_OutputDelegate23' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000508, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue13) == 0x000510, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue13' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue14) == 0x000511, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue14' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_WaitCancel_ReturnValue) == 0x000518, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_WaitCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue15) == 0x000520, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue15' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetPlayLength_ReturnValue) == 0x000524, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000528, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00052C, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue16) == 0x00052D, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue16' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_SelectFloat_ReturnValue) == 0x000530, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue2) == 0x000538, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetAvatarActorFromActorInfo_ReturnValue4) == 0x000540, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetAvatarActorFromActorInfo_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_DynamicCast_AsOrion_Team_Actor_Interface) == 0x000548, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_DynamicCast_AsOrion_Team_Actor_Interface' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_DynamicCast_bSuccess4) == 0x000558, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_GetTeamNum_ReturnValue) == 0x000559, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_IsValid_ReturnValue17) == 0x00055A, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_IsValid_ReturnValue17' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000560, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, K2Node_MakeStruct_OrionAbilityTargetDataFilter) == 0x000568, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::K2Node_MakeStruct_OrionAbilityTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_MakeOrionFilterHandle_ReturnValue) == 0x000598, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_MakeOrionFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase, CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue2) == 0x0005A8, "Member 'GA_RecallToBase_C_ExecuteUbergraph_GA_RecallToBase::CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue2' has a wrong offset!");
