#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Announcer_Dialog_TowerUnderAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Announcer_Dialog_TowerUnderAttack.GC_Announcer_Dialog_TowerUnderAttack_C
// 0x0020 (0x0860 - 0x0840)
class AGC_Announcer_Dialog_TowerUnderAttack_C final : public AOrionGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(Transient, DuplicateTransient)
	class USoundBase*                             AnnouncerInhibUnderAttack;                         // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AnnouncerTurretUnderAttack;                        // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Announcer_Dialog_TowerUnderAttack(int32 EntryPoint);
	void K2_OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* ApplicationParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UCameraShake* ApplicationCameraShakeInstance, class UNiagaraComponent* ApplicationNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void UserConstructionScript();
	bool OnExecute(class AActor* MyTarget, struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Announcer_Dialog_TowerUnderAttack_C">();
	}
	static class AGC_Announcer_Dialog_TowerUnderAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Announcer_Dialog_TowerUnderAttack_C>();
	}
};
static_assert(alignof(AGC_Announcer_Dialog_TowerUnderAttack_C) == 0x000010, "Wrong alignment on AGC_Announcer_Dialog_TowerUnderAttack_C");
static_assert(sizeof(AGC_Announcer_Dialog_TowerUnderAttack_C) == 0x000860, "Wrong size on AGC_Announcer_Dialog_TowerUnderAttack_C");
static_assert(offsetof(AGC_Announcer_Dialog_TowerUnderAttack_C, UberGraphFrame) == 0x000840, "Member 'AGC_Announcer_Dialog_TowerUnderAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_TowerUnderAttack_C, AnnouncerInhibUnderAttack) == 0x000848, "Member 'AGC_Announcer_Dialog_TowerUnderAttack_C::AnnouncerInhibUnderAttack' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_TowerUnderAttack_C, AnnouncerTurretUnderAttack) == 0x000850, "Member 'AGC_Announcer_Dialog_TowerUnderAttack_C::AnnouncerTurretUnderAttack' has a wrong offset!");

}

