#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Announcer_Dialog_KillingSpree

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Announcer_Dialog_KillingSpree.GC_Announcer_Dialog_KillingSpree_C
// 0x0070 (0x0780 - 0x0710)
class AGC_Announcer_Dialog_KillingSpree_C final : public AOrionGameplayCueNotify_Burst_Latent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(Transient, DuplicateTransient)
	TArray<class FString>                         SpreeSounds;                                       // 0x0718(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         EpicSpreeSounds;                                   // 0x0728(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         KillingSpreeDelay;                                 // 0x0738(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundBase*>                     KillingSpreeDialogArray;                           // 0x0740(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class USoundBase*>                     EpicKillingSpreeDialog;                            // 0x0750(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         KillingSpreeCount;                                 // 0x0760(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IfKillsAreHigherThanSpreeArray;                    // 0x0764(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartCountingAtZero;                               // 0x0768(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76C[0x4];                                      // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             EpicStreakDialog;                                  // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Announcer_Dialog_KillingSpree(int32 EntryPoint);
	void K2_OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* BurstParticleSystems, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* BurstNiagaraParticleSystems, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Announcer_Dialog_KillingSpree_C">();
	}
	static class AGC_Announcer_Dialog_KillingSpree_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Announcer_Dialog_KillingSpree_C>();
	}
};
static_assert(alignof(AGC_Announcer_Dialog_KillingSpree_C) == 0x000010, "Wrong alignment on AGC_Announcer_Dialog_KillingSpree_C");
static_assert(sizeof(AGC_Announcer_Dialog_KillingSpree_C) == 0x000780, "Wrong size on AGC_Announcer_Dialog_KillingSpree_C");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, UberGraphFrame) == 0x000710, "Member 'AGC_Announcer_Dialog_KillingSpree_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, SpreeSounds) == 0x000718, "Member 'AGC_Announcer_Dialog_KillingSpree_C::SpreeSounds' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, EpicSpreeSounds) == 0x000728, "Member 'AGC_Announcer_Dialog_KillingSpree_C::EpicSpreeSounds' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, KillingSpreeDelay) == 0x000738, "Member 'AGC_Announcer_Dialog_KillingSpree_C::KillingSpreeDelay' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, KillingSpreeDialogArray) == 0x000740, "Member 'AGC_Announcer_Dialog_KillingSpree_C::KillingSpreeDialogArray' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, EpicKillingSpreeDialog) == 0x000750, "Member 'AGC_Announcer_Dialog_KillingSpree_C::EpicKillingSpreeDialog' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, KillingSpreeCount) == 0x000760, "Member 'AGC_Announcer_Dialog_KillingSpree_C::KillingSpreeCount' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, IfKillsAreHigherThanSpreeArray) == 0x000764, "Member 'AGC_Announcer_Dialog_KillingSpree_C::IfKillsAreHigherThanSpreeArray' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, StartCountingAtZero) == 0x000768, "Member 'AGC_Announcer_Dialog_KillingSpree_C::StartCountingAtZero' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_KillingSpree_C, EpicStreakDialog) == 0x000770, "Member 'AGC_Announcer_Dialog_KillingSpree_C::EpicStreakDialog' has a wrong offset!");

}

