#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Burst_Heal

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Burst_Heal.GC_Burst_Heal_C.OnBurst
// 0x0110 (0x0110 - 0x0000)
struct GC_Burst_Heal_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               BurstParticleSystem;                               // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BurstNiagaraParticleSystem;                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Burst_Heal_C_OnBurst) == 0x000008, "Wrong alignment on GC_Burst_Heal_C_OnBurst");
static_assert(sizeof(GC_Burst_Heal_C_OnBurst) == 0x000110, "Wrong size on GC_Burst_Heal_C_OnBurst");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, MyTarget) == 0x000000, "Member 'GC_Burst_Heal_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Burst_Heal_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, BurstParticleSystem) == 0x0000C0, "Member 'GC_Burst_Heal_C_OnBurst::BurstParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Burst_Heal_C_OnBurst::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, BurstCameraShakeInstance) == 0x0000D8, "Member 'GC_Burst_Heal_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, BurstDecalInstance) == 0x0000E0, "Member 'GC_Burst_Heal_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, BurstNiagaraParticleSystem) == 0x0000E8, "Member 'GC_Burst_Heal_C_OnBurst::BurstNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, AdditionalNiagaraParticleSystems) == 0x0000F0, "Member 'GC_Burst_Heal_C_OnBurst::AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000100, "Member 'GC_Burst_Heal_C_OnBurst::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GC_Burst_Heal_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GC_Burst_Heal_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

