#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_CriticallyWounded

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_CriticallyWounded.GC_CriticallyWounded_C.ExecuteUbergraph_GC_CriticallyWounded
// 0x0138 (0x0138 - 0x0000)
struct GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_ApplicationParticleSystem;            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_ApplicationCameraShakeInstance;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_Event_ApplicationNiagaraParticleSystem;     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Hero_C*                             K2Node_DynamicCast_AsBP_Hero;                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthPCT_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded) == 0x000008, "Wrong alignment on GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded");
static_assert(sizeof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded) == 0x000138, "Wrong size on GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, EntryPoint) == 0x000000, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000004, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_GetFloatAttribute_ReturnValue) == 0x000008, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_Event_MyTarget) == 0x000010, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_Event_Parameters) == 0x000018, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_Event_ApplicationParticleSystem) == 0x0000D0, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_Event_ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_Event_AdditionalParticleSystems) == 0x0000D8, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_Event_ApplicationCameraShakeInstance) == 0x0000E8, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_Event_ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_Event_ApplicationNiagaraParticleSystem) == 0x0000F0, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_Event_ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0000F8, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_DynamicCast_AsBP_Hero) == 0x000110, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_DynamicCast_AsBP_Hero' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_GetHealthPCT_ReturnValue) == 0x00011C, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_GetHealthPCT_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_IsValid_ReturnValue2) == 0x000120, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000121, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000124, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000128, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_Abs_ReturnValue) == 0x00012C, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded, CallFunc_Add_FloatFloat_ReturnValue) == 0x000130, "Member 'GC_CriticallyWounded_C_ExecuteUbergraph_GC_CriticallyWounded::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function GC_CriticallyWounded.GC_CriticallyWounded_C.K2_OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_CriticallyWounded_C_K2_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               ApplicationParticleSystem;                         // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           ApplicationCameraShakeInstance;                    // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ApplicationNiagaraParticleSystem;                  // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_CriticallyWounded_C_K2_OnActive) == 0x000008, "Wrong alignment on GC_CriticallyWounded_C_K2_OnActive");
static_assert(sizeof(GC_CriticallyWounded_C_K2_OnActive) == 0x0000F8, "Wrong size on GC_CriticallyWounded_C_K2_OnActive");
static_assert(offsetof(GC_CriticallyWounded_C_K2_OnActive, MyTarget) == 0x000000, "Member 'GC_CriticallyWounded_C_K2_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_K2_OnActive, Parameters) == 0x000008, "Member 'GC_CriticallyWounded_C_K2_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_K2_OnActive, ApplicationParticleSystem) == 0x0000C0, "Member 'GC_CriticallyWounded_C_K2_OnActive::ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_K2_OnActive, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_CriticallyWounded_C_K2_OnActive::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_K2_OnActive, ApplicationCameraShakeInstance) == 0x0000D8, "Member 'GC_CriticallyWounded_C_K2_OnActive::ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_K2_OnActive, ApplicationNiagaraParticleSystem) == 0x0000E0, "Member 'GC_CriticallyWounded_C_K2_OnActive::ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_CriticallyWounded_C_K2_OnActive, AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_CriticallyWounded_C_K2_OnActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_CriticallyWounded.GC_CriticallyWounded_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_CriticallyWounded_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_CriticallyWounded_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_CriticallyWounded_C_ReceiveTick");
static_assert(sizeof(GC_CriticallyWounded_C_ReceiveTick) == 0x000004, "Wrong size on GC_CriticallyWounded_C_ReceiveTick");
static_assert(offsetof(GC_CriticallyWounded_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_CriticallyWounded_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

