#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_CardActivation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_CardActivation.GC_CardActivation_C
// 0x0080 (0x0790 - 0x0710)
class AGC_CardActivation_C final : public AOrionGameplayCueNotify_Burst_Latent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere1;                                           // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSequenceComponent*                GemBurstSequence;                                  // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   _CC_Device_CardArea;                               // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSequenceComponent*                BurstSequence;                                     // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FrontMesh;                                         // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialBillboardComponent*            MaterialBillboard;                                 // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_37651171482618761A4E28B5C01F7EDE; // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CardFrontDMI;                                      // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      GemImageDMI;                                       // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   NewEventDispatcher_0;                              // 0x0778(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void NewEventDispatcher_0__DelegateSignature();
	void ExecuteUbergraph_GC_CardActivation(int32 EntryPoint);
	void DissolveGem();
	void K2_OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* BurstParticleSystems, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* BurstNiagaraParticleSystems, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void ReceiveTick(float DeltaSeconds);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_CardActivation_C">();
	}
	static class AGC_CardActivation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_CardActivation_C>();
	}
};
static_assert(alignof(AGC_CardActivation_C) == 0x000010, "Wrong alignment on AGC_CardActivation_C");
static_assert(sizeof(AGC_CardActivation_C) == 0x000790, "Wrong size on AGC_CardActivation_C");
static_assert(offsetof(AGC_CardActivation_C, UberGraphFrame) == 0x000710, "Member 'AGC_CardActivation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, StaticMesh) == 0x000718, "Member 'AGC_CardActivation_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, Sphere1) == 0x000720, "Member 'AGC_CardActivation_C::Sphere1' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, GemBurstSequence) == 0x000728, "Member 'AGC_CardActivation_C::GemBurstSequence' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, _CC_Device_CardArea) == 0x000730, "Member 'AGC_CardActivation_C::_CC_Device_CardArea' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, BurstSequence) == 0x000738, "Member 'AGC_CardActivation_C::BurstSequence' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, FrontMesh) == 0x000740, "Member 'AGC_CardActivation_C::FrontMesh' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, MaterialBillboard) == 0x000748, "Member 'AGC_CardActivation_C::MaterialBillboard' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, Sphere) == 0x000750, "Member 'AGC_CardActivation_C::Sphere' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, Timeline_0__Direction_37651171482618761A4E28B5C01F7EDE) == 0x000758, "Member 'AGC_CardActivation_C::Timeline_0__Direction_37651171482618761A4E28B5C01F7EDE' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, Timeline_0) == 0x000760, "Member 'AGC_CardActivation_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, CardFrontDMI) == 0x000768, "Member 'AGC_CardActivation_C::CardFrontDMI' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, GemImageDMI) == 0x000770, "Member 'AGC_CardActivation_C::GemImageDMI' has a wrong offset!");
static_assert(offsetof(AGC_CardActivation_C, NewEventDispatcher_0) == 0x000778, "Member 'AGC_CardActivation_C::NewEventDispatcher_0' has a wrong offset!");

}

