#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_CardEquipped

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_CardEquipped.GC_CardEquipped_C
// 0x0020 (0x0730 - 0x0710)
class AGC_CardEquipped_C final : public AOrionGameplayCueNotify_Burst_Latent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(Transient, DuplicateTransient)
	class UMaterialBillboardComponent*            MaterialBillboard;                                 // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BillboardDMI;                                      // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_CardEquipped(int32 EntryPoint);
	void K2_OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* BurstParticleSystems, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* BurstNiagaraParticleSystems, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_CardEquipped_C">();
	}
	static class AGC_CardEquipped_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_CardEquipped_C>();
	}
};
static_assert(alignof(AGC_CardEquipped_C) == 0x000010, "Wrong alignment on AGC_CardEquipped_C");
static_assert(sizeof(AGC_CardEquipped_C) == 0x000730, "Wrong size on AGC_CardEquipped_C");
static_assert(offsetof(AGC_CardEquipped_C, UberGraphFrame) == 0x000710, "Member 'AGC_CardEquipped_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_CardEquipped_C, MaterialBillboard) == 0x000718, "Member 'AGC_CardEquipped_C::MaterialBillboard' has a wrong offset!");
static_assert(offsetof(AGC_CardEquipped_C, Sphere) == 0x000720, "Member 'AGC_CardEquipped_C::Sphere' has a wrong offset!");
static_assert(offsetof(AGC_CardEquipped_C, BillboardDMI) == 0x000728, "Member 'AGC_CardEquipped_C::BillboardDMI' has a wrong offset!");

}

