#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Card_Pestilence_Damage_Self

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Card_Pestilence_Damage_Self.GC_Card_Pestilence_Damage_Self_C.OnBurst
// 0x01B0 (0x01B0 - 0x0000)
struct GC_Card_Pestilence_Damage_Self_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               BurstParticleSystem;                               // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BurstNiagaraParticleSystem;                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0118(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0128(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GC_Card_Pestilence_Damage_Self_C_OnBurst) == 0x000008, "Wrong alignment on GC_Card_Pestilence_Damage_Self_C_OnBurst");
static_assert(sizeof(GC_Card_Pestilence_Damage_Self_C_OnBurst) == 0x0001B0, "Wrong size on GC_Card_Pestilence_Damage_Self_C_OnBurst");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, MyTarget) == 0x000000, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, BurstParticleSystem) == 0x0000C0, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::BurstParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, BurstCameraShakeInstance) == 0x0000D8, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, BurstDecalInstance) == 0x0000E0, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, BurstNiagaraParticleSystem) == 0x0000E8, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::BurstNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, AdditionalNiagaraParticleSystems) == 0x0000F0, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000100, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00010C, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, CallFunc_FindLookAtRotation_ReturnValue) == 0x000118, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Card_Pestilence_Damage_Self_C_OnBurst, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000128, "Member 'GC_Card_Pestilence_Damage_Self_C_OnBurst::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

}

