#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Item_Aura_Applied_Buff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Item_Aura_Applied_Buff.GC_Item_Aura_Applied_Buff_C
// 0x0070 (0x08B0 - 0x0840)
class AGC_Item_Aura_Applied_Buff_C : public AOrionGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(Transient, DuplicateTransient)
	class UOrionDecalComponent*                   StencilDecal;                                      // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Pulse_Control_Decal_Pulse_CD9981D34039DFC810A83FABE51D49D6; // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Pulse_Control__Direction_CD9981D34039DFC810A83FABE51D49D6; // 0x0854(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_855[0x3];                                      // 0x0855(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Pulse_Control;                                     // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Decal_MID;                                         // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PulseDelay;                                        // 0x0868(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PulseSpeed;                                        // 0x086C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Opacity_for_Decal;                                 // 0x0870(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0874(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_AffinityColor_;                                // 0x0884(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_885[0x3];                                      // 0x0885(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Affinity;                                          // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           DecalColor;                                        // 0x0890(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          TimelineStop;                                      // 0x08A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A1[0x7];                                      // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer;                                             // 0x08A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_GC_Item_Aura_Applied_Buff(int32 EntryPoint);
	void Repeat();
	void K2_OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* RemovalParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* RemovalNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* LoopingParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystem, class UNiagaraComponent* LoopingNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void Pulse_Control__FinishedFunc();
	void Pulse_Control__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Item_Aura_Applied_Buff_C">();
	}
	static class AGC_Item_Aura_Applied_Buff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Item_Aura_Applied_Buff_C>();
	}
};
static_assert(alignof(AGC_Item_Aura_Applied_Buff_C) == 0x000010, "Wrong alignment on AGC_Item_Aura_Applied_Buff_C");
static_assert(sizeof(AGC_Item_Aura_Applied_Buff_C) == 0x0008B0, "Wrong size on AGC_Item_Aura_Applied_Buff_C");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, UberGraphFrame) == 0x000840, "Member 'AGC_Item_Aura_Applied_Buff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, StencilDecal) == 0x000848, "Member 'AGC_Item_Aura_Applied_Buff_C::StencilDecal' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, Pulse_Control_Decal_Pulse_CD9981D34039DFC810A83FABE51D49D6) == 0x000850, "Member 'AGC_Item_Aura_Applied_Buff_C::Pulse_Control_Decal_Pulse_CD9981D34039DFC810A83FABE51D49D6' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, Pulse_Control__Direction_CD9981D34039DFC810A83FABE51D49D6) == 0x000854, "Member 'AGC_Item_Aura_Applied_Buff_C::Pulse_Control__Direction_CD9981D34039DFC810A83FABE51D49D6' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, Pulse_Control) == 0x000858, "Member 'AGC_Item_Aura_Applied_Buff_C::Pulse_Control' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, Decal_MID) == 0x000860, "Member 'AGC_Item_Aura_Applied_Buff_C::Decal_MID' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, PulseDelay) == 0x000868, "Member 'AGC_Item_Aura_Applied_Buff_C::PulseDelay' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, PulseSpeed) == 0x00086C, "Member 'AGC_Item_Aura_Applied_Buff_C::PulseSpeed' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, Opacity_for_Decal) == 0x000870, "Member 'AGC_Item_Aura_Applied_Buff_C::Opacity_for_Decal' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, Color) == 0x000874, "Member 'AGC_Item_Aura_Applied_Buff_C::Color' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, Use_AffinityColor_) == 0x000884, "Member 'AGC_Item_Aura_Applied_Buff_C::Use_AffinityColor_' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, Affinity) == 0x000888, "Member 'AGC_Item_Aura_Applied_Buff_C::Affinity' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, DecalColor) == 0x000890, "Member 'AGC_Item_Aura_Applied_Buff_C::DecalColor' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, TimelineStop) == 0x0008A0, "Member 'AGC_Item_Aura_Applied_Buff_C::TimelineStop' has a wrong offset!");
static_assert(offsetof(AGC_Item_Aura_Applied_Buff_C, Timer) == 0x0008A8, "Member 'AGC_Item_Aura_Applied_Buff_C::Timer' has a wrong offset!");

}

