#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Immunity_AllAbilities

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Immunity_AllAbilities.GC_Immunity_AllAbilities_C
// 0x0040 (0x0880 - 0x0840)
class AGC_Immunity_AllAbilities_C final : public AOrionGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(Transient, DuplicateTransient)
	float                                         Timeline_1_Opacity_BC338F5C4D4916064D5FE2B3716C0F07; // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_BC338F5C4D4916064D5FE2B3716C0F07; // 0x084C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84D[0x3];                                      // 0x084D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Brightness_372B74EF4190AD85E9718F959DC038DD; // 0x0858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Opacity_372B74EF4190AD85E9718F959DC038DD; // 0x085C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_372B74EF4190AD85E9718F959DC038DD; // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Hero_C*                             TargetCharacter;                                   // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Immunity_AllAbilities(int32 EntryPoint);
	void K2_OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* RemovalParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* RemovalNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* LoopingParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystem, class UNiagaraComponent* LoopingNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* ApplicationParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UCameraShake* ApplicationCameraShakeInstance, class UNiagaraComponent* ApplicationNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Immunity_AllAbilities_C">();
	}
	static class AGC_Immunity_AllAbilities_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Immunity_AllAbilities_C>();
	}
};
static_assert(alignof(AGC_Immunity_AllAbilities_C) == 0x000010, "Wrong alignment on AGC_Immunity_AllAbilities_C");
static_assert(sizeof(AGC_Immunity_AllAbilities_C) == 0x000880, "Wrong size on AGC_Immunity_AllAbilities_C");
static_assert(offsetof(AGC_Immunity_AllAbilities_C, UberGraphFrame) == 0x000840, "Member 'AGC_Immunity_AllAbilities_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Immunity_AllAbilities_C, Timeline_1_Opacity_BC338F5C4D4916064D5FE2B3716C0F07) == 0x000848, "Member 'AGC_Immunity_AllAbilities_C::Timeline_1_Opacity_BC338F5C4D4916064D5FE2B3716C0F07' has a wrong offset!");
static_assert(offsetof(AGC_Immunity_AllAbilities_C, Timeline_1__Direction_BC338F5C4D4916064D5FE2B3716C0F07) == 0x00084C, "Member 'AGC_Immunity_AllAbilities_C::Timeline_1__Direction_BC338F5C4D4916064D5FE2B3716C0F07' has a wrong offset!");
static_assert(offsetof(AGC_Immunity_AllAbilities_C, Timeline_1) == 0x000850, "Member 'AGC_Immunity_AllAbilities_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AGC_Immunity_AllAbilities_C, Timeline_0_Brightness_372B74EF4190AD85E9718F959DC038DD) == 0x000858, "Member 'AGC_Immunity_AllAbilities_C::Timeline_0_Brightness_372B74EF4190AD85E9718F959DC038DD' has a wrong offset!");
static_assert(offsetof(AGC_Immunity_AllAbilities_C, Timeline_0_Opacity_372B74EF4190AD85E9718F959DC038DD) == 0x00085C, "Member 'AGC_Immunity_AllAbilities_C::Timeline_0_Opacity_372B74EF4190AD85E9718F959DC038DD' has a wrong offset!");
static_assert(offsetof(AGC_Immunity_AllAbilities_C, Timeline_0__Direction_372B74EF4190AD85E9718F959DC038DD) == 0x000860, "Member 'AGC_Immunity_AllAbilities_C::Timeline_0__Direction_372B74EF4190AD85E9718F959DC038DD' has a wrong offset!");
static_assert(offsetof(AGC_Immunity_AllAbilities_C, Timeline_0) == 0x000868, "Member 'AGC_Immunity_AllAbilities_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGC_Immunity_AllAbilities_C, TargetCharacter) == 0x000870, "Member 'AGC_Immunity_AllAbilities_C::TargetCharacter' has a wrong offset!");

}

