#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Item_Debuff_Major_Burst

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Item_Debuff_Major_Burst.GC_Item_Debuff_Major_Burst_C.ExecuteUbergraph_GC_Item_Debuff_Major_Burst
// 0x02B0 (0x02B0 - 0x0000)
struct GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters2;                          // 0x0020(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_ApplicationParticleSystem;            // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_ApplicationCameraShakeInstance;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_Event_ApplicationNiagaraParticleSystem;     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems2;    // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0110(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0138(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_LoopingParticleSystem;                // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystem;             // 0x01F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_LoopingNiagaraParticleSystem;         // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x0210(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero2;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue3;                      // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0254(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0260(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue4;                      // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue2;     // 0x0274(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue2;    // 0x0288(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0298(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x02A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst) == 0x000008, "Wrong alignment on GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst");
static_assert(sizeof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst) == 0x0002B0, "Wrong size on GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, EntryPoint) == 0x000000, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000004, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_MyTarget2) == 0x000018, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_MyTarget2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_Parameters2) == 0x000020, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_Parameters2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_ApplicationParticleSystem) == 0x0000D8, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_AdditionalParticleSystems) == 0x0000E0, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_ApplicationCameraShakeInstance) == 0x0000F0, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_ApplicationNiagaraParticleSystem) == 0x0000F8, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_AdditionalNiagaraParticleSystems2) == 0x000100, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_AdditionalNiagaraParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000110, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_IsValid_ReturnValue) == 0x00011C, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000120, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_MyTarget) == 0x000130, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_Parameters) == 0x000138, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_LoopingParticleSystem) == 0x0001F0, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_AdditionalParticleSystem) == 0x0001F8, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_LoopingNiagaraParticleSystem) == 0x000208, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x000210, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000220, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_IsValid_ReturnValue2) == 0x000224, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_FClamp_ReturnValue) == 0x000228, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_DynamicCast_AsOrion_Char_Hero2) == 0x000230, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_DynamicCast_AsOrion_Char_Hero2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, K2Node_DynamicCast_bSuccess2) == 0x000238, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x00023C, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_FClamp_ReturnValue2) == 0x000240, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000244, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Less_FloatFloat_ReturnValue) == 0x000248, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_FClamp_ReturnValue3) == 0x00024C, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_FClamp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000250, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_MakeVector_ReturnValue) == 0x000254, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_MakeVector_ReturnValue2) == 0x000260, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x00026C, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_FClamp_ReturnValue4) == 0x000270, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_FClamp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_GetVectorParameterValue_ReturnValue2) == 0x000274, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_GetVectorParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000284, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Conv_LinearColorToVector_ReturnValue2) == 0x000288, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Conv_LinearColorToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000294, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_MakeVector_ReturnValue3) == 0x000298, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst, CallFunc_MakeVector_ReturnValue4) == 0x0002A4, "Member 'GC_Item_Debuff_Major_Burst_C_ExecuteUbergraph_GC_Item_Debuff_Major_Burst::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");

// Function GC_Item_Debuff_Major_Burst.GC_Item_Debuff_Major_Burst_C.K2_WhileActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_Item_Debuff_Major_Burst_C_K2_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               LoopingParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystem;                          // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      LoopingNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Item_Debuff_Major_Burst_C_K2_WhileActive) == 0x000008, "Wrong alignment on GC_Item_Debuff_Major_Burst_C_K2_WhileActive");
static_assert(sizeof(GC_Item_Debuff_Major_Burst_C_K2_WhileActive) == 0x0000F0, "Wrong size on GC_Item_Debuff_Major_Burst_C_K2_WhileActive");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_WhileActive, MyTarget) == 0x000000, "Member 'GC_Item_Debuff_Major_Burst_C_K2_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_WhileActive, Parameters) == 0x000008, "Member 'GC_Item_Debuff_Major_Burst_C_K2_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_WhileActive, LoopingParticleSystem) == 0x0000C0, "Member 'GC_Item_Debuff_Major_Burst_C_K2_WhileActive::LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_WhileActive, AdditionalParticleSystem) == 0x0000C8, "Member 'GC_Item_Debuff_Major_Burst_C_K2_WhileActive::AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_WhileActive, LoopingNiagaraParticleSystem) == 0x0000D8, "Member 'GC_Item_Debuff_Major_Burst_C_K2_WhileActive::LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_WhileActive, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_Item_Debuff_Major_Burst_C_K2_WhileActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_Item_Debuff_Major_Burst.GC_Item_Debuff_Major_Burst_C.K2_OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Item_Debuff_Major_Burst_C_K2_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               ApplicationParticleSystem;                         // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           ApplicationCameraShakeInstance;                    // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ApplicationNiagaraParticleSystem;                  // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Item_Debuff_Major_Burst_C_K2_OnActive) == 0x000008, "Wrong alignment on GC_Item_Debuff_Major_Burst_C_K2_OnActive");
static_assert(sizeof(GC_Item_Debuff_Major_Burst_C_K2_OnActive) == 0x0000F8, "Wrong size on GC_Item_Debuff_Major_Burst_C_K2_OnActive");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_OnActive, MyTarget) == 0x000000, "Member 'GC_Item_Debuff_Major_Burst_C_K2_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_OnActive, Parameters) == 0x000008, "Member 'GC_Item_Debuff_Major_Burst_C_K2_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_OnActive, ApplicationParticleSystem) == 0x0000C0, "Member 'GC_Item_Debuff_Major_Burst_C_K2_OnActive::ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_OnActive, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Item_Debuff_Major_Burst_C_K2_OnActive::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_OnActive, ApplicationCameraShakeInstance) == 0x0000D8, "Member 'GC_Item_Debuff_Major_Burst_C_K2_OnActive::ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_OnActive, ApplicationNiagaraParticleSystem) == 0x0000E0, "Member 'GC_Item_Debuff_Major_Burst_C_K2_OnActive::ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_Burst_C_K2_OnActive, AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_Item_Debuff_Major_Burst_C_K2_OnActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

}

