#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Item_Aura_Applied_Debuff

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Item_Aura_Applied_Debuff.GC_Item_Aura_Applied_Debuff_C.ExecuteUbergraph_GC_Item_Aura_Applied_Debuff
// 0x0230 (0x0230 - 0x0000)
struct GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_Event_MyTarget2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters2;                          // 0x0020(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_LoopingParticleSystem;                // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystem;             // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_LoopingNiagaraParticleSystem;         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems2;    // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0110(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_RemovalParticleSystem;                // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x01D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_RemovalNiagaraParticleSystem;         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0214(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0228(0x0008)(NoDestructor)
};
static_assert(alignof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff) == 0x000008, "Wrong alignment on GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff");
static_assert(sizeof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff) == 0x000230, "Wrong size on GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, EntryPoint) == 0x000000, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_MyTarget2) == 0x000018, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_MyTarget2' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_Parameters2) == 0x000020, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_Parameters2' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_LoopingParticleSystem) == 0x0000D8, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_AdditionalParticleSystem) == 0x0000E0, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_LoopingNiagaraParticleSystem) == 0x0000F0, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_AdditionalNiagaraParticleSystems2) == 0x0000F8, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_AdditionalNiagaraParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_MyTarget) == 0x000108, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_Parameters) == 0x000110, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_RemovalParticleSystem) == 0x0001C8, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_AdditionalParticleSystems) == 0x0001D0, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_RemovalNiagaraParticleSystem) == 0x0001E0, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0001E8, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x0001F8, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000204, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, CallFunc_FClamp_ReturnValue) == 0x000208, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x00020C, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, CallFunc_FClamp_ReturnValue2) == 0x000210, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, CallFunc_MakeVector_ReturnValue) == 0x000214, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000220, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000228, "Member 'GC_Item_Aura_Applied_Debuff_C_ExecuteUbergraph_GC_Item_Aura_Applied_Debuff::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function GC_Item_Aura_Applied_Debuff.GC_Item_Aura_Applied_Debuff_C.K2_OnRemove
// 0x00F0 (0x00F0 - 0x0000)
struct GC_Item_Aura_Applied_Debuff_C_K2_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               RemovalParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      RemovalNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Item_Aura_Applied_Debuff_C_K2_OnRemove) == 0x000008, "Wrong alignment on GC_Item_Aura_Applied_Debuff_C_K2_OnRemove");
static_assert(sizeof(GC_Item_Aura_Applied_Debuff_C_K2_OnRemove) == 0x0000F0, "Wrong size on GC_Item_Aura_Applied_Debuff_C_K2_OnRemove");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_OnRemove, MyTarget) == 0x000000, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_OnRemove, Parameters) == 0x000008, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_OnRemove, RemovalParticleSystem) == 0x0000C0, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_OnRemove::RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_OnRemove, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_OnRemove::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_OnRemove, RemovalNiagaraParticleSystem) == 0x0000D8, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_OnRemove::RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_OnRemove, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_OnRemove::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_Item_Aura_Applied_Debuff.GC_Item_Aura_Applied_Debuff_C.K2_WhileActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_Item_Aura_Applied_Debuff_C_K2_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               LoopingParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystem;                          // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      LoopingNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Item_Aura_Applied_Debuff_C_K2_WhileActive) == 0x000008, "Wrong alignment on GC_Item_Aura_Applied_Debuff_C_K2_WhileActive");
static_assert(sizeof(GC_Item_Aura_Applied_Debuff_C_K2_WhileActive) == 0x0000F0, "Wrong size on GC_Item_Aura_Applied_Debuff_C_K2_WhileActive");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_WhileActive, MyTarget) == 0x000000, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_WhileActive, Parameters) == 0x000008, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_WhileActive, LoopingParticleSystem) == 0x0000C0, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_WhileActive::LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_WhileActive, AdditionalParticleSystem) == 0x0000C8, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_WhileActive::AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_WhileActive, LoopingNiagaraParticleSystem) == 0x0000D8, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_WhileActive::LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_K2_WhileActive, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_Item_Aura_Applied_Debuff_C_K2_WhileActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_Item_Aura_Applied_Debuff.GC_Item_Aura_Applied_Debuff_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct GC_Item_Aura_Applied_Debuff_C_UserConstructionScript final
{
public:
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0000(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Item_Aura_Applied_Debuff_C_UserConstructionScript) == 0x000008, "Wrong alignment on GC_Item_Aura_Applied_Debuff_C_UserConstructionScript");
static_assert(sizeof(GC_Item_Aura_Applied_Debuff_C_UserConstructionScript) == 0x000018, "Wrong size on GC_Item_Aura_Applied_Debuff_C_UserConstructionScript");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_UserConstructionScript, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000000, "Member 'GC_Item_Aura_Applied_Debuff_C_UserConstructionScript::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Aura_Applied_Debuff_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'GC_Item_Aura_Applied_Debuff_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

