#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Juggernaut

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Juggernaut.GC_Juggernaut_C.ExecuteUbergraph_GC_Juggernaut
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_LoopingParticleSystem;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystem;             // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_LoopingNiagaraParticleSystem;         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut) == 0x000008, "Wrong alignment on GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut");
static_assert(sizeof(GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut) == 0x0000F8, "Wrong size on GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut");
static_assert(offsetof(GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut, EntryPoint) == 0x000000, "Member 'GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut, K2Node_Event_LoopingParticleSystem) == 0x0000C8, "Member 'GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut::K2Node_Event_LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut, K2Node_Event_AdditionalParticleSystem) == 0x0000D0, "Member 'GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut::K2Node_Event_AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut, K2Node_Event_LoopingNiagaraParticleSystem) == 0x0000E0, "Member 'GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut::K2Node_Event_LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_Juggernaut_C_ExecuteUbergraph_GC_Juggernaut::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_Juggernaut.GC_Juggernaut_C.K2_WhileActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_Juggernaut_C_K2_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               LoopingParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystem;                          // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      LoopingNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Juggernaut_C_K2_WhileActive) == 0x000008, "Wrong alignment on GC_Juggernaut_C_K2_WhileActive");
static_assert(sizeof(GC_Juggernaut_C_K2_WhileActive) == 0x0000F0, "Wrong size on GC_Juggernaut_C_K2_WhileActive");
static_assert(offsetof(GC_Juggernaut_C_K2_WhileActive, MyTarget) == 0x000000, "Member 'GC_Juggernaut_C_K2_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_K2_WhileActive, Parameters) == 0x000008, "Member 'GC_Juggernaut_C_K2_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_K2_WhileActive, LoopingParticleSystem) == 0x0000C0, "Member 'GC_Juggernaut_C_K2_WhileActive::LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_K2_WhileActive, AdditionalParticleSystem) == 0x0000C8, "Member 'GC_Juggernaut_C_K2_WhileActive::AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_K2_WhileActive, LoopingNiagaraParticleSystem) == 0x0000D8, "Member 'GC_Juggernaut_C_K2_WhileActive::LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Juggernaut_C_K2_WhileActive, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_Juggernaut_C_K2_WhileActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

}

