#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_LevelUp

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_LevelUp.GC_LevelUp_C.ExecuteUbergraph_GC_LevelUp
// 0x0108 (0x0108 - 0x0000)
struct GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_BurstParticleSystems;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_BurstNiagaraParticleSystems;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsLocallyControlledPlayer_ReturnValue;    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundTeamAdjusted_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp) == 0x000008, "Wrong alignment on GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp");
static_assert(sizeof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp) == 0x000108, "Wrong size on GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp");
static_assert(offsetof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp, EntryPoint) == 0x000000, "Member 'GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp, K2Node_Event_Parameters) == 0x000010, "Member 'GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp, K2Node_Event_BurstParticleSystems) == 0x0000C8, "Member 'GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp::K2Node_Event_BurstParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp, K2Node_Event_AdditionalParticleSystems) == 0x0000D0, "Member 'GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp, K2Node_Event_BurstNiagaraParticleSystems) == 0x0000E0, "Member 'GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp::K2Node_Event_BurstNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp, CallFunc_IsLocallyControlledPlayer_ReturnValue) == 0x0000F8, "Member 'GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp::CallFunc_IsLocallyControlledPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp, CallFunc_SpawnSoundTeamAdjusted_ReturnValue) == 0x000100, "Member 'GC_LevelUp_C_ExecuteUbergraph_GC_LevelUp::CallFunc_SpawnSoundTeamAdjusted_ReturnValue' has a wrong offset!");

// Function GC_LevelUp.GC_LevelUp_C.K2_OnExecute
// 0x00F0 (0x00F0 - 0x0000)
struct GC_LevelUp_C_K2_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               BurstParticleSystems;                              // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      BurstNiagaraParticleSystems;                       // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_LevelUp_C_K2_OnExecute) == 0x000008, "Wrong alignment on GC_LevelUp_C_K2_OnExecute");
static_assert(sizeof(GC_LevelUp_C_K2_OnExecute) == 0x0000F0, "Wrong size on GC_LevelUp_C_K2_OnExecute");
static_assert(offsetof(GC_LevelUp_C_K2_OnExecute, MyTarget) == 0x000000, "Member 'GC_LevelUp_C_K2_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_K2_OnExecute, Parameters) == 0x000008, "Member 'GC_LevelUp_C_K2_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_K2_OnExecute, BurstParticleSystems) == 0x0000C0, "Member 'GC_LevelUp_C_K2_OnExecute::BurstParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_K2_OnExecute, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_LevelUp_C_K2_OnExecute::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_K2_OnExecute, BurstNiagaraParticleSystems) == 0x0000D8, "Member 'GC_LevelUp_C_K2_OnExecute::BurstNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_K2_OnExecute, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_LevelUp_C_K2_OnExecute::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_LevelUp.GC_LevelUp_C.OnRemove
// 0x00C8 (0x00C8 - 0x0000)
struct GC_LevelUp_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_LevelUp_C_OnRemove) == 0x000008, "Wrong alignment on GC_LevelUp_C_OnRemove");
static_assert(sizeof(GC_LevelUp_C_OnRemove) == 0x0000C8, "Wrong size on GC_LevelUp_C_OnRemove");
static_assert(offsetof(GC_LevelUp_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_LevelUp_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnRemove, Parameters) == 0x000008, "Member 'GC_LevelUp_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnRemove, ReturnValue) == 0x0000C0, "Member 'GC_LevelUp_C_OnRemove::ReturnValue' has a wrong offset!");

}

