#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Recall_Teleport

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_Recall_Teleport.GC_Recall_Teleport_C.ExecuteUbergraph_GC_Recall_Teleport
// 0x0030 (0x0030 - 0x0000)
struct GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_TagsToHandle;                         // 0x0008(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue2;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport) == 0x000008, "Wrong alignment on GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport");
static_assert(sizeof(GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport) == 0x000030, "Wrong size on GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport");
static_assert(offsetof(GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport, EntryPoint) == 0x000000, "Member 'GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport, K2Node_Event_TagsToHandle) == 0x000008, "Member 'GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport::K2Node_Event_TagsToHandle' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport, CallFunc_HasTag_ReturnValue) == 0x000028, "Member 'GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport, CallFunc_HasTag_ReturnValue2) == 0x000029, "Member 'GC_Recall_Teleport_C_ExecuteUbergraph_GC_Recall_Teleport::CallFunc_HasTag_ReturnValue2' has a wrong offset!");

// Function GC_Recall_Teleport.GC_Recall_Teleport_C.HandleRotationalContent
// 0x0020 (0x0020 - 0x0000)
struct GC_Recall_Teleport_C_HandleRotationalContent final
{
public:
	struct FGameplayTagContainer                  TagsToHandle;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GC_Recall_Teleport_C_HandleRotationalContent) == 0x000008, "Wrong alignment on GC_Recall_Teleport_C_HandleRotationalContent");
static_assert(sizeof(GC_Recall_Teleport_C_HandleRotationalContent) == 0x000020, "Wrong size on GC_Recall_Teleport_C_HandleRotationalContent");
static_assert(offsetof(GC_Recall_Teleport_C_HandleRotationalContent, TagsToHandle) == 0x000000, "Member 'GC_Recall_Teleport_C_HandleRotationalContent::TagsToHandle' has a wrong offset!");

// Function GC_Recall_Teleport.GC_Recall_Teleport_C.OnBurst
// 0x0108 (0x0108 - 0x0000)
struct GC_Recall_Teleport_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               BurstParticleSystem;                               // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BurstNiagaraParticleSystem;                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Recall_Teleport_C_OnBurst) == 0x000008, "Wrong alignment on GC_Recall_Teleport_C_OnBurst");
static_assert(sizeof(GC_Recall_Teleport_C_OnBurst) == 0x000108, "Wrong size on GC_Recall_Teleport_C_OnBurst");
static_assert(offsetof(GC_Recall_Teleport_C_OnBurst, MyTarget) == 0x000000, "Member 'GC_Recall_Teleport_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Recall_Teleport_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_OnBurst, BurstParticleSystem) == 0x0000C0, "Member 'GC_Recall_Teleport_C_OnBurst::BurstParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_OnBurst, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Recall_Teleport_C_OnBurst::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_OnBurst, BurstCameraShakeInstance) == 0x0000D8, "Member 'GC_Recall_Teleport_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_OnBurst, BurstDecalInstance) == 0x0000E0, "Member 'GC_Recall_Teleport_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_OnBurst, BurstNiagaraParticleSystem) == 0x0000E8, "Member 'GC_Recall_Teleport_C_OnBurst::BurstNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_OnBurst, AdditionalNiagaraParticleSystems) == 0x0000F0, "Member 'GC_Recall_Teleport_C_OnBurst::AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Recall_Teleport_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'GC_Recall_Teleport_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

