#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Recall_Teleport

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Recall_Teleport.GC_Recall_Teleport_C
// 0x0020 (0x0660 - 0x0640)
class UGC_Recall_Teleport_C final : public UOrionGameplayCueNotify_Burst
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(Transient, DuplicateTransient)
	class UParticleSystem*                        Correct_Recal_VFX;                                 // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Default_Recall_VFX;                                // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Recall_Teleport(int32 EntryPoint);
	void HandleRotationalContent(const struct FGameplayTagContainer& TagsToHandle);

	void OnBurst(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* BurstParticleSystem, TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance, class UNiagaraComponent* BurstNiagaraParticleSystem, TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Recall_Teleport_C">();
	}
	static class UGC_Recall_Teleport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_Recall_Teleport_C>();
	}
};
static_assert(alignof(UGC_Recall_Teleport_C) == 0x000010, "Wrong alignment on UGC_Recall_Teleport_C");
static_assert(sizeof(UGC_Recall_Teleport_C) == 0x000660, "Wrong size on UGC_Recall_Teleport_C");
static_assert(offsetof(UGC_Recall_Teleport_C, UberGraphFrame) == 0x000640, "Member 'UGC_Recall_Teleport_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGC_Recall_Teleport_C, Correct_Recal_VFX) == 0x000648, "Member 'UGC_Recall_Teleport_C::Correct_Recal_VFX' has a wrong offset!");
static_assert(offsetof(UGC_Recall_Teleport_C, Default_Recall_VFX) == 0x000650, "Member 'UGC_Recall_Teleport_C::Default_Recall_VFX' has a wrong offset!");

}

