#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SentryTurret_DeathFinal

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GC_SentryTurret_DeathFinal.GC_SentryTurret_DeathFinal_C.OnBurst
// 0x01A8 (0x01A8 - 0x0000)
struct GC_SentryTurret_DeathFinal_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               BurstParticleSystem;                               // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BurstNiagaraParticleSystem;                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class FString                                 Temp_string_Variable;                              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SentryTurret_C*                     K2Node_DynamicCast_AsBP_Sentry_Turret;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable2;                             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue2;        // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable3;                             // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable4;                             // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SentryTurret_DeathFinal_C_OnBurst) == 0x000008, "Wrong alignment on GC_SentryTurret_DeathFinal_C_OnBurst");
static_assert(sizeof(GC_SentryTurret_DeathFinal_C_OnBurst) == 0x0001A8, "Wrong size on GC_SentryTurret_DeathFinal_C_OnBurst");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, MyTarget) == 0x000000, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, Parameters) == 0x000008, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, BurstParticleSystem) == 0x0000C0, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::BurstParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, BurstCameraShakeInstance) == 0x0000D8, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, BurstDecalInstance) == 0x0000E0, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, BurstNiagaraParticleSystem) == 0x0000E8, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::BurstNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, AdditionalNiagaraParticleSystems) == 0x0000F0, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, Temp_string_Variable) == 0x000100, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_Array_Get_Item) == 0x000110, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, K2Node_DynamicCast_AsBP_Sentry_Turret) == 0x000118, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::K2Node_DynamicCast_AsBP_Sentry_Turret' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, Temp_string_Variable2) == 0x000128, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_GetTeamNum_ReturnValue) == 0x000138, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000139, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_Not_PreBool_ReturnValue) == 0x00013A, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00013B, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_K2_AttachToComponent_ReturnValue2) == 0x00013C, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_K2_AttachToComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, Temp_string_Variable3) == 0x000140, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::Temp_string_Variable3' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, Temp_string_Variable4) == 0x000150, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::Temp_string_Variable4' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, Temp_int_Variable) == 0x000160, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, Temp_int_Variable2) == 0x000164, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, K2Node_Select_Default) == 0x000168, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000178, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_Concat_StrStr_ReturnValue) == 0x000180, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_Conv_StringToName_ReturnValue) == 0x000190, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_Conv_StringToName_ReturnValue2) == 0x000198, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_Conv_StringToName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_DeathFinal_C_OnBurst, CallFunc_Add_IntInt_ReturnValue) == 0x0001A0, "Member 'GC_SentryTurret_DeathFinal_C_OnBurst::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

