#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SentryTurret_Proj_Spawn

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_SentryTurret_Proj_Spawn.GC_SentryTurret_Proj_Spawn_C.OnBurst
// 0x0148 (0x0148 - 0x0000)
struct GC_SentryTurret_Proj_Spawn_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               BurstParticleSystem;                               // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BurstNiagaraParticleSystem;                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SentryTurret_C*                     K2Node_DynamicCast_AsBP_Sentry_Turret;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTarget_ReturnValue;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnLocalTeam_ReturnValue;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlledPlayer_ReturnValue;    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SentryTurret_Proj_Spawn_C_OnBurst) == 0x000008, "Wrong alignment on GC_SentryTurret_Proj_Spawn_C_OnBurst");
static_assert(sizeof(GC_SentryTurret_Proj_Spawn_C_OnBurst) == 0x000148, "Wrong size on GC_SentryTurret_Proj_Spawn_C_OnBurst");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, MyTarget) == 0x000000, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, Parameters) == 0x000008, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, BurstParticleSystem) == 0x0000C0, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::BurstParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, BurstCameraShakeInstance) == 0x0000D8, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, BurstDecalInstance) == 0x0000E0, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, BurstNiagaraParticleSystem) == 0x0000E8, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::BurstNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, AdditionalNiagaraParticleSystems) == 0x0000F0, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, CallFunc_GetOwner_ReturnValue) == 0x000100, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, K2Node_DynamicCast_AsBP_Sentry_Turret) == 0x000108, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::K2Node_DynamicCast_AsBP_Sentry_Turret' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, CallFunc_GetCurrentTarget_ReturnValue) == 0x000118, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::CallFunc_GetCurrentTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000120, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, K2Node_DynamicCast_bSuccess2) == 0x000128, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, CallFunc_IsOnLocalTeam_ReturnValue) == 0x000129, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::CallFunc_IsOnLocalTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, CallFunc_IsLocallyControlledPlayer_ReturnValue) == 0x00012A, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::CallFunc_IsLocallyControlledPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000130, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, CallFunc_GetAnimInstance_ReturnValue) == 0x000138, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Proj_Spawn_C_OnBurst, CallFunc_Montage_Play_ReturnValue) == 0x000140, "Member 'GC_SentryTurret_Proj_Spawn_C_OnBurst::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

}

