#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SpellShield

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_SpellShield.GC_SpellShield_C.ExecuteUbergraph_GC_SpellShield
// 0x03A0 (0x03A0 - 0x0000)
struct GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_RemovalParticleSystem;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_RemovalNiagaraParticleSystem;         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget2;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters2;                          // 0x0100(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_LoopingParticleSystem;                // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystem;             // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_LoopingNiagaraParticleSystem;         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems2;    // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget3;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters3;                          // 0x01F0(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_ApplicationParticleSystem;            // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems2;           // 0x02B0(0x0010)(ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_ApplicationCameraShakeInstance;       // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_Event_ApplicationNiagaraParticleSystem;     // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems3;    // 0x02D0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero2;             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue2; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x030C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0318(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0324(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x0338(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue5;                  // 0x0344(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue6;                  // 0x0358(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUnscaledCapsuleRadius_ReturnValue;     // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUnscaledCapsuleRadius_ReturnValue2;    // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0376(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_377[0x1];                                      // 0x0377(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue7;                  // 0x037C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue8;         // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue8;                  // 0x0390(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield) == 0x000008, "Wrong alignment on GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield");
static_assert(sizeof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield) == 0x0003A0, "Wrong size on GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, EntryPoint) == 0x000000, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_Parameters) == 0x000010, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_RemovalParticleSystem) == 0x0000C8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_AdditionalParticleSystems) == 0x0000D0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_RemovalNiagaraParticleSystem) == 0x0000E0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_MyTarget2) == 0x0000F8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_MyTarget2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_Parameters2) == 0x000100, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_Parameters2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_LoopingParticleSystem) == 0x0001B8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_AdditionalParticleSystem) == 0x0001C0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_LoopingNiagaraParticleSystem) == 0x0001D0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_AdditionalNiagaraParticleSystems2) == 0x0001D8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_AdditionalNiagaraParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_MyTarget3) == 0x0001E8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_MyTarget3' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_Parameters3) == 0x0001F0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_Parameters3' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_ApplicationParticleSystem) == 0x0002A8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_AdditionalParticleSystems2) == 0x0002B0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_AdditionalParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_ApplicationCameraShakeInstance) == 0x0002C0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_ApplicationNiagaraParticleSystem) == 0x0002C8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_Event_AdditionalNiagaraParticleSystems3) == 0x0002D0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_Event_AdditionalNiagaraParticleSystems3' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_IsValid_ReturnValue) == 0x0002E0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_IsValid_ReturnValue2) == 0x0002E1, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x0002E8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_DynamicCast_AsOrion_Char_Hero2) == 0x0002F8, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_DynamicCast_AsOrion_Char_Hero2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, K2Node_DynamicCast_bSuccess2) == 0x000300, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue) == 0x000304, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue2) == 0x000308, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_MakeVector_ReturnValue) == 0x00030C, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_MakeVector_ReturnValue2) == 0x000318, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_MakeVector_ReturnValue3) == 0x000324, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000330, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000334, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_MakeVector_ReturnValue4) == 0x000338, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_MakeVector_ReturnValue5) == 0x000344, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_MakeVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000350, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000354, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_MakeVector_ReturnValue6) == 0x000358, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_MakeVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_GetUnscaledCapsuleRadius_ReturnValue) == 0x000364, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_GetUnscaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_GetUnscaledCapsuleRadius_ReturnValue2) == 0x000368, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_GetUnscaledCapsuleRadius_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x00036C, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x000370, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Less_FloatFloat_ReturnValue) == 0x000374, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000375, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000376, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Multiply_FloatFloat_ReturnValue7) == 0x000378, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Multiply_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_MakeVector_ReturnValue7) == 0x00037C, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_MakeVector_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000388, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_Multiply_FloatFloat_ReturnValue8) == 0x00038C, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_Multiply_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield, CallFunc_MakeVector_ReturnValue8) == 0x000390, "Member 'GC_SpellShield_C_ExecuteUbergraph_GC_SpellShield::CallFunc_MakeVector_ReturnValue8' has a wrong offset!");

// Function GC_SpellShield.GC_SpellShield_C.K2_OnRemove
// 0x00F0 (0x00F0 - 0x0000)
struct GC_SpellShield_C_K2_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               RemovalParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      RemovalNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_SpellShield_C_K2_OnRemove) == 0x000008, "Wrong alignment on GC_SpellShield_C_K2_OnRemove");
static_assert(sizeof(GC_SpellShield_C_K2_OnRemove) == 0x0000F0, "Wrong size on GC_SpellShield_C_K2_OnRemove");
static_assert(offsetof(GC_SpellShield_C_K2_OnRemove, MyTarget) == 0x000000, "Member 'GC_SpellShield_C_K2_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_OnRemove, Parameters) == 0x000008, "Member 'GC_SpellShield_C_K2_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_OnRemove, RemovalParticleSystem) == 0x0000C0, "Member 'GC_SpellShield_C_K2_OnRemove::RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_OnRemove, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_SpellShield_C_K2_OnRemove::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_OnRemove, RemovalNiagaraParticleSystem) == 0x0000D8, "Member 'GC_SpellShield_C_K2_OnRemove::RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_OnRemove, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_SpellShield_C_K2_OnRemove::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_SpellShield.GC_SpellShield_C.K2_WhileActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_SpellShield_C_K2_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               LoopingParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystem;                          // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      LoopingNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_SpellShield_C_K2_WhileActive) == 0x000008, "Wrong alignment on GC_SpellShield_C_K2_WhileActive");
static_assert(sizeof(GC_SpellShield_C_K2_WhileActive) == 0x0000F0, "Wrong size on GC_SpellShield_C_K2_WhileActive");
static_assert(offsetof(GC_SpellShield_C_K2_WhileActive, MyTarget) == 0x000000, "Member 'GC_SpellShield_C_K2_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_WhileActive, Parameters) == 0x000008, "Member 'GC_SpellShield_C_K2_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_WhileActive, LoopingParticleSystem) == 0x0000C0, "Member 'GC_SpellShield_C_K2_WhileActive::LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_WhileActive, AdditionalParticleSystem) == 0x0000C8, "Member 'GC_SpellShield_C_K2_WhileActive::AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_WhileActive, LoopingNiagaraParticleSystem) == 0x0000D8, "Member 'GC_SpellShield_C_K2_WhileActive::LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_WhileActive, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_SpellShield_C_K2_WhileActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_SpellShield.GC_SpellShield_C.K2_OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_SpellShield_C_K2_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               ApplicationParticleSystem;                         // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           ApplicationCameraShakeInstance;                    // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ApplicationNiagaraParticleSystem;                  // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_SpellShield_C_K2_OnActive) == 0x000008, "Wrong alignment on GC_SpellShield_C_K2_OnActive");
static_assert(sizeof(GC_SpellShield_C_K2_OnActive) == 0x0000F8, "Wrong size on GC_SpellShield_C_K2_OnActive");
static_assert(offsetof(GC_SpellShield_C_K2_OnActive, MyTarget) == 0x000000, "Member 'GC_SpellShield_C_K2_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_OnActive, Parameters) == 0x000008, "Member 'GC_SpellShield_C_K2_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SpellShield_C_K2_OnActive, ApplicationParticleSystem) == 0x0000C0, "Member 'GC_SpellShield_C_K2_OnActive::ApplicationParticleSystem' has a wrong offset!");
