#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SentryTurret_Proj_Spawn

#include "Basic.hpp"

#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_SentryTurret_Proj_Spawn.GC_SentryTurret_Proj_Spawn_C
// 0x0030 (0x0670 - 0x0640)
class UGC_SentryTurret_Proj_Spawn_C final : public UOrionGameplayCueNotify_Burst
{
public:
	class UAnimMontage*                           Recoil_Anim;                                       // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartingSectionName;                               // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        NewVar_0;                                          // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SentryTurretFiringSound;                           // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ListenerStyle;                                     // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBurst(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* BurstParticleSystem, TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance, class UNiagaraComponent* BurstNiagaraParticleSystem, TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_SentryTurret_Proj_Spawn_C">();
	}
	static class UGC_SentryTurret_Proj_Spawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_SentryTurret_Proj_Spawn_C>();
	}
};
static_assert(alignof(UGC_SentryTurret_Proj_Spawn_C) == 0x000010, "Wrong alignment on UGC_SentryTurret_Proj_Spawn_C");
static_assert(sizeof(UGC_SentryTurret_Proj_Spawn_C) == 0x000670, "Wrong size on UGC_SentryTurret_Proj_Spawn_C");
static_assert(offsetof(UGC_SentryTurret_Proj_Spawn_C, Recoil_Anim) == 0x000640, "Member 'UGC_SentryTurret_Proj_Spawn_C::Recoil_Anim' has a wrong offset!");
static_assert(offsetof(UGC_SentryTurret_Proj_Spawn_C, StartingSectionName) == 0x000648, "Member 'UGC_SentryTurret_Proj_Spawn_C::StartingSectionName' has a wrong offset!");
static_assert(offsetof(UGC_SentryTurret_Proj_Spawn_C, NewVar_0) == 0x000650, "Member 'UGC_SentryTurret_Proj_Spawn_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UGC_SentryTurret_Proj_Spawn_C, SentryTurretFiringSound) == 0x000658, "Member 'UGC_SentryTurret_Proj_Spawn_C::SentryTurretFiringSound' has a wrong offset!");
static_assert(offsetof(UGC_SentryTurret_Proj_Spawn_C, ListenerStyle) == 0x000660, "Member 'UGC_SentryTurret_Proj_Spawn_C::ListenerStyle' has a wrong offset!");

}

