#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Shared_SpeedBuff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Shared_SpeedBuff.GC_Shared_SpeedBuff_C
// 0x0020 (0x0860 - 0x0840)
class AGC_Shared_SpeedBuff_C final : public AOrionGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               Foot_r;                                            // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Foot_l;                                            // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Shared_SpeedBuff(int32 EntryPoint);
	void K2_OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* RemovalParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* RemovalNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* LoopingParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystem, class UNiagaraComponent* LoopingNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Shared_SpeedBuff_C">();
	}
	static class AGC_Shared_SpeedBuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Shared_SpeedBuff_C>();
	}
};
static_assert(alignof(AGC_Shared_SpeedBuff_C) == 0x000010, "Wrong alignment on AGC_Shared_SpeedBuff_C");
static_assert(sizeof(AGC_Shared_SpeedBuff_C) == 0x000860, "Wrong size on AGC_Shared_SpeedBuff_C");
static_assert(offsetof(AGC_Shared_SpeedBuff_C, UberGraphFrame) == 0x000840, "Member 'AGC_Shared_SpeedBuff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Shared_SpeedBuff_C, Foot_r) == 0x000848, "Member 'AGC_Shared_SpeedBuff_C::Foot_r' has a wrong offset!");
static_assert(offsetof(AGC_Shared_SpeedBuff_C, Foot_l) == 0x000850, "Member 'AGC_Shared_SpeedBuff_C::Foot_l' has a wrong offset!");

}

