#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_ShadowPlane

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_ShadowPlane.GC_ShadowPlane_C
// 0x0090 (0x08D0 - 0x0840)
class AGC_ShadowPlane_C : public AOrionGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Aurora1;                                           // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AuroraBack4;                                       // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AuroraBack3;                                       // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AuroraBack2;                                       // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AuroraBack1;                                       // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Aurora8;                                           // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AuroraBack5;                                       // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Aurora6;                                           // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Aurora5;                                           // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Aurora4;                                           // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Aurora3;                                           // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Aurora2;                                           // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Aurora7;                                           // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExponentialHeightFogComponent*         ShadowHeightFog;                                   // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SkySphere;                                         // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess;                                       // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x08C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GC_ShadowPlane(int32 EntryPoint);
	void K2_OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* ApplicationParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UCameraShake* ApplicationCameraShakeInstance, class UNiagaraComponent* ApplicationNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* RecurringParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* RecurringNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* RemovalParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* RemovalNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* LoopingParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystem, class UNiagaraComponent* LoopingNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void UserConstructionScript();
	bool WhileActive(class AActor* MyTarget, struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_ShadowPlane_C">();
	}
	static class AGC_ShadowPlane_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_ShadowPlane_C>();
	}
};
static_assert(alignof(AGC_ShadowPlane_C) == 0x000010, "Wrong alignment on AGC_ShadowPlane_C");
static_assert(sizeof(AGC_ShadowPlane_C) == 0x0008D0, "Wrong size on AGC_ShadowPlane_C");
static_assert(offsetof(AGC_ShadowPlane_C, UberGraphFrame) == 0x000840, "Member 'AGC_ShadowPlane_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, Aurora1) == 0x000848, "Member 'AGC_ShadowPlane_C::Aurora1' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, AuroraBack4) == 0x000850, "Member 'AGC_ShadowPlane_C::AuroraBack4' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, AuroraBack3) == 0x000858, "Member 'AGC_ShadowPlane_C::AuroraBack3' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, AuroraBack2) == 0x000860, "Member 'AGC_ShadowPlane_C::AuroraBack2' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, AuroraBack1) == 0x000868, "Member 'AGC_ShadowPlane_C::AuroraBack1' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, Aurora8) == 0x000870, "Member 'AGC_ShadowPlane_C::Aurora8' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, AuroraBack5) == 0x000878, "Member 'AGC_ShadowPlane_C::AuroraBack5' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, Aurora6) == 0x000880, "Member 'AGC_ShadowPlane_C::Aurora6' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, Aurora5) == 0x000888, "Member 'AGC_ShadowPlane_C::Aurora5' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, Aurora4) == 0x000890, "Member 'AGC_ShadowPlane_C::Aurora4' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, Aurora3) == 0x000898, "Member 'AGC_ShadowPlane_C::Aurora3' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, Aurora2) == 0x0008A0, "Member 'AGC_ShadowPlane_C::Aurora2' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, Aurora7) == 0x0008A8, "Member 'AGC_ShadowPlane_C::Aurora7' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, ShadowHeightFog) == 0x0008B0, "Member 'AGC_ShadowPlane_C::ShadowHeightFog' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, SkySphere) == 0x0008B8, "Member 'AGC_ShadowPlane_C::SkySphere' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, PostProcess) == 0x0008C0, "Member 'AGC_ShadowPlane_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGC_ShadowPlane_C, NewVar_0) == 0x0008C8, "Member 'AGC_ShadowPlane_C::NewVar_0' has a wrong offset!");

}

