#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SentryTurret_Idle

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_SentryTurret_Idle.GC_SentryTurret_Idle_C.WhileActive
// 0x0130 (0x0130 - 0x0000)
struct GC_SentryTurret_Idle_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SentryTurret_C*                     K2Node_DynamicCast_AsBP_Sentry_Turret;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchmakingContext*                    CallFunc_GetContext_ReturnValue;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionPlayerController_Base*            CallFunc_GetLocalPlayerController_Base_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentPlaylistId_ReturnValue;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionReplaySpectator*                  K2Node_DynamicCast_AsOrion_Replay_Spectator;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTutorial_ReturnValue;                   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionPlayerController_Game*            CallFunc_GetLocalPlayerController_Game_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerContext*                         CallFunc_GetContext_ReturnValue2;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionLevelInfo                        CallFunc_GetAccountLevelInfo_AccountLevelInfo;     // 0x0118(0x0010)(NoDestructor)
	bool                                          CallFunc_IsOnLocalTeam_ReturnValue;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_SentryTurret_Idle_C_WhileActive) == 0x000008, "Wrong alignment on GC_SentryTurret_Idle_C_WhileActive");
static_assert(sizeof(GC_SentryTurret_Idle_C_WhileActive) == 0x000130, "Wrong size on GC_SentryTurret_Idle_C_WhileActive");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, MyTarget) == 0x000000, "Member 'GC_SentryTurret_Idle_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, Parameters) == 0x000008, "Member 'GC_SentryTurret_Idle_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, ReturnValue) == 0x0000C0, "Member 'GC_SentryTurret_Idle_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, K2Node_DynamicCast_AsBP_Sentry_Turret) == 0x0000C8, "Member 'GC_SentryTurret_Idle_C_WhileActive::K2Node_DynamicCast_AsBP_Sentry_Turret' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GC_SentryTurret_Idle_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_GetContext_ReturnValue) == 0x0000D8, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_GetLocalPlayerController_Base_ReturnValue) == 0x0000E0, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_GetLocalPlayerController_Base_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_GetCurrentPlaylistId_ReturnValue) == 0x0000E8, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_GetCurrentPlaylistId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, K2Node_DynamicCast_AsOrion_Replay_Spectator) == 0x0000F0, "Member 'GC_SentryTurret_Idle_C_WhileActive::K2Node_DynamicCast_AsOrion_Replay_Spectator' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, K2Node_DynamicCast_bSuccess2) == 0x0000F8, "Member 'GC_SentryTurret_Idle_C_WhileActive::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_IsTutorial_ReturnValue) == 0x0000F9, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_IsTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_GetLocalPlayerController_Game_ReturnValue) == 0x000100, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_GetLocalPlayerController_Game_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_Not_PreBool_ReturnValue) == 0x000108, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_GetContext_ReturnValue2) == 0x000110, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_GetAccountLevelInfo_AccountLevelInfo) == 0x000118, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_GetAccountLevelInfo_AccountLevelInfo' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_IsOnLocalTeam_ReturnValue) == 0x000128, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_IsOnLocalTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_Greater_IntInt_ReturnValue) == 0x000129, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Idle_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x00012A, "Member 'GC_SentryTurret_Idle_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

