#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_TravelMode_Exhaust

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_TravelMode_Exhaust.GC_TravelMode_Exhaust_C.ExecuteUbergraph_GC_TravelMode_Exhaust
// 0x0108 (0x0108 - 0x0000)
struct GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_LoopingParticleSystem;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystem;             // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_LoopingNiagaraParticleSystem;         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust) == 0x000008, "Wrong alignment on GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust");
static_assert(sizeof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust) == 0x000108, "Wrong size on GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, EntryPoint) == 0x000000, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, K2Node_Event_Parameters) == 0x000010, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, K2Node_Event_LoopingParticleSystem) == 0x0000C8, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::K2Node_Event_LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, K2Node_Event_AdditionalParticleSystem) == 0x0000D0, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::K2Node_Event_AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, K2Node_Event_LoopingNiagaraParticleSystem) == 0x0000E0, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::K2Node_Event_LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, CallFunc_EvaluateCurveTableRow_OutResult) == 0x0000F8, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, CallFunc_EvaluateCurveTableRow_OutXY) == 0x0000FC, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust, K2Node_SwitchEnum_CmpSuccess) == 0x000101, "Member 'GC_TravelMode_Exhaust_C_ExecuteUbergraph_GC_TravelMode_Exhaust::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function GC_TravelMode_Exhaust.GC_TravelMode_Exhaust_C.K2_WhileActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_TravelMode_Exhaust_C_K2_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               LoopingParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystem;                          // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      LoopingNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_TravelMode_Exhaust_C_K2_WhileActive) == 0x000008, "Wrong alignment on GC_TravelMode_Exhaust_C_K2_WhileActive");
static_assert(sizeof(GC_TravelMode_Exhaust_C_K2_WhileActive) == 0x0000F0, "Wrong size on GC_TravelMode_Exhaust_C_K2_WhileActive");
static_assert(offsetof(GC_TravelMode_Exhaust_C_K2_WhileActive, MyTarget) == 0x000000, "Member 'GC_TravelMode_Exhaust_C_K2_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_K2_WhileActive, Parameters) == 0x000008, "Member 'GC_TravelMode_Exhaust_C_K2_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_K2_WhileActive, LoopingParticleSystem) == 0x0000C0, "Member 'GC_TravelMode_Exhaust_C_K2_WhileActive::LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_K2_WhileActive, AdditionalParticleSystem) == 0x0000C8, "Member 'GC_TravelMode_Exhaust_C_K2_WhileActive::AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_K2_WhileActive, LoopingNiagaraParticleSystem) == 0x0000D8, "Member 'GC_TravelMode_Exhaust_C_K2_WhileActive::LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_TravelMode_Exhaust_C_K2_WhileActive, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_TravelMode_Exhaust_C_K2_WhileActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

}

