#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GemSummary

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GemSummary.GemSummary_C.ExecuteUbergraph_GemSummary
// 0x0090 (0x0090 - 0x0000)
struct GemSummary_C_ExecuteUbergraph_GemSummary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionItemRarity                              K2Node_Event_GemRarity;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionItemRarity                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x0018(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable3;                             // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable4;                             // 0x0038(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable5;                             // 0x0048(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0058(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0068(0x0028)()
};
static_assert(alignof(GemSummary_C_ExecuteUbergraph_GemSummary) == 0x000008, "Wrong alignment on GemSummary_C_ExecuteUbergraph_GemSummary");
static_assert(sizeof(GemSummary_C_ExecuteUbergraph_GemSummary) == 0x000090, "Wrong size on GemSummary_C_ExecuteUbergraph_GemSummary");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, EntryPoint) == 0x000000, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::EntryPoint' has a wrong offset!");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, K2Node_Event_GemRarity) == 0x000004, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::K2Node_Event_GemRarity' has a wrong offset!");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, Temp_byte_Variable) == 0x000005, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, Temp_struct_Variable) == 0x000008, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, Temp_struct_Variable2) == 0x000018, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, Temp_struct_Variable3) == 0x000028, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, Temp_struct_Variable4) == 0x000038, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, Temp_struct_Variable5) == 0x000048, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, K2Node_Select_Default) == 0x000058, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GemSummary_C_ExecuteUbergraph_GemSummary, K2Node_MakeStruct_SlateColor) == 0x000068, "Member 'GemSummary_C_ExecuteUbergraph_GemSummary::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function GemSummary.GemSummary_C.OnDataSet
// 0x0001 (0x0001 - 0x0000)
struct GemSummary_C_OnDataSet final
{
public:
	EOrionItemRarity                              GemRarity;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GemSummary_C_OnDataSet) == 0x000001, "Wrong alignment on GemSummary_C_OnDataSet");
static_assert(sizeof(GemSummary_C_OnDataSet) == 0x000001, "Wrong size on GemSummary_C_OnDataSet");
static_assert(offsetof(GemSummary_C_OnDataSet, GemRarity) == 0x000000, "Member 'GemSummary_C_OnDataSet::GemRarity' has a wrong offset!");

}

