#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlowingRarityText

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "Engine_structs.hpp"
#include "OrionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GlowingRarityText.GlowingRarityText_C
// 0x0028 (0x02E8 - 0x02C0)
class UGlowingRarityText_C final : public UOrionGlowingRarityText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ImageRarityBG1;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageRarityBG2;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayRarityContainer;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EOrionWidgetStyleSize                         Text_Size;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EOrionItemRarity                              Rarity;                                            // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GlowingRarityText(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetRarityBP(EOrionItemRarity ItemRarity, bool bHideGlowingText);
	void SetRarityValue(EOrionItemRarity ItemRarity, bool HideGlowingText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GlowingRarityText_C">();
	}
	static class UGlowingRarityText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGlowingRarityText_C>();
	}
};
static_assert(alignof(UGlowingRarityText_C) == 0x000008, "Wrong alignment on UGlowingRarityText_C");
static_assert(sizeof(UGlowingRarityText_C) == 0x0002E8, "Wrong size on UGlowingRarityText_C");
static_assert(offsetof(UGlowingRarityText_C, UberGraphFrame) == 0x0002C0, "Member 'UGlowingRarityText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGlowingRarityText_C, ImageRarityBG1) == 0x0002C8, "Member 'UGlowingRarityText_C::ImageRarityBG1' has a wrong offset!");
static_assert(offsetof(UGlowingRarityText_C, ImageRarityBG2) == 0x0002D0, "Member 'UGlowingRarityText_C::ImageRarityBG2' has a wrong offset!");
static_assert(offsetof(UGlowingRarityText_C, OverlayRarityContainer) == 0x0002D8, "Member 'UGlowingRarityText_C::OverlayRarityContainer' has a wrong offset!");
static_assert(offsetof(UGlowingRarityText_C, Text_Size) == 0x0002E0, "Member 'UGlowingRarityText_C::Text_Size' has a wrong offset!");
static_assert(offsetof(UGlowingRarityText_C, Rarity) == 0x0002E1, "Member 'UGlowingRarityText_C::Rarity' has a wrong offset!");

}

