#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GoldBuff_AnimBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GoldBuff_AnimBP.GoldBuff_AnimBP_C.ExecuteUbergraph_GoldBuff_AnimBP
// 0x0060 (0x0060 - 0x0000)
struct GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             CallFunc_TryGetOrionChar_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetBaseAimRotation_ReturnValue;           // 0x001C(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0028(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ShouldRateLimitBlueprintTicks_Amount;     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldRateLimitBlueprintTicks_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP) == 0x000008, "Wrong alignment on GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP");
static_assert(sizeof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP) == 0x000060, "Wrong size on GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, EntryPoint) == 0x000000, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_TryGetOrionChar_ReturnValue) == 0x000008, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_TryGetOrionChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_GetBaseAimRotation_ReturnValue) == 0x00001C, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_GetBaseAimRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000028, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_BreakRotator_Roll) == 0x000034, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_BreakRotator_Pitch) == 0x000038, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_BreakRotator_Yaw) == 0x00003C, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_Not_PreBool_ReturnValue2) == 0x000041, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_ShouldRateLimitBlueprintTicks_Amount) == 0x000044, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_ShouldRateLimitBlueprintTicks_Amount' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_ShouldRateLimitBlueprintTicks_ReturnValue) == 0x000048, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_ShouldRateLimitBlueprintTicks_ReturnValue' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, K2Node_Event_DeltaTimeX) == 0x00004C, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000050, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'GoldBuff_AnimBP_C_ExecuteUbergraph_GoldBuff_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GoldBuff_AnimBP.GoldBuff_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct GoldBuff_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GoldBuff_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on GoldBuff_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(GoldBuff_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on GoldBuff_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(GoldBuff_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'GoldBuff_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

