#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GoldBuff_AnimBP

#include "Basic.hpp"

#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass GoldBuff_AnimBP.GoldBuff_AnimBP_C
// 0x1590 (0x2750 - 0x11C0)
class UGoldBuff_AnimBP_C final : public UOrionHeroAnimInstance
{
public:
	uint8                                         Pad_11B8[0x8];                                     // 0x11B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11C0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6D5C63FB44F233F6CFBF9BA2E8A0D450; // 0x11C8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C525611F49A4163D962A7FA409936677; // 0x1210(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_97919802402F3F719C4C17BA96282362; // 0x1278(0x0078)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_E827A0884C3187A7A553D8A1A33436DD; // 0x12F0(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_355E063347F8777599861EA85B0D4684; // 0x1350(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DD35B2014696C75E95E58E8E2CE65305; // 0x13D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F68D2E044F5F2118D6A0B8A917F05D75; // 0x1450(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5CBDB2FE431A7108FDE17FAD2AC8FAAE; // 0x14D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BE5C158F41215E219CA4699A4411D037; // 0x1550(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D2B6A84F4C00D3675A4F72B298475320; // 0x15D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8F2FE22C46E2BE74397D938212625B91; // 0x1650(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ABB0759549FED8D154408B94738A7AF2; // 0x16D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_415F3E3B429A53CD15E612985D62E79B; // 0x1750(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7AD98CB744137F5BE58FAF85E7D09E8B; // 0x17D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7AA4A61448A582CE9A9500A5522F296B; // 0x1850(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B76ED2144DF1902A192DA0B20825782C; // 0x18D0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_0237C07942B69678C4680D84994F71D3; // 0x1950(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D6968CC149D16123DCF565BA79A004AA; // 0x1A20(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9D8B9BED46CF0EFDC9AA008B267B3BA2; // 0x1A90(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_F677E8784BDF2DDFBFD47590606E4E9D; // 0x1B00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7B5BB2FD469B0285E2643F8E9EA8A660; // 0x1B48(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_B56AF0E94A5A87BA839D6EA4C0FE7479; // 0x1BB8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_362780404222F8FD2ABD62965FAC75D2; // 0x1C00(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_928DC43A4635EA432233D08D36BC92E7; // 0x1C70(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2930925146F1B4F516FD7E97A797C326; // 0x1CB8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A8711883453482A5D2A77E9B399910C0; // 0x1D28(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3F9F022C4C5D898C896E78843685FC2F; // 0x1D70(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_ADE48DD3406E5A3F46EC449D72806F39; // 0x1E98(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55BF4E0F44A52B0A9EF92C8E679394F8; // 0x1EE0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_86E47BA74A68229912BCABBF9BDF381A; // 0x1F50(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_69870FC64EE085F15E99C0A3388BC9D6; // 0x1F98(0x00D8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9B561C8440E0849852D29191AD9CAE34; // 0x2070(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4F07E8934E1AF3DEFDDB36938AC7F516; // 0x20D8(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BAE422B24A3A36CD8D0041AEEDF2105F; // 0x21B8(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_D775E79146B1036D12D500A4C822DE27; // 0x2288(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_FFC4AAAA4EEEAF346BDCA784A8D66B2D; // 0x22F0(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75908EA043ACF112A1EED18094580DC1; // 0x2398(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5A328CD14F3A0C3AD2FD35BC370553FC; // 0x23E8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43DB07CC4CE23C0EA859D992A5AE1CC5; // 0x2438(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_FFF780E2483480E188744B84429C7FF9; // 0x2488(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3D69F52F49089C0806283BAAFCCDF366; // 0x2530(0x0050)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_6FE2A86D41258BF786D498AA3421500E; // 0x2580(0x0158)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_FE5C7B5845B4A450816B2588209BFAF4; // 0x26D8(0x0070)()
	float                                         Pitch;                                             // 0x2748(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GoldBuff_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_ApplyAdditive_97919802402F3F719C4C17BA96282362();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_BlendListByBool_0237C07942B69678C4680D84994F71D3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_BlendListByBool_BAE422B24A3A36CD8D0041AEEDF2105F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_BlendSpacePlayer_3F9F022C4C5D898C896E78843685FC2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_RotateRootBone_E827A0884C3187A7A553D8A1A33436DD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_6FE2A86D41258BF786D498AA3421500E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_SequenceEvaluator_2930925146F1B4F516FD7E97A797C326();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_SequenceEvaluator_362780404222F8FD2ABD62965FAC75D2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_SequenceEvaluator_FE5C7B5845B4A450816B2588209BFAF4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_355E063347F8777599861EA85B0D4684();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_415F3E3B429A53CD15E612985D62E79B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_7AA4A61448A582CE9A9500A5522F296B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_7AD98CB744137F5BE58FAF85E7D09E8B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_8F2FE22C46E2BE74397D938212625B91();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_ABB0759549FED8D154408B94738A7AF2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_B76ED2144DF1902A192DA0B20825782C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_BE5C158F41215E219CA4699A4411D037();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_D2B6A84F4C00D3675A4F72B298475320();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_DD35B2014696C75E95E58E8E2CE65305();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GoldBuff_AnimBP_AnimGraphNode_TransitionResult_F68D2E044F5F2118D6A0B8A917F05D75();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GoldBuff_AnimBP_C">();
	}
	static class UGoldBuff_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGoldBuff_AnimBP_C>();
	}
};
static_assert(alignof(UGoldBuff_AnimBP_C) == 0x000010, "Wrong alignment on UGoldBuff_AnimBP_C");
static_assert(sizeof(UGoldBuff_AnimBP_C) == 0x002750, "Wrong size on UGoldBuff_AnimBP_C");
static_assert(offsetof(UGoldBuff_AnimBP_C, UberGraphFrame) == 0x0011C0, "Member 'UGoldBuff_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_Root_6D5C63FB44F233F6CFBF9BA2E8A0D450) == 0x0011C8, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_Root_6D5C63FB44F233F6CFBF9BA2E8A0D450' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_Slot_C525611F49A4163D962A7FA409936677) == 0x001210, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_Slot_C525611F49A4163D962A7FA409936677' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_ApplyAdditive_97919802402F3F719C4C17BA96282362) == 0x001278, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_ApplyAdditive_97919802402F3F719C4C17BA96282362' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_RotateRootBone_E827A0884C3187A7A553D8A1A33436DD) == 0x0012F0, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_RotateRootBone_E827A0884C3187A7A553D8A1A33436DD' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_355E063347F8777599861EA85B0D4684) == 0x001350, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_355E063347F8777599861EA85B0D4684' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_DD35B2014696C75E95E58E8E2CE65305) == 0x0013D0, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_DD35B2014696C75E95E58E8E2CE65305' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_F68D2E044F5F2118D6A0B8A917F05D75) == 0x001450, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_F68D2E044F5F2118D6A0B8A917F05D75' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_5CBDB2FE431A7108FDE17FAD2AC8FAAE) == 0x0014D0, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_5CBDB2FE431A7108FDE17FAD2AC8FAAE' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_BE5C158F41215E219CA4699A4411D037) == 0x001550, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_BE5C158F41215E219CA4699A4411D037' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_D2B6A84F4C00D3675A4F72B298475320) == 0x0015D0, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_D2B6A84F4C00D3675A4F72B298475320' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_8F2FE22C46E2BE74397D938212625B91) == 0x001650, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_8F2FE22C46E2BE74397D938212625B91' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_ABB0759549FED8D154408B94738A7AF2) == 0x0016D0, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_ABB0759549FED8D154408B94738A7AF2' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_415F3E3B429A53CD15E612985D62E79B) == 0x001750, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_415F3E3B429A53CD15E612985D62E79B' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_7AD98CB744137F5BE58FAF85E7D09E8B) == 0x0017D0, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_7AD98CB744137F5BE58FAF85E7D09E8B' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_7AA4A61448A582CE9A9500A5522F296B) == 0x001850, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_7AA4A61448A582CE9A9500A5522F296B' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_TransitionResult_B76ED2144DF1902A192DA0B20825782C) == 0x0018D0, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_TransitionResult_B76ED2144DF1902A192DA0B20825782C' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_BlendListByBool_0237C07942B69678C4680D84994F71D3) == 0x001950, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_BlendListByBool_0237C07942B69678C4680D84994F71D3' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_SequencePlayer_D6968CC149D16123DCF565BA79A004AA) == 0x001A20, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_SequencePlayer_D6968CC149D16123DCF565BA79A004AA' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_SequencePlayer_9D8B9BED46CF0EFDC9AA008B267B3BA2) == 0x001A90, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_SequencePlayer_9D8B9BED46CF0EFDC9AA008B267B3BA2' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_StateResult_F677E8784BDF2DDFBFD47590606E4E9D) == 0x001B00, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_StateResult_F677E8784BDF2DDFBFD47590606E4E9D' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_SequencePlayer_7B5BB2FD469B0285E2643F8E9EA8A660) == 0x001B48, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_SequencePlayer_7B5BB2FD469B0285E2643F8E9EA8A660' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_StateResult_B56AF0E94A5A87BA839D6EA4C0FE7479) == 0x001BB8, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_StateResult_B56AF0E94A5A87BA839D6EA4C0FE7479' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_SequenceEvaluator_362780404222F8FD2ABD62965FAC75D2) == 0x001C00, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_SequenceEvaluator_362780404222F8FD2ABD62965FAC75D2' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_StateResult_928DC43A4635EA432233D08D36BC92E7) == 0x001C70, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_StateResult_928DC43A4635EA432233D08D36BC92E7' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_SequenceEvaluator_2930925146F1B4F516FD7E97A797C326) == 0x001CB8, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_SequenceEvaluator_2930925146F1B4F516FD7E97A797C326' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_StateResult_A8711883453482A5D2A77E9B399910C0) == 0x001D28, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_StateResult_A8711883453482A5D2A77E9B399910C0' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_BlendSpacePlayer_3F9F022C4C5D898C896E78843685FC2F) == 0x001D70, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_BlendSpacePlayer_3F9F022C4C5D898C896E78843685FC2F' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_StateResult_ADE48DD3406E5A3F46EC449D72806F39) == 0x001E98, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_StateResult_ADE48DD3406E5A3F46EC449D72806F39' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_SequencePlayer_55BF4E0F44A52B0A9EF92C8E679394F8) == 0x001EE0, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_SequencePlayer_55BF4E0F44A52B0A9EF92C8E679394F8' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_StateResult_86E47BA74A68229912BCABBF9BDF381A) == 0x001F50, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_StateResult_86E47BA74A68229912BCABBF9BDF381A' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_StateMachine_69870FC64EE085F15E99C0A3388BC9D6) == 0x001F98, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_StateMachine_69870FC64EE085F15E99C0A3388BC9D6' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_Slot_9B561C8440E0849852D29191AD9CAE34) == 0x002070, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_Slot_9B561C8440E0849852D29191AD9CAE34' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_LayeredBoneBlend_4F07E8934E1AF3DEFDDB36938AC7F516) == 0x0020D8, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_LayeredBoneBlend_4F07E8934E1AF3DEFDDB36938AC7F516' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_BlendListByBool_BAE422B24A3A36CD8D0041AEEDF2105F) == 0x0021B8, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_BlendListByBool_BAE422B24A3A36CD8D0041AEEDF2105F' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_Slot_D775E79146B1036D12D500A4C822DE27) == 0x002288, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_Slot_D775E79146B1036D12D500A4C822DE27' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_SaveCachedPose_FFC4AAAA4EEEAF346BDCA784A8D66B2D) == 0x0022F0, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_SaveCachedPose_FFC4AAAA4EEEAF346BDCA784A8D66B2D' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_UseCachedPose_75908EA043ACF112A1EED18094580DC1) == 0x002398, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_UseCachedPose_75908EA043ACF112A1EED18094580DC1' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_UseCachedPose_5A328CD14F3A0C3AD2FD35BC370553FC) == 0x0023E8, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_UseCachedPose_5A328CD14F3A0C3AD2FD35BC370553FC' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_UseCachedPose_43DB07CC4CE23C0EA859D992A5AE1CC5) == 0x002438, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_UseCachedPose_43DB07CC4CE23C0EA859D992A5AE1CC5' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_SaveCachedPose_FFF780E2483480E188744B84429C7FF9) == 0x002488, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_SaveCachedPose_FFF780E2483480E188744B84429C7FF9' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_UseCachedPose_3D69F52F49089C0806283BAAFCCDF366) == 0x002530, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_UseCachedPose_3D69F52F49089C0806283BAAFCCDF366' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_6FE2A86D41258BF786D498AA3421500E) == 0x002580, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_6FE2A86D41258BF786D498AA3421500E' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, AnimGraphNode_SequenceEvaluator_FE5C7B5845B4A450816B2588209BFAF4) == 0x0026D8, "Member 'UGoldBuff_AnimBP_C::AnimGraphNode_SequenceEvaluator_FE5C7B5845B4A450816B2588209BFAF4' has a wrong offset!");
static_assert(offsetof(UGoldBuff_AnimBP_C, Pitch) == 0x002748, "Member 'UGoldBuff_AnimBP_C::Pitch' has a wrong offset!");

}

