#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionUI_structs.hpp"
#include "OrionUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HeroTooltip.HeroTooltip_C
// 0x0018 (0x03F8 - 0x03E0)
class UHeroTooltip_C final : public UOrionHeroTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	class UWidgetSwitcher*                        Switcher_Status;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_StatusInfo;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HeroTooltip(int32 EntryPoint);
	void OnHeroDataSet(EOrionHeroRankTier RankTier, EOrionHeroTooltipStatus Status);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroTooltip_C">();
	}
	static class UHeroTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeroTooltip_C>();
	}
};
static_assert(alignof(UHeroTooltip_C) == 0x000008, "Wrong alignment on UHeroTooltip_C");
static_assert(sizeof(UHeroTooltip_C) == 0x0003F8, "Wrong size on UHeroTooltip_C");
static_assert(offsetof(UHeroTooltip_C, UberGraphFrame) == 0x0003E0, "Member 'UHeroTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeroTooltip_C, Switcher_Status) == 0x0003E8, "Member 'UHeroTooltip_C::Switcher_Status' has a wrong offset!");
static_assert(offsetof(UHeroTooltip_C, VBox_StatusInfo) == 0x0003F0, "Member 'UHeroTooltip_C::VBox_StatusInfo' has a wrong offset!");

}

