#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImgMediaFactory

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ImgMediaFactory.ImgMediaSettings
// 0x0028 (0x0050 - 0x0028)
class UImgMediaSettings final : public UObject
{
public:
	float                                         DefaultFps;                                        // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CacheBehindPercentage;                             // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CacheSizeGB;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ExrDecoderThreads;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultProxy;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          UseDefaultProxy;                                   // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImgMediaSettings">();
	}
	static class UImgMediaSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImgMediaSettings>();
	}
};
static_assert(alignof(UImgMediaSettings) == 0x000008, "Wrong alignment on UImgMediaSettings");
static_assert(sizeof(UImgMediaSettings) == 0x000050, "Wrong size on UImgMediaSettings");
static_assert(offsetof(UImgMediaSettings, DefaultFps) == 0x000028, "Member 'UImgMediaSettings::DefaultFps' has a wrong offset!");
static_assert(offsetof(UImgMediaSettings, CacheBehindPercentage) == 0x00002C, "Member 'UImgMediaSettings::CacheBehindPercentage' has a wrong offset!");
static_assert(offsetof(UImgMediaSettings, CacheSizeGB) == 0x000030, "Member 'UImgMediaSettings::CacheSizeGB' has a wrong offset!");
static_assert(offsetof(UImgMediaSettings, ExrDecoderThreads) == 0x000034, "Member 'UImgMediaSettings::ExrDecoderThreads' has a wrong offset!");
static_assert(offsetof(UImgMediaSettings, DefaultProxy) == 0x000038, "Member 'UImgMediaSettings::DefaultProxy' has a wrong offset!");
static_assert(offsetof(UImgMediaSettings, UseDefaultProxy) == 0x000048, "Member 'UImgMediaSettings::UseDefaultProxy' has a wrong offset!");

}

