#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InlineRichText_RarityGlow

#include "Basic.hpp"

#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function InlineRichText_RarityGlow.InlineRichText_RarityGlow_C.ExecuteUbergraph_InlineRichText_RarityGlow
// 0x0068 (0x0068 - 0x0000)
struct InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue2;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_Tag;                                  // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_Value;                                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow) == 0x000008, "Wrong alignment on InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow");
static_assert(sizeof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow) == 0x000068, "Wrong size on InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, EntryPoint) == 0x000000, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::EntryPoint' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, Temp_int_Variable) == 0x000008, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, Temp_int_Variable2) == 0x00000C, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_Conv_IntToByte_ReturnValue) == 0x000010, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_GetValidValue_ReturnValue) == 0x000018, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_Conv_IntToByte_ReturnValue2) == 0x000019, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_Conv_IntToByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000030, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000034, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, K2Node_Event_Tag) == 0x000040, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::K2Node_Event_Tag' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, K2Node_Event_Value) == 0x000050, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000060, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000061, "Member 'InlineRichText_RarityGlow_C_ExecuteUbergraph_InlineRichText_RarityGlow::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");

// Function InlineRichText_RarityGlow.InlineRichText_RarityGlow_C.OnApplyMetaData
// 0x0020 (0x0020 - 0x0000)
struct InlineRichText_RarityGlow_C_OnApplyMetaData final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Value;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(InlineRichText_RarityGlow_C_OnApplyMetaData) == 0x000008, "Wrong alignment on InlineRichText_RarityGlow_C_OnApplyMetaData");
static_assert(sizeof(InlineRichText_RarityGlow_C_OnApplyMetaData) == 0x000020, "Wrong size on InlineRichText_RarityGlow_C_OnApplyMetaData");
static_assert(offsetof(InlineRichText_RarityGlow_C_OnApplyMetaData, Tag) == 0x000000, "Member 'InlineRichText_RarityGlow_C_OnApplyMetaData::Tag' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_OnApplyMetaData, Value) == 0x000010, "Member 'InlineRichText_RarityGlow_C_OnApplyMetaData::Value' has a wrong offset!");

// Function InlineRichText_RarityGlow.InlineRichText_RarityGlow_C.SetRarityValue
// 0x0002 (0x0002 - 0x0000)
struct InlineRichText_RarityGlow_C_SetRarityValue final
{
public:
	EOrionItemRarity                              ItemRarity;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InlineRichText_RarityGlow_C_SetRarityValue) == 0x000001, "Wrong alignment on InlineRichText_RarityGlow_C_SetRarityValue");
static_assert(sizeof(InlineRichText_RarityGlow_C_SetRarityValue) == 0x000002, "Wrong size on InlineRichText_RarityGlow_C_SetRarityValue");
static_assert(offsetof(InlineRichText_RarityGlow_C_SetRarityValue, ItemRarity) == 0x000000, "Member 'InlineRichText_RarityGlow_C_SetRarityValue::ItemRarity' has a wrong offset!");
static_assert(offsetof(InlineRichText_RarityGlow_C_SetRarityValue, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'InlineRichText_RarityGlow_C_SetRarityValue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

