#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelupEventWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LevelupEventWidget.LevelupEventWidget_C
// 0x00A0 (0x0390 - 0x02F0)
class ULevelupEventWidget_C final : public UOrionUserWidget_GameEventMessage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       LevelUp;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_60;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_61;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_65;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_114;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_115;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_353;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_354;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_355;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_360;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_361;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        LevelText;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        Text_CurrentLevel;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         MessageDuration;                                   // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LevelNumber1;                                      // 0x0378(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__LevelUp_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void BndEvt__LevelUp_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_LevelupEventWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LevelupEventWidget_C">();
	}
	static class ULevelupEventWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelupEventWidget_C>();
	}
};
static_assert(alignof(ULevelupEventWidget_C) == 0x000008, "Wrong alignment on ULevelupEventWidget_C");
static_assert(sizeof(ULevelupEventWidget_C) == 0x000390, "Wrong size on ULevelupEventWidget_C");
static_assert(offsetof(ULevelupEventWidget_C, UberGraphFrame) == 0x0002F0, "Member 'ULevelupEventWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, LevelUp) == 0x0002F8, "Member 'ULevelupEventWidget_C::LevelUp' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_0) == 0x000300, "Member 'ULevelupEventWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_60) == 0x000308, "Member 'ULevelupEventWidget_C::Image_60' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_61) == 0x000310, "Member 'ULevelupEventWidget_C::Image_61' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_65) == 0x000318, "Member 'ULevelupEventWidget_C::Image_65' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_113) == 0x000320, "Member 'ULevelupEventWidget_C::Image_113' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_114) == 0x000328, "Member 'ULevelupEventWidget_C::Image_114' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_115) == 0x000330, "Member 'ULevelupEventWidget_C::Image_115' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_353) == 0x000338, "Member 'ULevelupEventWidget_C::Image_353' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_354) == 0x000340, "Member 'ULevelupEventWidget_C::Image_354' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_355) == 0x000348, "Member 'ULevelupEventWidget_C::Image_355' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_360) == 0x000350, "Member 'ULevelupEventWidget_C::Image_360' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Image_361) == 0x000358, "Member 'ULevelupEventWidget_C::Image_361' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, LevelText) == 0x000360, "Member 'ULevelupEventWidget_C::LevelText' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, Text_CurrentLevel) == 0x000368, "Member 'ULevelupEventWidget_C::Text_CurrentLevel' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, MessageDuration) == 0x000370, "Member 'ULevelupEventWidget_C::MessageDuration' has a wrong offset!");
static_assert(offsetof(ULevelupEventWidget_C, LevelNumber1) == 0x000378, "Member 'ULevelupEventWidget_C::LevelNumber1' has a wrong offset!");

}

