#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreenTransition

#include "Basic.hpp"

#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingScreenTransition.LoadingScreenTransition_C
// 0x0040 (0x0488 - 0x0448)
class ULoadingScreenTransition_C final : public UOrionActivatableWidget
{
public:
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorder*                                BorderLogoBackplate;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_223;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_43;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        LoadingText;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVersionInfo_C*                         VersionInfo;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingScreenTransition_C">();
	}
	static class ULoadingScreenTransition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenTransition_C>();
	}
};
static_assert(alignof(ULoadingScreenTransition_C) == 0x000008, "Wrong alignment on ULoadingScreenTransition_C");
static_assert(sizeof(ULoadingScreenTransition_C) == 0x000488, "Wrong size on ULoadingScreenTransition_C");
static_assert(offsetof(ULoadingScreenTransition_C, BorderLogoBackplate) == 0x000450, "Member 'ULoadingScreenTransition_C::BorderLogoBackplate' has a wrong offset!");
static_assert(offsetof(ULoadingScreenTransition_C, HorizontalBox_223) == 0x000458, "Member 'ULoadingScreenTransition_C::HorizontalBox_223' has a wrong offset!");
static_assert(offsetof(ULoadingScreenTransition_C, Image_0) == 0x000460, "Member 'ULoadingScreenTransition_C::Image_0' has a wrong offset!");
static_assert(offsetof(ULoadingScreenTransition_C, Image_43) == 0x000468, "Member 'ULoadingScreenTransition_C::Image_43' has a wrong offset!");
static_assert(offsetof(ULoadingScreenTransition_C, LoadingText) == 0x000470, "Member 'ULoadingScreenTransition_C::LoadingText' has a wrong offset!");
static_assert(offsetof(ULoadingScreenTransition_C, VersionInfo) == 0x000478, "Member 'ULoadingScreenTransition_C::VersionInfo' has a wrong offset!");
static_assert(offsetof(ULoadingScreenTransition_C, WidgetSwitcher_0) == 0x000480, "Member 'ULoadingScreenTransition_C::WidgetSwitcher_0' has a wrong offset!");

}

