#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingScreen.LoadingScreen_C
// 0x0088 (0x0638 - 0x05B0)
class ULoadingScreen_C final : public UOrionLoadingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn_Instant;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_Normal;                                     // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoadBarIntro;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Loading;                                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSpinner;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingScreenProgress_C*               LoadingScreenProgress;                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        LoadingText;                                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         AccumulatedTime;                                   // 0x0600(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoadingTextIndex;                                  // 0x0604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreMatchLoadingScreen;                             // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionGameTipsData*                     LoadingScreenTips;                                 // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             NewVar_0;                                          // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           EnterTitle;                                        // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class USoundMix*                              LoadingScreenMix;                                  // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoadingScreen(int32 EntryPoint);
	void OnAnimationFinished_Event_0();
	void Construct();
	void OnLoadingScreenHidden();
	void OnLoadingScreenShown(bool bIsUsingFallback);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingScreen_C">();
	}
	static class ULoadingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreen_C>();
	}
};
static_assert(alignof(ULoadingScreen_C) == 0x000008, "Wrong alignment on ULoadingScreen_C");
static_assert(sizeof(ULoadingScreen_C) == 0x000638, "Wrong size on ULoadingScreen_C");
static_assert(offsetof(ULoadingScreen_C, UberGraphFrame) == 0x0005B0, "Member 'ULoadingScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, FadeIn_Instant) == 0x0005B8, "Member 'ULoadingScreen_C::FadeIn_Instant' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, FadeIn_Normal) == 0x0005C0, "Member 'ULoadingScreen_C::FadeIn_Normal' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, FadeOut) == 0x0005C8, "Member 'ULoadingScreen_C::FadeOut' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, LoadBarIntro) == 0x0005D0, "Member 'ULoadingScreen_C::LoadBarIntro' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, HBox_Loading) == 0x0005D8, "Member 'ULoadingScreen_C::HBox_Loading' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, ImageSpinner) == 0x0005E0, "Member 'ULoadingScreen_C::ImageSpinner' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, LoadingScreenProgress) == 0x0005E8, "Member 'ULoadingScreen_C::LoadingScreenProgress' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, LoadingText) == 0x0005F0, "Member 'ULoadingScreen_C::LoadingText' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, SafeZone_0) == 0x0005F8, "Member 'ULoadingScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, AccumulatedTime) == 0x000600, "Member 'ULoadingScreen_C::AccumulatedTime' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, LoadingTextIndex) == 0x000604, "Member 'ULoadingScreen_C::LoadingTextIndex' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, PreMatchLoadingScreen) == 0x000608, "Member 'ULoadingScreen_C::PreMatchLoadingScreen' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, LoadingScreenTips) == 0x000610, "Member 'ULoadingScreen_C::LoadingScreenTips' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, NewVar_0) == 0x000618, "Member 'ULoadingScreen_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, EnterTitle) == 0x000620, "Member 'ULoadingScreen_C::EnterTitle' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, LoadingScreenMix) == 0x000630, "Member 'ULoadingScreen_C::LoadingScreenMix' has a wrong offset!");

}

