#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreenProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingScreenProgress.LoadingScreenProgress_C
// 0x0028 (0x0308 - 0x02E0)
class ULoadingScreenProgress_C final : public UOrionLoadingScreenProgress
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       TipAnim;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BarTrack;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageMonolithLoadingbar;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxMonoLoadbarSize;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoadingScreenProgress(int32 EntryPoint);
	void OnProgressUpdate();
	void OnTipChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingScreenProgress_C">();
	}
	static class ULoadingScreenProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenProgress_C>();
	}
};
static_assert(alignof(ULoadingScreenProgress_C) == 0x000008, "Wrong alignment on ULoadingScreenProgress_C");
static_assert(sizeof(ULoadingScreenProgress_C) == 0x000308, "Wrong size on ULoadingScreenProgress_C");
static_assert(offsetof(ULoadingScreenProgress_C, UberGraphFrame) == 0x0002E0, "Member 'ULoadingScreenProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadingScreenProgress_C, TipAnim) == 0x0002E8, "Member 'ULoadingScreenProgress_C::TipAnim' has a wrong offset!");
static_assert(offsetof(ULoadingScreenProgress_C, BarTrack) == 0x0002F0, "Member 'ULoadingScreenProgress_C::BarTrack' has a wrong offset!");
static_assert(offsetof(ULoadingScreenProgress_C, ImageMonolithLoadingbar) == 0x0002F8, "Member 'ULoadingScreenProgress_C::ImageMonolithLoadingbar' has a wrong offset!");
static_assert(offsetof(ULoadingScreenProgress_C, SizeBoxMonoLoadbarSize) == 0x000300, "Member 'ULoadingScreenProgress_C::SizeBoxMonoLoadbarSize' has a wrong offset!");

}

