#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreenProgress

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LoadingScreenProgress.LoadingScreenProgress_C.ExecuteUbergraph_LoadingScreenProgress
// 0x0018 (0x0018 - 0x0000)
struct LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress) == 0x000004, "Wrong alignment on LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress");
static_assert(sizeof(LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress) == 0x000018, "Wrong size on LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress");
static_assert(offsetof(LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress, EntryPoint) == 0x000000, "Member 'LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress, CallFunc_GetDesiredSize_ReturnValue) == 0x000004, "Member 'LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress, CallFunc_BreakVector2D_X) == 0x00000C, "Member 'LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'LoadingScreenProgress_C_ExecuteUbergraph_LoadingScreenProgress::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

