#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginScreen

#include "Basic.hpp"

#include "Account_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LoginScreen.LoginScreen_C.ExecuteUbergraph_LoginScreen
// 0x0298 (0x0298 - 0x0000)
struct LoginScreen_C_ExecuteUbergraph_LoginScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionAsyncAction_ShowConfirmation*     CallFunc_ShowConfirmationDialog_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMcpContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess, class FText& MESSAGE, const class FString& AuthCode)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bSuccess, class FText& MESSAGE)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UMcpContext*                            CallFunc_GetContext_ReturnValue2;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMcpContext*                            CallFunc_GetContext_ReturnValue3;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELoginResult Result, class FText& MESSAGE)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UMcpContext*                            CallFunc_GetContext_ReturnValue4;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText& EulaText)>        K2Node_CreateDelegate_OutputDelegate5;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_DisplayNameUpdateAllowed_ReturnValue;     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTencentContext*                        CallFunc_GetContext_ReturnValue5;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayerContext*                         CallFunc_GetContext_ReturnValue6;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoginResult                                  K2Node_CustomEvent_Result2;                        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message4;                       // 0x00B8(0x0018)(ConstParm)
	class FString                                 CallFunc_GetAccountCountryCode_ReturnValue;        // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Username;               // 0x00E8(0x0018)()
	class FText                                   K2Node_ComponentBoundEvent_Password;               // 0x0100(0x0018)()
	bool                                          K2Node_ComponentBoundEvent_RememberMe;             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button3;                // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button2;                // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMcpContext*                            CallFunc_GetContext_ReturnValue7;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionGameUserSettings*                 CallFunc_GetOrionGameUserSettings_ReturnValue;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionGameUserSettings*                 CallFunc_GetOrionGameUserSettings_ReturnValue2;    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEngineDoingAsyncLoading_ReturnValue;    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0164(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess2;                      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message3;                       // 0x01A8(0x0018)(ConstParm)
	class FString                                 K2Node_CustomEvent_AuthCode;                       // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message2;                       // 0x01D8(0x0018)(ConstParm)
	ELoginResult                                  K2Node_CustomEvent_Result;                         // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message;                        // 0x01F8(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Email;                  // 0x0218(0x0018)()
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button;                 // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGeForceNowBuild_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCommandLineParameter_ReturnValue;      // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   K2Node_CustomEvent_EulaText;                       // 0x0250(0x0018)(ConstParm)
	bool                                          CallFunc_IsTencentBuild_ReturnValue;               // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTencentBuild_ReturnValue2;              // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	class UMcpContext*                            CallFunc_GetContext_ReturnValue8;                  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELoginResult Result, class FText& MESSAGE)> K2Node_CreateDelegate_OutputDelegate10;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ExecuteUbergraph_LoginScreen) == 0x000008, "Wrong alignment on LoginScreen_C_ExecuteUbergraph_LoginScreen");
static_assert(sizeof(LoginScreen_C_ExecuteUbergraph_LoginScreen) == 0x000298, "Wrong size on LoginScreen_C_ExecuteUbergraph_LoginScreen");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, EntryPoint) == 0x000000, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_ShowConfirmationDialog_ReturnValue) == 0x000018, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_ShowConfirmationDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_bool_Variable) == 0x000020, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_byte_Variable) == 0x000022, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_byte_Variable2) == 0x000023, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue2) == 0x000050, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue3) == 0x000058, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue4) == 0x000070, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate5) == 0x000078, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_DisplayNameUpdateAllowed_ReturnValue) == 0x000088, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_DisplayNameUpdateAllowed_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue5) == 0x000090, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate6) == 0x000098, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue6) == 0x0000A8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Result2) == 0x0000B0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Result2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Message4) == 0x0000B8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Message4' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetAccountCountryCode_ReturnValue) == 0x0000D0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetAccountCountryCode_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000E0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E1, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_ComponentBoundEvent_Username) == 0x0000E8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_ComponentBoundEvent_Username' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_ComponentBoundEvent_Password) == 0x000100, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_ComponentBoundEvent_Password' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_ComponentBoundEvent_RememberMe) == 0x000118, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_ComponentBoundEvent_RememberMe' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate7) == 0x000120, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_ComponentBoundEvent_Button3) == 0x000130, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_ComponentBoundEvent_Button2) == 0x000138, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue7) == 0x000140, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetOrionGameUserSettings_ReturnValue) == 0x000148, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetOrionGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000150, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetOrionGameUserSettings_ReturnValue2) == 0x000158, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetOrionGameUserSettings_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsEngineDoingAsyncLoading_ReturnValue) == 0x000160, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsEngineDoingAsyncLoading_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_MyGeometry) == 0x000164, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_InDeltaTime) == 0x00019C, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Select_Default) == 0x0001A0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_bSuccess2) == 0x0001A1, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_bSuccess2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Message3) == 0x0001A8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Message3' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_AuthCode) == 0x0001C0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_AuthCode' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0001D0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_BooleanAND_ReturnValue) == 0x0001D1, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_bSuccess) == 0x0001D2, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Message2) == 0x0001D8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Message2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Result) == 0x0001F0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Message) == 0x0001F8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000210, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000211, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_ComponentBoundEvent_Email) == 0x000218, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_ComponentBoundEvent_Email' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_ComponentBoundEvent_Button) == 0x000230, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsGeForceNowBuild_ReturnValue) == 0x000238, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsGeForceNowBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_HasCommandLineParameter_ReturnValue) == 0x000239, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_HasCommandLineParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate8) == 0x000240, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_EulaText) == 0x000250, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_EulaText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsTencentBuild_ReturnValue) == 0x000268, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsTencentBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsTencentBuild_ReturnValue2) == 0x000269, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsTencentBuild_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate9) == 0x000270, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue8) == 0x000280, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate10) == 0x000288, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.On EULA Available
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_On_EULA_Available final
{
public:
	class FText                                   EulaText;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_On_EULA_Available) == 0x000008, "Wrong alignment on LoginScreen_C_On_EULA_Available");
static_assert(sizeof(LoginScreen_C_On_EULA_Available) == 0x000018, "Wrong size on LoginScreen_C_On_EULA_Available");
static_assert(offsetof(LoginScreen_C_On_EULA_Available, EulaText) == 0x000000, "Member 'LoginScreen_C_On_EULA_Available::EulaText' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.BndEvt__CreateAccountButton_K2Node_ComponentBoundEvent_165_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoginScreen_C_BndEvt__CreateAccountButton_K2Node_ComponentBoundEvent_165_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_BndEvt__CreateAccountButton_K2Node_ComponentBoundEvent_165_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoginScreen_C_BndEvt__CreateAccountButton_K2Node_ComponentBoundEvent_165_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(LoginScreen_C_BndEvt__CreateAccountButton_K2Node_ComponentBoundEvent_165_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LoginScreen_C_BndEvt__CreateAccountButton_K2Node_ComponentBoundEvent_165_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(LoginScreen_C_BndEvt__CreateAccountButton_K2Node_ComponentBoundEvent_165_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LoginScreen_C_BndEvt__CreateAccountButton_K2Node_ComponentBoundEvent_165_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.BndEvt__LoginWindow_K2Node_ComponentBoundEvent_1_OnForgotPasswordRequest__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_1_OnForgotPasswordRequest__DelegateSignature final
{
public:
	class FText                                   Email;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_1_OnForgotPasswordRequest__DelegateSignature) == 0x000008, "Wrong alignment on LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_1_OnForgotPasswordRequest__DelegateSignature");
static_assert(sizeof(LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_1_OnForgotPasswordRequest__DelegateSignature) == 0x000018, "Wrong size on LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_1_OnForgotPasswordRequest__DelegateSignature");
static_assert(offsetof(LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_1_OnForgotPasswordRequest__DelegateSignature, Email) == 0x000000, "Member 'LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_1_OnForgotPasswordRequest__DelegateSignature::Email' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnLoginAuthCodeComplete
// 0x0020 (0x0020 - 0x0000)
struct LoginScreen_C_OnLoginAuthCodeComplete final
{
public:
	ELoginResult                                  Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MESSAGE;                                           // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnLoginAuthCodeComplete) == 0x000008, "Wrong alignment on LoginScreen_C_OnLoginAuthCodeComplete");
static_assert(sizeof(LoginScreen_C_OnLoginAuthCodeComplete) == 0x000020, "Wrong size on LoginScreen_C_OnLoginAuthCodeComplete");
static_assert(offsetof(LoginScreen_C_OnLoginAuthCodeComplete, Result) == 0x000000, "Member 'LoginScreen_C_OnLoginAuthCodeComplete::Result' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnLoginAuthCodeComplete, MESSAGE) == 0x000008, "Member 'LoginScreen_C_OnLoginAuthCodeComplete::MESSAGE' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnWebForgotPasswordComplete
// 0x0020 (0x0020 - 0x0000)
struct LoginScreen_C_OnWebForgotPasswordComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MESSAGE;                                           // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnWebForgotPasswordComplete) == 0x000008, "Wrong alignment on LoginScreen_C_OnWebForgotPasswordComplete");
static_assert(sizeof(LoginScreen_C_OnWebForgotPasswordComplete) == 0x000020, "Wrong size on LoginScreen_C_OnWebForgotPasswordComplete");
static_assert(offsetof(LoginScreen_C_OnWebForgotPasswordComplete, bSuccess) == 0x000000, "Member 'LoginScreen_C_OnWebForgotPasswordComplete::bSuccess' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnWebForgotPasswordComplete, MESSAGE) == 0x000008, "Member 'LoginScreen_C_OnWebForgotPasswordComplete::MESSAGE' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnWebCreateAccountComplete
// 0x0030 (0x0030 - 0x0000)
struct LoginScreen_C_OnWebCreateAccountComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MESSAGE;                                           // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 AuthCode;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_OnWebCreateAccountComplete) == 0x000008, "Wrong alignment on LoginScreen_C_OnWebCreateAccountComplete");
static_assert(sizeof(LoginScreen_C_OnWebCreateAccountComplete) == 0x000030, "Wrong size on LoginScreen_C_OnWebCreateAccountComplete");
static_assert(offsetof(LoginScreen_C_OnWebCreateAccountComplete, bSuccess) == 0x000000, "Member 'LoginScreen_C_OnWebCreateAccountComplete::bSuccess' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnWebCreateAccountComplete, MESSAGE) == 0x000008, "Member 'LoginScreen_C_OnWebCreateAccountComplete::MESSAGE' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnWebCreateAccountComplete, AuthCode) == 0x000020, "Member 'LoginScreen_C_OnWebCreateAccountComplete::AuthCode' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct LoginScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_Tick) == 0x000004, "Wrong alignment on LoginScreen_C_Tick");
static_assert(sizeof(LoginScreen_C_Tick) == 0x00003C, "Wrong size on LoginScreen_C_Tick");
static_assert(offsetof(LoginScreen_C_Tick, MyGeometry) == 0x000000, "Member 'LoginScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'LoginScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.BndEvt__RunBenchmarkButton_K2Node_ComponentBoundEvent_133_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoginScreen_C_BndEvt__RunBenchmarkButton_K2Node_ComponentBoundEvent_133_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_BndEvt__RunBenchmarkButton_K2Node_ComponentBoundEvent_133_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoginScreen_C_BndEvt__RunBenchmarkButton_K2Node_ComponentBoundEvent_133_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(LoginScreen_C_BndEvt__RunBenchmarkButton_K2Node_ComponentBoundEvent_133_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LoginScreen_C_BndEvt__RunBenchmarkButton_K2Node_ComponentBoundEvent_133_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(LoginScreen_C_BndEvt__RunBenchmarkButton_K2Node_ComponentBoundEvent_133_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LoginScreen_C_BndEvt__RunBenchmarkButton_K2Node_ComponentBoundEvent_133_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_893_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoginScreen_C_BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_893_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_893_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoginScreen_C_BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_893_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(LoginScreen_C_BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_893_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LoginScreen_C_BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_893_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(LoginScreen_C_BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_893_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LoginScreen_C_BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_893_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature final
{
public:
	class FText                                   Username;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Password;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          RememberMe;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature) == 0x000008, "Wrong alignment on LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature");
static_assert(sizeof(LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature) == 0x000038, "Wrong size on LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature");
static_assert(offsetof(LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature, Username) == 0x000000, "Member 'LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature::Username' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature, Password) == 0x000018, "Member 'LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature::Password' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature, RememberMe) == 0x000030, "Member 'LoginScreen_C_BndEvt__LoginWindow_K2Node_ComponentBoundEvent_394_OnLoginRequest__DelegateSignature::RememberMe' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnLoginComplete
// 0x0020 (0x0020 - 0x0000)
struct LoginScreen_C_OnLoginComplete final
{
public:
	ELoginResult                                  Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MESSAGE;                                           // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnLoginComplete) == 0x000008, "Wrong alignment on LoginScreen_C_OnLoginComplete");
static_assert(sizeof(LoginScreen_C_OnLoginComplete) == 0x000020, "Wrong size on LoginScreen_C_OnLoginComplete");
static_assert(offsetof(LoginScreen_C_OnLoginComplete, Result) == 0x000000, "Member 'LoginScreen_C_OnLoginComplete::Result' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnLoginComplete, MESSAGE) == 0x000008, "Member 'LoginScreen_C_OnLoginComplete::MESSAGE' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct LoginScreen_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(LoginScreen_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on LoginScreen_C_OnMouseButtonDown");
static_assert(sizeof(LoginScreen_C_OnMouseButtonDown) == 0x000218, "Wrong size on LoginScreen_C_OnMouseButtonDown");
static_assert(offsetof(LoginScreen_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'LoginScreen_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'LoginScreen_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'LoginScreen_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'LoginScreen_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct LoginScreen_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(LoginScreen_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on LoginScreen_C_OnMouseButtonUp");
static_assert(sizeof(LoginScreen_C_OnMouseButtonUp) == 0x000218, "Wrong size on LoginScreen_C_OnMouseButtonUp");
static_assert(offsetof(LoginScreen_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'LoginScreen_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'LoginScreen_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'LoginScreen_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'LoginScreen_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.Show Eula
// 0x0058 (0x0058 - 0x0000)
struct LoginScreen_C_Show_Eula final
{
public:
	class FText                                   EULA_Text;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UOrionUIManagerWidget*                  CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMcpContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEULAWidget_C*                          CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(LoginScreen_C_Show_Eula) == 0x000008, "Wrong alignment on LoginScreen_C_Show_Eula");
static_assert(sizeof(LoginScreen_C_Show_Eula) == 0x000058, "Wrong size on LoginScreen_C_Show_Eula");
static_assert(offsetof(LoginScreen_C_Show_Eula, EULA_Text) == 0x000000, "Member 'LoginScreen_C_Show_Eula::EULA_Text' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_Show_Eula, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'LoginScreen_C_Show_Eula::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_Show_Eula, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'LoginScreen_C_Show_Eula::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_Show_Eula, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'LoginScreen_C_Show_Eula::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_Show_Eula, CallFunc_Create_ReturnValue) == 0x000030, "Member 'LoginScreen_C_Show_Eula::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_Show_Eula, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'LoginScreen_C_Show_Eula::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_Show_Eula, K2Node_CreateDelegate_OutputDelegate2) == 0x000048, "Member 'LoginScreen_C_Show_Eula::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ShowLoginThrobber
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_ShowLoginThrobber final
{
public:
	bool                                          CallFunc_IsTencentBuild_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ShowLoginThrobber) == 0x000001, "Wrong alignment on LoginScreen_C_ShowLoginThrobber");
static_assert(sizeof(LoginScreen_C_ShowLoginThrobber) == 0x000001, "Wrong size on LoginScreen_C_ShowLoginThrobber");
static_assert(offsetof(LoginScreen_C_ShowLoginThrobber, CallFunc_IsTencentBuild_ReturnValue) == 0x000000, "Member 'LoginScreen_C_ShowLoginThrobber::CallFunc_IsTencentBuild_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ShowErrorMessage
// 0x0020 (0x0020 - 0x0000)
struct LoginScreen_C_ShowErrorMessage final
{
public:
	class FText                                   ErrorText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Play_Sound_on_Error;                               // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTencentBuild_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ShowErrorMessage) == 0x000008, "Wrong alignment on LoginScreen_C_ShowErrorMessage");
static_assert(sizeof(LoginScreen_C_ShowErrorMessage) == 0x000020, "Wrong size on LoginScreen_C_ShowErrorMessage");
static_assert(offsetof(LoginScreen_C_ShowErrorMessage, ErrorText) == 0x000000, "Member 'LoginScreen_C_ShowErrorMessage::ErrorText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowErrorMessage, Play_Sound_on_Error) == 0x000018, "Member 'LoginScreen_C_ShowErrorMessage::Play_Sound_on_Error' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowErrorMessage, CallFunc_IsTencentBuild_ReturnValue) == 0x000019, "Member 'LoginScreen_C_ShowErrorMessage::CallFunc_IsTencentBuild_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnLogin
// 0x0028 (0x0028 - 0x0000)
struct LoginScreen_C_OnLogin final
{
public:
	ELoginResult                                  LoginResult;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MESSAGE;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_OnLogin) == 0x000008, "Wrong alignment on LoginScreen_C_OnLogin");
static_assert(sizeof(LoginScreen_C_OnLogin) == 0x000028, "Wrong size on LoginScreen_C_OnLogin");
static_assert(offsetof(LoginScreen_C_OnLogin, LoginResult) == 0x000000, "Member 'LoginScreen_C_OnLogin::LoginResult' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnLogin, MESSAGE) == 0x000008, "Member 'LoginScreen_C_OnLogin::MESSAGE' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnLogin, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000020, "Member 'LoginScreen_C_OnLogin::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnLogin, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'LoginScreen_C_OnLogin::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.IsReadyForNextState
// 0x0009 (0x0009 - 0x0000)
struct LoginScreen_C_IsReadyForNextState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTencentBuild_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReadyForNextState_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_IsReadyForNextState) == 0x000001, "Wrong alignment on LoginScreen_C_IsReadyForNextState");
static_assert(sizeof(LoginScreen_C_IsReadyForNextState) == 0x000009, "Wrong size on LoginScreen_C_IsReadyForNextState");
static_assert(offsetof(LoginScreen_C_IsReadyForNextState, ReturnValue) == 0x000000, "Member 'LoginScreen_C_IsReadyForNextState::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_IsReadyForNextState, CallFunc_IsTencentBuild_ReturnValue) == 0x000001, "Member 'LoginScreen_C_IsReadyForNextState::CallFunc_IsTencentBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_IsReadyForNextState, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000002, "Member 'LoginScreen_C_IsReadyForNextState::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
