#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginWindow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LoginWindow.LoginWindow_C.OnLoginRequest__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct LoginWindow_C_OnLoginRequest__DelegateSignature final
{
public:
	class FText                                   Username;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Password;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          RememberMe;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginWindow_C_OnLoginRequest__DelegateSignature) == 0x000008, "Wrong alignment on LoginWindow_C_OnLoginRequest__DelegateSignature");
static_assert(sizeof(LoginWindow_C_OnLoginRequest__DelegateSignature) == 0x000038, "Wrong size on LoginWindow_C_OnLoginRequest__DelegateSignature");
static_assert(offsetof(LoginWindow_C_OnLoginRequest__DelegateSignature, Username) == 0x000000, "Member 'LoginWindow_C_OnLoginRequest__DelegateSignature::Username' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_OnLoginRequest__DelegateSignature, Password) == 0x000018, "Member 'LoginWindow_C_OnLoginRequest__DelegateSignature::Password' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_OnLoginRequest__DelegateSignature, RememberMe) == 0x000030, "Member 'LoginWindow_C_OnLoginRequest__DelegateSignature::RememberMe' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.OnForgotPasswordRequest__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LoginWindow_C_OnForgotPasswordRequest__DelegateSignature final
{
public:
	class FText                                   Email;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LoginWindow_C_OnForgotPasswordRequest__DelegateSignature) == 0x000008, "Wrong alignment on LoginWindow_C_OnForgotPasswordRequest__DelegateSignature");
static_assert(sizeof(LoginWindow_C_OnForgotPasswordRequest__DelegateSignature) == 0x000018, "Wrong size on LoginWindow_C_OnForgotPasswordRequest__DelegateSignature");
static_assert(offsetof(LoginWindow_C_OnForgotPasswordRequest__DelegateSignature, Email) == 0x000000, "Member 'LoginWindow_C_OnForgotPasswordRequest__DelegateSignature::Email' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.ExecuteUbergraph_LoginWindow
// 0x0168 (0x0168 - 0x0000)
struct LoginWindow_C_ExecuteUbergraph_LoginWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue2;                     // 0x0020(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue3;                     // 0x0038(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue4;                     // 0x0058(0x0018)()
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button2;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue2;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMcpContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidEmail_ReturnValue;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text4;                  // 0x0090(0x0018)()
	class FText                                   K2Node_ComponentBoundEvent_Text3;                  // 0x00A8(0x0018)()
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text2;                  // 0x00D0(0x0018)()
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod2;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00F0(0x0018)()
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue5;                     // 0x0110(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue6;                     // 0x0128(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue7;                     // 0x0140(0x0018)()
	class UMcpContext*                            CallFunc_GetContext_ReturnValue2;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidEmail_ReturnValue2;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginWindow_C_ExecuteUbergraph_LoginWindow) == 0x000008, "Wrong alignment on LoginWindow_C_ExecuteUbergraph_LoginWindow");
static_assert(sizeof(LoginWindow_C_ExecuteUbergraph_LoginWindow) == 0x000168, "Wrong size on LoginWindow_C_ExecuteUbergraph_LoginWindow");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, EntryPoint) == 0x000000, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_IsChecked_ReturnValue) == 0x000004, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetText_ReturnValue2) == 0x000020, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetText_ReturnValue3) == 0x000038, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_TextIsEmpty_ReturnValue) == 0x000050, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetText_ReturnValue4) == 0x000058, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, K2Node_ComponentBoundEvent_Button2) == 0x000070, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_TextIsEmpty_ReturnValue2) == 0x000078, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_TextIsEmpty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetContext_ReturnValue) == 0x000080, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_Not_PreBool_ReturnValue2) == 0x000088, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_IsValidEmail_ReturnValue) == 0x000089, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_IsValidEmail_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_BooleanAND_ReturnValue) == 0x00008A, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, K2Node_ComponentBoundEvent_Text4) == 0x000090, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::K2Node_ComponentBoundEvent_Text4' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, K2Node_ComponentBoundEvent_Text3) == 0x0000A8, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::K2Node_ComponentBoundEvent_Text3' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, K2Node_ComponentBoundEvent_Button) == 0x0000C0, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetIsEnabled_ReturnValue) == 0x0000C8, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, K2Node_ComponentBoundEvent_bIsChecked) == 0x0000C9, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, K2Node_ComponentBoundEvent_Text2) == 0x0000D0, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::K2Node_ComponentBoundEvent_Text2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, K2Node_ComponentBoundEvent_CommitMethod2) == 0x0000E8, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::K2Node_ComponentBoundEvent_CommitMethod2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, K2Node_ComponentBoundEvent_Text) == 0x0000F0, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, K2Node_ComponentBoundEvent_CommitMethod) == 0x000108, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000109, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_NotEqual_ByteByte_ReturnValue2) == 0x00010A, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_NotEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetText_ReturnValue5) == 0x000110, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetText_ReturnValue6) == 0x000128, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetText_ReturnValue6' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetText_ReturnValue7) == 0x000140, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetText_ReturnValue7' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_GetContext_ReturnValue2) == 0x000158, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_IsValidEmail_ReturnValue2) == 0x000160, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_IsValidEmail_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ExecuteUbergraph_LoginWindow, CallFunc_BooleanAND_ReturnValue2) == 0x000161, "Member 'LoginWindow_C_ExecuteUbergraph_LoginWindow::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_63_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_156_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.BndEvt__Remember_K2Node_ComponentBoundEvent_67_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct LoginWindow_C_BndEvt__Remember_K2Node_ComponentBoundEvent_67_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginWindow_C_BndEvt__Remember_K2Node_ComponentBoundEvent_67_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on LoginWindow_C_BndEvt__Remember_K2Node_ComponentBoundEvent_67_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(LoginWindow_C_BndEvt__Remember_K2Node_ComponentBoundEvent_67_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on LoginWindow_C_BndEvt__Remember_K2Node_ComponentBoundEvent_67_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(LoginWindow_C_BndEvt__Remember_K2Node_ComponentBoundEvent_67_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'LoginWindow_C_BndEvt__Remember_K2Node_ComponentBoundEvent_67_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.BndEvt__LoginButton_K2Node_ComponentBoundEvent_824_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoginWindow_C_BndEvt__LoginButton_K2Node_ComponentBoundEvent_824_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginWindow_C_BndEvt__LoginButton_K2Node_ComponentBoundEvent_824_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoginWindow_C_BndEvt__LoginButton_K2Node_ComponentBoundEvent_824_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(LoginWindow_C_BndEvt__LoginButton_K2Node_ComponentBoundEvent_824_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LoginWindow_C_BndEvt__LoginButton_K2Node_ComponentBoundEvent_824_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(LoginWindow_C_BndEvt__LoginButton_K2Node_ComponentBoundEvent_824_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LoginWindow_C_BndEvt__LoginButton_K2Node_ComponentBoundEvent_824_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.BndEvt__OrionPassword_K2Node_ComponentBoundEvent_231_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_231_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_231_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_231_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_231_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_231_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_231_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'LoginWindow_C_BndEvt__OrionPassword_K2Node_ComponentBoundEvent_231_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.BndEvt__OrionEmail_K2Node_ComponentBoundEvent_111_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_111_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_111_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_111_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_111_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_111_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_111_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'LoginWindow_C_BndEvt__OrionEmail_K2Node_ComponentBoundEvent_111_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.BndEvt__ForgotPasswordButton_K2Node_ComponentBoundEvent_88_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoginWindow_C_BndEvt__ForgotPasswordButton_K2Node_ComponentBoundEvent_88_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginWindow_C_BndEvt__ForgotPasswordButton_K2Node_ComponentBoundEvent_88_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoginWindow_C_BndEvt__ForgotPasswordButton_K2Node_ComponentBoundEvent_88_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(LoginWindow_C_BndEvt__ForgotPasswordButton_K2Node_ComponentBoundEvent_88_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LoginWindow_C_BndEvt__ForgotPasswordButton_K2Node_ComponentBoundEvent_88_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(LoginWindow_C_BndEvt__ForgotPasswordButton_K2Node_ComponentBoundEvent_88_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LoginWindow_C_BndEvt__ForgotPasswordButton_K2Node_ComponentBoundEvent_88_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.GetErrorMessageText
// 0x0038 (0x0038 - 0x0000)
struct LoginWindow_C_GetErrorMessageText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMcpContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLoginStatus_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(LoginWindow_C_GetErrorMessageText) == 0x000008, "Wrong alignment on LoginWindow_C_GetErrorMessageText");
static_assert(sizeof(LoginWindow_C_GetErrorMessageText) == 0x000038, "Wrong size on LoginWindow_C_GetErrorMessageText");
static_assert(offsetof(LoginWindow_C_GetErrorMessageText, ReturnValue) == 0x000000, "Member 'LoginWindow_C_GetErrorMessageText::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetErrorMessageText, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'LoginWindow_C_GetErrorMessageText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetErrorMessageText, CallFunc_GetLoginStatus_ReturnValue) == 0x000020, "Member 'LoginWindow_C_GetErrorMessageText::CallFunc_GetLoginStatus_ReturnValue' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.ShowErrorMessage
// 0x0020 (0x0020 - 0x0000)
struct LoginWindow_C_ShowErrorMessage final
{
public:
	class FText                                   MESSAGE;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          PlaySoundOnError;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginWindow_C_ShowErrorMessage) == 0x000008, "Wrong alignment on LoginWindow_C_ShowErrorMessage");
static_assert(sizeof(LoginWindow_C_ShowErrorMessage) == 0x000020, "Wrong size on LoginWindow_C_ShowErrorMessage");
static_assert(offsetof(LoginWindow_C_ShowErrorMessage, MESSAGE) == 0x000000, "Member 'LoginWindow_C_ShowErrorMessage::MESSAGE' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ShowErrorMessage, PlaySoundOnError) == 0x000018, "Member 'LoginWindow_C_ShowErrorMessage::PlaySoundOnError' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ShowErrorMessage, Temp_bool_Variable) == 0x000019, "Member 'LoginWindow_C_ShowErrorMessage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ShowErrorMessage, CallFunc_TextIsEmpty_ReturnValue) == 0x00001A, "Member 'LoginWindow_C_ShowErrorMessage::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ShowErrorMessage, Temp_byte_Variable) == 0x00001B, "Member 'LoginWindow_C_ShowErrorMessage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ShowErrorMessage, Temp_byte_Variable2) == 0x00001C, "Member 'LoginWindow_C_ShowErrorMessage::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_ShowErrorMessage, K2Node_Select_Default) == 0x00001D, "Member 'LoginWindow_C_ShowErrorMessage::K2Node_Select_Default' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.GetRememberMeVisible
// 0x0018 (0x0018 - 0x0000)
struct LoginWindow_C_GetRememberMeVisible final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMcpContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRememberMeAllowed_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginWindow_C_GetRememberMeVisible) == 0x000008, "Wrong alignment on LoginWindow_C_GetRememberMeVisible");
static_assert(sizeof(LoginWindow_C_GetRememberMeVisible) == 0x000018, "Wrong size on LoginWindow_C_GetRememberMeVisible");
static_assert(offsetof(LoginWindow_C_GetRememberMeVisible, ReturnValue) == 0x000000, "Member 'LoginWindow_C_GetRememberMeVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetRememberMeVisible, Temp_bool_Variable) == 0x000001, "Member 'LoginWindow_C_GetRememberMeVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetRememberMeVisible, Temp_byte_Variable) == 0x000002, "Member 'LoginWindow_C_GetRememberMeVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetRememberMeVisible, Temp_byte_Variable2) == 0x000003, "Member 'LoginWindow_C_GetRememberMeVisible::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetRememberMeVisible, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'LoginWindow_C_GetRememberMeVisible::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetRememberMeVisible, CallFunc_IsRememberMeAllowed_ReturnValue) == 0x000010, "Member 'LoginWindow_C_GetRememberMeVisible::CallFunc_IsRememberMeAllowed_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetRememberMeVisible, K2Node_Select_Default) == 0x000011, "Member 'LoginWindow_C_GetRememberMeVisible::K2Node_Select_Default' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.GetLoggingInText
// 0x0078 (0x0078 - 0x0000)
struct LoginWindow_C_GetLoggingInText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class UMcpContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLoginStatus_ReturnValue;               // 0x0040(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
};
static_assert(alignof(LoginWindow_C_GetLoggingInText) == 0x000008, "Wrong alignment on LoginWindow_C_GetLoggingInText");
static_assert(sizeof(LoginWindow_C_GetLoggingInText) == 0x000078, "Wrong size on LoginWindow_C_GetLoggingInText");
static_assert(offsetof(LoginWindow_C_GetLoggingInText, ReturnValue) == 0x000000, "Member 'LoginWindow_C_GetLoggingInText::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetLoggingInText, Temp_bool_Variable) == 0x000018, "Member 'LoginWindow_C_GetLoggingInText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetLoggingInText, Temp_text_Variable) == 0x000020, "Member 'LoginWindow_C_GetLoggingInText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetLoggingInText, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'LoginWindow_C_GetLoggingInText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetLoggingInText, CallFunc_GetLoginStatus_ReturnValue) == 0x000040, "Member 'LoginWindow_C_GetLoggingInText::CallFunc_GetLoginStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetLoggingInText, CallFunc_TextIsEmpty_ReturnValue) == 0x000058, "Member 'LoginWindow_C_GetLoggingInText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_GetLoggingInText, K2Node_Select_Default) == 0x000060, "Member 'LoginWindow_C_GetLoggingInText::K2Node_Select_Default' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.Reset
// 0x0030 (0x0030 - 0x0000)
struct LoginWindow_C_Reset final
{
public:
	class UMcpContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRememberMeChecked_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUsername_ReturnValue;                  // 0x0010(0x0018)()
	bool                                          CallFunc_IsGeForceNowBuild_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginWindow_C_Reset) == 0x000008, "Wrong alignment on LoginWindow_C_Reset");
static_assert(sizeof(LoginWindow_C_Reset) == 0x000030, "Wrong size on LoginWindow_C_Reset");
static_assert(offsetof(LoginWindow_C_Reset, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'LoginWindow_C_Reset::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_Reset, CallFunc_IsRememberMeChecked_ReturnValue) == 0x000008, "Member 'LoginWindow_C_Reset::CallFunc_IsRememberMeChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_Reset, CallFunc_GetUsername_ReturnValue) == 0x000010, "Member 'LoginWindow_C_Reset::CallFunc_GetUsername_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_Reset, CallFunc_IsGeForceNowBuild_ReturnValue) == 0x000028, "Member 'LoginWindow_C_Reset::CallFunc_IsGeForceNowBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_Reset, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'LoginWindow_C_Reset::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginWindow_C_Reset, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'LoginWindow_C_Reset::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function LoginWindow.LoginWindow_C.IsInteractable
// 0x0001 (0x0001 - 0x0000)
struct LoginWindow_C_IsInteractable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginWindow_C_IsInteractable) == 0x000001, "Wrong alignment on LoginWindow_C_IsInteractable");
static_assert(sizeof(LoginWindow_C_IsInteractable) == 0x000001, "Wrong size on LoginWindow_C_IsInteractable");
static_assert(offsetof(LoginWindow_C_IsInteractable, ReturnValue) == 0x000000, "Member 'LoginWindow_C_IsInteractable::ReturnValue' has a wrong offset!");

}

