#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Match_Info_Text_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function Match_Info_Text_Widget.Match_Info_Text_Widget_C.ExecuteUbergraph_Match_Info_Text_Widget
// 0x0050 (0x0050 - 0x0000)
struct Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionGameState_MOBA*                   K2Node_DynamicCast_AsOrion_Game_State_MOBA;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SecondsUntilMatchStarts)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue2;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SecondsUntilMatchStarts;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionGameState_MOBA*                   K2Node_DynamicCast_AsOrion_Game_State_MOBA2;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget) == 0x000008, "Wrong alignment on Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget");
static_assert(sizeof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget) == 0x000050, "Wrong size on Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, EntryPoint) == 0x000000, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, K2Node_DynamicCast_AsOrion_Game_State_MOBA) == 0x000010, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::K2Node_DynamicCast_AsOrion_Game_State_MOBA' has a wrong offset!");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, CallFunc_GetGameState_ReturnValue2) == 0x000030, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::CallFunc_GetGameState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, K2Node_CustomEvent_SecondsUntilMatchStarts) == 0x000038, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::K2Node_CustomEvent_SecondsUntilMatchStarts' has a wrong offset!");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, K2Node_DynamicCast_AsOrion_Game_State_MOBA2) == 0x000040, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::K2Node_DynamicCast_AsOrion_Game_State_MOBA2' has a wrong offset!");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'Match_Info_Text_Widget_C_ExecuteUbergraph_Match_Info_Text_Widget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function Match_Info_Text_Widget.Match_Info_Text_Widget_C.OnMatchCountdownSecondsUpdated_Event_0
// 0x0004 (0x0004 - 0x0000)
struct Match_Info_Text_Widget_C_OnMatchCountdownSecondsUpdated_Event_0 final
{
public:
	int32                                         SecondsUntilMatchStarts;                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Match_Info_Text_Widget_C_OnMatchCountdownSecondsUpdated_Event_0) == 0x000004, "Wrong alignment on Match_Info_Text_Widget_C_OnMatchCountdownSecondsUpdated_Event_0");
static_assert(sizeof(Match_Info_Text_Widget_C_OnMatchCountdownSecondsUpdated_Event_0) == 0x000004, "Wrong size on Match_Info_Text_Widget_C_OnMatchCountdownSecondsUpdated_Event_0");
static_assert(offsetof(Match_Info_Text_Widget_C_OnMatchCountdownSecondsUpdated_Event_0, SecondsUntilMatchStarts) == 0x000000, "Member 'Match_Info_Text_Widget_C_OnMatchCountdownSecondsUpdated_Event_0::SecondsUntilMatchStarts' has a wrong offset!");

}

