#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Minion_Melee_Prototype_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Minion_Melee_Prototype_AnimBP.Minion_Melee_Prototype_AnimBP_C
// 0x0B80 (0x17B0 - 0x0C30)
class UMinion_Melee_Prototype_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_B7F0310746CDCDBD1FBBE29EDA9B6A2B; // 0x0C38(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_A8F04F354511EE05381C4B9434E0EBCA; // 0x0D60(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1D0971E84118778B50B409A55DC4C654; // 0x0DA8(0x0048)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_294754EE4E33EE1A5145DE938AD1FD31; // 0x0DF0(0x02F0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_A412B7504967E8804139D4A1B977EA45; // 0x10E0(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_157560624FFD8CAE29EE3E989C8D3883; // 0x11B0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A0E9F02646D59A926DB8758278883E25; // 0x11F8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_66F771C44E8297721692B8B53AD80995; // 0x1320(0x00B8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_BF7E822A40F1191A293D7D94E569EDC3; // 0x13D8(0x00B8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11CC98914FF3EFC21184F1BCC2FFB062; // 0x1490(0x00B8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_C0E3C02D45DC6B37625621915CCD19A2; // 0x1548(0x00B8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5045C3D94151B5F6FDB5868DE4695A5F; // 0x1600(0x00B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_EAB0EB9948CCF343080EB4A8E0CDD1B2; // 0x16B8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B10ED0F547854D35D20EE395AD7DE3E2; // 0x1730(0x0070)()
	float                                         Bent;                                              // 0x17A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewVar_0;                                          // 0x17A4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Melee_Prototype_AnimBP_AnimGraphNode_BlendListByInt_A412B7504967E8804139D4A1B977EA45();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Melee_Prototype_AnimBP_AnimGraphNode_BlendSpacePlayer_A0E9F02646D59A926DB8758278883E25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Melee_Prototype_AnimBP_AnimGraphNode_BlendSpacePlayer_B7F0310746CDCDBD1FBBE29EDA9B6A2B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Melee_Prototype_AnimBP_AnimGraphNode_ModifyBone_11CC98914FF3EFC21184F1BCC2FFB062();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Melee_Prototype_AnimBP_AnimGraphNode_ModifyBone_66F771C44E8297721692B8B53AD80995();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Melee_Prototype_AnimBP_AnimGraphNode_ModifyBone_BF7E822A40F1191A293D7D94E569EDC3();
	void ExecuteUbergraph_Minion_Melee_Prototype_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Minion_Melee_Prototype_AnimBP_C">();
	}
	static class UMinion_Melee_Prototype_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinion_Melee_Prototype_AnimBP_C>();
	}
};
static_assert(alignof(UMinion_Melee_Prototype_AnimBP_C) == 0x000010, "Wrong alignment on UMinion_Melee_Prototype_AnimBP_C");
static_assert(sizeof(UMinion_Melee_Prototype_AnimBP_C) == 0x0017B0, "Wrong size on UMinion_Melee_Prototype_AnimBP_C");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'UMinion_Melee_Prototype_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_BlendSpacePlayer_B7F0310746CDCDBD1FBBE29EDA9B6A2B) == 0x000C38, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_BlendSpacePlayer_B7F0310746CDCDBD1FBBE29EDA9B6A2B' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_LocalToComponentSpace_A8F04F354511EE05381C4B9434E0EBCA) == 0x000D60, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_LocalToComponentSpace_A8F04F354511EE05381C4B9434E0EBCA' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1D0971E84118778B50B409A55DC4C654) == 0x000DA8, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1D0971E84118778B50B409A55DC4C654' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, OrionAnimGraphNode_MinionBehavior_294754EE4E33EE1A5145DE938AD1FD31) == 0x000DF0, "Member 'UMinion_Melee_Prototype_AnimBP_C::OrionAnimGraphNode_MinionBehavior_294754EE4E33EE1A5145DE938AD1FD31' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_BlendListByInt_A412B7504967E8804139D4A1B977EA45) == 0x0010E0, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_BlendListByInt_A412B7504967E8804139D4A1B977EA45' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_Root_157560624FFD8CAE29EE3E989C8D3883) == 0x0011B0, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_Root_157560624FFD8CAE29EE3E989C8D3883' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_BlendSpacePlayer_A0E9F02646D59A926DB8758278883E25) == 0x0011F8, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_BlendSpacePlayer_A0E9F02646D59A926DB8758278883E25' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_ModifyBone_66F771C44E8297721692B8B53AD80995) == 0x001320, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_ModifyBone_66F771C44E8297721692B8B53AD80995' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_ModifyBone_BF7E822A40F1191A293D7D94E569EDC3) == 0x0013D8, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_ModifyBone_BF7E822A40F1191A293D7D94E569EDC3' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_ModifyBone_11CC98914FF3EFC21184F1BCC2FFB062) == 0x001490, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_ModifyBone_11CC98914FF3EFC21184F1BCC2FFB062' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_ModifyBone_C0E3C02D45DC6B37625621915CCD19A2) == 0x001548, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_ModifyBone_C0E3C02D45DC6B37625621915CCD19A2' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_ModifyBone_5045C3D94151B5F6FDB5868DE4695A5F) == 0x001600, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_ModifyBone_5045C3D94151B5F6FDB5868DE4695A5F' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_ApplyAdditive_EAB0EB9948CCF343080EB4A8E0CDD1B2) == 0x0016B8, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_ApplyAdditive_EAB0EB9948CCF343080EB4A8E0CDD1B2' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, AnimGraphNode_SequencePlayer_B10ED0F547854D35D20EE395AD7DE3E2) == 0x001730, "Member 'UMinion_Melee_Prototype_AnimBP_C::AnimGraphNode_SequencePlayer_B10ED0F547854D35D20EE395AD7DE3E2' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, Bent) == 0x0017A0, "Member 'UMinion_Melee_Prototype_AnimBP_C::Bent' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_Prototype_AnimBP_C, NewVar_0) == 0x0017A4, "Member 'UMinion_Melee_Prototype_AnimBP_C::NewVar_0' has a wrong offset!");

}

