#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Minion_JungleMelee_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Minion_JungleMelee_AnimBP.Minion_JungleMelee_AnimBP_C
// 0x0890 (0x14C0 - 0x0C30)
class UMinion_JungleMelee_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9E43F6C34EF975AB7A09448D89FB1229; // 0x0C38(0x0128)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_D47D07E349FC836BFDF3CB8C11F4C8C6; // 0x0D60(0x01A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_B03AD189471F3E6732A864908D764BD8; // 0x0F00(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_48CD69EA4F757D742A987DA7D428395C; // 0x0F48(0x0048)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_4E03BA7742A80A1643ED1A9E97A26300; // 0x0F90(0x02F0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_154270D847E87BE1C1C1E989AC71A3B5; // 0x1280(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7B3F85E14EA9627A8B62DEB8500A9E08; // 0x1350(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6C75C5E14BC2020D621C0393BCE4FB82; // 0x1398(0x0128)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_JungleMelee_AnimBP_AnimGraphNode_BlendListByInt_154270D847E87BE1C1C1E989AC71A3B5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_JungleMelee_AnimBP_AnimGraphNode_BlendSpacePlayer_6C75C5E14BC2020D621C0393BCE4FB82();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_JungleMelee_AnimBP_AnimGraphNode_BlendSpacePlayer_9E43F6C34EF975AB7A09448D89FB1229();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_JungleMelee_AnimBP_AnimGraphNode_LookAt_D47D07E349FC836BFDF3CB8C11F4C8C6();
	void ExecuteUbergraph_Minion_JungleMelee_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Minion_JungleMelee_AnimBP_C">();
	}
	static class UMinion_JungleMelee_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinion_JungleMelee_AnimBP_C>();
	}
};
static_assert(alignof(UMinion_JungleMelee_AnimBP_C) == 0x000010, "Wrong alignment on UMinion_JungleMelee_AnimBP_C");
static_assert(sizeof(UMinion_JungleMelee_AnimBP_C) == 0x0014C0, "Wrong size on UMinion_JungleMelee_AnimBP_C");
static_assert(offsetof(UMinion_JungleMelee_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'UMinion_JungleMelee_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinion_JungleMelee_AnimBP_C, AnimGraphNode_BlendSpacePlayer_9E43F6C34EF975AB7A09448D89FB1229) == 0x000C38, "Member 'UMinion_JungleMelee_AnimBP_C::AnimGraphNode_BlendSpacePlayer_9E43F6C34EF975AB7A09448D89FB1229' has a wrong offset!");
static_assert(offsetof(UMinion_JungleMelee_AnimBP_C, AnimGraphNode_LookAt_D47D07E349FC836BFDF3CB8C11F4C8C6) == 0x000D60, "Member 'UMinion_JungleMelee_AnimBP_C::AnimGraphNode_LookAt_D47D07E349FC836BFDF3CB8C11F4C8C6' has a wrong offset!");
static_assert(offsetof(UMinion_JungleMelee_AnimBP_C, AnimGraphNode_LocalToComponentSpace_B03AD189471F3E6732A864908D764BD8) == 0x000F00, "Member 'UMinion_JungleMelee_AnimBP_C::AnimGraphNode_LocalToComponentSpace_B03AD189471F3E6732A864908D764BD8' has a wrong offset!");
static_assert(offsetof(UMinion_JungleMelee_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_48CD69EA4F757D742A987DA7D428395C) == 0x000F48, "Member 'UMinion_JungleMelee_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_48CD69EA4F757D742A987DA7D428395C' has a wrong offset!");
static_assert(offsetof(UMinion_JungleMelee_AnimBP_C, OrionAnimGraphNode_MinionBehavior_4E03BA7742A80A1643ED1A9E97A26300) == 0x000F90, "Member 'UMinion_JungleMelee_AnimBP_C::OrionAnimGraphNode_MinionBehavior_4E03BA7742A80A1643ED1A9E97A26300' has a wrong offset!");
static_assert(offsetof(UMinion_JungleMelee_AnimBP_C, AnimGraphNode_BlendListByInt_154270D847E87BE1C1C1E989AC71A3B5) == 0x001280, "Member 'UMinion_JungleMelee_AnimBP_C::AnimGraphNode_BlendListByInt_154270D847E87BE1C1C1E989AC71A3B5' has a wrong offset!");
static_assert(offsetof(UMinion_JungleMelee_AnimBP_C, AnimGraphNode_Root_7B3F85E14EA9627A8B62DEB8500A9E08) == 0x001350, "Member 'UMinion_JungleMelee_AnimBP_C::AnimGraphNode_Root_7B3F85E14EA9627A8B62DEB8500A9E08' has a wrong offset!");
static_assert(offsetof(UMinion_JungleMelee_AnimBP_C, AnimGraphNode_BlendSpacePlayer_6C75C5E14BC2020D621C0393BCE4FB82) == 0x001398, "Member 'UMinion_JungleMelee_AnimBP_C::AnimGraphNode_BlendSpacePlayer_6C75C5E14BC2020D621C0393BCE4FB82' has a wrong offset!");

}

