#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Minion_Ranged_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Minion_Ranged_AnimBP.Minion_Ranged_AnimBP_C
// 0x0770 (0x13A0 - 0x0C30)
class UMinion_Ranged_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_395D9E174AA80B6395A6E1B8ED04DB02; // 0x0C38(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_22A53C3B47C9857EBD8E2F95E0997477; // 0x0C80(0x0128)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_5CD562694D2ED8BFDF2BDB9E9C22F4FB; // 0x0DA8(0x02F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6F817D004C336D8F71606794D799C4B4; // 0x1098(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_D03904604F493370647C6B9E9CF3787D; // 0x10E0(0x00D0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_889C96AF44AC1E04D5ECAF9AA63E1A47; // 0x11B0(0x01A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_606D972247045313743D2897D56435F8; // 0x1350(0x0048)()

public:
	void ExecuteUbergraph_Minion_Ranged_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Ranged_AnimBP_AnimGraphNode_BlendSpacePlayer_22A53C3B47C9857EBD8E2F95E0997477();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Ranged_AnimBP_AnimGraphNode_LookAt_889C96AF44AC1E04D5ECAF9AA63E1A47();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Minion_Ranged_AnimBP_C">();
	}
	static class UMinion_Ranged_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinion_Ranged_AnimBP_C>();
	}
};
static_assert(alignof(UMinion_Ranged_AnimBP_C) == 0x000010, "Wrong alignment on UMinion_Ranged_AnimBP_C");
static_assert(sizeof(UMinion_Ranged_AnimBP_C) == 0x0013A0, "Wrong size on UMinion_Ranged_AnimBP_C");
static_assert(offsetof(UMinion_Ranged_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'UMinion_Ranged_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinion_Ranged_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_395D9E174AA80B6395A6E1B8ED04DB02) == 0x000C38, "Member 'UMinion_Ranged_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_395D9E174AA80B6395A6E1B8ED04DB02' has a wrong offset!");
static_assert(offsetof(UMinion_Ranged_AnimBP_C, AnimGraphNode_BlendSpacePlayer_22A53C3B47C9857EBD8E2F95E0997477) == 0x000C80, "Member 'UMinion_Ranged_AnimBP_C::AnimGraphNode_BlendSpacePlayer_22A53C3B47C9857EBD8E2F95E0997477' has a wrong offset!");
static_assert(offsetof(UMinion_Ranged_AnimBP_C, OrionAnimGraphNode_MinionBehavior_5CD562694D2ED8BFDF2BDB9E9C22F4FB) == 0x000DA8, "Member 'UMinion_Ranged_AnimBP_C::OrionAnimGraphNode_MinionBehavior_5CD562694D2ED8BFDF2BDB9E9C22F4FB' has a wrong offset!");
static_assert(offsetof(UMinion_Ranged_AnimBP_C, AnimGraphNode_LocalToComponentSpace_6F817D004C336D8F71606794D799C4B4) == 0x001098, "Member 'UMinion_Ranged_AnimBP_C::AnimGraphNode_LocalToComponentSpace_6F817D004C336D8F71606794D799C4B4' has a wrong offset!");
static_assert(offsetof(UMinion_Ranged_AnimBP_C, AnimGraphNode_BlendListByInt_D03904604F493370647C6B9E9CF3787D) == 0x0010E0, "Member 'UMinion_Ranged_AnimBP_C::AnimGraphNode_BlendListByInt_D03904604F493370647C6B9E9CF3787D' has a wrong offset!");
static_assert(offsetof(UMinion_Ranged_AnimBP_C, AnimGraphNode_LookAt_889C96AF44AC1E04D5ECAF9AA63E1A47) == 0x0011B0, "Member 'UMinion_Ranged_AnimBP_C::AnimGraphNode_LookAt_889C96AF44AC1E04D5ECAF9AA63E1A47' has a wrong offset!");
static_assert(offsetof(UMinion_Ranged_AnimBP_C, AnimGraphNode_Root_606D972247045313743D2897D56435F8) == 0x001350, "Member 'UMinion_Ranged_AnimBP_C::AnimGraphNode_Root_606D972247045313743D2897D56435F8' has a wrong offset!");

}

