#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraShader

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct NiagaraShader.DIGPUBufferParamDescriptor
// 0x0028 (0x0028 - 0x0000)
struct FDIGPUBufferParamDescriptor final
{
public:
	class FString                                 BufferParamName;                                   // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SamplerParamName;                                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Index;                                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDIGPUBufferParamDescriptor) == 0x000008, "Wrong alignment on FDIGPUBufferParamDescriptor");
static_assert(sizeof(FDIGPUBufferParamDescriptor) == 0x000028, "Wrong size on FDIGPUBufferParamDescriptor");
static_assert(offsetof(FDIGPUBufferParamDescriptor, BufferParamName) == 0x000000, "Member 'FDIGPUBufferParamDescriptor::BufferParamName' has a wrong offset!");
static_assert(offsetof(FDIGPUBufferParamDescriptor, SamplerParamName) == 0x000010, "Member 'FDIGPUBufferParamDescriptor::SamplerParamName' has a wrong offset!");
static_assert(offsetof(FDIGPUBufferParamDescriptor, Index) == 0x000020, "Member 'FDIGPUBufferParamDescriptor::Index' has a wrong offset!");

// ScriptStruct NiagaraShader.DIBufferDescriptorStore
// 0x0018 (0x0018 - 0x0000)
struct FDIBufferDescriptorStore final
{
public:
	class FName                                   DataInterfaceName;                                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDIGPUBufferParamDescriptor>    Descriptors;                                       // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDIBufferDescriptorStore) == 0x000008, "Wrong alignment on FDIBufferDescriptorStore");
static_assert(sizeof(FDIBufferDescriptorStore) == 0x000018, "Wrong size on FDIBufferDescriptorStore");
static_assert(offsetof(FDIBufferDescriptorStore, DataInterfaceName) == 0x000000, "Member 'FDIBufferDescriptorStore::DataInterfaceName' has a wrong offset!");
static_assert(offsetof(FDIBufferDescriptorStore, Descriptors) == 0x000008, "Member 'FDIBufferDescriptorStore::Descriptors' has a wrong offset!");

}

