#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NotificationManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NotificationManager.NotificationManager_C
// 0x0018 (0x0218 - 0x0200)
class UNotificationManager_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0200(0x0008)(Transient, DuplicateTransient)
	class UOrionNotificationList*                 OrionNotificationList_0;                           // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsShowingNotifications;                            // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHandleRemoveBound;                               // 0x0211(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_NotificationManager(int32 EntryPoint);
	void Construct();
	void Construct_New_Notification(const struct FOrionNotification& Notification_Data);
	void Remove_Dead_Notification(const struct FOrionNotification& Notification);
	void Notification_Exit_Finished(class UNotification_C* Widget);
	void Set_Display_State(bool bCanShowNotifications);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NotificationManager_C">();
	}
	static class UNotificationManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNotificationManager_C>();
	}
};
static_assert(alignof(UNotificationManager_C) == 0x000008, "Wrong alignment on UNotificationManager_C");
static_assert(sizeof(UNotificationManager_C) == 0x000218, "Wrong size on UNotificationManager_C");
static_assert(offsetof(UNotificationManager_C, UberGraphFrame) == 0x000200, "Member 'UNotificationManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNotificationManager_C, OrionNotificationList_0) == 0x000208, "Member 'UNotificationManager_C::OrionNotificationList_0' has a wrong offset!");
static_assert(offsetof(UNotificationManager_C, IsShowingNotifications) == 0x000210, "Member 'UNotificationManager_C::IsShowingNotifications' has a wrong offset!");
static_assert(offsetof(UNotificationManager_C, IsHandleRemoveBound) == 0x000211, "Member 'UNotificationManager_C::IsHandleRemoveBound' has a wrong offset!");

}

