#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NVShieldTextPopup

#include "Basic.hpp"


namespace SDK::Params
{

// Function NVShieldTextPopup.NVShieldTextPopup_C.BndEvt__CancelButton_K2Node_ComponentBoundEvent_125_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct NVShieldTextPopup_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_125_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NVShieldTextPopup_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_125_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on NVShieldTextPopup_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_125_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(NVShieldTextPopup_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_125_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on NVShieldTextPopup_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_125_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(NVShieldTextPopup_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_125_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'NVShieldTextPopup_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_125_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function NVShieldTextPopup.NVShieldTextPopup_C.BndEvt__CommitButton_K2Node_ComponentBoundEvent_111_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct NVShieldTextPopup_C_BndEvt__CommitButton_K2Node_ComponentBoundEvent_111_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NVShieldTextPopup_C_BndEvt__CommitButton_K2Node_ComponentBoundEvent_111_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on NVShieldTextPopup_C_BndEvt__CommitButton_K2Node_ComponentBoundEvent_111_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(NVShieldTextPopup_C_BndEvt__CommitButton_K2Node_ComponentBoundEvent_111_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on NVShieldTextPopup_C_BndEvt__CommitButton_K2Node_ComponentBoundEvent_111_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(NVShieldTextPopup_C_BndEvt__CommitButton_K2Node_ComponentBoundEvent_111_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'NVShieldTextPopup_C_BndEvt__CommitButton_K2Node_ComponentBoundEvent_111_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function NVShieldTextPopup.NVShieldTextPopup_C.ExecuteUbergraph_NVShieldTextPopup
// 0x0018 (0x0018 - 0x0000)
struct NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button2;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup) == 0x000008, "Wrong alignment on NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup");
static_assert(sizeof(NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup) == 0x000018, "Wrong size on NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup");
static_assert(offsetof(NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup, EntryPoint) == 0x000000, "Member 'NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup, K2Node_ComponentBoundEvent_Button2) == 0x000008, "Member 'NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'NVShieldTextPopup_C_ExecuteUbergraph_NVShieldTextPopup::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

}

