#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemTencent

#include "Basic.hpp"


namespace SDK::Params
{

// Function OnlineSubsystemTencent.TssAntiComponent.ClientHandleDataFromServer
// 0x0010 (0x0010 - 0x0000)
struct TssAntiComponent_ClientHandleDataFromServer final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TssAntiComponent_ClientHandleDataFromServer) == 0x000008, "Wrong alignment on TssAntiComponent_ClientHandleDataFromServer");
static_assert(sizeof(TssAntiComponent_ClientHandleDataFromServer) == 0x000010, "Wrong size on TssAntiComponent_ClientHandleDataFromServer");
static_assert(offsetof(TssAntiComponent_ClientHandleDataFromServer, Data) == 0x000000, "Member 'TssAntiComponent_ClientHandleDataFromServer::Data' has a wrong offset!");

// Function OnlineSubsystemTencent.TssAntiComponent.ServerHandleDataFromClient
// 0x0010 (0x0010 - 0x0000)
struct TssAntiComponent_ServerHandleDataFromClient final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TssAntiComponent_ServerHandleDataFromClient) == 0x000008, "Wrong alignment on TssAntiComponent_ServerHandleDataFromClient");
static_assert(sizeof(TssAntiComponent_ServerHandleDataFromClient) == 0x000010, "Wrong size on TssAntiComponent_ServerHandleDataFromClient");
static_assert(offsetof(TssAntiComponent_ServerHandleDataFromClient, Data) == 0x000000, "Member 'TssAntiComponent_ServerHandleDataFromClient::Data' has a wrong offset!");

}

