#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pistol_Reticle_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Pistol_Reticle_Widget.Pistol_Reticle_Widget_C
// 0x0030 (0x0270 - 0x0240)
class UPistol_Reticle_Widget_C final : public UOrionUserWidget_Reticle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Targeting;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SuccessfulHit;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Circle;                                            // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HitX;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outline;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Pistol_Reticle_Widget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pistol_Reticle_Widget_C">();
	}
	static class UPistol_Reticle_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPistol_Reticle_Widget_C>();
	}
};
static_assert(alignof(UPistol_Reticle_Widget_C) == 0x000008, "Wrong alignment on UPistol_Reticle_Widget_C");
static_assert(sizeof(UPistol_Reticle_Widget_C) == 0x000270, "Wrong size on UPistol_Reticle_Widget_C");
static_assert(offsetof(UPistol_Reticle_Widget_C, UberGraphFrame) == 0x000240, "Member 'UPistol_Reticle_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPistol_Reticle_Widget_C, Targeting) == 0x000248, "Member 'UPistol_Reticle_Widget_C::Targeting' has a wrong offset!");
static_assert(offsetof(UPistol_Reticle_Widget_C, SuccessfulHit) == 0x000250, "Member 'UPistol_Reticle_Widget_C::SuccessfulHit' has a wrong offset!");
static_assert(offsetof(UPistol_Reticle_Widget_C, Circle) == 0x000258, "Member 'UPistol_Reticle_Widget_C::Circle' has a wrong offset!");
static_assert(offsetof(UPistol_Reticle_Widget_C, HitX) == 0x000260, "Member 'UPistol_Reticle_Widget_C::HitX' has a wrong offset!");
static_assert(offsetof(UPistol_Reticle_Widget_C, Outline) == 0x000268, "Member 'UPistol_Reticle_Widget_C::Outline' has a wrong offset!");

}

