#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_Kill_Player_R

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Player_Kill_Player_R.Player_Kill_Player_R_C.ExecuteUbergraph_Player_Kill_Player_R
// 0x0014 (0x0014 - 0x0000)
struct Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R) == 0x000004, "Wrong alignment on Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R");
static_assert(sizeof(Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R) == 0x000014, "Wrong size on Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R");
static_assert(offsetof(Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R, EntryPoint) == 0x000000, "Member 'Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R::EntryPoint' has a wrong offset!");
static_assert(offsetof(Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000004, "Member 'Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R, CallFunc_BreakVector2D_X) == 0x000008, "Member 'Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'Player_Kill_Player_R_C_ExecuteUbergraph_Player_Kill_Player_R::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function Player_Kill_Player_R.Player_Kill_Player_R_C.Setup Widget
// 0x0058 (0x0058 - 0x0000)
struct Player_Kill_Player_R_C_Setup_Widget final
{
public:
	class FText                                   New_Player_Name;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           New_Outline_Color;                                 // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 New_Hero_Icon;                                     // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Show_Red;                                          // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Player_Kill_Player_R_C_Setup_Widget) == 0x000008, "Wrong alignment on Player_Kill_Player_R_C_Setup_Widget");
static_assert(sizeof(Player_Kill_Player_R_C_Setup_Widget) == 0x000058, "Wrong size on Player_Kill_Player_R_C_Setup_Widget");
static_assert(offsetof(Player_Kill_Player_R_C_Setup_Widget, New_Player_Name) == 0x000000, "Member 'Player_Kill_Player_R_C_Setup_Widget::New_Player_Name' has a wrong offset!");
static_assert(offsetof(Player_Kill_Player_R_C_Setup_Widget, New_Outline_Color) == 0x000018, "Member 'Player_Kill_Player_R_C_Setup_Widget::New_Outline_Color' has a wrong offset!");
static_assert(offsetof(Player_Kill_Player_R_C_Setup_Widget, New_Hero_Icon) == 0x000028, "Member 'Player_Kill_Player_R_C_Setup_Widget::New_Hero_Icon' has a wrong offset!");
static_assert(offsetof(Player_Kill_Player_R_C_Setup_Widget, Show_Red) == 0x000050, "Member 'Player_Kill_Player_R_C_Setup_Widget::Show_Red' has a wrong offset!");
static_assert(offsetof(Player_Kill_Player_R_C_Setup_Widget, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000051, "Member 'Player_Kill_Player_R_C_Setup_Widget::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

}

