#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_Kill_Player_Widget_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Player_Kill_Player_Widget_Template.Player_Kill_Player_Widget_Template_C
// 0x0028 (0x0318 - 0x02F0)
class UPlayer_Kill_Player_Widget_Template_C final : public UOrionUserWidget_GameEventMessage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       ScaleInOut;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCentral_message_Widget_C*              Central_message_Widget;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayer_Kill_Player_R_C*                Player_Kill_Player_L;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayer_Kill_Player_R_C*                Player_Kill_Player_R;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Player_Kill_Player_Widget_Template(int32 EntryPoint);
	void Construct();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_Kill_Player_Widget_Template_C">();
	}
	static class UPlayer_Kill_Player_Widget_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_Kill_Player_Widget_Template_C>();
	}
};
static_assert(alignof(UPlayer_Kill_Player_Widget_Template_C) == 0x000008, "Wrong alignment on UPlayer_Kill_Player_Widget_Template_C");
static_assert(sizeof(UPlayer_Kill_Player_Widget_Template_C) == 0x000318, "Wrong size on UPlayer_Kill_Player_Widget_Template_C");
static_assert(offsetof(UPlayer_Kill_Player_Widget_Template_C, UberGraphFrame) == 0x0002F0, "Member 'UPlayer_Kill_Player_Widget_Template_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_Widget_Template_C, ScaleInOut) == 0x0002F8, "Member 'UPlayer_Kill_Player_Widget_Template_C::ScaleInOut' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_Widget_Template_C, Central_message_Widget) == 0x000300, "Member 'UPlayer_Kill_Player_Widget_Template_C::Central_message_Widget' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_Widget_Template_C, Player_Kill_Player_L) == 0x000308, "Member 'UPlayer_Kill_Player_Widget_Template_C::Player_Kill_Player_L' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_Widget_Template_C, Player_Kill_Player_R) == 0x000310, "Member 'UPlayer_Kill_Player_Widget_Template_C::Player_Kill_Player_R' has a wrong offset!");

}

