#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prime_Helix_Killed

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Prime_Helix_Killed.Prime_Helix_Killed_C.ExecuteUbergraph_Prime_Helix_Killed
// 0x0038 (0x0038 - 0x0000)
struct Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetMyTeam_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CompareTeams_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0014(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue2;                 // 0x0024(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed) == 0x000008, "Wrong alignment on Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed");
static_assert(sizeof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed) == 0x000038, "Wrong size on Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed");
static_assert(offsetof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed, EntryPoint) == 0x000000, "Member 'Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed, CallFunc_GetMyTeam_ReturnValue) == 0x000004, "Member 'Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed::CallFunc_GetMyTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed, K2Node_Event_Animation) == 0x000008, "Member 'Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed, CallFunc_CompareTeams_ReturnValue) == 0x000011, "Member 'Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed, CallFunc_SelectColor_ReturnValue) == 0x000014, "Member 'Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed, CallFunc_SelectColor_ReturnValue2) == 0x000024, "Member 'Prime_Helix_Killed_C_ExecuteUbergraph_Prime_Helix_Killed::CallFunc_SelectColor_ReturnValue2' has a wrong offset!");

// Function Prime_Helix_Killed.Prime_Helix_Killed_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct Prime_Helix_Killed_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prime_Helix_Killed_C_OnAnimationFinished) == 0x000008, "Wrong alignment on Prime_Helix_Killed_C_OnAnimationFinished");
static_assert(sizeof(Prime_Helix_Killed_C_OnAnimationFinished) == 0x000008, "Wrong size on Prime_Helix_Killed_C_OnAnimationFinished");
static_assert(offsetof(Prime_Helix_Killed_C_OnAnimationFinished, Animation) == 0x000000, "Member 'Prime_Helix_Killed_C_OnAnimationFinished::Animation' has a wrong offset!");

}

