#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prime_Helix_Killed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Prime_Helix_Killed.Prime_Helix_Killed_C
// 0x0068 (0x0358 - 0x02F0)
class UPrime_Helix_Killed_C final : public UOrionUserWidget_GameEventMessage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       ScaleInOut;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCentral_message_Widget_C*              Central_message_Widget;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayer_Kill_Player_R_C*                Player_Kill_Player_L;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayer_Kill_Player_R_C*                Player_Kill_Prime_Helix_R;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PrimeHelixName;                                    // 0x0318(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UObject>                 PrimeHelixImage;                                   // 0x0330(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prime_Helix_Killed(int32 EntryPoint);
	void Construct();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prime_Helix_Killed_C">();
	}
	static class UPrime_Helix_Killed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrime_Helix_Killed_C>();
	}
};
static_assert(alignof(UPrime_Helix_Killed_C) == 0x000008, "Wrong alignment on UPrime_Helix_Killed_C");
static_assert(sizeof(UPrime_Helix_Killed_C) == 0x000358, "Wrong size on UPrime_Helix_Killed_C");
static_assert(offsetof(UPrime_Helix_Killed_C, UberGraphFrame) == 0x0002F0, "Member 'UPrime_Helix_Killed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPrime_Helix_Killed_C, ScaleInOut) == 0x0002F8, "Member 'UPrime_Helix_Killed_C::ScaleInOut' has a wrong offset!");
static_assert(offsetof(UPrime_Helix_Killed_C, Central_message_Widget) == 0x000300, "Member 'UPrime_Helix_Killed_C::Central_message_Widget' has a wrong offset!");
static_assert(offsetof(UPrime_Helix_Killed_C, Player_Kill_Player_L) == 0x000308, "Member 'UPrime_Helix_Killed_C::Player_Kill_Player_L' has a wrong offset!");
static_assert(offsetof(UPrime_Helix_Killed_C, Player_Kill_Prime_Helix_R) == 0x000310, "Member 'UPrime_Helix_Killed_C::Player_Kill_Prime_Helix_R' has a wrong offset!");
static_assert(offsetof(UPrime_Helix_Killed_C, PrimeHelixName) == 0x000318, "Member 'UPrime_Helix_Killed_C::PrimeHelixName' has a wrong offset!");
static_assert(offsetof(UPrime_Helix_Killed_C, PrimeHelixImage) == 0x000330, "Member 'UPrime_Helix_Killed_C::PrimeHelixImage' has a wrong offset!");

}

