#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Gem_Multishot_SideBolt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Item_Projectile_Global_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_Gem_Multishot_SideBolt.Proj_Gem_Multishot_SideBolt_C
// 0x0020 (0x0730 - 0x0710)
class AProj_Gem_Multishot_SideBolt_C final : public ABP_Item_Projectile_Global_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(Transient, DuplicateTransient)
	struct FVector                                ProjectileOrigin;                                  // 0x0718(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_724[0x4];                                      // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        BulletTrailParticleSystem;                         // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_Gem_Multishot_SideBolt(int32 EntryPoint);
	void OnShutdown();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_Gem_Multishot_SideBolt_C">();
	}
	static class AProj_Gem_Multishot_SideBolt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_Gem_Multishot_SideBolt_C>();
	}
};
static_assert(alignof(AProj_Gem_Multishot_SideBolt_C) == 0x000008, "Wrong alignment on AProj_Gem_Multishot_SideBolt_C");
static_assert(sizeof(AProj_Gem_Multishot_SideBolt_C) == 0x000730, "Wrong size on AProj_Gem_Multishot_SideBolt_C");
static_assert(offsetof(AProj_Gem_Multishot_SideBolt_C, UberGraphFrame) == 0x000710, "Member 'AProj_Gem_Multishot_SideBolt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProj_Gem_Multishot_SideBolt_C, ProjectileOrigin) == 0x000718, "Member 'AProj_Gem_Multishot_SideBolt_C::ProjectileOrigin' has a wrong offset!");
static_assert(offsetof(AProj_Gem_Multishot_SideBolt_C, BulletTrailParticleSystem) == 0x000728, "Member 'AProj_Gem_Multishot_SideBolt_C::BulletTrailParticleSystem' has a wrong offset!");

}

