#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionUI_structs.hpp"
#include "OrionUI_classes.hpp"
#include "OrionGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RewardWidget.RewardWidget_C
// 0x0140 (0x04D0 - 0x0390)
class URewardWidget_C final : public UOrionRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fanfare_and_Widget_Collapse;                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FanfareMinusStaysOn;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       TempFlashAnimation;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PostMatch_Summary;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fanfare2complete;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BonusQuestComplete;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LevelProgressFanfare;                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Generic_FadeIn;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Generic_FadeOut;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FanFareMinusIn;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FanFareMinusOut;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       DimMinusNormal;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NormalMinusActive;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ActiveMinusDim;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnHover;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderAll;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderContainer;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderRarity_BorderGlow;                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Backing;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dim;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FanFare_Backing;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FanFare_Front;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GemBacking;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HoverBrighten;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HoverOutline;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Outline;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rarity_Backing;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rarity_Effect;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rarity_Glow;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rarity_Outline;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Today_Callout;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageAvailabilityIcon;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSelectionOverlay;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Normal_Outline;                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayToday_Callout;                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherRewardType;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             TopRight;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Active;                                         // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EOrionRewardWidgetState                       PreviousState;                                     // 0x04C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Card_Progress;                                // 0x04CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_RewardWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnVaultFlourish();
	void OnVaultFlash(int32 RoundsRemaining);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnActiveStateSet(EOrionRewardWidgetState State);
	void OnDataSet(EOrionItemRarity ItemRarity, EOrionItemType ItemType);
	void Fanfare_Out();
	void Fanfare_In();
	void Generic_Fadout();
	void Generic_FadeIn_0();
	void Postgame_Fanfare();
	void Default_Complete();
	void Bonus_Quest_Complete();
	void FanfareMinusToMinusComplete();
	void PostGame_Summary();
	void Fanfare_Remain_Visible();
	void Fanfare_Collapse();
	void Get_Type_Switcher_Index(EOrionItemType Type, int32* Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RewardWidget_C">();
	}
	static class URewardWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardWidget_C>();
	}
};
static_assert(alignof(URewardWidget_C) == 0x000008, "Wrong alignment on URewardWidget_C");
static_assert(sizeof(URewardWidget_C) == 0x0004D0, "Wrong size on URewardWidget_C");
static_assert(offsetof(URewardWidget_C, UberGraphFrame) == 0x000390, "Member 'URewardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Fanfare_and_Widget_Collapse) == 0x000398, "Member 'URewardWidget_C::Fanfare_and_Widget_Collapse' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, FanfareMinusStaysOn) == 0x0003A0, "Member 'URewardWidget_C::FanfareMinusStaysOn' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, TempFlashAnimation) == 0x0003A8, "Member 'URewardWidget_C::TempFlashAnimation' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, PostMatch_Summary) == 0x0003B0, "Member 'URewardWidget_C::PostMatch_Summary' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Fanfare2complete) == 0x0003B8, "Member 'URewardWidget_C::Fanfare2complete' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, BonusQuestComplete) == 0x0003C0, "Member 'URewardWidget_C::BonusQuestComplete' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, LevelProgressFanfare) == 0x0003C8, "Member 'URewardWidget_C::LevelProgressFanfare' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Generic_FadeIn) == 0x0003D0, "Member 'URewardWidget_C::Generic_FadeIn' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Generic_FadeOut) == 0x0003D8, "Member 'URewardWidget_C::Generic_FadeOut' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, FanFareMinusIn) == 0x0003E0, "Member 'URewardWidget_C::FanFareMinusIn' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, FanFareMinusOut) == 0x0003E8, "Member 'URewardWidget_C::FanFareMinusOut' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, DimMinusNormal) == 0x0003F0, "Member 'URewardWidget_C::DimMinusNormal' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, NormalMinusActive) == 0x0003F8, "Member 'URewardWidget_C::NormalMinusActive' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, ActiveMinusDim) == 0x000400, "Member 'URewardWidget_C::ActiveMinusDim' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, UnHover) == 0x000408, "Member 'URewardWidget_C::UnHover' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Hover) == 0x000410, "Member 'URewardWidget_C::Hover' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, BorderAll) == 0x000418, "Member 'URewardWidget_C::BorderAll' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, BorderContainer) == 0x000420, "Member 'URewardWidget_C::BorderContainer' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, BorderRarity_BorderGlow) == 0x000428, "Member 'URewardWidget_C::BorderRarity_BorderGlow' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_Backing) == 0x000430, "Member 'URewardWidget_C::Image_Backing' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_Dim) == 0x000438, "Member 'URewardWidget_C::Image_Dim' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_FanFare_Backing) == 0x000440, "Member 'URewardWidget_C::Image_FanFare_Backing' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_FanFare_Front) == 0x000448, "Member 'URewardWidget_C::Image_FanFare_Front' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_GemBacking) == 0x000450, "Member 'URewardWidget_C::Image_GemBacking' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_HoverBrighten) == 0x000458, "Member 'URewardWidget_C::Image_HoverBrighten' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_HoverOutline) == 0x000460, "Member 'URewardWidget_C::Image_HoverOutline' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_Outline) == 0x000468, "Member 'URewardWidget_C::Image_Outline' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_Rarity_Backing) == 0x000470, "Member 'URewardWidget_C::Image_Rarity_Backing' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_Rarity_Effect) == 0x000478, "Member 'URewardWidget_C::Image_Rarity_Effect' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_Rarity_Glow) == 0x000480, "Member 'URewardWidget_C::Image_Rarity_Glow' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_Rarity_Outline) == 0x000488, "Member 'URewardWidget_C::Image_Rarity_Outline' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_Today_Callout) == 0x000490, "Member 'URewardWidget_C::Image_Today_Callout' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, ImageAvailabilityIcon) == 0x000498, "Member 'URewardWidget_C::ImageAvailabilityIcon' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, ImageSelectionOverlay) == 0x0004A0, "Member 'URewardWidget_C::ImageSelectionOverlay' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Overlay_Normal_Outline) == 0x0004A8, "Member 'URewardWidget_C::Overlay_Normal_Outline' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, OverlayToday_Callout) == 0x0004B0, "Member 'URewardWidget_C::OverlayToday_Callout' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, SwitcherRewardType) == 0x0004B8, "Member 'URewardWidget_C::SwitcherRewardType' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, TopRight) == 0x0004C0, "Member 'URewardWidget_C::TopRight' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Is_Active) == 0x0004C8, "Member 'URewardWidget_C::Is_Active' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, PreviousState) == 0x0004C9, "Member 'URewardWidget_C::PreviousState' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Show_Card_Progress) == 0x0004CA, "Member 'URewardWidget_C::Show_Card_Progress' has a wrong offset!");

}

