#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardTooltip_Item

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function RewardTooltip_Item.RewardTooltip_Item_C.ExecuteUbergraph_RewardTooltip_Item
// 0x0098 (0x0098 - 0x0000)
struct RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionItemRarity                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x0018(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable3;                             // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable4;                             // 0x0038(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable5;                             // 0x0048(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionItemRarity                              K2Node_Event_ItemRarity;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x005C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0070(0x0028)()
};
static_assert(alignof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item) == 0x000008, "Wrong alignment on RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item");
static_assert(sizeof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item) == 0x000098, "Wrong size on RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, EntryPoint) == 0x000000, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, Temp_byte_Variable) == 0x000004, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, Temp_struct_Variable) == 0x000008, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, Temp_struct_Variable2) == 0x000018, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, Temp_struct_Variable3) == 0x000028, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, Temp_struct_Variable4) == 0x000038, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, Temp_struct_Variable5) == 0x000048, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, K2Node_Event_ItemRarity) == 0x000058, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::K2Node_Event_ItemRarity' has a wrong offset!");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, K2Node_Select_Default) == 0x00005C, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item, K2Node_MakeStruct_SlateColor) == 0x000070, "Member 'RewardTooltip_Item_C_ExecuteUbergraph_RewardTooltip_Item::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function RewardTooltip_Item.RewardTooltip_Item_C.OnDataSet
// 0x0001 (0x0001 - 0x0000)
struct RewardTooltip_Item_C_OnDataSet final
{
public:
	EOrionItemRarity                              ItemRarity;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardTooltip_Item_C_OnDataSet) == 0x000001, "Wrong alignment on RewardTooltip_Item_C_OnDataSet");
static_assert(sizeof(RewardTooltip_Item_C_OnDataSet) == 0x000001, "Wrong size on RewardTooltip_Item_C_OnDataSet");
static_assert(offsetof(RewardTooltip_Item_C_OnDataSet, ItemRarity) == 0x000000, "Member 'RewardTooltip_Item_C_OnDataSet::ItemRarity' has a wrong offset!");

}

