#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Social

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct Social.SocialListStyle
// 0x2500 (0x2500 - 0x0000)
struct FSocialListStyle final
{
public:
	struct FButtonStyle                           GlobalChatButtonStyle;                             // 0x0000(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            GlobalChatIcon;                                    // 0x0238(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendItemButtonStyle;                             // 0x02B0(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ConfirmButtonStyle;                                // 0x04E8(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           CancelButtonStyle;                                 // 0x0720(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonContentColor;                                // 0x0958(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverContentColor;                           // 0x0980(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActionMenuArrowBrush;                              // 0x09A8(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActionMenuArrowRightBrush;                         // 0x0A20(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ActionMenuBackgroundColor;                         // 0x0A98(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ToolTipArrowBrush;                                 // 0x0AC0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           BackButtonStyle;                                   // 0x0B38(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           HeaderButtonStyle;                                 // 0x0D70(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendListActionButtonStyle;                       // 0x0FA8(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AddFriendButtonContentBrush;                       // 0x11E0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StatusIconBrush;                                   // 0x1258(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PCIconBrush;                                       // 0x12D0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ConsoleIconBrush;                                  // 0x1348(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EpicIconBrush;                                     // 0x13C0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendImageBrush;                                  // 0x1438(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OfflineBrush;                                      // 0x14B0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OnlineBrush;                                       // 0x1528(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AwayBrush;                                         // 0x15A0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SpectateBrush;                                     // 0x1618(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsContainerBackground;                        // 0x1690(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsListBackground;                             // 0x1708(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  AddFriendEditableTextStyle;                        // 0x1780(0x0728)(Edit, NativeAccessSpecifierPublic)
	struct FVector2D                              UserPresenceImageSize;                             // 0x1EA8(0x0008)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackBrush;                                         // 0x1EB0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SelectedOptionBrush;                               // 0x1F28(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SettingsBrush;                                     // 0x1FA0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x2018(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PresenceSeperatorBrush;                            // 0x2090(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FontSizeBrush;                                     // 0x2108(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SearchBrush;                                       // 0x2180(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                BackButtonMargin;                                  // 0x21F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonMargin;                                // 0x2208(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListMargin;                                 // 0x2218(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                BackButtonContentMargin;                           // 0x2228(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListNoFriendsMargin;                        // 0x2238(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderMargin;                           // 0x2248(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderCountMargin;                      // 0x2258(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonContentMargin;                         // 0x2268(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemMargin;                                  // 0x2278(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemStatusMargin;                            // 0x2288(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipStatusMargin;                             // 0x2298(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPresenceMargin;                          // 0x22A8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPlatformMargin;                          // 0x22B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemTextScrollerMargin;                      // 0x22C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationBorderMargin;                          // 0x22D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonMargin;                          // 0x22E8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonContentMargin;                   // 0x22F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                NoneFriendContentMargin;                           // 0x2308(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         NoneFriendContentHeight;                           // 0x2318(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoneFriendIconWidth;                               // 0x231C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackIconMargin;                             // 0x2320(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuPageIconMargin;                             // 0x2330(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                RadioSettingTitleMargin;                           // 0x2340(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchIconMargin;                           // 0x2350(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchTextMargin;                           // 0x2360(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackButtonMargin;                           // 0x2370(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSettingButtonMargin;                        // 0x2380(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuListMargin;                                 // 0x2390(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SubMenuSeperatorThickness;                         // 0x23A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PresenceSeperatorThickness;                        // 0x23A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipMargin;                                   // 0x23A8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipPresenceMargin;                           // 0x23B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipSeperatorMargin;                          // 0x23C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ToolTipMargin;                                     // 0x23D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TipStatusMargin;                                   // 0x23E8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                AddButtonMargin;                                   // 0x23F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              AddButtonSpacing;                                  // 0x2408(0x0008)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ClanDetailsBrush;                                  // 0x2410(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ClanMembersBrush;                                  // 0x2488(0x0078)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSocialListStyle) == 0x000008, "Wrong alignment on FSocialListStyle");
static_assert(sizeof(FSocialListStyle) == 0x002500, "Wrong size on FSocialListStyle");
static_assert(offsetof(FSocialListStyle, GlobalChatButtonStyle) == 0x000000, "Member 'FSocialListStyle::GlobalChatButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, GlobalChatIcon) == 0x000238, "Member 'FSocialListStyle::GlobalChatIcon' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendItemButtonStyle) == 0x0002B0, "Member 'FSocialListStyle::FriendItemButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ConfirmButtonStyle) == 0x0004E8, "Member 'FSocialListStyle::ConfirmButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, CancelButtonStyle) == 0x000720, "Member 'FSocialListStyle::CancelButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ButtonContentColor) == 0x000958, "Member 'FSocialListStyle::ButtonContentColor' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ButtonHoverContentColor) == 0x000980, "Member 'FSocialListStyle::ButtonHoverContentColor' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ActionMenuArrowBrush) == 0x0009A8, "Member 'FSocialListStyle::ActionMenuArrowBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ActionMenuArrowRightBrush) == 0x000A20, "Member 'FSocialListStyle::ActionMenuArrowRightBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ActionMenuBackgroundColor) == 0x000A98, "Member 'FSocialListStyle::ActionMenuBackgroundColor' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ToolTipArrowBrush) == 0x000AC0, "Member 'FSocialListStyle::ToolTipArrowBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, BackButtonStyle) == 0x000B38, "Member 'FSocialListStyle::BackButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, HeaderButtonStyle) == 0x000D70, "Member 'FSocialListStyle::HeaderButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendListActionButtonStyle) == 0x000FA8, "Member 'FSocialListStyle::FriendListActionButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, AddFriendButtonContentBrush) == 0x0011E0, "Member 'FSocialListStyle::AddFriendButtonContentBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, StatusIconBrush) == 0x001258, "Member 'FSocialListStyle::StatusIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, PCIconBrush) == 0x0012D0, "Member 'FSocialListStyle::PCIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ConsoleIconBrush) == 0x001348, "Member 'FSocialListStyle::ConsoleIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, EpicIconBrush) == 0x0013C0, "Member 'FSocialListStyle::EpicIconBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendImageBrush) == 0x001438, "Member 'FSocialListStyle::FriendImageBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, OfflineBrush) == 0x0014B0, "Member 'FSocialListStyle::OfflineBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, OnlineBrush) == 0x001528, "Member 'FSocialListStyle::OnlineBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, AwayBrush) == 0x0015A0, "Member 'FSocialListStyle::AwayBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SpectateBrush) == 0x001618, "Member 'FSocialListStyle::SpectateBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendsContainerBackground) == 0x001690, "Member 'FSocialListStyle::FriendsContainerBackground' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendsListBackground) == 0x001708, "Member 'FSocialListStyle::FriendsListBackground' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, AddFriendEditableTextStyle) == 0x001780, "Member 'FSocialListStyle::AddFriendEditableTextStyle' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, UserPresenceImageSize) == 0x001EA8, "Member 'FSocialListStyle::UserPresenceImageSize' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, BackBrush) == 0x001EB0, "Member 'FSocialListStyle::BackBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SelectedOptionBrush) == 0x001F28, "Member 'FSocialListStyle::SelectedOptionBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SettingsBrush) == 0x001FA0, "Member 'FSocialListStyle::SettingsBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SeperatorBrush) == 0x002018, "Member 'FSocialListStyle::SeperatorBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, PresenceSeperatorBrush) == 0x002090, "Member 'FSocialListStyle::PresenceSeperatorBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FontSizeBrush) == 0x002108, "Member 'FSocialListStyle::FontSizeBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SearchBrush) == 0x002180, "Member 'FSocialListStyle::SearchBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, BackButtonMargin) == 0x0021F8, "Member 'FSocialListStyle::BackButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, HeaderButtonMargin) == 0x002208, "Member 'FSocialListStyle::HeaderButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendsListMargin) == 0x002218, "Member 'FSocialListStyle::FriendsListMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, BackButtonContentMargin) == 0x002228, "Member 'FSocialListStyle::BackButtonContentMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendsListNoFriendsMargin) == 0x002238, "Member 'FSocialListStyle::FriendsListNoFriendsMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendsListHeaderMargin) == 0x002248, "Member 'FSocialListStyle::FriendsListHeaderMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendsListHeaderCountMargin) == 0x002258, "Member 'FSocialListStyle::FriendsListHeaderCountMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, HeaderButtonContentMargin) == 0x002268, "Member 'FSocialListStyle::HeaderButtonContentMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendItemMargin) == 0x002278, "Member 'FSocialListStyle::FriendItemMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendItemStatusMargin) == 0x002288, "Member 'FSocialListStyle::FriendItemStatusMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendTipStatusMargin) == 0x002298, "Member 'FSocialListStyle::FriendTipStatusMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendItemPresenceMargin) == 0x0022A8, "Member 'FSocialListStyle::FriendItemPresenceMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendItemPlatformMargin) == 0x0022B8, "Member 'FSocialListStyle::FriendItemPlatformMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendItemTextScrollerMargin) == 0x0022C8, "Member 'FSocialListStyle::FriendItemTextScrollerMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ConfirmationBorderMargin) == 0x0022D8, "Member 'FSocialListStyle::ConfirmationBorderMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ConfirmationButtonMargin) == 0x0022E8, "Member 'FSocialListStyle::ConfirmationButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ConfirmationButtonContentMargin) == 0x0022F8, "Member 'FSocialListStyle::ConfirmationButtonContentMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, NoneFriendContentMargin) == 0x002308, "Member 'FSocialListStyle::NoneFriendContentMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, NoneFriendContentHeight) == 0x002318, "Member 'FSocialListStyle::NoneFriendContentHeight' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, NoneFriendIconWidth) == 0x00231C, "Member 'FSocialListStyle::NoneFriendIconWidth' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SubMenuBackIconMargin) == 0x002320, "Member 'FSocialListStyle::SubMenuBackIconMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SubMenuPageIconMargin) == 0x002330, "Member 'FSocialListStyle::SubMenuPageIconMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, RadioSettingTitleMargin) == 0x002340, "Member 'FSocialListStyle::RadioSettingTitleMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SubMenuSearchIconMargin) == 0x002350, "Member 'FSocialListStyle::SubMenuSearchIconMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SubMenuSearchTextMargin) == 0x002360, "Member 'FSocialListStyle::SubMenuSearchTextMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SubMenuBackButtonMargin) == 0x002370, "Member 'FSocialListStyle::SubMenuBackButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SubMenuSettingButtonMargin) == 0x002380, "Member 'FSocialListStyle::SubMenuSettingButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SubMenuListMargin) == 0x002390, "Member 'FSocialListStyle::SubMenuListMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, SubMenuSeperatorThickness) == 0x0023A0, "Member 'FSocialListStyle::SubMenuSeperatorThickness' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, PresenceSeperatorThickness) == 0x0023A4, "Member 'FSocialListStyle::PresenceSeperatorThickness' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendTipMargin) == 0x0023A8, "Member 'FSocialListStyle::FriendTipMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendTipPresenceMargin) == 0x0023B8, "Member 'FSocialListStyle::FriendTipPresenceMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, FriendTipSeperatorMargin) == 0x0023C8, "Member 'FSocialListStyle::FriendTipSeperatorMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ToolTipMargin) == 0x0023D8, "Member 'FSocialListStyle::ToolTipMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, TipStatusMargin) == 0x0023E8, "Member 'FSocialListStyle::TipStatusMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, AddButtonMargin) == 0x0023F8, "Member 'FSocialListStyle::AddButtonMargin' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, AddButtonSpacing) == 0x002408, "Member 'FSocialListStyle::AddButtonSpacing' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ClanDetailsBrush) == 0x002410, "Member 'FSocialListStyle::ClanDetailsBrush' has a wrong offset!");
static_assert(offsetof(FSocialListStyle, ClanMembersBrush) == 0x002488, "Member 'FSocialListStyle::ClanMembersBrush' has a wrong offset!");

// ScriptStruct Social.SocialFontStyle
// 0x0240 (0x0240 - 0x0000)
struct FSocialFontStyle final
{
public:
	struct FSlateFontInfo                         FontSmall;                                         // 0x0000(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontSmallBold;                                     // 0x0058(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormal;                                        // 0x00B0(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormalBold;                                    // 0x0108(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLarge;                                         // 0x0160(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLargeBold;                                     // 0x01B8(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultFontColor;                                  // 0x0210(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InvertedFontColor;                                 // 0x0220(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultDullFontColor;                              // 0x0230(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSocialFontStyle) == 0x000008, "Wrong alignment on FSocialFontStyle");
static_assert(sizeof(FSocialFontStyle) == 0x000240, "Wrong size on FSocialFontStyle");
static_assert(offsetof(FSocialFontStyle, FontSmall) == 0x000000, "Member 'FSocialFontStyle::FontSmall' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontSmallBold) == 0x000058, "Member 'FSocialFontStyle::FontSmallBold' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontNormal) == 0x0000B0, "Member 'FSocialFontStyle::FontNormal' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontNormalBold) == 0x000108, "Member 'FSocialFontStyle::FontNormalBold' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontLarge) == 0x000160, "Member 'FSocialFontStyle::FontLarge' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, FontLargeBold) == 0x0001B8, "Member 'FSocialFontStyle::FontLargeBold' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, DefaultFontColor) == 0x000210, "Member 'FSocialFontStyle::DefaultFontColor' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, InvertedFontColor) == 0x000220, "Member 'FSocialFontStyle::InvertedFontColor' has a wrong offset!");
static_assert(offsetof(FSocialFontStyle, DefaultDullFontColor) == 0x000230, "Member 'FSocialFontStyle::DefaultDullFontColor' has a wrong offset!");

// ScriptStruct Social.ChatStyle
// 0x1630 (0x1630 - 0x0000)
struct FChatStyle final
{
public:
	struct FTextBlockStyle                        TextStyle;                                         // 0x0000(0x01C8)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        TimeStampTextStyle;                                // 0x01C8(0x01C8)(Edit, NativeAccessSpecifierPublic)
	struct FLinearColor                           TimeStampColor;                                    // 0x0390(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultChatColor;                                  // 0x03A0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperChatColor;                                  // 0x03B0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalChatColor;                                   // 0x03C0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameChatColor;                                     // 0x03D0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamChatColor;                                     // 0x03E0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyChatColor;                                    // 0x03F0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AdminChatColor;                                    // 0x0400(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameAdminChatColor;                                // 0x0410(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AddedItemChatColor;                                // 0x0420(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CompletedItemChatColor;                            // 0x0430(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DiscardedItemChatColor;                            // 0x0440(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperHyperlinkChatColor;                         // 0x0450(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalHyperlinkChatColor;                          // 0x0460(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameHyperlinkChatColor;                            // 0x0470(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamHyperlinkChatColor;                            // 0x0480(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyHyperlinkChatColor;                           // 0x0490(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EnemyColor;                                        // 0x04A0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FriendlyColor;                                     // 0x04B0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  ChatEntryTextStyle;                                // 0x04C0(0x0728)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  ChatDisplayTextStyle;                              // 0x0BE8(0x0728)(Edit, NativeAccessSpecifierPublic)
	struct FScrollBoxStyle                        ScrollBorderStyle;                                 // 0x1310(0x01E8)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MessageNotificationBrush;                          // 0x14F8(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatEntryPadding;                                  // 0x1570(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ChatEntryHeight;                                   // 0x1580(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1584[0x4];                                     // 0x1584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ChatMenuBackgroundBrush;                           // 0x1588(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionPadding;                               // 0x1600(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionHeaderPadding;                         // 0x1610(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionStatusMargin;                          // 0x1620(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatStyle) == 0x000008, "Wrong alignment on FChatStyle");
static_assert(sizeof(FChatStyle) == 0x001630, "Wrong size on FChatStyle");
static_assert(offsetof(FChatStyle, TextStyle) == 0x000000, "Member 'FChatStyle::TextStyle' has a wrong offset!");
static_assert(offsetof(FChatStyle, TimeStampTextStyle) == 0x0001C8, "Member 'FChatStyle::TimeStampTextStyle' has a wrong offset!");
static_assert(offsetof(FChatStyle, TimeStampColor) == 0x000390, "Member 'FChatStyle::TimeStampColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, DefaultChatColor) == 0x0003A0, "Member 'FChatStyle::DefaultChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, WhisperChatColor) == 0x0003B0, "Member 'FChatStyle::WhisperChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, GlobalChatColor) == 0x0003C0, "Member 'FChatStyle::GlobalChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, GameChatColor) == 0x0003D0, "Member 'FChatStyle::GameChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, TeamChatColor) == 0x0003E0, "Member 'FChatStyle::TeamChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, PartyChatColor) == 0x0003F0, "Member 'FChatStyle::PartyChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, AdminChatColor) == 0x000400, "Member 'FChatStyle::AdminChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, GameAdminChatColor) == 0x000410, "Member 'FChatStyle::GameAdminChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, AddedItemChatColor) == 0x000420, "Member 'FChatStyle::AddedItemChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, CompletedItemChatColor) == 0x000430, "Member 'FChatStyle::CompletedItemChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, DiscardedItemChatColor) == 0x000440, "Member 'FChatStyle::DiscardedItemChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, WhisperHyperlinkChatColor) == 0x000450, "Member 'FChatStyle::WhisperHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, GlobalHyperlinkChatColor) == 0x000460, "Member 'FChatStyle::GlobalHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, GameHyperlinkChatColor) == 0x000470, "Member 'FChatStyle::GameHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, TeamHyperlinkChatColor) == 0x000480, "Member 'FChatStyle::TeamHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, PartyHyperlinkChatColor) == 0x000490, "Member 'FChatStyle::PartyHyperlinkChatColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, EnemyColor) == 0x0004A0, "Member 'FChatStyle::EnemyColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, FriendlyColor) == 0x0004B0, "Member 'FChatStyle::FriendlyColor' has a wrong offset!");
static_assert(offsetof(FChatStyle, ChatEntryTextStyle) == 0x0004C0, "Member 'FChatStyle::ChatEntryTextStyle' has a wrong offset!");
static_assert(offsetof(FChatStyle, ChatDisplayTextStyle) == 0x000BE8, "Member 'FChatStyle::ChatDisplayTextStyle' has a wrong offset!");
static_assert(offsetof(FChatStyle, ScrollBorderStyle) == 0x001310, "Member 'FChatStyle::ScrollBorderStyle' has a wrong offset!");
static_assert(offsetof(FChatStyle, MessageNotificationBrush) == 0x0014F8, "Member 'FChatStyle::MessageNotificationBrush' has a wrong offset!");
static_assert(offsetof(FChatStyle, ChatEntryPadding) == 0x001570, "Member 'FChatStyle::ChatEntryPadding' has a wrong offset!");
static_assert(offsetof(FChatStyle, ChatEntryHeight) == 0x001580, "Member 'FChatStyle::ChatEntryHeight' has a wrong offset!");
static_assert(offsetof(FChatStyle, ChatMenuBackgroundBrush) == 0x001588, "Member 'FChatStyle::ChatMenuBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatStyle, FriendActionPadding) == 0x001600, "Member 'FChatStyle::FriendActionPadding' has a wrong offset!");
static_assert(offsetof(FChatStyle, FriendActionHeaderPadding) == 0x001610, "Member 'FChatStyle::FriendActionHeaderPadding' has a wrong offset!");
static_assert(offsetof(FChatStyle, FriendActionStatusMargin) == 0x001620, "Member 'FChatStyle::FriendActionStatusMargin' has a wrong offset!");

// ScriptStruct Social.ChatChromeStyle
// 0x0288 (0x0288 - 0x0000)
struct FChatChromeStyle final
{
public:
	struct FSlateBrush                            ChatBackgroundBrush;                               // 0x0000(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatEntryBackgroundBrush;                          // 0x0078(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChannelBackgroundBrush;                            // 0x00F0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChatEntryBackgroundColor;                          // 0x0168(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            TabBackgroundBrush;                                // 0x0178(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FLinearColor                           NoneActiveTabColor;                                // 0x01F0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColor;                                      // 0x0200(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColorInverted;                              // 0x0210(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TabWidth;                                          // 0x0220(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                TabPadding;                                        // 0x0224(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowPadding;                                 // 0x0234(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowToEntryMargin;                           // 0x0244(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatChannelPadding;                                // 0x0254(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatEntryPadding;                                  // 0x0264(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChatBackgroundColor;                               // 0x0274(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChatChromeStyle) == 0x000008, "Wrong alignment on FChatChromeStyle");
static_assert(sizeof(FChatChromeStyle) == 0x000288, "Wrong size on FChatChromeStyle");
static_assert(offsetof(FChatChromeStyle, ChatBackgroundBrush) == 0x000000, "Member 'FChatChromeStyle::ChatBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChatEntryBackgroundBrush) == 0x000078, "Member 'FChatChromeStyle::ChatEntryBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChannelBackgroundBrush) == 0x0000F0, "Member 'FChatChromeStyle::ChannelBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChatEntryBackgroundColor) == 0x000168, "Member 'FChatChromeStyle::ChatEntryBackgroundColor' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabBackgroundBrush) == 0x000178, "Member 'FChatChromeStyle::TabBackgroundBrush' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, NoneActiveTabColor) == 0x0001F0, "Member 'FChatChromeStyle::NoneActiveTabColor' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabFontColor) == 0x000200, "Member 'FChatChromeStyle::TabFontColor' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabFontColorInverted) == 0x000210, "Member 'FChatChromeStyle::TabFontColorInverted' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabWidth) == 0x000220, "Member 'FChatChromeStyle::TabWidth' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, TabPadding) == 0x000224, "Member 'FChatChromeStyle::TabPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChatWindowPadding) == 0x000234, "Member 'FChatChromeStyle::ChatWindowPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChatWindowToEntryMargin) == 0x000244, "Member 'FChatChromeStyle::ChatWindowToEntryMargin' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChatChannelPadding) == 0x000254, "Member 'FChatChromeStyle::ChatChannelPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChatEntryPadding) == 0x000264, "Member 'FChatChromeStyle::ChatEntryPadding' has a wrong offset!");
static_assert(offsetof(FChatChromeStyle, ChatBackgroundColor) == 0x000274, "Member 'FChatChromeStyle::ChatBackgroundColor' has a wrong offset!");

// ScriptStruct Social.ChatMarkupStyle
// 0x0590 (0x0590 - 0x0000)
struct FChatMarkupStyle final
{
public:
	struct FButtonStyle                           MarkupButtonStyle;                                 // 0x0000(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        MarkupTextStyle;                                   // 0x0238(0x01C8)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MarkupBackground;                                  // 0x0400(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonColor;                                       // 0x0478(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverColor;                                  // 0x04A0(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            TipColor;                                          // 0x04C8(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x04F0(0x0078)(Edit, NativeAccessSpecifierPublic)
	float                                         SeperatorThickness;                                // 0x0568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                MarkupPadding;                                     // 0x056C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ButtonPadding;                                     // 0x057C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChatMarkupStyle) == 0x000008, "Wrong alignment on FChatMarkupStyle");
static_assert(sizeof(FChatMarkupStyle) == 0x000590, "Wrong size on FChatMarkupStyle");
static_assert(offsetof(FChatMarkupStyle, MarkupButtonStyle) == 0x000000, "Member 'FChatMarkupStyle::MarkupButtonStyle' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, MarkupTextStyle) == 0x000238, "Member 'FChatMarkupStyle::MarkupTextStyle' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, MarkupBackground) == 0x000400, "Member 'FChatMarkupStyle::MarkupBackground' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, ButtonColor) == 0x000478, "Member 'FChatMarkupStyle::ButtonColor' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, ButtonHoverColor) == 0x0004A0, "Member 'FChatMarkupStyle::ButtonHoverColor' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, TipColor) == 0x0004C8, "Member 'FChatMarkupStyle::TipColor' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, SeperatorBrush) == 0x0004F0, "Member 'FChatMarkupStyle::SeperatorBrush' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, SeperatorThickness) == 0x000568, "Member 'FChatMarkupStyle::SeperatorThickness' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, MarkupPadding) == 0x00056C, "Member 'FChatMarkupStyle::MarkupPadding' has a wrong offset!");
static_assert(offsetof(FChatMarkupStyle, ButtonPadding) == 0x00057C, "Member 'FChatMarkupStyle::ButtonPadding' has a wrong offset!");

// ScriptStruct Social.SocialStyle
// 0x5CA0 (0x5CA0 - 0x0000)
struct FSocialStyle final
{
public:
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0000(0x0440)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ActionButtonStyle;                                 // 0x0440(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       SmallFontStyle;                                    // 0x0678(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       NormalFontStyle;                                   // 0x08B8(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       LargeFontStyle;                                    // 0x0AF8(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       ChatFontStyle;                                     // 0x0D38(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         CheckBoxStyle;                                     // 0x0F78(0x04F0)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         RadioBoxStyle;                                     // 0x1468(0x04F0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialListStyle                       SocialListStyle;                                   // 0x1958(0x2500)(Edit, NativeAccessSpecifierPublic)
	struct FChatStyle                             ChatStyle;                                         // 0x3E58(0x1630)(Edit, NativeAccessSpecifierPublic)
	struct FChatChromeStyle                       ChatChromeStyle;                                   // 0x5488(0x0288)(Edit, NativeAccessSpecifierPublic)
	struct FChatMarkupStyle                       ChatMarkupStyle;                                   // 0x5710(0x0590)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSocialStyle) == 0x000008, "Wrong alignment on FSocialStyle");
static_assert(sizeof(FSocialStyle) == 0x005CA0, "Wrong size on FSocialStyle");
static_assert(offsetof(FSocialStyle, ScrollBarStyle) == 0x000000, "Member 'FSocialStyle::ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(FSocialStyle, ActionButtonStyle) == 0x000440, "Member 'FSocialStyle::ActionButtonStyle' has a wrong offset!");
static_assert(offsetof(FSocialStyle, SmallFontStyle) == 0x000678, "Member 'FSocialStyle::SmallFontStyle' has a wrong offset!");
static_assert(offsetof(FSocialStyle, NormalFontStyle) == 0x0008B8, "Member 'FSocialStyle::NormalFontStyle' has a wrong offset!");
static_assert(offsetof(FSocialStyle, LargeFontStyle) == 0x000AF8, "Member 'FSocialStyle::LargeFontStyle' has a wrong offset!");
static_assert(offsetof(FSocialStyle, ChatFontStyle) == 0x000D38, "Member 'FSocialStyle::ChatFontStyle' has a wrong offset!");
