#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnPad_Agent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SpawnPad_Agent.SpawnPad_Agent_C
// 0x0040 (0x0358 - 0x0318)
class ASpawnPad_Agent_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere1;                                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Driver_B88EA32F4241B71D27EDD19CA0B054FC; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_B88EA32F4241B71D27EDD19CA0B054FC; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpawnPad_Manager_C*                    SpawnPad_Manager;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Pad_ID;                                            // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTestMode;                                         // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSpawned;                                          // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TestDelay;                                         // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpawnPad_Agent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Spawned();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpawnPad_Agent_C">();
	}
	static class ASpawnPad_Agent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpawnPad_Agent_C>();
	}
};
static_assert(alignof(ASpawnPad_Agent_C) == 0x000008, "Wrong alignment on ASpawnPad_Agent_C");
static_assert(sizeof(ASpawnPad_Agent_C) == 0x000358, "Wrong size on ASpawnPad_Agent_C");
static_assert(offsetof(ASpawnPad_Agent_C, UberGraphFrame) == 0x000318, "Member 'ASpawnPad_Agent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, Billboard) == 0x000320, "Member 'ASpawnPad_Agent_C::Billboard' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, Sphere1) == 0x000328, "Member 'ASpawnPad_Agent_C::Sphere1' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, Timeline_0_Driver_B88EA32F4241B71D27EDD19CA0B054FC) == 0x000330, "Member 'ASpawnPad_Agent_C::Timeline_0_Driver_B88EA32F4241B71D27EDD19CA0B054FC' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, Timeline_0__Direction_B88EA32F4241B71D27EDD19CA0B054FC) == 0x000334, "Member 'ASpawnPad_Agent_C::Timeline_0__Direction_B88EA32F4241B71D27EDD19CA0B054FC' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, Timeline_0) == 0x000338, "Member 'ASpawnPad_Agent_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, SpawnPad_Manager) == 0x000340, "Member 'ASpawnPad_Agent_C::SpawnPad_Manager' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, Pad_ID) == 0x000348, "Member 'ASpawnPad_Agent_C::Pad_ID' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, bTestMode) == 0x00034C, "Member 'ASpawnPad_Agent_C::bTestMode' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, bSpawned) == 0x00034D, "Member 'ASpawnPad_Agent_C::bSpawned' has a wrong offset!");
static_assert(offsetof(ASpawnPad_Agent_C, TestDelay) == 0x000350, "Member 'ASpawnPad_Agent_C::TestDelay' has a wrong offset!");

}

