#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_MoonMaterial

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_MoonMaterial.Struct_MoonMaterial
// 0x0040 (0x0040 - 0x0000)
struct FStruct_MoonMaterial final
{
public:
	class UMaterialInstance*                      OmedaSurface_2_33527B7349163FFCEDEDC4935E847280;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      OmedaAtmosphere_7_F1E363044C23DB4B4D5F45AA62CFB002; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      LethaSurface_8_4626EE304179E1630AA4A4BC318225BC;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      LethaAtmosphere_9_5F46D7BA4ED3767F68CAB3907A58F3BD; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      ZechinSurface_10_7B02BA2541AFF387FD2F7799C7FF9612; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      ZechinAtmosphere_12_2318510544E5D4EAABCCB5B6CD5BFE2E; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      UnknownSurface_16_D4A2341F45E5D0958028108BC804FD06; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      UknownAtmosphere_18_69B08F7A4A8938B9F423BB81EB6EC39A; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_MoonMaterial) == 0x000008, "Wrong alignment on FStruct_MoonMaterial");
static_assert(sizeof(FStruct_MoonMaterial) == 0x000040, "Wrong size on FStruct_MoonMaterial");
static_assert(offsetof(FStruct_MoonMaterial, OmedaSurface_2_33527B7349163FFCEDEDC4935E847280) == 0x000000, "Member 'FStruct_MoonMaterial::OmedaSurface_2_33527B7349163FFCEDEDC4935E847280' has a wrong offset!");
static_assert(offsetof(FStruct_MoonMaterial, OmedaAtmosphere_7_F1E363044C23DB4B4D5F45AA62CFB002) == 0x000008, "Member 'FStruct_MoonMaterial::OmedaAtmosphere_7_F1E363044C23DB4B4D5F45AA62CFB002' has a wrong offset!");
static_assert(offsetof(FStruct_MoonMaterial, LethaSurface_8_4626EE304179E1630AA4A4BC318225BC) == 0x000010, "Member 'FStruct_MoonMaterial::LethaSurface_8_4626EE304179E1630AA4A4BC318225BC' has a wrong offset!");
static_assert(offsetof(FStruct_MoonMaterial, LethaAtmosphere_9_5F46D7BA4ED3767F68CAB3907A58F3BD) == 0x000018, "Member 'FStruct_MoonMaterial::LethaAtmosphere_9_5F46D7BA4ED3767F68CAB3907A58F3BD' has a wrong offset!");
static_assert(offsetof(FStruct_MoonMaterial, ZechinSurface_10_7B02BA2541AFF387FD2F7799C7FF9612) == 0x000020, "Member 'FStruct_MoonMaterial::ZechinSurface_10_7B02BA2541AFF387FD2F7799C7FF9612' has a wrong offset!");
static_assert(offsetof(FStruct_MoonMaterial, ZechinAtmosphere_12_2318510544E5D4EAABCCB5B6CD5BFE2E) == 0x000028, "Member 'FStruct_MoonMaterial::ZechinAtmosphere_12_2318510544E5D4EAABCCB5B6CD5BFE2E' has a wrong offset!");
static_assert(offsetof(FStruct_MoonMaterial, UnknownSurface_16_D4A2341F45E5D0958028108BC804FD06) == 0x000030, "Member 'FStruct_MoonMaterial::UnknownSurface_16_D4A2341F45E5D0958028108BC804FD06' has a wrong offset!");
static_assert(offsetof(FStruct_MoonMaterial, UknownAtmosphere_18_69B08F7A4A8938B9F423BB81EB6EC39A) == 0x000038, "Member 'FStruct_MoonMaterial::UknownAtmosphere_18_69B08F7A4A8938B9F423BB81EB6EC39A' has a wrong offset!");

}

