#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuperMinion_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SuperMinion_AnimBP.SuperMinion_AnimBP_C
// 0x0470 (0x10A0 - 0x0C30)
class USuperMinion_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_C57A82D4493F12AB0D77C3A8BCC78DF2; // 0x0C38(0x02F0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_FD59DC6C4AB768279CEE4CACE8882E75; // 0x0F28(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root_C72180864C38737F8BD70EA5A959596E; // 0x1050(0x0048)()
	int32                                         Random_Pose;                                       // 0x1098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinion_AnimBP_AnimGraphNode_BlendSpacePlayer_FD59DC6C4AB768279CEE4CACE8882E75();
	void ExecuteUbergraph_SuperMinion_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SuperMinion_AnimBP_C">();
	}
	static class USuperMinion_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USuperMinion_AnimBP_C>();
	}
};
static_assert(alignof(USuperMinion_AnimBP_C) == 0x000010, "Wrong alignment on USuperMinion_AnimBP_C");
static_assert(sizeof(USuperMinion_AnimBP_C) == 0x0010A0, "Wrong size on USuperMinion_AnimBP_C");
static_assert(offsetof(USuperMinion_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'USuperMinion_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USuperMinion_AnimBP_C, OrionAnimGraphNode_MinionBehavior_C57A82D4493F12AB0D77C3A8BCC78DF2) == 0x000C38, "Member 'USuperMinion_AnimBP_C::OrionAnimGraphNode_MinionBehavior_C57A82D4493F12AB0D77C3A8BCC78DF2' has a wrong offset!");
static_assert(offsetof(USuperMinion_AnimBP_C, AnimGraphNode_BlendSpacePlayer_FD59DC6C4AB768279CEE4CACE8882E75) == 0x000F28, "Member 'USuperMinion_AnimBP_C::AnimGraphNode_BlendSpacePlayer_FD59DC6C4AB768279CEE4CACE8882E75' has a wrong offset!");
static_assert(offsetof(USuperMinion_AnimBP_C, AnimGraphNode_Root_C72180864C38737F8BD70EA5A959596E) == 0x001050, "Member 'USuperMinion_AnimBP_C::AnimGraphNode_Root_C72180864C38737F8BD70EA5A959596E' has a wrong offset!");
static_assert(offsetof(USuperMinion_AnimBP_C, Random_Pose) == 0x001098, "Member 'USuperMinion_AnimBP_C::Random_Pose' has a wrong offset!");

}

