#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Survey_Question

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Survey_Question.Survey_Question_C
// 0x0050 (0x0320 - 0x02D0)
class USurvey_Question_C final : public UOrionSurveyQuestion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(Transient, DuplicateTransient)
	class UDefaultButton_C*                       One;                                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       Two;                                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       Three;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       Four;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       Five;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UDefaultButton_C*>               Stars;                                             // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          StarFound;                                         // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Survey_Question(int32 EntryPoint);
	void Construct();
	void Event_StarOnClick(class UOrionBaseButton* Button);
	void Event_StarOnHover(class UOrionBaseButton* Button);
	void Event_StarOnUnhover(class UOrionBaseButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Survey_Question_C">();
	}
	static class USurvey_Question_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvey_Question_C>();
	}
};
static_assert(alignof(USurvey_Question_C) == 0x000008, "Wrong alignment on USurvey_Question_C");
static_assert(sizeof(USurvey_Question_C) == 0x000320, "Wrong size on USurvey_Question_C");
static_assert(offsetof(USurvey_Question_C, UberGraphFrame) == 0x0002D0, "Member 'USurvey_Question_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USurvey_Question_C, One) == 0x0002D8, "Member 'USurvey_Question_C::One' has a wrong offset!");
static_assert(offsetof(USurvey_Question_C, Two) == 0x0002E0, "Member 'USurvey_Question_C::Two' has a wrong offset!");
static_assert(offsetof(USurvey_Question_C, Three) == 0x0002E8, "Member 'USurvey_Question_C::Three' has a wrong offset!");
static_assert(offsetof(USurvey_Question_C, Four) == 0x0002F0, "Member 'USurvey_Question_C::Four' has a wrong offset!");
static_assert(offsetof(USurvey_Question_C, Five) == 0x0002F8, "Member 'USurvey_Question_C::Five' has a wrong offset!");
static_assert(offsetof(USurvey_Question_C, Image_0) == 0x000300, "Member 'USurvey_Question_C::Image_0' has a wrong offset!");
static_assert(offsetof(USurvey_Question_C, Stars) == 0x000308, "Member 'USurvey_Question_C::Stars' has a wrong offset!");
static_assert(offsetof(USurvey_Question_C, StarFound) == 0x000318, "Member 'USurvey_Question_C::StarFound' has a wrong offset!");

}

