#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TencentSensitivityBrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TencentSensitivityBrowser.TencentSensitivityBrowser_C
// 0x0058 (0x0258 - 0x0200)
class UTencentSensitivityBrowser_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0200(0x0008)(Transient, DuplicateTransient)
	class UOverlay*                               BrowserOverlay;                                    // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       CloseBrowserButton;                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       CloseDialogButton;                                 // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        DialogBodyText;                                    // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        DialogTitleText;                                   // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlap;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PromptOverlay;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             WebHolder;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionWidgetSwitcher*                   WidgetSwitcher;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TencentSensitivityBrowser(int32 EntryPoint);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_462_OrionBaseButtonClicked__DelegateSignature(class UOrionBaseButton* Button);
	void BndEvt__CloseDialogButton_K2Node_ComponentBoundEvent_137_OrionBaseButtonClicked__DelegateSignature(class UOrionBaseButton* Button);
	void Construct();
	void Display_Widget(class UWidget* WebWidget, const class FText& Title, const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TencentSensitivityBrowser_C">();
	}
	static class UTencentSensitivityBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTencentSensitivityBrowser_C>();
	}
};
static_assert(alignof(UTencentSensitivityBrowser_C) == 0x000008, "Wrong alignment on UTencentSensitivityBrowser_C");
static_assert(sizeof(UTencentSensitivityBrowser_C) == 0x000258, "Wrong size on UTencentSensitivityBrowser_C");
static_assert(offsetof(UTencentSensitivityBrowser_C, UberGraphFrame) == 0x000200, "Member 'UTencentSensitivityBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, BrowserOverlay) == 0x000208, "Member 'UTencentSensitivityBrowser_C::BrowserOverlay' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, CircularThrobber_0) == 0x000210, "Member 'UTencentSensitivityBrowser_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, CloseBrowserButton) == 0x000218, "Member 'UTencentSensitivityBrowser_C::CloseBrowserButton' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, CloseDialogButton) == 0x000220, "Member 'UTencentSensitivityBrowser_C::CloseDialogButton' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, DialogBodyText) == 0x000228, "Member 'UTencentSensitivityBrowser_C::DialogBodyText' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, DialogTitleText) == 0x000230, "Member 'UTencentSensitivityBrowser_C::DialogTitleText' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, Overlap) == 0x000238, "Member 'UTencentSensitivityBrowser_C::Overlap' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, PromptOverlay) == 0x000240, "Member 'UTencentSensitivityBrowser_C::PromptOverlay' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, WebHolder) == 0x000248, "Member 'UTencentSensitivityBrowser_C::WebHolder' has a wrong offset!");
static_assert(offsetof(UTencentSensitivityBrowser_C, WidgetSwitcher) == 0x000250, "Member 'UTencentSensitivityBrowser_C::WidgetSwitcher' has a wrong offset!");

}

