#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TM_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TM_Base.TM_Base_C
// 0x0038 (0x0780 - 0x0748)
class ATM_Base_C : public AOrionTargetingMode_FacetShape
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0748(0x0008)(Transient, DuplicateTransient)
	class UPointLightComponent*                   TargetLight;                                       // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseMeshPreviz;                                     // 0x0758(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            PrevizMesh;                                        // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PrevizMeshComponent;                               // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     PrevizMaterial;                                    // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLightPreviz;                                    // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_779[0x3];                                      // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LightPrevizRadius;                                 // 0x077C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TM_Base(int32 EntryPoint);
	void OnTargetingModeActivate();
	void OnTargetingModeCancel();
	void OnTargetingModeConfirm();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TM_Base_C">();
	}
	static class ATM_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATM_Base_C>();
	}
};
static_assert(alignof(ATM_Base_C) == 0x000008, "Wrong alignment on ATM_Base_C");
static_assert(sizeof(ATM_Base_C) == 0x000780, "Wrong size on ATM_Base_C");
static_assert(offsetof(ATM_Base_C, UberGraphFrame) == 0x000748, "Member 'ATM_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATM_Base_C, TargetLight) == 0x000750, "Member 'ATM_Base_C::TargetLight' has a wrong offset!");
static_assert(offsetof(ATM_Base_C, UseMeshPreviz) == 0x000758, "Member 'ATM_Base_C::UseMeshPreviz' has a wrong offset!");
static_assert(offsetof(ATM_Base_C, PrevizMesh) == 0x000760, "Member 'ATM_Base_C::PrevizMesh' has a wrong offset!");
static_assert(offsetof(ATM_Base_C, PrevizMeshComponent) == 0x000768, "Member 'ATM_Base_C::PrevizMeshComponent' has a wrong offset!");
static_assert(offsetof(ATM_Base_C, PrevizMaterial) == 0x000770, "Member 'ATM_Base_C::PrevizMaterial' has a wrong offset!");
static_assert(offsetof(ATM_Base_C, UseLightPreviz) == 0x000778, "Member 'ATM_Base_C::UseLightPreviz' has a wrong offset!");
static_assert(offsetof(ATM_Base_C, LightPrevizRadius) == 0x00077C, "Member 'ATM_Base_C::LightPrevizRadius' has a wrong offset!");

}

