#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TM_Beam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TM_Beam.TM_Beam_C.ExecuteUbergraph_TM_Beam
// 0x0078 (0x0078 - 0x0000)
struct TM_Beam_C_ExecuteUbergraph_TM_Beam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerContext*                         CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bEnabled)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Start;                                // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_End;                                  // 0x003C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Radius;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerContext*                         CallFunc_GetContext_ReturnValue2;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowBasicAttackRangeIndicator_ReturnValue; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnabled;                       // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TM_Beam_C_ExecuteUbergraph_TM_Beam) == 0x000008, "Wrong alignment on TM_Beam_C_ExecuteUbergraph_TM_Beam");
static_assert(sizeof(TM_Beam_C_ExecuteUbergraph_TM_Beam) == 0x000078, "Wrong size on TM_Beam_C_ExecuteUbergraph_TM_Beam");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, EntryPoint) == 0x000000, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::EntryPoint' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, K2Node_Event_Start) == 0x000030, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::K2Node_Event_Start' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, K2Node_Event_End) == 0x00003C, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::K2Node_Event_End' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, K2Node_Event_Radius) == 0x000048, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::K2Node_Event_Radius' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00004C, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_VSize_ReturnValue) == 0x000058, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_GetContext_ReturnValue2) == 0x000060, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_GetShowBasicAttackRangeIndicator_ReturnValue) == 0x000068, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_GetShowBasicAttackRangeIndicator_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_Conv_IntToBool_ReturnValue) == 0x00006C, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_IsServer_ReturnValue) == 0x00006D, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, K2Node_CustomEvent_bEnabled) == 0x00006E, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::K2Node_CustomEvent_bEnabled' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_IsServer_ReturnValue2) == 0x00006F, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_ExecuteUbergraph_TM_Beam, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000070, "Member 'TM_Beam_C_ExecuteUbergraph_TM_Beam::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");

// Function TM_Beam.TM_Beam_C.Value Changed
// 0x0001 (0x0001 - 0x0000)
struct TM_Beam_C_Value_Changed final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TM_Beam_C_Value_Changed) == 0x000001, "Wrong alignment on TM_Beam_C_Value_Changed");
static_assert(sizeof(TM_Beam_C_Value_Changed) == 0x000001, "Wrong size on TM_Beam_C_Value_Changed");
static_assert(offsetof(TM_Beam_C_Value_Changed, bEnabled) == 0x000000, "Member 'TM_Beam_C_Value_Changed::bEnabled' has a wrong offset!");

// Function TM_Beam.TM_Beam_C.OnFacetBeamBuilt
// 0x001C (0x001C - 0x0000)
struct TM_Beam_C_OnFacetBeamBuilt final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TM_Beam_C_OnFacetBeamBuilt) == 0x000004, "Wrong alignment on TM_Beam_C_OnFacetBeamBuilt");
static_assert(sizeof(TM_Beam_C_OnFacetBeamBuilt) == 0x00001C, "Wrong size on TM_Beam_C_OnFacetBeamBuilt");
static_assert(offsetof(TM_Beam_C_OnFacetBeamBuilt, Start) == 0x000000, "Member 'TM_Beam_C_OnFacetBeamBuilt::Start' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_OnFacetBeamBuilt, End) == 0x00000C, "Member 'TM_Beam_C_OnFacetBeamBuilt::End' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_OnFacetBeamBuilt, Radius) == 0x000018, "Member 'TM_Beam_C_OnFacetBeamBuilt::Radius' has a wrong offset!");

// Function TM_Beam.TM_Beam_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct TM_Beam_C_UserConstructionScript final
{
public:
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0000(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TM_Beam_C_UserConstructionScript) == 0x000008, "Wrong alignment on TM_Beam_C_UserConstructionScript");
static_assert(sizeof(TM_Beam_C_UserConstructionScript) == 0x000018, "Wrong size on TM_Beam_C_UserConstructionScript");
static_assert(offsetof(TM_Beam_C_UserConstructionScript, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000000, "Member 'TM_Beam_C_UserConstructionScript::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Beam_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'TM_Beam_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

