#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TM_Beam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TM_Beam.TM_Beam_C
// 0x0020 (0x07A0 - 0x0780)
class ATM_Beam_C : public ATM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TM_Beam_C;                          // 0x0780(0x0008)(Transient, DuplicateTransient)
	class UDecalComponent*                        RangeDecal;                                        // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RangeDecalMat;                                     // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowingIndicator;                                 // 0x0798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BeamFacetSum;                                      // 0x079C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TM_Beam(int32 EntryPoint);
	void OnStartBuildingFacets();
	void Value_Changed(bool bEnabled);
	void OnFacetBeamBuilt(const struct FVector& Start, const struct FVector& End, float Radius);
	void ReceiveBeginPlay();
	void OnTargetingModeConfirm();
	void OnTargetingModeCancel();
	void OnTargetingModeActivate();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TM_Beam_C">();
	}
	static class ATM_Beam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATM_Beam_C>();
	}
};
static_assert(alignof(ATM_Beam_C) == 0x000008, "Wrong alignment on ATM_Beam_C");
static_assert(sizeof(ATM_Beam_C) == 0x0007A0, "Wrong size on ATM_Beam_C");
static_assert(offsetof(ATM_Beam_C, UberGraphFrame_TM_Beam_C) == 0x000780, "Member 'ATM_Beam_C::UberGraphFrame_TM_Beam_C' has a wrong offset!");
static_assert(offsetof(ATM_Beam_C, RangeDecal) == 0x000788, "Member 'ATM_Beam_C::RangeDecal' has a wrong offset!");
static_assert(offsetof(ATM_Beam_C, RangeDecalMat) == 0x000790, "Member 'ATM_Beam_C::RangeDecalMat' has a wrong offset!");
static_assert(offsetof(ATM_Beam_C, bShowingIndicator) == 0x000798, "Member 'ATM_Beam_C::bShowingIndicator' has a wrong offset!");
static_assert(offsetof(ATM_Beam_C, BeamFacetSum) == 0x00079C, "Member 'ATM_Beam_C::BeamFacetSum' has a wrong offset!");

}

