#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TM_WardPlacement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TM_WardPlacement.TM_WardPlacement_C
// 0x0048 (0x07C8 - 0x0780)
class ATM_WardPlacement_C final : public ATM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TM_WardPlacement_C;                 // 0x0780(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   RangeMesh;                                         // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_ShadowPlaneShimmer;                              // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TM_OverrideRadius;                                 // 0x0798(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A4[0x4];                                      // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     M_Range;                                           // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Range;                                         // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActive;                                           // 0x07B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SecondCounter;                                     // 0x07BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFlashVisibilityOn;                                // 0x07C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bConfirmAllowed;                                   // 0x07C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TM_WardPlacement(int32 EntryPoint);
	void OnConfirmAllowedChange(bool ConfirmAllowed);
	void ReceiveTick(float DeltaSeconds);
	void OnTargetingModeActivate();
	void OnTargetingModeCancel();
	void OnTargetingModeConfirm();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TM_WardPlacement_C">();
	}
	static class ATM_WardPlacement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATM_WardPlacement_C>();
	}
};
static_assert(alignof(ATM_WardPlacement_C) == 0x000008, "Wrong alignment on ATM_WardPlacement_C");
static_assert(sizeof(ATM_WardPlacement_C) == 0x0007C8, "Wrong size on ATM_WardPlacement_C");
static_assert(offsetof(ATM_WardPlacement_C, UberGraphFrame_TM_WardPlacement_C) == 0x000780, "Member 'ATM_WardPlacement_C::UberGraphFrame_TM_WardPlacement_C' has a wrong offset!");
static_assert(offsetof(ATM_WardPlacement_C, RangeMesh) == 0x000788, "Member 'ATM_WardPlacement_C::RangeMesh' has a wrong offset!");
static_assert(offsetof(ATM_WardPlacement_C, M_ShadowPlaneShimmer) == 0x000790, "Member 'ATM_WardPlacement_C::M_ShadowPlaneShimmer' has a wrong offset!");
static_assert(offsetof(ATM_WardPlacement_C, TM_OverrideRadius) == 0x000798, "Member 'ATM_WardPlacement_C::TM_OverrideRadius' has a wrong offset!");
static_assert(offsetof(ATM_WardPlacement_C, M_Range) == 0x0007A8, "Member 'ATM_WardPlacement_C::M_Range' has a wrong offset!");
static_assert(offsetof(ATM_WardPlacement_C, DMI_Range) == 0x0007B0, "Member 'ATM_WardPlacement_C::DMI_Range' has a wrong offset!");
static_assert(offsetof(ATM_WardPlacement_C, bActive) == 0x0007B8, "Member 'ATM_WardPlacement_C::bActive' has a wrong offset!");
static_assert(offsetof(ATM_WardPlacement_C, SecondCounter) == 0x0007BC, "Member 'ATM_WardPlacement_C::SecondCounter' has a wrong offset!");
static_assert(offsetof(ATM_WardPlacement_C, bFlashVisibilityOn) == 0x0007C0, "Member 'ATM_WardPlacement_C::bFlashVisibilityOn' has a wrong offset!");
static_assert(offsetof(ATM_WardPlacement_C, bConfirmAllowed) == 0x0007C1, "Member 'ATM_WardPlacement_C::bConfirmAllowed' has a wrong offset!");

}

