#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ui_StylizedDivider_Hor

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "StylizedDivider_Hor_ArrowDir_structs.hpp"


namespace SDK::Params
{

// Function ui_StylizedDivider_Hor.ui_StylizedDivider_Hor_C.ExecuteUbergraph_ui_StylizedDivider_Hor
// 0x0038 (0x0038 - 0x0000)
struct Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStylizedDivider_Hor_ArrowDir                 Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStylizedDivider_Hor_ArrowDir                 Temp_byte_Variable5;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable3;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select2_Default;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor) == 0x000008, "Wrong alignment on Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor");
static_assert(sizeof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor) == 0x000038, "Wrong size on Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, EntryPoint) == 0x000000, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, Temp_byte_Variable) == 0x000004, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, Temp_byte_Variable2) == 0x000005, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, Temp_byte_Variable3) == 0x000006, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, Temp_byte_Variable4) == 0x000007, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, Temp_byte_Variable5) == 0x000008, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, Temp_object_Variable) == 0x000010, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, Temp_object_Variable2) == 0x000018, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, Temp_object_Variable3) == 0x000020, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, K2Node_Event_IsDesignTime) == 0x000028, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, K2Node_Select_Default) == 0x000029, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor, K2Node_Select2_Default) == 0x000030, "Member 'Ui_StylizedDivider_Hor_C_ExecuteUbergraph_ui_StylizedDivider_Hor::K2Node_Select2_Default' has a wrong offset!");

// Function ui_StylizedDivider_Hor.ui_StylizedDivider_Hor_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Ui_StylizedDivider_Hor_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ui_StylizedDivider_Hor_C_PreConstruct) == 0x000001, "Wrong alignment on Ui_StylizedDivider_Hor_C_PreConstruct");
static_assert(sizeof(Ui_StylizedDivider_Hor_C_PreConstruct) == 0x000001, "Wrong size on Ui_StylizedDivider_Hor_C_PreConstruct");
static_assert(offsetof(Ui_StylizedDivider_Hor_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Ui_StylizedDivider_Hor_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

