#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIManager.UIManager_C
// 0x0030 (0x0580 - 0x0550)
class UUIManager_C final : public UOrionUIManagerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(Transient, DuplicateTransient)
	class UNotificationManager_C*                 _Notification_Manager_;                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BoxPreMatchInfoText;                               // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEpicPurchaseFlowDisplay_C*             EpicPurchaseFlowDisplay;                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatch_Info_Text_Widget_C*              Match_Info_Text_Widget;                            // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTencentSensitivityBrowser_C*           TencentSensitivityBrowser;                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIManager(int32 EntryPoint);
	void Construct();
	void OnStateTransitionComplete();
	void Destruct();
	void OnSetMatchInfoVisibility(bool bVisible);
	void OnConfirmed_1304D0084FAF86AA0C7457A14A356F8D();
	void OnDeclined_1304D0084FAF86AA0C7457A14A356F8D();
	void OnKilled_1304D0084FAF86AA0C7457A14A356F8D();
	void OnSetMatchInfoText(const class FText& InText);
	void OnShowError(const struct FOrionDialogDescription& Description);
	void OnTimedOut_1304D0084FAF86AA0C7457A14A356F8D();
	void Set_Box_Content(class USizeBox* Box, class UOrionUIStateWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIManager_C">();
	}
	static class UUIManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIManager_C>();
	}
};
static_assert(alignof(UUIManager_C) == 0x000008, "Wrong alignment on UUIManager_C");
static_assert(sizeof(UUIManager_C) == 0x000580, "Wrong size on UUIManager_C");
static_assert(offsetof(UUIManager_C, UberGraphFrame) == 0x000550, "Member 'UUIManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIManager_C, _Notification_Manager_) == 0x000558, "Member 'UUIManager_C::_Notification_Manager_' has a wrong offset!");
static_assert(offsetof(UUIManager_C, BoxPreMatchInfoText) == 0x000560, "Member 'UUIManager_C::BoxPreMatchInfoText' has a wrong offset!");
static_assert(offsetof(UUIManager_C, EpicPurchaseFlowDisplay) == 0x000568, "Member 'UUIManager_C::EpicPurchaseFlowDisplay' has a wrong offset!");
static_assert(offsetof(UUIManager_C, Match_Info_Text_Widget) == 0x000570, "Member 'UUIManager_C::Match_Info_Text_Widget' has a wrong offset!");
static_assert(offsetof(UUIManager_C, TencentSensitivityBrowser) == 0x000578, "Member 'UUIManager_C::TencentSensitivityBrowser' has a wrong offset!");

}

