#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealEdMessages

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct UnrealEdMessages.AssetEditorRequestOpenAsset
// 0x0010 (0x0010 - 0x0000)
struct FAssetEditorRequestOpenAsset final
{
public:
	class FString                                 AssetName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAssetEditorRequestOpenAsset) == 0x000008, "Wrong alignment on FAssetEditorRequestOpenAsset");
static_assert(sizeof(FAssetEditorRequestOpenAsset) == 0x000010, "Wrong size on FAssetEditorRequestOpenAsset");
static_assert(offsetof(FAssetEditorRequestOpenAsset, AssetName) == 0x000000, "Member 'FAssetEditorRequestOpenAsset::AssetName' has a wrong offset!");

// ScriptStruct UnrealEdMessages.FileServerReady
// 0x0020 (0x0020 - 0x0000)
struct FFileServerReady final
{
public:
	TArray<class FString>                         AddressList;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGuid                                  InstanceId;                                        // 0x0010(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFileServerReady) == 0x000008, "Wrong alignment on FFileServerReady");
static_assert(sizeof(FFileServerReady) == 0x000020, "Wrong size on FFileServerReady");
static_assert(offsetof(FFileServerReady, AddressList) == 0x000000, "Member 'FFileServerReady::AddressList' has a wrong offset!");
static_assert(offsetof(FFileServerReady, InstanceId) == 0x000010, "Member 'FFileServerReady::InstanceId' has a wrong offset!");

}

