#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * WidgetBlueprintGeneratedClass DebugHeroSelect.DebugHeroSelect_C
	 * Size -> 0x0050 (FullSize[0x0510] - InheritedSize[0x04C0])
	 */
	class UDebugHeroSelect_C : public UOrionDebugHeroSelect
	{
	public:
		class UDebugTeamMember_C*                                  DebugTeamMember;                                         // 0x04C0(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor
		class UDebugTeamMember_C*                                  DebugTeamMember_C_1;                                     // 0x04C8(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor
		class UDebugTeamMember_C*                                  DebugTeamMember_C_2;                                     // 0x04D0(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor
		class UDebugTeamMember_C*                                  DebugTeamMember_C_3;                                     // 0x04D8(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor
		class UDebugTeamMember_C*                                  DebugTeamMember_C_4;                                     // 0x04E0(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor
		class UDebugTeamMember_C*                                  DebugTeamMember_C_5;                                     // 0x04E8(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor
		class UDebugTeamMember_C*                                  DebugTeamMember_C_6;                                     // 0x04F0(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor
		class UDebugTeamMember_C*                                  DebugTeamMember_C_7;                                     // 0x04F8(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor
		class UDebugTeamMember_C*                                  DebugTeamMember_C_8;                                     // 0x0500(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor
		class UDebugTeamMember_C*                                  DebugTeamMember_C_9;                                     // 0x0508(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor

	public:
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
