#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyEnd_312C16D2459472D9C8AE11B9E8146D85
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnNotifyEnd_312C16D2459472D9C8AE11B9E8146D85_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCancelled_312C16D2459472D9C8AE11B9E8146D85
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnCancelled_312C16D2459472D9C8AE11B9E8146D85_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnInterrupted_312C16D2459472D9C8AE11B9E8146D85
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnInterrupted_312C16D2459472D9C8AE11B9E8146D85_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnBlendOut_312C16D2459472D9C8AE11B9E8146D85
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnBlendOut_312C16D2459472D9C8AE11B9E8146D85_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCompleted_312C16D2459472D9C8AE11B9E8146D85
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnCompleted_312C16D2459472D9C8AE11B9E8146D85_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyEnd_A7EC350E43DEB7B9D3D809B02BAA6E7C
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnNotifyEnd_A7EC350E43DEB7B9D3D809B02BAA6E7C_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyEnd_CB8233F548BE64B22B4288B726D3CBFD
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnNotifyEnd_CB8233F548BE64B22B4288B726D3CBFD_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCancelled_CB8233F548BE64B22B4288B726D3CBFD
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnCancelled_CB8233F548BE64B22B4288B726D3CBFD_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCompleted_CB8233F548BE64B22B4288B726D3CBFD
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnCompleted_CB8233F548BE64B22B4288B726D3CBFD_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyEnd_F2C5B4274F278F2F3D93A18C0A71D3A1
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnNotifyEnd_F2C5B4274F278F2F3D93A18C0A71D3A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyBegin_F2C5B4274F278F2F3D93A18C0A71D3A1
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_F2C5B4274F278F2F3D93A18C0A71D3A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.Cancelled_2EAD026045E93D20A19BB088C38760CB
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_Cancelled_2EAD026045E93D20A19BB088C38760CB_Params
	{
	public:
		struct FGameplayAbilityTargetDataHandle                    Targets;                                                 // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.Confirmed_2EAD026045E93D20A19BB088C38760CB
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_Confirmed_2EAD026045E93D20A19BB088C38760CB_Params
	{
	public:
		struct FGameplayAbilityTargetDataHandle                    Targets;                                                 // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.K2_ActivateAbility
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.ExecuteUbergraph_GA_Buff_Red_PrimaryAttack
	 */
	struct UGA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_KC22[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
