#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnNotifyEnd_EE75F5AA4723D93C1B9E01B42B8EC2A1
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnNotifyEnd_EE75F5AA4723D93C1B9E01B42B8EC2A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnNotifyBegin_EE75F5AA4723D93C1B9E01B42B8EC2A1
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnNotifyBegin_EE75F5AA4723D93C1B9E01B42B8EC2A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnCancelled_EE75F5AA4723D93C1B9E01B42B8EC2A1
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnCancelled_EE75F5AA4723D93C1B9E01B42B8EC2A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnInterrupted_EE75F5AA4723D93C1B9E01B42B8EC2A1
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnInterrupted_EE75F5AA4723D93C1B9E01B42B8EC2A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnBlendOut_EE75F5AA4723D93C1B9E01B42B8EC2A1
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnBlendOut_EE75F5AA4723D93C1B9E01B42B8EC2A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnCompleted_EE75F5AA4723D93C1B9E01B42B8EC2A1
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnCompleted_EE75F5AA4723D93C1B9E01B42B8EC2A1_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnNotifyEnd_29ED4B38410B27C8CC2E3A8CF49C4FFB
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnNotifyEnd_29ED4B38410B27C8CC2E3A8CF49C4FFB_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnNotifyBegin_29ED4B38410B27C8CC2E3A8CF49C4FFB
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnNotifyBegin_29ED4B38410B27C8CC2E3A8CF49C4FFB_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnCancelled_29ED4B38410B27C8CC2E3A8CF49C4FFB
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnCancelled_29ED4B38410B27C8CC2E3A8CF49C4FFB_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnInterrupted_29ED4B38410B27C8CC2E3A8CF49C4FFB
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnInterrupted_29ED4B38410B27C8CC2E3A8CF49C4FFB_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnBlendOut_29ED4B38410B27C8CC2E3A8CF49C4FFB
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnBlendOut_29ED4B38410B27C8CC2E3A8CF49C4FFB_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnCompleted_29ED4B38410B27C8CC2E3A8CF49C4FFB
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnCompleted_29ED4B38410B27C8CC2E3A8CF49C4FFB_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.FailedToSpawn_CE1F20C5494D039F7419C888C89B9BE3
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_FailedToSpawn_CE1F20C5494D039F7419C888C89B9BE3_Params
	{
	public:
		class AOrionProjectile*                                    SpawnedProjectile;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.NotAuthority_CE1F20C5494D039F7419C888C89B9BE3
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_NotAuthority_CE1F20C5494D039F7419C888C89B9BE3_Params
	{
	public:
		class AOrionProjectile*                                    SpawnedProjectile;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.PreSpawned_CE1F20C5494D039F7419C888C89B9BE3
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_PreSpawned_CE1F20C5494D039F7419C888C89B9BE3_Params
	{
	public:
		class AOrionProjectile*                                    SpawnedProjectile;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.Success_CE1F20C5494D039F7419C888C89B9BE3
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_Success_CE1F20C5494D039F7419C888C89B9BE3_Params
	{
	public:
		class AOrionProjectile*                                    SpawnedProjectile;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnNotifyEnd_CEA65A7A483D5251D5519BA8B922DE3B
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnNotifyEnd_CEA65A7A483D5251D5519BA8B922DE3B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnNotifyBegin_CEA65A7A483D5251D5519BA8B922DE3B
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnNotifyBegin_CEA65A7A483D5251D5519BA8B922DE3B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnCancelled_CEA65A7A483D5251D5519BA8B922DE3B
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnCancelled_CEA65A7A483D5251D5519BA8B922DE3B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnInterrupted_CEA65A7A483D5251D5519BA8B922DE3B
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnInterrupted_CEA65A7A483D5251D5519BA8B922DE3B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnBlendOut_CEA65A7A483D5251D5519BA8B922DE3B
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnBlendOut_CEA65A7A483D5251D5519BA8B922DE3B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.OnCompleted_CEA65A7A483D5251D5519BA8B922DE3B
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_OnCompleted_CEA65A7A483D5251D5519BA8B922DE3B_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.K2_ActivateAbility
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Buff_Blue_PrimaryAttack.GA_Buff_Blue_PrimaryAttack_C.ExecuteUbergraph_GA_Buff_Blue_PrimaryAttack
	 */
	struct UGA_Buff_Blue_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Blue_PrimaryAttack_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_3WU7[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
