#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Card_OnKillPlayer_GainShadowPlane.GA_Card_OnKillPlayer_GainShadowPlane_C.OnMinionKill_E8EFD428448A47D1F42967A317E4D98E
	 */
	struct UGA_Card_OnKillPlayer_GainShadowPlane_C_OnMinionKill_E8EFD428448A47D1F42967A317E4D98E_Params
	{
	public:
		int32_t                                                    NewValue;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_8TGV[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              KilledActor;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FGameplayEffectContextHandle                        KillingEffectContext;                                    // 0x0010(0x0018)  (Parm)
	};

	/**
	 * Function GA_Card_OnKillPlayer_GainShadowPlane.GA_Card_OnKillPlayer_GainShadowPlane_C.OnMinionAssist_E8EFD428448A47D1F42967A317E4D98E
	 */
	struct UGA_Card_OnKillPlayer_GainShadowPlane_C_OnMinionAssist_E8EFD428448A47D1F42967A317E4D98E_Params
	{
	public:
		int32_t                                                    NewValue;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_9QMJ[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              KilledActor;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FGameplayEffectContextHandle                        KillingEffectContext;                                    // 0x0010(0x0018)  (Parm)
	};

	/**
	 * Function GA_Card_OnKillPlayer_GainShadowPlane.GA_Card_OnKillPlayer_GainShadowPlane_C.OnPlayerKill_E8EFD428448A47D1F42967A317E4D98E
	 */
	struct UGA_Card_OnKillPlayer_GainShadowPlane_C_OnPlayerKill_E8EFD428448A47D1F42967A317E4D98E_Params
	{
	public:
		int32_t                                                    NewValue;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_AE86[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              KilledActor;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FGameplayEffectContextHandle                        KillingEffectContext;                                    // 0x0010(0x0018)  (Parm)
	};

	/**
	 * Function GA_Card_OnKillPlayer_GainShadowPlane.GA_Card_OnKillPlayer_GainShadowPlane_C.OnPlayerAssist_E8EFD428448A47D1F42967A317E4D98E
	 */
	struct UGA_Card_OnKillPlayer_GainShadowPlane_C_OnPlayerAssist_E8EFD428448A47D1F42967A317E4D98E_Params
	{
	public:
		int32_t                                                    NewValue;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_O78A[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              KilledActor;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FGameplayEffectContextHandle                        KillingEffectContext;                                    // 0x0010(0x0018)  (Parm)
	};

	/**
	 * Function GA_Card_OnKillPlayer_GainShadowPlane.GA_Card_OnKillPlayer_GainShadowPlane_C.K2_ActivateAbility
	 */
	struct UGA_Card_OnKillPlayer_GainShadowPlane_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Card_OnKillPlayer_GainShadowPlane.GA_Card_OnKillPlayer_GainShadowPlane_C.ExecuteUbergraph_GA_Card_OnKillPlayer_GainShadowPlane
	 */
	struct UGA_Card_OnKillPlayer_GainShadowPlane_C_ExecuteUbergraph_GA_Card_OnKillPlayer_GainShadowPlane_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
