#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54
	 */
	struct UGA_JungleBuff_Spawn_C_OnNotifyEnd_0BE4C0FC4CCC7578BADAEC9977A07F54_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54
	 */
	struct UGA_JungleBuff_Spawn_C_OnNotifyBegin_0BE4C0FC4CCC7578BADAEC9977A07F54_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54
	 */
	struct UGA_JungleBuff_Spawn_C_OnCancelled_0BE4C0FC4CCC7578BADAEC9977A07F54_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54
	 */
	struct UGA_JungleBuff_Spawn_C_OnInterrupted_0BE4C0FC4CCC7578BADAEC9977A07F54_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54
	 */
	struct UGA_JungleBuff_Spawn_C_OnBlendOut_0BE4C0FC4CCC7578BADAEC9977A07F54_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54
	 */
	struct UGA_JungleBuff_Spawn_C_OnCompleted_0BE4C0FC4CCC7578BADAEC9977A07F54_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnMoveFinished_2F7A4269458C8A6D89B9DA864896061E
	 */
	struct UGA_JungleBuff_Spawn_C_OnMoveFinished_2F7A4269458C8A6D89B9DA864896061E_Params
	{
	public:
		EPathFollowingResult                                       Result;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.OnRequestFailed_2F7A4269458C8A6D89B9DA864896061E
	 */
	struct UGA_JungleBuff_Spawn_C_OnRequestFailed_2F7A4269458C8A6D89B9DA864896061E_Params
	{	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.Added_4BDC7B19421FA58FBC04CDB13E98D0B4
	 */
	struct UGA_JungleBuff_Spawn_C_Added_4BDC7B19421FA58FBC04CDB13E98D0B4_Params
	{	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.K2_ActivateAbility
	 */
	struct UGA_JungleBuff_Spawn_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_JungleBuff_Spawn.GA_JungleBuff_Spawn_C.ExecuteUbergraph_GA_JungleBuff_Spawn
	 */
	struct UGA_JungleBuff_Spawn_C_ExecuteUbergraph_GA_JungleBuff_Spawn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_43QH[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
