#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnCancelled_D9C1AA114193BD9693342FB0EFB53450
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_OnCancelled_D9C1AA114193BD9693342FB0EFB53450_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnInterrupted_D9C1AA114193BD9693342FB0EFB53450
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_OnInterrupted_D9C1AA114193BD9693342FB0EFB53450_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnBlendOut_D9C1AA114193BD9693342FB0EFB53450
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_OnBlendOut_D9C1AA114193BD9693342FB0EFB53450_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnCompleted_D9C1AA114193BD9693342FB0EFB53450
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_OnCompleted_D9C1AA114193BD9693342FB0EFB53450_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.FailedToSpawn_872DC5B445DB407423B939A03225AC56
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_FailedToSpawn_872DC5B445DB407423B939A03225AC56_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.NotAuthority_872DC5B445DB407423B939A03225AC56
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_NotAuthority_872DC5B445DB407423B939A03225AC56_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.Success_872DC5B445DB407423B939A03225AC56
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_Success_872DC5B445DB407423B939A03225AC56_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.K2_ActivateAbility
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack
	 */
	struct UGA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_2G8N[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
