#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function HaveEpicAccountScreen.HaveEpicAccountScreen_C.BndEvt__YesButton_K2Node_ComponentBoundEvent_483_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UHaveEpicAccountScreen_C_BndEvt__YesButton_K2Node_ComponentBoundEvent_483_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HaveEpicAccountScreen.HaveEpicAccountScreen_C.BndEvt__NoButton_K2Node_ComponentBoundEvent_506_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UHaveEpicAccountScreen_C_BndEvt__NoButton_K2Node_ComponentBoundEvent_506_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HaveEpicAccountScreen.HaveEpicAccountScreen_C.NavigateBack
	 */
	struct UHaveEpicAccountScreen_C_NavigateBack_Params
	{	};

	/**
	 * Function HaveEpicAccountScreen.HaveEpicAccountScreen_C.BndEvt__SignUpButton_K2Node_ComponentBoundEvent_131_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UHaveEpicAccountScreen_C_BndEvt__SignUpButton_K2Node_ComponentBoundEvent_131_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HaveEpicAccountScreen.HaveEpicAccountScreen_C.ExecuteUbergraph_HaveEpicAccountScreen
	 */
	struct UHaveEpicAccountScreen_C_ExecuteUbergraph_HaveEpicAccountScreen_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HDQ7[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
