#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetTowerTakedowns
	 */
	struct UOrionGameplayStatsLibrary_GetTowerTakedowns_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       bUseTrackedStat;                                         // 0x0068(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_6N6A[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x006C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetTotalKills
	 */
	struct UOrionGameplayStatsLibrary_GetTotalKills_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       bUseTrackedStat;                                         // 0x0068(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_C6S0[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x006C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetTotalDeaths
	 */
	struct UOrionGameplayStatsLibrary_GetTotalDeaths_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       bUseTrackedStat;                                         // 0x0068(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_P0HQ[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x006C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetTotalAssists
	 */
	struct UOrionGameplayStatsLibrary_GetTotalAssists_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       bUseTrackedStat;                                         // 0x0068(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_ZL7X[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x006C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetPersistentStatValue
	 */
	struct UOrionGameplayStatsLibrary_GetPersistentStatValue_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              StatName;                                                // 0x0068(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0078(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetMatchStatValue
	 */
	struct UOrionGameplayStatsLibrary_GetMatchStatValue_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FName                                                StatName;                                                // 0x0068(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionStatTrackType                                        TrackType;                                               // 0x0070(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_PMIP[0x3];                                   // 0x0071(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0074(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetInhibitorTakedowns
	 */
	struct UOrionGameplayStatsLibrary_GetInhibitorTakedowns_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       bUseTrackedStat;                                         // 0x0068(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_WQWI[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x006C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetHeroTakedowns
	 */
	struct UOrionGameplayStatsLibrary_GetHeroTakedowns_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       bUseTrackedStat;                                         // 0x0068(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_9RJL[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x006C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetHarvesterTakedowns
	 */
	struct UOrionGameplayStatsLibrary_GetHarvesterTakedowns_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       bUseTrackedStat;                                         // 0x0068(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_Q7H3[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x006C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameplayStatsLibrary.GetCoreTakedowns
	 */
	struct UOrionGameplayStatsLibrary_GetCoreTakedowns_Params
	{
	public:
		struct FGameplayStats                                      GameplayStats;                                           // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       bUseTrackedStat;                                         // 0x0068(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_HJ3J[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x006C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpItemDefinition.GetPersistentName
	 */
	struct UOrionMcpItemDefinition_GetPersistentName_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpItemDefinition.GetIconMaterial
	 */
	struct UOrionMcpItemDefinition_GetIconMaterial_Params
	{
	public:
		class UMaterialInterface*                                  ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpItemDefinition.GetIconAsset
	 */
	struct UOrionMcpItemDefinition_GetIconAsset_Params
	{
	public:
		TAssetPtr<class UObject>                                   ReturnValue;                                             // 0x0000(0x001C)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpItemDefinition.GetIcon
	 */
	struct UOrionMcpItemDefinition_GetIcon_Params
	{
	public:
		class UTexture2D*                                          ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpItemDefinition.GetCustomStoreContentWidget
	 */
	struct UOrionMcpItemDefinition_GetCustomStoreContentWidget_Params
	{
	public:
		class UClass*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionCardInstanceUtils.CardData
	 */
	struct UOrionCardInstanceUtils_CardData_Params
	{
	public:
		struct FOrionCardInstance                                  Card;                                                    // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class UOrionCardData*                                      ReturnValue;                                             // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionCardInstanceUtils.CardActor
	 */
	struct UOrionCardInstanceUtils_CardActor_Params
	{
	public:
		struct FOrionCardInstance                                  Card;                                                    // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class AOrionCard*                                          ReturnValue;                                             // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction OrionGame.OrionMcpItem.OnOrionMcpItemAttributeChanged__DelegateSignature
	 */
	struct UOrionMcpItem_OnOrionMcpItemAttributeChanged__DelegateSignature_Params
	{	};

	/**
	 * Function OrionGame.OrionMcpItem.GetType
	 */
	struct UOrionMcpItem_GetType_Params
	{
	public:
		EOrionItemType                                             ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpItem.GetNumInStack
	 */
	struct UOrionMcpItem_GetNumInStack_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpItem.GetDisplayName
	 */
	struct UOrionMcpItem_GetDisplayName_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpItem.GetDescription
	 */
	struct UOrionMcpItem_GetDescription_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpCardItem.GetInternalData
	 */
	struct UOrionMcpCardItem_GetInternalData_Params
	{
	public:
		class UOrionCardData*                                      ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerItemDefinition.GetStaticMesh
	 */
	struct UOrionMcpBannerItemDefinition_GetStaticMesh_Params
	{
	public:
		class UStaticMesh*                                         ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerItemDefinition.GetSockets
	 */
	struct UOrionMcpBannerItemDefinition_GetSockets_Params
	{
	public:
		TArray<struct FBannerSocketEntry>                          ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerItemDefinition.GetFXSound
	 */
	struct UOrionMcpBannerItemDefinition_GetFXSound_Params
	{
	public:
		class USoundBase*                                          ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerItemDefinition.GetFXParticle
	 */
	struct UOrionMcpBannerItemDefinition_GetFXParticle_Params
	{
	public:
		class UParticleSystem*                                     ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerItemDefinition.GetFXMaterial
	 */
	struct UOrionMcpBannerItemDefinition_GetFXMaterial_Params
	{
	public:
		class UMaterialInterface*                                  ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerItemDefinition.GetDecalSize
	 */
	struct UOrionMcpBannerItemDefinition_GetDecalSize_Params
	{
	public:
		struct FVector                                             ReturnValue;                                             // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerItemDefinition.GetBannerType
	 */
	struct UOrionMcpBannerItemDefinition_GetBannerType_Params
	{
	public:
		EOrionBannerType                                           ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerItemDefinition.GetAttachToParent
	 */
	struct UOrionMcpBannerItemDefinition_GetAttachToParent_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerAlterationItemDefinition.GetTexture
	 */
	struct UOrionMcpBannerAlterationItemDefinition_GetTexture_Params
	{
	public:
		class UTexture*                                            ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerAlterationItemDefinition.GetNormal
	 */
	struct UOrionMcpBannerAlterationItemDefinition_GetNormal_Params
	{
	public:
		class UTexture*                                            ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerAlterationItemDefinition.GetDiffuse
	 */
	struct UOrionMcpBannerAlterationItemDefinition_GetDiffuse_Params
	{
	public:
		class UTexture*                                            ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerAlterationItemDefinition.GetBannerMaterialDesc
	 */
	struct UOrionMcpBannerAlterationItemDefinition_GetBannerMaterialDesc_Params
	{
	public:
		struct FBannerMaterialDesc                                 ReturnValue;                                             // 0x0000(0x00C0)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerItem.GetInternalData
	 */
	struct UOrionMcpBannerItem_GetInternalData_Params
	{
	public:
		class UOrionMcpBannerItemDefinition*                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBannerAlterationItem.GetInternalData
	 */
	struct UOrionMcpBannerAlterationItem_GetInternalData_Params
	{
	public:
		class UOrionMcpBannerAlterationItemDefinition*             ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpBoostItem.GetInternalData
	 */
	struct UOrionMcpBoostItem_GetInternalData_Params
	{
	public:
		class UOrionBoostItemDefinition*                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpCardPackItemDefinition.GetExplicitCards
	 */
	struct UOrionMcpCardPackItemDefinition_GetExplicitCards_Params
	{
	public:
		TArray<class UOrionCardData*>                              Cards;                                                   // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpCardPackItem.GetInternalData
	 */
	struct UOrionMcpCardPackItem_GetInternalData_Params
	{
	public:
		class UOrionMcpCardPackItemDefinition*                     ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpComponentItem.GetInternalData
	 */
	struct UOrionMcpComponentItem_GetInternalData_Params
	{
	public:
		class UOrionComponentItemDefinition*                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionSkinItemDefinition.GetSkelMesh
	 */
	struct UOrionSkinItemDefinition_GetSkelMesh_Params
	{
	public:
		class USkeletalMesh*                                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionSkinItemDefinition.GetPawnClassOverride
	 */
	struct UOrionSkinItemDefinition_GetPawnClassOverride_Params
	{
	public:
		class UClass*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionSkinItemDefinition.GetAnimInstanceClass
	 */
	struct UOrionSkinItemDefinition_GetAnimInstanceClass_Params
	{
	public:
		class UClass*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionSkinItemDefinition.BP_GetMaterials
	 */
	struct UOrionSkinItemDefinition_BP_GetMaterials_Params
	{
	public:
		TArray<class UMaterialInterface*>                          ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionEmoteItemDefinition.GetAnimMontage
	 */
	struct UOrionEmoteItemDefinition_GetAnimMontage_Params
	{
	public:
		class UOrionSkinItemDefinition*                            SkinItemDefinition;                                      // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UAnimMontage*                                        ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpEmoteItem.GetInternalData
	 */
	struct UOrionMcpEmoteItem_GetInternalData_Params
	{
	public:
		class UOrionEmoteItemDefinition*                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpGiftBoxItem.GetInternalData
	 */
	struct UOrionMcpGiftBoxItem_GetInternalData_Params
	{
	public:
		class UOrionMcpGiftBoxItemDefinition*                      ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpGlyphItemDefinition.GetMesh
	 */
	struct UOrionMcpGlyphItemDefinition_GetMesh_Params
	{
	public:
		class UStaticMesh*                                         ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpGlyphItemDefinition.GetMaterial
	 */
	struct UOrionMcpGlyphItemDefinition_GetMaterial_Params
	{
	public:
		class UMaterialInterface*                                  ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionMcpGlyphItem.GetInternalData
	 */
	struct UOrionMcpGlyphItem_GetInternalData_Params
	{
	public:
		class UOrionMcpGlyphItemDefinition*                        ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionTeamActorInterface.OnTeamChanged
	 */
	struct UOrionTeamActorInterface_OnTeamChanged_Params
	{
	public:
		EOrionTeam                                                 NewTeamIdx;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionTeamActorInterface.GetTeamNum
	 */
	struct UOrionTeamActorInterface_GetTeamNum_Params
	{
	public:
		EOrionTeam                                                 ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.UpdateOccludedVision
	 */
	struct UOrionAimTargetInterface_UpdateOccludedVision_Params
	{
	public:
		bool                                                       bShouldShowWhenOccluded;                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.ShouldIgnoreCollisionWithTeam
	 */
	struct UOrionAimTargetInterface_ShouldIgnoreCollisionWithTeam_Params
	{
	public:
		EOrionTeam                                                 Team;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bPassedFilter;                                           // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0002(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.RemoveShadowPlaneMaterials
	 */
	struct UOrionAimTargetInterface_RemoveShadowPlaneMaterials_Params
	{	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.IsValidDirectHit
	 */
	struct UOrionAimTargetInterface_IsValidDirectHit_Params
	{
	public:
		struct FHitResult                                          HitResult;                                               // 0x0000(0x0088)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0088(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.IsTargetable
	 */
	struct UOrionAimTargetInterface_IsTargetable_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.GetTargetingLocation
	 */
	struct UOrionAimTargetInterface_GetTargetingLocation_Params
	{
	public:
		struct FVector                                             OutPosition;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.GetNumberPopLocation
	 */
	struct UOrionAimTargetInterface_GetNumberPopLocation_Params
	{
	public:
		struct FVector                                             HitLocation;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FVector                                             ReturnValue;                                             // 0x000C(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.GetMyTargetType
	 */
	struct UOrionAimTargetInterface_GetMyTargetType_Params
	{
	public:
		EOrionTargetType                                           ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.GetAimTargetSensingLocation
	 */
	struct UOrionAimTargetInterface_GetAimTargetSensingLocation_Params
	{
	public:
		struct FVector                                             AimPosition;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.GetAimTargetExtent
	 */
	struct UOrionAimTargetInterface_GetAimTargetExtent_Params
	{
	public:
		struct FVector                                             Center;                                                  // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		float                                                      Width;                                                   // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Height;                                                  // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.CanSee
	 */
	struct UOrionAimTargetInterface_CanSee_Params
	{
	public:
		class AActor*                                              TargetActor;                                             // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionVisionType                                           ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.CanBeHitWhileInShadowPlane
	 */
	struct UOrionAimTargetInterface_CanBeHitWhileInShadowPlane_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAimTargetInterface.ApplyShadowPlaneMaterials
	 */
	struct UOrionAimTargetInterface_ApplyShadowPlaneMaterials_Params
	{	};

	/**
	 * Function OrionGame.OrionBaseActor.SetVisionRules
	 */
	struct AOrionBaseActor_SetVisionRules_Params
	{
	public:
		EOrionVisionIndividualRules                                NewType;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionBaseActor.SetupTeamColors
	 */
	struct AOrionBaseActor_SetupTeamColors_Params
	{
	public:
		bool                                                       bIsDead;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionBaseActor.PlaySoundTeamAdjustedForSelf
	 */
	struct AOrionBaseActor_PlaySoundTeamAdjustedForSelf_Params
	{
	public:
		class USoundBase*                                          SoundToPlay;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       Attached;                                                // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bStopWhenAttachedToDestroyed;                            // 0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_IDB6[0x6];                                   // 0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UAudioComponent*                                     ReturnValue;                                             // 0x0010(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionBaseActor.OnRep_VisibleToEnemy
	 */
	struct AOrionBaseActor_OnRep_VisibleToEnemy_Params
	{
	public:
		struct FOrionReplicatedVisibleToEnemy                      OldValue;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionBaseActor.OnRep_TeamNum
	 */
	struct AOrionBaseActor_OnRep_TeamNum_Params
	{
	public:
		EOrionTeam                                                 OldTeamNum;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionBaseActor.OnRep_ReplicatedVisionData
	 */
	struct AOrionBaseActor_OnRep_ReplicatedVisionData_Params
	{
	public:
		struct FOrionReplicatedVisionData                          OldData;                                                 // 0x0000(0x0004)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionBaseActor.OnRemovedTracked
	 */
	struct AOrionBaseActor_OnRemovedTracked_Params
	{
	public:
		class UOrionAbilitySystemComponent*                        AbilityComponent;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionBaseActor.NotifyTeamChanged
	 */
	struct AOrionBaseActor_NotifyTeamChanged_Params
	{
	public:
		EOrionTeam                                                 NewTeamIdx;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionBaseActor.GetTeamNum
	 */
	struct AOrionBaseActor_GetTeamNum_Params
	{
	public:
		EOrionTeam                                                 ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionBaseActor.ExecuteGameplayCueLocal
	 */
	struct AOrionBaseActor_ExecuteGameplayCueLocal_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (Parm, NativeAccessSpecifierPublic)
		struct FGameplayCueParameters                              Parameters;                                              // 0x0008(0x00B8)  (Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableActor.OnRep_Dying
	 */
	struct AOrionDamageableActor_OnRep_Dying_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableActor.OnDeath
	 */
	struct AOrionDamageableActor_OnDeath_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableActor.OnDamageTaken
	 */
	struct AOrionDamageableActor_OnDamageTaken_Params
	{
	public:
		float                                                      Damage;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_3USZ[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              DamageInstigator;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableActor.MakeGameplayCueParameters
	 */
	struct AOrionDamageableActor_MakeGameplayCueParameters_Params
	{
	public:
		struct FGameplayCueParameters                              ReturnValue;                                             // 0x0000(0x00B8)  (Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableActor.K2_RemoveGameplayCue
	 */
	struct AOrionDamageableActor_K2_RemoveGameplayCue_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableActor.K2_ExecuteGameplayCue
	 */
	struct AOrionDamageableActor_K2_ExecuteGameplayCue_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (Parm, NativeAccessSpecifierPublic)
		struct FGameplayCueParameters                              Parameters;                                              // 0x0008(0x00B8)  (Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableActor.K2_AddGameplayCue
	 */
	struct AOrionDamageableActor_K2_AddGameplayCue_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableActor.GetMaxHealth
	 */
	struct AOrionDamageableActor_GetMaxHealth_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableActor.GetHealthPercent
	 */
	struct AOrionDamageableActor_GetHealthPercent_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableActor.GetHealth
	 */
	struct AOrionDamageableActor_GetHealth_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableActor.CustomMatch_RemoveOnDeath
	 */
	struct AOrionDamageableActor_CustomMatch_RemoveOnDeath_Params
	{
	public:
		struct FActiveGameplayEffect                               Effect;                                                  // 0x0000(0x0400)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0400(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.UpdateTargeting
	 */
	struct AOrionDamageableObjective_Base_UpdateTargeting_Params
	{
	public:
		bool                                                       bInIgnoreHeight;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.TargetStartOverlap
	 */
	struct AOrionDamageableObjective_Base_TargetStartOverlap_Params
	{
	public:
		class AActor*                                              SelfActor;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.TargetEndOverlap
	 */
	struct AOrionDamageableObjective_Base_TargetEndOverlap_Params
	{
	public:
		class AActor*                                              SelfActor;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.TargetAcquired
	 */
	struct AOrionDamageableObjective_Base_TargetAcquired_Params
	{
	public:
		class AActor*                                              NewTarget;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.SetTargetingBeamComp
	 */
	struct AOrionDamageableObjective_Base_SetTargetingBeamComp_Params
	{
	public:
		class UParticleSystemComponent*                            InTargetingBeam;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.SetCurrentTarget
	 */
	struct AOrionDamageableObjective_Base_SetCurrentTarget_Params
	{
	public:
		class AActor*                                              InNewTarget;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.ReviveSelf
	 */
	struct AOrionDamageableObjective_Base_ReviveSelf_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.OnSelfRevive
	 */
	struct AOrionDamageableObjective_Base_OnSelfRevive_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.OnRep_TargetingVolume
	 */
	struct AOrionDamageableObjective_Base_OnRep_TargetingVolume_Params
	{
	public:
		class AVolume*                                             OldTargetingVolume;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.OnRep_ObjectiveVulnerable
	 */
	struct AOrionDamageableObjective_Base_OnRep_ObjectiveVulnerable_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.OnRep_MatchHasStarted
	 */
	struct AOrionDamageableObjective_Base_OnRep_MatchHasStarted_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.OnRep_Dying
	 */
	struct AOrionDamageableObjective_Base_OnRep_Dying_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.ObjectiveStartUp
	 */
	struct AOrionDamageableObjective_Base_ObjectiveStartUp_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.LostCurrentTarget
	 */
	struct AOrionDamageableObjective_Base_LostCurrentTarget_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.HandleMatchStarted
	 */
	struct AOrionDamageableObjective_Base_HandleMatchStarted_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.HandleMatchEnded
	 */
	struct AOrionDamageableObjective_Base_HandleMatchEnded_Params
	{	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.HandleCallForHelp
	 */
	struct AOrionDamageableObjective_Base_HandleCallForHelp_Params
	{
	public:
		class AActor*                                              DamagedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              AttackingActor;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayEffectSpec                                 EffectSpec;                                              // 0x0010(0x0248)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetTargetsToAttack
	 */
	struct AOrionDamageableObjective_Base_GetTargetsToAttack_Params
	{
	public:
		TArray<class AActor*>                                      OutTargetArray;                                          // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetTargetingTime
	 */
	struct AOrionDamageableObjective_Base_GetTargetingTime_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetReviveSelfTimer
	 */
	struct AOrionDamageableObjective_Base_GetReviveSelfTimer_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetNumberOfTargetsToAttack
	 */
	struct AOrionDamageableObjective_Base_GetNumberOfTargetsToAttack_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetNumberOfTargetedMinions
	 */
	struct AOrionDamageableObjective_Base_GetNumberOfTargetedMinions_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetCurrentTarget
	 */
	struct AOrionDamageableObjective_Base_GetCurrentTarget_Params
	{
	public:
		class AActor*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetBaseAttackingSocketName
	 */
	struct AOrionDamageableObjective_Base_GetBaseAttackingSocketName_Params
	{
	public:
		class FName                                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetBaseAttackingMesh
	 */
	struct AOrionDamageableObjective_Base_GetBaseAttackingMesh_Params
	{
	public:
		class UMeshComponent*                                      ReturnValue;                                             // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetAttackSpeed
	 */
	struct AOrionDamageableObjective_Base_GetAttackSpeed_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetAttackRadius
	 */
	struct AOrionDamageableObjective_Base_GetAttackRadius_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetAttackHeight
	 */
	struct AOrionDamageableObjective_Base_GetAttackHeight_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.GetAllValidTargets
	 */
	struct AOrionDamageableObjective_Base_GetAllValidTargets_Params
	{
	public:
		TArray<class AActor*>                                      OutTargetArray;                                          // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		bool                                                       bInIgnoreHeight;                                         // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.CanTargetActor
	 */
	struct AOrionDamageableObjective_Base_CanTargetActor_Params
	{
	public:
		class AActor*                                              InTarget;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bInIgnoreHeight;                                         // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionDamageableObjective_Base.ApplyBackDoorProtection
	 */
	struct AOrionDamageableObjective_Base_ApplyBackDoorProtection_Params
	{	};

	/**
	 * Function OrionGame.OrionAISystem.OnMatchStarted
	 */
	struct UOrionAISystem_OnMatchStarted_Params
	{	};

	/**
	 * Function OrionGame.OrionAISystem.OnMatchEnded
	 */
	struct UOrionAISystem_OnMatchEnded_Params
	{	};

	/**
	 * Function OrionGame.OrionAIInfluenceMapManager.OnNavDataGenerationFinished
	 */
	struct AOrionAIInfluenceMapManager_OnNavDataGenerationFinished_Params
	{
	public:
		class ANavigationData*                                     NavData;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGravesite.OnRep_GravesiteActivation
	 */
	struct AOrionGravesite_OnRep_GravesiteActivation_Params
	{	};

	/**
	 * Function OrionGame.OrionGravesite.GetTeamNum
	 */
	struct AOrionGravesite_GetTeamNum_Params
	{
	public:
		EOrionTeam                                                 ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGravesite.FadeOut
	 */
	struct AOrionGravesite_FadeOut_Params
	{
	public:
		bool                                                       bBrightenFirst;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGravesite.ActivateGravesite
	 */
	struct AOrionGravesite_ActivateGravesite_Params
	{
	public:
		struct FVector                                             Pos;                                                     // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FVector                                             TriggerPos;                                              // 0x000C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionProjectileMovementComponent.StopSimulating
	 */
	struct UOrionProjectileMovementComponent_StopSimulating_Params
	{
	public:
		struct FHitResult                                          HitResult;                                               // 0x0000(0x0088)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionProjectileMovementComponent.SetVelocityInLocalSpace
	 */
	struct UOrionProjectileMovementComponent_SetVelocityInLocalSpace_Params
	{
	public:
		struct FVector                                             NewVelocity;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction OrionGame.OrionProjectileMovementComponent.OnOrionProjectileStopDelegate__DelegateSignature
	 */
	struct UOrionProjectileMovementComponent_OnOrionProjectileStopDelegate__DelegateSignature_Params
	{
	public:
		struct FHitResult                                          ImpactResult;                                            // 0x0000(0x0088)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction OrionGame.OrionProjectileMovementComponent.OnOrionProjectileMaxRangeDelegate__DelegateSignature
	 */
	struct UOrionProjectileMovementComponent_OnOrionProjectileMaxRangeDelegate__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction OrionGame.OrionProjectileMovementComponent.OnOrionProjectileBounceDelegate__DelegateSignature
	 */
	struct UOrionProjectileMovementComponent_OnOrionProjectileBounceDelegate__DelegateSignature_Params
	{
	public:
