#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	struct FStoreOfferBP
	{
	public:
		unsigned char                                              UnknownData_85KW[0x120];
	};

	struct FDeckOutline
	{
	public:
		unsigned char                                              UnknownData_85KW[0xB0];
	};
	
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class OrionGame.OrionAbilitySet
	 * Size -> 0x0030 (FullSize[0x0058] - InheritedSize[0x0028])
	 */
	class UOrionAbilitySet : public UDataAsset
	{
	public:
		TArray<struct FOrionAbilityBindInfo>                       KeyBinding;                                              // 0x0028(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class UGameplayEffect*>                             PassiveGameplayEffects;                                  // 0x0038(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      PassiveGameplayEffectClasses;                            // 0x0048(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionTypes
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UOrionTypes : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionTextObject
	 * Size -> 0x0018 (FullSize[0x0040] - InheritedSize[0x0028])
	 */
	class UOrionTextObject : public UObject
	{
	public:
		class FText                                                Label;                                                   // 0x0028(0x0018) BlueprintVisible, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionGameplayStatsLibrary
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UOrionGameplayStatsLibrary : public UBlueprintFunctionLibrary
	{
	public:
		int32_t STATIC_GetTowerTakedowns(const struct FGameplayStats& GameplayStats, bool bUseTrackedStat);
		int32_t STATIC_GetTotalKills(const struct FGameplayStats& GameplayStats, bool bUseTrackedStat);
		int32_t STATIC_GetTotalDeaths(const struct FGameplayStats& GameplayStats, bool bUseTrackedStat);
		int32_t STATIC_GetTotalAssists(const struct FGameplayStats& GameplayStats, bool bUseTrackedStat);
		int32_t STATIC_GetPersistentStatValue(const struct FGameplayStats& GameplayStats, const class FString& StatName);
		int32_t STATIC_GetMatchStatValue(const struct FGameplayStats& GameplayStats, const class FName& StatName, EOrionStatTrackType TrackType);
		int32_t STATIC_GetInhibitorTakedowns(const struct FGameplayStats& GameplayStats, bool bUseTrackedStat);
		int32_t STATIC_GetHeroTakedowns(const struct FGameplayStats& GameplayStats, bool bUseTrackedStat);
		int32_t STATIC_GetHarvesterTakedowns(const struct FGameplayStats& GameplayStats, bool bUseTrackedStat);
		int32_t STATIC_GetCoreTakedowns(const struct FGameplayStats& GameplayStats, bool bUseTrackedStat);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.SimpleAchievementDescriptions
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	class USimpleAchievementDescriptions : public UDataAsset
	{
	public:
		TArray<struct FSimpleAchievementDescription>               AchievementDescriptions;                                 // 0x0028(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpItemDefinition
	 * Size -> 0x00B0 (FullSize[0x00D8] - InheritedSize[0x0028])
	 */
	class UOrionMcpItemDefinition : public UMcpItemDefinitionBase
	{
	public:
		unsigned char                                              UnknownData_HD3W[0x18];                                  // 0x0028(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EOrionItemType                                             ItemType;                                                // 0x0040(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_85KW[0x7];                                   // 0x0041(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                ItemDisplayName;                                         // 0x0048(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected
		class FText                                                ItemDisplayDescription;                                  // 0x0060(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		class FText                                                DisplayNamePrefix;                                       // 0x0078(0x0018) Protected, NativeAccessSpecifierProtected
		TAssetPtr<class UObject>                                   ItemDisplayAsset;                                        // 0x0090(0x001C) ELEMENT_SIZE_MISMATCH Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_A5TT[0x4];                                   // 0x00AC(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		class UClass*                                              CustomStoreContentWidget;                                // 0x00B0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bAllowMultipleStacks : 1;                                // 0x00B8(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_NSGU[0x3];                                   // 0x00B9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    MaxStackSize;                                            // 0x00BC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_BYYP[0x10];                                  // 0x00C0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    LoadedGameplayCueNotifyHandle;                           // 0x00D0(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    LoadedFrontEndGameplayCueNotifyHandle;                   // 0x00D4(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		class FString GetPersistentName();
		class UMaterialInterface* GetIconMaterial();
		TAssetPtr<class UObject> GetIconAsset();
		class UTexture2D* GetIcon();
		class UClass* GetCustomStoreContentWidget();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionSimpleMcpItemDefinition
	 * Size -> 0x0018 (FullSize[0x00F0] - InheritedSize[0x00D8])
	 */
	class UOrionSimpleMcpItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		bool                                                       bManuallyDefinedJson;                                    // 0x00D8(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BWKW[0x7];                                   // 0x00D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              TemplateId;                                              // 0x00E0(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpCuratedDeckItemDefinition
	 * Size -> 0x00D0 (FullSize[0x01A8] - InheritedSize[0x00D8])
	 */
	class UOrionMcpCuratedDeckItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		TArray<class UOrionCardData*>                              Cards;                                                   // 0x00D8(0x0010) ZeroConstructor, Deprecated, Protected, NativeAccessSpecifierProtected
		TArray<struct FCuratedCardGroup>                           TopLevelCards;                                           // 0x00E8(0x0010) ZeroConstructor, Deprecated, Protected, NativeAccessSpecifierProtected
		struct FGameplayTagContainer                               RequiredTags;                                            // 0x00F8(0x0020) Edit, Protected, NativeAccessSpecifierProtected
		struct FGuid                                               CuratedDeckGuid;                                         // 0x0118(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FOrionMcpCuratedDeck                                CuratedCards;                                            // 0x0128(0x0060) Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		TAssetPtr<class UOrionMcpTokenItemDefinition>              UnlockTokenPtr;                                          // 0x0188(0x001C) ELEMENT_SIZE_MISMATCH Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_Y1W7[0x4];                                   // 0x01A4(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpTokenItemDefinition
	 * Size -> 0x0058 (FullSize[0x0130] - InheritedSize[0x00D8])
	 */
	class UOrionMcpTokenItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		bool                                                       bIsReward;                                               // 0x00D8(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_8LXD[0x7];                                   // 0x00D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<TAssetPtr<class UOrionMcpItemDefinition>>           Substitutions;                                           // 0x00E0(0x0010) Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected
		TAssetPtr<class UOrionMcpItemDefinition>                   EquivalencyType;                                         // 0x00F0(0x001C) ELEMENT_SIZE_MISMATCH Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_1H91[0x4];                                   // 0x010C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		int32_t                                                    EquivalencyQuantity;                                     // 0x0110(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_HDYV[0x4];                                   // 0x0114(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              PersistentNameOverride;                                  // 0x0118(0x0010) Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bMakeNewItemNotification;                                // 0x0128(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_VJN1[0x7];                                   // 0x0129(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionCardInstanceUtils
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UOrionCardInstanceUtils : public UBlueprintFunctionLibrary
	{
	public:
		class UOrionCardData* STATIC_CardData(const struct FOrionCardInstance& Card);
		class AOrionCard* STATIC_CardActor(const struct FOrionCardInstance& Card);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionCardData
	 * Size -> 0x0088 (FullSize[0x0160] - InheritedSize[0x00D8])
	 */
	class UOrionCardData : public UOrionMcpItemDefinition
	{
	public:
		class UClass*                                              CardClass;                                               // 0x00D8(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Cost;                                                    // 0x00E0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KDDX[0x4];                                   // 0x00E4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      PassiveGameplayEffectClasses;                            // 0x00E8(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TArray<struct FOrionCardGameplayEffectData>                GameplayEffects;                                         // 0x00F8(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       ReplenishAtBase;                                         // 0x0108(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		EOrionCardSlottypes                                        CardSlotType;                                            // 0x0109(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EOrionCardRarity                                           CardRarity;                                              // 0x010A(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1MIO[0x1];                                   // 0x010B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    CardUpgradeSlots;                                        // 0x010C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FOrionAffinityStruct                                Affinities;                                              // 0x0110(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		bool                                                       bIsInfiniteCard;                                         // 0x0114(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bShowInUI;                                               // 0x0115(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bPlayEnabled;                                            // 0x0116(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FC6B[0x1];                                   // 0x0117(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TAssetPtr<class UOrionMcpTokenItemDefinition>              UnlockTokenPtr;                                          // 0x0118(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GFQ8[0x4];                                   // 0x0134(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		class FName                                                UnlockToken;                                             // 0x0138(0x0008) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                DesignCommentary;                                        // 0x0140(0x0018) Edit, NativeAccessSpecifierPublic
		EOrionCardType                                             CalculatedCardType;                                      // 0x0158(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EOrionCardType                                             OverrideCardType;                                        // 0x0159(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_5QEB[0x6];                                   // 0x015A(0x0006) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpItem
	 * Size -> 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
	 */
	class UOrionMcpItem : public UObject
	{
	public:
		unsigned char                                              UnknownData_YSG4[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UOrionMcpItemDefinition*                             ItemDefinition;                                          // 0x0030(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FString                                              InstanceId;                                              // 0x0038(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FString                                              TemplateId;                                              // 0x0048(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    Quantity;                                                // 0x0058(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_TDOE[0x4];                                   // 0x005C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnOrionMcpItemAttributeChanged;                          // 0x0060(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_UOTC[0x8];                                   // 0x0070(0x0008) MISSED OFFSET (PADDING)

	public:
		void OnOrionMcpItemAttributeChanged__DelegateSignature();
		EOrionItemType GetType();
		int32_t GetNumInStack();
		class FText GetDisplayName();
		class FText GetDescription();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpCardItem
	 * Size -> 0x0008 (FullSize[0x0080] - InheritedSize[0x0078])
	 */
	class UOrionMcpCardItem : public UOrionMcpItem
	{
	public:
		int32_t                                                    Tier;                                                    // 0x0078(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_WBEU[0x4];                                   // 0x007C(0x0004) MISSED OFFSET (PADDING)

	public:
		class UOrionCardData* GetInternalData();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionDeckItemDefinition
	 * Size -> 0x0000 (FullSize[0x00D8] - InheritedSize[0x00D8])
	 */
	class UOrionDeckItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpDeckItem
	 * Size -> 0x00F0 (FullSize[0x0168] - InheritedSize[0x0078])
	 */
	class UOrionMcpDeckItem : public UOrionMcpItem
	{
	public:
		class FText                                                Name;                                                    // 0x0078(0x0018) BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TArray<class FString>                                      Affinities;                                              // 0x0090(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		struct FOrionAffinityStruct                                AffinityStruct;                                          // 0x00A0(0x0004) BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CM4X[0x4];                                   // 0x00A4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FUserCreatedDeck                                    Details;                                                 // 0x00A8(0x0010) BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TArray<struct FCuratedCardGroup>                           CuratedDeckCards;                                        // 0x00B8(0x0010) ZeroConstructor, Deprecated, NativeAccessSpecifierPublic
		bool                                                       bLocked;                                                 // 0x00C8(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bCreateNew;                                              // 0x00C9(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PJD3[0x6];                                   // 0x00CA(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                UnlockToken;                                             // 0x00D0(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              HeroName;                                                // 0x00D8(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FOrionMcpCuratedDeck                                CuratedCards;                                            // 0x00E8(0x0060) NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               RequiredTags;                                            // 0x0148(0x0020) NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpProfile
	 * Size -> 0x0000 (FullSize[0x02C0] - InheritedSize[0x02C0])
	 */
	class UOrionMcpProfile : public UMcpProfile
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpBannerItemDefinition
	 * Size -> 0x00E0 (FullSize[0x01B8] - InheritedSize[0x00D8])
	 */
	class UOrionMcpBannerItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		EOrionBannerType                                           BannerType;                                              // 0x00D8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FQNG[0x7];                                   // 0x00D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TAssetPtr<class UStaticMesh>                               StaticMesh;                                              // 0x00E0(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DGHZ[0x4];                                   // 0x00FC(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TArray<struct FBannerSocketEntry>                          Sockets;                                                 // 0x0100(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TAssetPtr<class USoundBase>                                FXSound;                                                 // 0x0110(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AL1V[0x4];                                   // 0x012C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UMaterialInterface>                        FXMaterial;                                              // 0x0130(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7QGY[0x4];                                   // 0x014C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		struct FVector                                             DecalSize;                                               // 0x0150(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ULLZ[0x4];                                   // 0x015C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TAssetPtr<class UParticleSystem>                           FXParticle;                                              // 0x0160(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D8JI[0x4];                                   // 0x017C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		bool                                                       bAttachToParent;                                         // 0x0180(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4JXJ[0x7];                                   // 0x0181(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UStaticMesh*                                         StaticMeshLoaded;                                        // 0x0188(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<class FString>                                      DefaultAlterationLootTables;                             // 0x0190(0x0010) Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		class USoundBase*                                          FXSoundLoaded;                                           // 0x01A0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UMaterialInterface*                                  FXMaterialLoaded;                                        // 0x01A8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UParticleSystem*                                     FXParticleLoaded;                                        // 0x01B0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		class UStaticMesh* GetStaticMesh();
		TArray<struct FBannerSocketEntry> GetSockets();
		class USoundBase* GetFXSound();
		class UParticleSystem* GetFXParticle();
		class UMaterialInterface* GetFXMaterial();
		struct FVector GetDecalSize();
		EOrionBannerType GetBannerType();
		bool GetAttachToParent();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpBannerAlterationItemDefinition
	 * Size -> 0x00C0 (FullSize[0x0198] - InheritedSize[0x00D8])
	 */
	class UOrionMcpBannerAlterationItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		struct FBannerMaterialDesc                                 MaterialDesc;                                            // 0x00D8(0x00C0) Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected

	public:
		class UTexture* GetTexture();
		class UTexture* GetNormal();
		class UTexture* GetDiffuse();
		struct FBannerMaterialDesc GetBannerMaterialDesc();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpBannerItem
	 * Size -> 0x0030 (FullSize[0x00A8] - InheritedSize[0x0078])
	 */
	class UOrionMcpBannerItem : public UOrionMcpItem
	{
	public:
		class FString                                              Name;                                                    // 0x0078(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FMcpBannerEntry>                             Pieces;                                                  // 0x0088(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<class FString>                                      BannerAlterationNames;                                   // 0x0098(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected

	public:
		class UOrionMcpBannerItemDefinition* GetInternalData();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpBannerAlterationItem
	 * Size -> 0x0000 (FullSize[0x0078] - InheritedSize[0x0078])
	 */
	class UOrionMcpBannerAlterationItem : public UOrionMcpItem
	{
	public:
		class UOrionMcpBannerAlterationItemDefinition* GetInternalData();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionBoostItemDefinition
	 * Size -> 0x0008 (FullSize[0x00E0] - InheritedSize[0x00D8])
	 */
	class UOrionBoostItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		EOrionBoostType                                            BoostType;                                               // 0x00D8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_H2SO[0x3];                                   // 0x00D9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    DurationInHours;                                         // 0x00DC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpBoostItem
	 * Size -> 0x0000 (FullSize[0x0078] - InheritedSize[0x0078])
	 */
	class UOrionMcpBoostItem : public UOrionMcpItem
	{
	public:
		class UOrionBoostItemDefinition* GetInternalData();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpCardPackItemDefinition
	 * Size -> 0x00B8 (FullSize[0x0190] - InheritedSize[0x00D8])
	 */
	class UOrionMcpCardPackItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		class FString                                              LootTierGroup;                                           // 0x00D8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    LootTier;                                                // 0x00E8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HNT7[0x4];                                   // 0x00EC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<TAssetPtr<class UOrionMcpItemDefinition>>           ExplicitItems;                                           // 0x00F0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TAssetPtr<class UClass>                                    DisplayActor;                                            // 0x0100(0x001C) ELEMENT_SIZE_MISMATCH Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_R8AY[0x4];                                   // 0x011C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		unsigned char                                              UnknownData_76SX[0x70];                                  // 0x0120(0x0070) MISSED OFFSET (PADDING)

	public:
		bool GetExplicitCards(TArray<class UOrionCardData*>* Cards);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpCardPackItem
	 * Size -> 0x0000 (FullSize[0x0078] - InheritedSize[0x0078])
	 */
	class UOrionMcpCardPackItem : public UOrionMcpItem
	{
	public:
		class UOrionMcpCardPackItemDefinition* GetInternalData();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionComponentItemDefinition
	 * Size -> 0x0028 (FullSize[0x0100] - InheritedSize[0x00D8])
	 */
	class UOrionComponentItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		TAssetPtr<class UMaterialInterface>                        WorldIconMaterial;                                       // 0x00D8(0x001C) ELEMENT_SIZE_MISMATCH Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_VJUM[0x4];                                   // 0x00F4(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		struct FOrionAffinityStruct                                Affinities;                                              // 0x00F8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_VFX7[0x4];                                   // 0x00FC(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpComponentItem
	 * Size -> 0x0000 (FullSize[0x0078] - InheritedSize[0x0078])
	 */
	class UOrionMcpComponentItem : public UOrionMcpItem
	{
	public:
		class UOrionComponentItemDefinition* GetInternalData();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionSkinItemDefinition
	 * Size -> 0x0128 (FullSize[0x0200] - InheritedSize[0x00D8])
	 */
	class UOrionSkinItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		TAssetPtr<class UClass>                                    PawnClassOverride;                                       // 0x00D8(0x001C) ELEMENT_SIZE_MISMATCH Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1KJK[0x4];                                   // 0x00F4(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class USkeletalMesh>                             SkelMesh;                                                // 0x00F8(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BET4[0x4];                                   // 0x0114(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TArray<TAssetPtr<class UMaterialInterface>>                Materials;                                               // 0x0118(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TAssetPtr<class UClass>                                    AnimInstanceClass;                                       // 0x0128(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_132F[0x4];                                   // 0x0144(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TArray<struct FSkinSpawnOverrideItem>                      SpawnOverrides;                                          // 0x0148(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FSkinAnimOverride>                           AnimOverrides;                                           // 0x0158(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		class FName                                                GameplayCueOverrideString;                               // 0x0168(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TAssetPtr<class UClass>                                    SimpleActor;                                             // 0x0170(0x001C) ELEMENT_SIZE_MISMATCH Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2VIX[0x4];                                   // 0x018C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		int32_t                                                    Rarity;                                                  // 0x0190(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_75NE[0x4];                                   // 0x0194(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              HeroName;                                                // 0x0198(0x0010) Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FGuid                                               SkinGuid;                                                // 0x01A8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bShowInUI;                                               // 0x01B8(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bPlayEnabled;                                            // 0x01B9(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bAllowPreview;                                           // 0x01BA(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bSelfDoubleXP;                                           // 0x01BB(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bSelfDoubleTimeCurrency;                                 // 0x01BC(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bTeamDoubleXP;                                           // 0x01BD(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bTeamDoubleTimeCurrency;                                 // 0x01BE(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bMatchDoubleXP;                                          // 0x01BF(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bMatchTeamDoubleTimeCurrency;                            // 0x01C0(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bContagious;                                             // 0x01C1(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_Z8KA[0x6];                                   // 0x01C2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FString>                                      EventRestrictions;                                       // 0x01C8(0x0010) Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected
		class USkeletalMesh*                                       SkelMeshLoaded;                                          // 0x01D8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              AnimInstanceLoaded;                                      // 0x01E0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<class UMaterialInterface*>                          MaterialsLoaded;                                         // 0x01E8(0x0010) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
		class UClass*                                              LoadedPawnClass;                                         // 0x01F8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		class USkeletalMesh* GetSkelMesh();
		class UClass* GetPawnClassOverride();
		class UClass* GetAnimInstanceClass();
		TArray<class UMaterialInterface*> BP_GetMaterials();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionEmoteItemDefinition
	 * Size -> 0x0080 (FullSize[0x0158] - InheritedSize[0x00D8])
	 */
	class UOrionEmoteItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		EOrionEmoteType                                            EmoteType;                                               // 0x00D8(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FM36[0x3];                                   // 0x00D9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    Rarity;                                                  // 0x00DC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FString                                              HeroName;                                                // 0x00E0(0x0010) Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bShowInUI;                                               // 0x00F0(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bPlayEnabled;                                            // 0x00F1(0x0001) Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_TRU2[0x6];                                   // 0x00F2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FSkinAnimMontagePair>                        SkinToAnimMontagePairs;                                  // 0x00F8(0x0010) Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TMap<class UOrionSkinItemDefinition*, class UAnimMontage*> SkinToAnimMontageMapLoaded;                              // 0x0108(0x0050) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected

	public:
		class UAnimMontage* GetAnimMontage(class UOrionSkinItemDefinition* SkinItemDefinition);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpEmoteItem
	 * Size -> 0x0000 (FullSize[0x0078] - InheritedSize[0x0078])
	 */
	class UOrionMcpEmoteItem : public UOrionMcpItem
	{
	public:
		class UOrionEmoteItemDefinition* GetInternalData();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpGiftBoxItemDefinition
	 * Size -> 0x0000 (FullSize[0x00D8] - InheritedSize[0x00D8])
	 */
	class UOrionMcpGiftBoxItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpGiftBoxItem
	 * Size -> 0x0000 (FullSize[0x0078] - InheritedSize[0x0078])
	 */
	class UOrionMcpGiftBoxItem : public UOrionMcpItem
	{
	public:
		class UOrionMcpGiftBoxItemDefinition* GetInternalData();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpGlyphItemDefinition
	 * Size -> 0x0070 (FullSize[0x0148] - InheritedSize[0x00D8])
	 */
	class UOrionMcpGlyphItemDefinition : public UOrionMcpItemDefinition
	{
	public:
		class FString                                              EventName;                                               // 0x00D8(0x0010) Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FString                                              HeroName;                                                // 0x00E8(0x0010) Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TAssetPtr<class UStaticMesh>                               Mesh;                                                    // 0x00F8(0x001C) ELEMENT_SIZE_MISMATCH Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_EGCH[0x4];                                   // 0x0114(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		unsigned char                                              UnknownData_TX8K[0x8];                                   // 0x0118(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TAssetPtr<class UMaterialInterface>                        Material;                                                // 0x0120(0x001C) ELEMENT_SIZE_MISMATCH Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_NCZ8[0x4];                                   // 0x013C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		unsigned char                                              UnknownData_ZJMJ[0x8];                                   // 0x0140(0x0008) MISSED OFFSET (PADDING)

	public:
		class UStaticMesh* GetMesh();
		class UMaterialInterface* GetMaterial();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMcpGlyphItem
	 * Size -> 0x0008 (FullSize[0x0080] - InheritedSize[0x0078])
	 */
	class UOrionMcpGlyphItem : public UOrionMcpItem
	{
	public:
		struct FColor                                              Color;                                                   // 0x0078(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_0K1X[0x4];                                   // 0x007C(0x0004) MISSED OFFSET (PADDING)

	public:
		class UOrionMcpGlyphItemDefinition* GetInternalData();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionTeamActorInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UOrionTeamActorInterface : public UGenericTeamAgentInterface
	{
	public:
		void OnTeamChanged(EOrionTeam NewTeamIdx);
		EOrionTeam GetTeamNum();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAimTargetInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UOrionAimTargetInterface : public UInterface
	{
	public:
		void UpdateOccludedVision(bool bShouldShowWhenOccluded);
		bool ShouldIgnoreCollisionWithTeam(EOrionTeam Team, bool bPassedFilter);
		void RemoveShadowPlaneMaterials();
		bool IsValidDirectHit(const struct FHitResult& HitResult);
		bool IsTargetable();
		void GetTargetingLocation(struct FVector* OutPosition);
		struct FVector GetNumberPopLocation(const struct FVector& HitLocation);
		EOrionTargetType GetMyTargetType();
		void GetAimTargetSensingLocation(struct FVector* AimPosition);
		void GetAimTargetExtent(struct FVector* Center, float* Width, float* Height);
		EOrionVisionType CanSee(class AActor* TargetActor);
		bool CanBeHitWhileInShadowPlane();
		void ApplyShadowPlaneMaterials();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionVisionDef
	 * Size -> 0x0038 (FullSize[0x0060] - InheritedSize[0x0028])
	 */
	class UOrionVisionDef : public UObject
	{
	public:
		EOrionVisionDef                                            Type;                                                    // 0x0028(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShouldTeamColor;                                         // 0x0029(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       RequiresLOS;                                             // 0x002A(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       RequiresFOV;                                             // 0x002B(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		float                                                      ZOffsetForVisionTest;                                    // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DefaultVisionDistance;                                   // 0x0030(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DefaultVisionDistanceSquared;                            // 0x0034(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              IconSizeX;                                               // 0x0038(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              IconSizeY;                                               // 0x0039(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RDTY[0x6];                                   // 0x003A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTexture2D*                                          IconTexture;                                             // 0x0040(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UMaterialInterface*                                  IconMaterial;                                            // 0x0048(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ZOffset;                                                 // 0x0050(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxIndicatorDrawDistance;                                // 0x0054(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxIndicatorDrawDistanceSquared;                         // 0x0058(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YIO6[0x4];                                   // 0x005C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionVisionActorInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UOrionVisionActorInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionSignificanceManager
	 * Size -> 0x0520 (FullSize[0x0610] - InheritedSize[0x00F0])
	 */
	class UOrionSignificanceManager : public USignificanceManager
	{
	public:
		unsigned char                                              UnknownData_R00U[0x520];                                 // 0x00F0(0x0520) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionBaseActor
	 * Size -> 0x0050 (FullSize[0x03D0] - InheritedSize[0x0380])
	 */
	class AOrionBaseActor : public AActor
	{
	public:
		unsigned char                                              UnknownData_CDX3[0x10];                                  // 0x0380(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    AbilityLevel;                                            // 0x0390(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EOrionVisionDef                                            VisionCategory;                                          // 0x0394(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6NI8[0x1];                                   // 0x0395(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FOrionReplicatedVisionData                          ReplicatedVisionData;                                    // 0x0396(0x0004) Net, RepNotify, NativeAccessSpecifierPublic
		struct FOrionReplicatedVisibleToEnemy                      VisibleToEnemy;                                          // 0x039A(0x0001) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZNQR[0x5];                                   // 0x039B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class AStaticMeshActor*>                            AdditionalTeamColorMeshActors;                           // 0x03A0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected
		EOrionTeam                                                 TeamNum;                                                 // 0x03B0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EOrionSignificanceType                                     SignificanceType;                                        // 0x03B1(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_U1CO[0x2];                                   // 0x03B2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bManageSignificance : 1;                                 // 0x03B4(0x0001) BIT_FIELD Edit, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bUsesTeamColors : 1;                                     // 0x03B4(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bBlockMinionSight : 1;                                   // 0x03B4(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_GVAQ[0xB];                                   // 0x03B5(0x000B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UOrionTeamColorComponent*>                    CachedTeamColorComponents;                               // 0x03C0(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate

	public:
		void SetVisionRules(EOrionVisionIndividualRules NewType);
		void SetupTeamColors(bool bIsDead);
		class UAudioComponent* PlaySoundTeamAdjustedForSelf(class USoundBase* SoundToPlay, bool Attached, bool bStopWhenAttachedToDestroyed);
		void OnRep_VisibleToEnemy(const struct FOrionReplicatedVisibleToEnemy& OldValue);
		void OnRep_TeamNum(EOrionTeam OldTeamNum);
		void OnRep_ReplicatedVisionData(const struct FOrionReplicatedVisionData& OldData);
		void OnRemovedTracked(class UOrionAbilitySystemComponent* AbilityComponent);
		void NotifyTeamChanged(EOrionTeam NewTeamIdx);
		EOrionTeam GetTeamNum();
		void ExecuteGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& Parameters);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIAbilityTargetInterface
