#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function RegionList.RegionList_C.Fill Region List
	 */
	struct URegionList_C_FillRegionList_Params
	{
	public:
		class UMatchmakingContext*                                 self2;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function RegionList.RegionList_C.Construct
	 */
	struct URegionList_C_Construct_Params
	{	};

	/**
	 * Function RegionList.RegionList_C.BndEvt__RegionList_K2Node_ComponentBoundEvent_10_ListViewEvent__DelegateSignature
	 */
	struct URegionList_C_BndEvt__RegionList_K2Node_ComponentBoundEvent_10_ListViewEvent__DelegateSignature_Params
	{
	public:
		class UObject*                                             Item;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function RegionList.RegionList_C.BndEvt__DefaultButton_K2Node_ComponentBoundEvent_31_OrionBaseButtonClicked__DelegateSignature
	 */
	struct URegionList_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_31_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function RegionList.RegionList_C.OnRefreshPingComplete
	 */
	struct URegionList_C_OnRefreshPingComplete_Params
	{	};

	/**
	 * Function RegionList.RegionList_C.ExecuteUbergraph_RegionList
	 */
	struct URegionList_C_ExecuteUbergraph_RegionList_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_NMJG[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
