#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ReportPlayer.ReportPlayer_C.Construct
	 */
	struct UReportPlayer_C_Construct_Params
	{	};

	/**
	 * Function ReportPlayer.ReportPlayer_C.BndEvt__DefaultButton_C_6_K2Node_ComponentBoundEvent_409_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UReportPlayer_C_BndEvt__DefaultButton_C_6_K2Node_ComponentBoundEvent_409_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ReportPlayer.ReportPlayer_C.BndEvt__DefaultButton_K2Node_ComponentBoundEvent_838_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UReportPlayer_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_838_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ReportPlayer.ReportPlayer_C.OnFeedbackScreenshotReady_Event_1
	 */
	struct UReportPlayer_C_OnFeedbackScreenshotReady_Event_1_Params
	{	};

	/**
	 * Function ReportPlayer.ReportPlayer_C.BndEvt__DefaultButton_K2Node_ComponentBoundEvent_207_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UReportPlayer_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_207_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ReportPlayer.ReportPlayer_C.ExecuteUbergraph_ReportPlayer
	 */
	struct UReportPlayer_C_ExecuteUbergraph_ReportPlayer_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_H9L7[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
