#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ReportBug.ReportBug_C.OnHandleBackAction
	 */
	struct UReportBug_C_OnHandleBackAction_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ReportBug.ReportBug_C.Construct
	 */
	struct UReportBug_C_Construct_Params
	{	};

	/**
	 * Function ReportBug.ReportBug_C.BndEvt__DefaultButton_C_6_K2Node_ComponentBoundEvent_409_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UReportBug_C_BndEvt__DefaultButton_C_6_K2Node_ComponentBoundEvent_409_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ReportBug.ReportBug_C.BndEvt__DefaultButton_K2Node_ComponentBoundEvent_838_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UReportBug_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_838_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ReportBug.ReportBug_C.OnFeedbackScreenshotReady_Event_1
	 */
	struct UReportBug_C_OnFeedbackScreenshotReady_Event_1_Params
	{	};

	/**
	 * Function ReportBug.ReportBug_C.BndEvt__DefaultButton_K2Node_ComponentBoundEvent_207_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UReportBug_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_207_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ReportBug.ReportBug_C.ExecuteUbergraph_ReportBug
	 */
	struct UReportBug_C_ExecuteUbergraph_ReportBug_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_72WQ[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
