#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function WeeklyQuestScreen.WeeklyQuestScreen_C.Setup Data
	 */
	struct UWeeklyQuestScreen_C_SetupData_Params
	{	};

	/**
	 * Function WeeklyQuestScreen.WeeklyQuestScreen_C.OnResetData
	 */
	struct UWeeklyQuestScreen_C_OnResetData_Params
	{	};

	/**
	 * Function WeeklyQuestScreen.WeeklyQuestScreen_C.Construct
	 */
	struct UWeeklyQuestScreen_C_Construct_Params
	{	};

	/**
	 * Function WeeklyQuestScreen.WeeklyQuestScreen_C.BndEvt__DefaultButton_K2Node_ComponentBoundEvent_4_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWeeklyQuestScreen_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_4_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WeeklyQuestScreen.WeeklyQuestScreen_C.BndEvt__DefaultButtonAbandonQuest_K2Node_ComponentBoundEvent_4_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWeeklyQuestScreen_C_BndEvt__DefaultButtonAbandonQuest_K2Node_ComponentBoundEvent_4_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WeeklyQuestScreen.WeeklyQuestScreen_C.BndEvt__DefaultButtonAbandonConfirm_K2Node_ComponentBoundEvent_23_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWeeklyQuestScreen_C_BndEvt__DefaultButtonAbandonConfirm_K2Node_ComponentBoundEvent_23_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WeeklyQuestScreen.WeeklyQuestScreen_C.BndEvt__DefaultButtonAbandonCancel_K2Node_ComponentBoundEvent_39_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWeeklyQuestScreen_C_BndEvt__DefaultButtonAbandonCancel_K2Node_ComponentBoundEvent_39_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WeeklyQuestScreen.WeeklyQuestScreen_C.ExecuteUbergraph_WeeklyQuestScreen
	 */
	struct UWeeklyQuestScreen_C_ExecuteUbergraph_WeeklyQuestScreen_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_1JXC[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
