#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIScriptedBehavior_Blind

#include "Basic.hpp"

#include "GameplayTasks_structs.hpp"


namespace SDK::Params
{

// Function AIScriptedBehavior_Blind.AIScriptedBehavior_Blind_C.ExecuteUbergraph_AIScriptedBehavior_Blind
// 0x0018 (0x0018 - 0x0000)
struct AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionAIController*                     K2Node_Event_AIController;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind) == 0x000008, "Wrong alignment on AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind");
static_assert(sizeof(AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind) == 0x000018, "Wrong size on AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind");
static_assert(offsetof(AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind, EntryPoint) == 0x000000, "Member 'AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind, K2Node_Event_AIController) == 0x000008, "Member 'AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind::K2Node_Event_AIController' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AIScriptedBehavior_Blind_C_ExecuteUbergraph_AIScriptedBehavior_Blind::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AIScriptedBehavior_Blind.AIScriptedBehavior_Blind_C.BehaviorFinished
// 0x0008 (0x0008 - 0x0000)
struct AIScriptedBehavior_Blind_C_BehaviorFinished final
{
public:
	class AOrionAIController*                     AIController_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIScriptedBehavior_Blind_C_BehaviorFinished) == 0x000008, "Wrong alignment on AIScriptedBehavior_Blind_C_BehaviorFinished");
static_assert(sizeof(AIScriptedBehavior_Blind_C_BehaviorFinished) == 0x000008, "Wrong size on AIScriptedBehavior_Blind_C_BehaviorFinished");
static_assert(offsetof(AIScriptedBehavior_Blind_C_BehaviorFinished, AIController_0) == 0x000000, "Member 'AIScriptedBehavior_Blind_C_BehaviorFinished::AIController_0' has a wrong offset!");

// Function AIScriptedBehavior_Blind.AIScriptedBehavior_Blind_C.RunBehavior
// 0x0050 (0x0050 - 0x0000)
struct AIScriptedBehavior_Blind_C_RunBehavior final
{
public:
	class AOrionAIController*                     AIController_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionAIBot*                            K2Node_DynamicCast_AsOrion_AIBot;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_ClaimResource_InTaskOwner_CastInput;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameplayTask_ClaimResource*            CallFunc_ClaimResource_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_K2_RunGameplayTask_TaskOwner_CastInput;   // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayTaskRunResult                        CallFunc_K2_RunGameplayTask_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehavior_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIScriptedBehavior_Blind_C_RunBehavior) == 0x000008, "Wrong alignment on AIScriptedBehavior_Blind_C_RunBehavior");
static_assert(sizeof(AIScriptedBehavior_Blind_C_RunBehavior) == 0x000050, "Wrong size on AIScriptedBehavior_Blind_C_RunBehavior");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, AIController_0) == 0x000000, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::AIController_0' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, ReturnValue) == 0x000008, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, K2Node_DynamicCast_AsOrion_AIBot) == 0x000010, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::K2Node_DynamicCast_AsOrion_AIBot' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, CallFunc_ClaimResource_InTaskOwner_CastInput) == 0x000020, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::CallFunc_ClaimResource_InTaskOwner_CastInput' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, CallFunc_ClaimResource_ReturnValue) == 0x000030, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::CallFunc_ClaimResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, CallFunc_K2_RunGameplayTask_TaskOwner_CastInput) == 0x000038, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::CallFunc_K2_RunGameplayTask_TaskOwner_CastInput' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, CallFunc_K2_RunGameplayTask_ReturnValue) == 0x000048, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::CallFunc_K2_RunGameplayTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIScriptedBehavior_Blind_C_RunBehavior, CallFunc_RunBehavior_ReturnValue) == 0x00004A, "Member 'AIScriptedBehavior_Blind_C_RunBehavior::CallFunc_RunBehavior_ReturnValue' has a wrong offset!");

}

