#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIScriptedBehavior_FlowUntilEnemySeen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIScriptedBehavior_FlowUntilEnemySeen.AIScriptedBehavior_FlowUntilEnemySeen_C
// 0x0020 (0x0068 - 0x0048)
class UAIScriptedBehavior_FlowUntilEnemySeen_C final : public UAIScriptedBehavior_BehaviorTree
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(Transient, DuplicateTransient)
	class AOrionAIBot*                            AIController;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 MoveGoalActor;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAITask_FlowFieldMove*             MoveTask;                                          // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AIScriptedBehavior_FlowUntilEnemySeen(int32 EntryPoint);
	void FlowUntilEnemySeen();
	void BehaviorFinished(class AOrionAIController* AIController_0);
	void OnRequestFailed_34E09C5A4FA5A3B75B14678C178918DA();
	void OnMoveFinished_34E09C5A4FA5A3B75B14678C178918DA(EPathFollowingResult Result, class AAIController* AIController_0);
	void OnRequestFailed_623B680040E2A42E4DABDF8D1D61043E();
	void OnMoveFinished_623B680040E2A42E4DABDF8D1D61043E(EPathFollowingResult Result);
	void OnFinish_81B41A9F4A1860E88BB263A806ACABAE();
	void OnFinish_4016BB134EB9080C2EDA7CB625816B19();
	bool RunBehavior(class AOrionAIController* AIController_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIScriptedBehavior_FlowUntilEnemySeen_C">();
	}
	static class UAIScriptedBehavior_FlowUntilEnemySeen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIScriptedBehavior_FlowUntilEnemySeen_C>();
	}
};
static_assert(alignof(UAIScriptedBehavior_FlowUntilEnemySeen_C) == 0x000008, "Wrong alignment on UAIScriptedBehavior_FlowUntilEnemySeen_C");
static_assert(sizeof(UAIScriptedBehavior_FlowUntilEnemySeen_C) == 0x000068, "Wrong size on UAIScriptedBehavior_FlowUntilEnemySeen_C");
static_assert(offsetof(UAIScriptedBehavior_FlowUntilEnemySeen_C, UberGraphFrame) == 0x000048, "Member 'UAIScriptedBehavior_FlowUntilEnemySeen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAIScriptedBehavior_FlowUntilEnemySeen_C, AIController) == 0x000050, "Member 'UAIScriptedBehavior_FlowUntilEnemySeen_C::AIController' has a wrong offset!");
static_assert(offsetof(UAIScriptedBehavior_FlowUntilEnemySeen_C, MoveGoalActor) == 0x000058, "Member 'UAIScriptedBehavior_FlowUntilEnemySeen_C::MoveGoalActor' has a wrong offset!");
static_assert(offsetof(UAIScriptedBehavior_FlowUntilEnemySeen_C, MoveTask) == 0x000060, "Member 'UAIScriptedBehavior_FlowUntilEnemySeen_C::MoveTask' has a wrong offset!");

}

