#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Animated_Reticle_Ammo_Widget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Animated_Reticle_Ammo_Widget.Animated_Reticle_Ammo_Widget_C.ExecuteUbergraph_Animated_Reticle_Ammo_Widget
// 0x0020 (0x0020 - 0x0000)
struct Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_AmmoValue;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Buffed;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget) == 0x000008, "Wrong alignment on Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget");
static_assert(sizeof(Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget) == 0x000020, "Wrong size on Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget");
static_assert(offsetof(Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget, EntryPoint) == 0x000000, "Member 'Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget, K2Node_CustomEvent_AmmoValue) == 0x000010, "Member 'Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget::K2Node_CustomEvent_AmmoValue' has a wrong offset!");
static_assert(offsetof(Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget, K2Node_CustomEvent_Buffed) == 0x000014, "Member 'Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget::K2Node_CustomEvent_Buffed' has a wrong offset!");
static_assert(offsetof(Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000018, "Member 'Animated_Reticle_Ammo_Widget_C_ExecuteUbergraph_Animated_Reticle_Ammo_Widget::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");

// Function Animated_Reticle_Ammo_Widget.Animated_Reticle_Ammo_Widget_C.SetAmmoAmount
// 0x0008 (0x0008 - 0x0000)
struct Animated_Reticle_Ammo_Widget_C_SetAmmoAmount final
{
public:
	float                                         AmmoValue_0;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Buffed_0;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Animated_Reticle_Ammo_Widget_C_SetAmmoAmount) == 0x000004, "Wrong alignment on Animated_Reticle_Ammo_Widget_C_SetAmmoAmount");
static_assert(sizeof(Animated_Reticle_Ammo_Widget_C_SetAmmoAmount) == 0x000008, "Wrong size on Animated_Reticle_Ammo_Widget_C_SetAmmoAmount");
static_assert(offsetof(Animated_Reticle_Ammo_Widget_C_SetAmmoAmount, AmmoValue_0) == 0x000000, "Member 'Animated_Reticle_Ammo_Widget_C_SetAmmoAmount::AmmoValue_0' has a wrong offset!");
static_assert(offsetof(Animated_Reticle_Ammo_Widget_C_SetAmmoAmount, Buffed_0) == 0x000004, "Member 'Animated_Reticle_Ammo_Widget_C_SetAmmoAmount::Buffed_0' has a wrong offset!");

// Function Animated_Reticle_Ammo_Widget.Animated_Reticle_Ammo_Widget_C.GetPercentAmmoFill
// 0x0004 (0x0004 - 0x0000)
struct Animated_Reticle_Ammo_Widget_C_GetPercentAmmoFill final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Animated_Reticle_Ammo_Widget_C_GetPercentAmmoFill) == 0x000004, "Wrong alignment on Animated_Reticle_Ammo_Widget_C_GetPercentAmmoFill");
static_assert(sizeof(Animated_Reticle_Ammo_Widget_C_GetPercentAmmoFill) == 0x000004, "Wrong size on Animated_Reticle_Ammo_Widget_C_GetPercentAmmoFill");
static_assert(offsetof(Animated_Reticle_Ammo_Widget_C_GetPercentAmmoFill, ReturnValue) == 0x000000, "Member 'Animated_Reticle_Ammo_Widget_C_GetPercentAmmoFill::ReturnValue' has a wrong offset!");

// Function Animated_Reticle_Ammo_Widget.Animated_Reticle_Ammo_Widget_C.Get_AmmoBar_FillColorAndOpacity
// 0x0010 (0x0010 - 0x0000)
struct Animated_Reticle_Ammo_Widget_C_Get_AmmoBar_FillColorAndOpacity final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Animated_Reticle_Ammo_Widget_C_Get_AmmoBar_FillColorAndOpacity) == 0x000004, "Wrong alignment on Animated_Reticle_Ammo_Widget_C_Get_AmmoBar_FillColorAndOpacity");
static_assert(sizeof(Animated_Reticle_Ammo_Widget_C_Get_AmmoBar_FillColorAndOpacity) == 0x000010, "Wrong size on Animated_Reticle_Ammo_Widget_C_Get_AmmoBar_FillColorAndOpacity");
static_assert(offsetof(Animated_Reticle_Ammo_Widget_C_Get_AmmoBar_FillColorAndOpacity, ReturnValue) == 0x000000, "Member 'Animated_Reticle_Ammo_Widget_C_Get_AmmoBar_FillColorAndOpacity::ReturnValue' has a wrong offset!");

}

