#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Animated_Reticle_Widget

#include "Basic.hpp"


namespace SDK::Params
{

// Function Animated_Reticle_Widget.Animated_Reticle_Widget_C.ExecuteUbergraph_Animated_Reticle_Widget
// 0x0018 (0x0018 - 0x0000)
struct Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget) == 0x000008, "Wrong alignment on Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget");
static_assert(sizeof(Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget) == 0x000018, "Wrong size on Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget");
static_assert(offsetof(Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget, EntryPoint) == 0x000000, "Member 'Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000010, "Member 'Animated_Reticle_Widget_C_ExecuteUbergraph_Animated_Reticle_Widget::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");

}

