#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AppleARKit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AppleARKit_structs.hpp"


namespace SDK::Params
{

// Function AppleARKit.AppleARKitAnchor.GetTransform
// 0x0030 (0x0030 - 0x0000)
struct AppleARKitAnchor_GetTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppleARKitAnchor_GetTransform) == 0x000010, "Wrong alignment on AppleARKitAnchor_GetTransform");
static_assert(sizeof(AppleARKitAnchor_GetTransform) == 0x000030, "Wrong size on AppleARKitAnchor_GetTransform");
static_assert(offsetof(AppleARKitAnchor_GetTransform, ReturnValue) == 0x000000, "Member 'AppleARKitAnchor_GetTransform::ReturnValue' has a wrong offset!");

// Function AppleARKit.AppleARKitBlueprintLibrary.GetCurrentFrame
// 0x00D0 (0x00D0 - 0x0000)
struct AppleARKitBlueprintLibrary_GetCurrentFrame final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppleARKitFrame                       OutCurrentFrame;                                   // 0x0010(0x00B0)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0xF];                                       // 0x00C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppleARKitBlueprintLibrary_GetCurrentFrame) == 0x000010, "Wrong alignment on AppleARKitBlueprintLibrary_GetCurrentFrame");
static_assert(sizeof(AppleARKitBlueprintLibrary_GetCurrentFrame) == 0x0000D0, "Wrong size on AppleARKitBlueprintLibrary_GetCurrentFrame");
static_assert(offsetof(AppleARKitBlueprintLibrary_GetCurrentFrame, WorldContextObject) == 0x000000, "Member 'AppleARKitBlueprintLibrary_GetCurrentFrame::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AppleARKitBlueprintLibrary_GetCurrentFrame, OutCurrentFrame) == 0x000010, "Member 'AppleARKitBlueprintLibrary_GetCurrentFrame::OutCurrentFrame' has a wrong offset!");
static_assert(offsetof(AppleARKitBlueprintLibrary_GetCurrentFrame, ReturnValue) == 0x0000C0, "Member 'AppleARKitBlueprintLibrary_GetCurrentFrame::ReturnValue' has a wrong offset!");

// Function AppleARKit.AppleARKitBlueprintLibrary.HitTestAtScreenPosition_TrackingSpace
// 0x0030 (0x0030 - 0x0000)
struct AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ScreenPosition;                                    // 0x0008(0x0008)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppleARKitHitTestResultType                  Types;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAppleARKitHitTestResult>       OutResults;                                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace) == 0x000008, "Wrong alignment on AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace");
static_assert(sizeof(AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace) == 0x000030, "Wrong size on AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace");
static_assert(offsetof(AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace, WorldContextObject) == 0x000000, "Member 'AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace, ScreenPosition) == 0x000008, "Member 'AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace::ScreenPosition' has a wrong offset!");
static_assert(offsetof(AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace, Types) == 0x000010, "Member 'AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace::Types' has a wrong offset!");
static_assert(offsetof(AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace, OutResults) == 0x000018, "Member 'AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace::OutResults' has a wrong offset!");
static_assert(offsetof(AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace, ReturnValue) == 0x000028, "Member 'AppleARKitBlueprintLibrary_HitTestAtScreenPosition_TrackingSpace::ReturnValue' has a wrong offset!");

// Function AppleARKit.AppleARKitPlaneAnchor.GetCenter
// 0x000C (0x000C - 0x0000)
struct AppleARKitPlaneAnchor_GetCenter final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppleARKitPlaneAnchor_GetCenter) == 0x000004, "Wrong alignment on AppleARKitPlaneAnchor_GetCenter");
static_assert(sizeof(AppleARKitPlaneAnchor_GetCenter) == 0x00000C, "Wrong size on AppleARKitPlaneAnchor_GetCenter");
static_assert(offsetof(AppleARKitPlaneAnchor_GetCenter, ReturnValue) == 0x000000, "Member 'AppleARKitPlaneAnchor_GetCenter::ReturnValue' has a wrong offset!");

// Function AppleARKit.AppleARKitPlaneAnchor.GetExtent
// 0x000C (0x000C - 0x0000)
struct AppleARKitPlaneAnchor_GetExtent final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppleARKitPlaneAnchor_GetExtent) == 0x000004, "Wrong alignment on AppleARKitPlaneAnchor_GetExtent");
static_assert(sizeof(AppleARKitPlaneAnchor_GetExtent) == 0x00000C, "Wrong size on AppleARKitPlaneAnchor_GetExtent");
static_assert(offsetof(AppleARKitPlaneAnchor_GetExtent, ReturnValue) == 0x000000, "Member 'AppleARKitPlaneAnchor_GetExtent::ReturnValue' has a wrong offset!");

// Function AppleARKit.AppleARKitPlaneAnchor.GetTransformToCenter
// 0x0030 (0x0030 - 0x0000)
struct AppleARKitPlaneAnchor_GetTransformToCenter final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppleARKitPlaneAnchor_GetTransformToCenter) == 0x000010, "Wrong alignment on AppleARKitPlaneAnchor_GetTransformToCenter");
static_assert(sizeof(AppleARKitPlaneAnchor_GetTransformToCenter) == 0x000030, "Wrong size on AppleARKitPlaneAnchor_GetTransformToCenter");
static_assert(offsetof(AppleARKitPlaneAnchor_GetTransformToCenter, ReturnValue) == 0x000000, "Member 'AppleARKitPlaneAnchor_GetTransformToCenter::ReturnValue' has a wrong offset!");

}

