#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_VisionSpore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Card_VisionSpore.BP_Card_VisionSpore_C.ExecuteUbergraph_BP_Card_VisionSpore
// 0x0038 (0x0038 - 0x0000)
struct BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore) == 0x000008, "Wrong alignment on BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore");
static_assert(sizeof(BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore) == 0x000038, "Wrong size on BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore");
static_assert(offsetof(BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore, EntryPoint) == 0x000000, "Member 'BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'BP_Card_VisionSpore_C_ExecuteUbergraph_BP_Card_VisionSpore::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_Card_VisionSpore.BP_Card_VisionSpore_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_Card_VisionSpore_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Card_VisionSpore_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Card_VisionSpore_C_UserConstructionScript");
static_assert(sizeof(BP_Card_VisionSpore_C_UserConstructionScript) == 0x000008, "Wrong size on BP_Card_VisionSpore_C_UserConstructionScript");
static_assert(offsetof(BP_Card_VisionSpore_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Card_VisionSpore_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_Card_VisionSpore.BP_Card_VisionSpore_C.GetHighlightableMeshes
// 0x0010 (0x0010 - 0x0000)
struct BP_Card_VisionSpore_C_GetHighlightableMeshes final
{
public:
	TArray<class UMeshComponent*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm)
};
static_assert(alignof(BP_Card_VisionSpore_C_GetHighlightableMeshes) == 0x000008, "Wrong alignment on BP_Card_VisionSpore_C_GetHighlightableMeshes");
static_assert(sizeof(BP_Card_VisionSpore_C_GetHighlightableMeshes) == 0x000010, "Wrong size on BP_Card_VisionSpore_C_GetHighlightableMeshes");
static_assert(offsetof(BP_Card_VisionSpore_C_GetHighlightableMeshes, ReturnValue) == 0x000000, "Member 'BP_Card_VisionSpore_C_GetHighlightableMeshes::ReturnValue' has a wrong offset!");

}

