#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_LinkAllyToRedirectDmg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Card_LinkAllyToRedirectDmg.BP_Card_LinkAllyToRedirectDmg_C.ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg
// 0x02C0 (0x02C0 - 0x0000)
struct BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachTo_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x003C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Direction;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0054(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue3;       // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0084(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue2;                      // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x00D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00F8(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue2;          // 0x0104(0x000C)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0110(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult2;      // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0220(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0230(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg) == 0x000008, "Wrong alignment on BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg");
static_assert(sizeof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg) == 0x0002C0, "Wrong size on BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, EntryPoint) == 0x000000, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, Temp_bool_Has_Been_Initd_Variable) == 0x000007, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_GetDistanceTo_ReturnValue) == 0x000008, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000010, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000019, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00001C, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_AttachTo_ReturnValue) == 0x000028, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_AttachTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00002C, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000030, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00003C, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, K2Node_CustomEvent_Direction) == 0x000049, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue2) == 0x00004A, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x00004C, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_GetSocketLocation_ReturnValue) == 0x000054, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x000060, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_Subtract_VectorVector_ReturnValue3) == 0x00006C, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_Subtract_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_GetVelocity_ReturnValue) == 0x000078, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000084, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_Normal_ReturnValue) == 0x000090, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_Normal_ReturnValue2) == 0x00009C, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_Normal_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_VSize_ReturnValue) == 0x0000A8, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_VLerp_ReturnValue) == 0x0000AC, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_FClamp_ReturnValue) == 0x0000B8, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000BC, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x0000C0, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue3) == 0x0000CC, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_VInterpTo_ReturnValue) == 0x0000D0, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000DC, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue4) == 0x0000E8, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000EC, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000F8, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_FindLookAtRotation_ReturnValue2) == 0x000104, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_FindLookAtRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000110, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_SetWorldRotation_SweepHitResult2) == 0x000198, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_SetWorldRotation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000220, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000230, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg, CallFunc_IsValid_ReturnValue5) == 0x0002B8, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ExecuteUbergraph_BP_Card_LinkAllyToRedirectDmg::CallFunc_IsValid_ReturnValue5' has a wrong offset!");

// Function BP_Card_LinkAllyToRedirectDmg.BP_Card_LinkAllyToRedirectDmg_C.ChangeSplineWidth
// 0x0001 (0x0001 - 0x0000)
struct BP_Card_LinkAllyToRedirectDmg_C_ChangeSplineWidth final
{
public:
	bool                                          Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Card_LinkAllyToRedirectDmg_C_ChangeSplineWidth) == 0x000001, "Wrong alignment on BP_Card_LinkAllyToRedirectDmg_C_ChangeSplineWidth");
static_assert(sizeof(BP_Card_LinkAllyToRedirectDmg_C_ChangeSplineWidth) == 0x000001, "Wrong size on BP_Card_LinkAllyToRedirectDmg_C_ChangeSplineWidth");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ChangeSplineWidth, Direction) == 0x000000, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ChangeSplineWidth::Direction' has a wrong offset!");

// Function BP_Card_LinkAllyToRedirectDmg.BP_Card_LinkAllyToRedirectDmg_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Card_LinkAllyToRedirectDmg_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Card_LinkAllyToRedirectDmg_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Card_LinkAllyToRedirectDmg_C_ReceiveTick");
static_assert(sizeof(BP_Card_LinkAllyToRedirectDmg_C_ReceiveTick) == 0x000004, "Wrong size on BP_Card_LinkAllyToRedirectDmg_C_ReceiveTick");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Card_LinkAllyToRedirectDmg_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Card_LinkAllyToRedirectDmg.BP_Card_LinkAllyToRedirectDmg_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_Card_LinkAllyToRedirectDmg_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Card_LinkAllyToRedirectDmg_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Card_LinkAllyToRedirectDmg_C_UserConstructionScript");
static_assert(sizeof(BP_Card_LinkAllyToRedirectDmg_C_UserConstructionScript) == 0x000008, "Wrong size on BP_Card_LinkAllyToRedirectDmg_C_UserConstructionScript");
static_assert(offsetof(BP_Card_LinkAllyToRedirectDmg_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Card_LinkAllyToRedirectDmg_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

