#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_Metamorphosis

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Card_Metamorphosis.BP_Card_Metamorphosis_C.OnRep_InShadowPlane
// 0x0068 (0x0068 - 0x0000)
struct BP_Card_Metamorphosis_C_OnRep_InShadowPlane final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item2;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane) == 0x000008, "Wrong alignment on BP_Card_Metamorphosis_C_OnRep_InShadowPlane");
static_assert(sizeof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane) == 0x000068, "Wrong size on BP_Card_Metamorphosis_C_OnRep_InShadowPlane");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, Temp_int_Loop_Counter_Variable2) == 0x000004, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Add_IntInt_ReturnValue2) == 0x00000C, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, Temp_int_Array_Index_Variable2) == 0x000014, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_GetMaterials_ReturnValue) == 0x000018, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Array_Get_Item2) == 0x000050, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Array_Length_ReturnValue2) == 0x000058, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_IsValid_ReturnValue2) == 0x00005C, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Less_IntInt_ReturnValue) == 0x00005D, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Array_Length_ReturnValue3) == 0x000060, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_InShadowPlane, CallFunc_Less_IntInt_ReturnValue2) == 0x000064, "Member 'BP_Card_Metamorphosis_C_OnRep_InShadowPlane::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");

// Function BP_Card_Metamorphosis.BP_Card_Metamorphosis_C.OnRep_isVisible
// 0x0010 (0x0010 - 0x0000)
struct BP_Card_Metamorphosis_C_OnRep_isVisible final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlledPlayer_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Card_Metamorphosis_C_OnRep_isVisible) == 0x000008, "Wrong alignment on BP_Card_Metamorphosis_C_OnRep_isVisible");
static_assert(sizeof(BP_Card_Metamorphosis_C_OnRep_isVisible) == 0x000010, "Wrong size on BP_Card_Metamorphosis_C_OnRep_isVisible");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_isVisible, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_Card_Metamorphosis_C_OnRep_isVisible::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_isVisible, CallFunc_IsLocallyControlledPlayer_ReturnValue) == 0x000008, "Member 'BP_Card_Metamorphosis_C_OnRep_isVisible::CallFunc_IsLocallyControlledPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Metamorphosis_C_OnRep_isVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_Card_Metamorphosis_C_OnRep_isVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

