#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharSelect_Lights

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharSelect_Lights.BP_CharSelect_Lights_C
// 0x0040 (0x0358 - 0x0318)
class ABP_CharSelect_Lights_C final : public AActor
{
public:
	class USpotLightComponent*                    SpotLight1;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent05;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent03;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent02;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent01;                                  // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CharSelect_Lights_C">();
	}
	static class ABP_CharSelect_Lights_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CharSelect_Lights_C>();
	}
};
static_assert(alignof(ABP_CharSelect_Lights_C) == 0x000008, "Wrong alignment on ABP_CharSelect_Lights_C");
static_assert(sizeof(ABP_CharSelect_Lights_C) == 0x000358, "Wrong size on ABP_CharSelect_Lights_C");
static_assert(offsetof(ABP_CharSelect_Lights_C, SpotLight1) == 0x000318, "Member 'ABP_CharSelect_Lights_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ABP_CharSelect_Lights_C, SpotLight) == 0x000320, "Member 'ABP_CharSelect_Lights_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_CharSelect_Lights_C, Arrow) == 0x000328, "Member 'ABP_CharSelect_Lights_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_CharSelect_Lights_C, LightComponent05) == 0x000330, "Member 'ABP_CharSelect_Lights_C::LightComponent05' has a wrong offset!");
static_assert(offsetof(ABP_CharSelect_Lights_C, LightComponent03) == 0x000338, "Member 'ABP_CharSelect_Lights_C::LightComponent03' has a wrong offset!");
static_assert(offsetof(ABP_CharSelect_Lights_C, LightComponent02) == 0x000340, "Member 'ABP_CharSelect_Lights_C::LightComponent02' has a wrong offset!");
static_assert(offsetof(ABP_CharSelect_Lights_C, LightComponent01) == 0x000348, "Member 'ABP_CharSelect_Lights_C::LightComponent01' has a wrong offset!");
static_assert(offsetof(ABP_CharSelect_Lights_C, SharedRoot) == 0x000350, "Member 'ABP_CharSelect_Lights_C::SharedRoot' has a wrong offset!");

}

