#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_GroupPower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Card_GroupPower.BP_Card_GroupPower_C
// 0x0050 (0x0438 - 0x03E8)
class ABP_Card_GroupPower_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CollisionSphere;                                   // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_ToApply;                                        // 0x0408(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         LevelOfAbility;                                    // 0x0410(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Card_GroupPower(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Card_GroupPower_C">();
	}
	static class ABP_Card_GroupPower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Card_GroupPower_C>();
	}
};
static_assert(alignof(ABP_Card_GroupPower_C) == 0x000008, "Wrong alignment on ABP_Card_GroupPower_C");
static_assert(sizeof(ABP_Card_GroupPower_C) == 0x000438, "Wrong size on ABP_Card_GroupPower_C");
static_assert(offsetof(ABP_Card_GroupPower_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_Card_GroupPower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Card_GroupPower_C, OrionGameplayVolume) == 0x0003F0, "Member 'ABP_Card_GroupPower_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_Card_GroupPower_C, CollisionSphere) == 0x0003F8, "Member 'ABP_Card_GroupPower_C::CollisionSphere' has a wrong offset!");
static_assert(offsetof(ABP_Card_GroupPower_C, DefaultSceneRoot) == 0x000400, "Member 'ABP_Card_GroupPower_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Card_GroupPower_C, GE_ToApply) == 0x000408, "Member 'ABP_Card_GroupPower_C::GE_ToApply' has a wrong offset!");
static_assert(offsetof(ABP_Card_GroupPower_C, LevelOfAbility) == 0x000410, "Member 'ABP_Card_GroupPower_C::LevelOfAbility' has a wrong offset!");

}

