#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_Fireball_ImpactDecal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Card_Fireball_ImpactDecal.BP_Card_Fireball_ImpactDecal_C
// 0x0030 (0x0350 - 0x0320)
class ABP_Card_Fireball_ImpactDecal_C final : public ADecalActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(Transient, DuplicateTransient)
	class UDecalComponent*                        DecalEmissive;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Decal_MID;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SlopeDirection;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Decal_E_MID;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Card_Fireball_ImpactDecal(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Card_Fireball_ImpactDecal_C">();
	}
	static class ABP_Card_Fireball_ImpactDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Card_Fireball_ImpactDecal_C>();
	}
};
static_assert(alignof(ABP_Card_Fireball_ImpactDecal_C) == 0x000008, "Wrong alignment on ABP_Card_Fireball_ImpactDecal_C");
static_assert(sizeof(ABP_Card_Fireball_ImpactDecal_C) == 0x000350, "Wrong size on ABP_Card_Fireball_ImpactDecal_C");
static_assert(offsetof(ABP_Card_Fireball_ImpactDecal_C, UberGraphFrame) == 0x000320, "Member 'ABP_Card_Fireball_ImpactDecal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Card_Fireball_ImpactDecal_C, DecalEmissive) == 0x000328, "Member 'ABP_Card_Fireball_ImpactDecal_C::DecalEmissive' has a wrong offset!");
static_assert(offsetof(ABP_Card_Fireball_ImpactDecal_C, Decal_MID) == 0x000330, "Member 'ABP_Card_Fireball_ImpactDecal_C::Decal_MID' has a wrong offset!");
static_assert(offsetof(ABP_Card_Fireball_ImpactDecal_C, SlopeDirection) == 0x000338, "Member 'ABP_Card_Fireball_ImpactDecal_C::SlopeDirection' has a wrong offset!");
static_assert(offsetof(ABP_Card_Fireball_ImpactDecal_C, Decal_E_MID) == 0x000348, "Member 'ABP_Card_Fireball_ImpactDecal_C::Decal_E_MID' has a wrong offset!");

}

