#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_Aura_SacrificialAura

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Card_Aura_SacrificialAura.BP_Card_Aura_SacrificialAura_C
// 0x0028 (0x0410 - 0x03E8)
class ABP_Card_Aura_SacrificialAura_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolumeStatusTrack;                    // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CollisionSphere;                                   // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Card_Aura_SacrificialAura(int32 EntryPoint);
	void BndEvt__OrionGameplayVolume_K2Node_ComponentBoundEvent_0_ContainerEffectApplied__DelegateSignature(class AActor* Target);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Card_Aura_SacrificialAura_C">();
	}
	static class ABP_Card_Aura_SacrificialAura_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Card_Aura_SacrificialAura_C>();
	}
};
static_assert(alignof(ABP_Card_Aura_SacrificialAura_C) == 0x000008, "Wrong alignment on ABP_Card_Aura_SacrificialAura_C");
static_assert(sizeof(ABP_Card_Aura_SacrificialAura_C) == 0x000410, "Wrong size on ABP_Card_Aura_SacrificialAura_C");
static_assert(offsetof(ABP_Card_Aura_SacrificialAura_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_Card_Aura_SacrificialAura_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Card_Aura_SacrificialAura_C, OrionGameplayVolumeStatusTrack) == 0x0003F0, "Member 'ABP_Card_Aura_SacrificialAura_C::OrionGameplayVolumeStatusTrack' has a wrong offset!");
static_assert(offsetof(ABP_Card_Aura_SacrificialAura_C, OrionGameplayVolume) == 0x0003F8, "Member 'ABP_Card_Aura_SacrificialAura_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_Card_Aura_SacrificialAura_C, CollisionSphere) == 0x000400, "Member 'ABP_Card_Aura_SacrificialAura_C::CollisionSphere' has a wrong offset!");
static_assert(offsetof(ABP_Card_Aura_SacrificialAura_C, DefaultSceneRoot) == 0x000408, "Member 'ABP_Card_Aura_SacrificialAura_C::DefaultSceneRoot' has a wrong offset!");

}

