#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_ArmoredShadowWard

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_OrionVisionWard_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Card_ArmoredShadowWard.BP_Card_ArmoredShadowWard_C
// 0x0048 (0x0708 - 0x06C0)
class ABP_Card_ArmoredShadowWard_C final : public ABP_OrionVisionWard_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Card_ArmoredShadowWard_C;        // 0x06C0(0x0008)(Transient, DuplicateTransient)
	class USphereComponent*                       CollisionSphere;                                   // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeGoingToStealth;                         // 0x06D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            StealthGameplayEffectHandle;                       // 0x06DC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeReturningToStealth;                     // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionFilterAndEffectsContainer        TargetFilter;                                      // 0x06E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Card_ArmoredShadowWard(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Card_ArmoredShadowWard_C">();
	}
	static class ABP_Card_ArmoredShadowWard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Card_ArmoredShadowWard_C>();
	}
};
static_assert(alignof(ABP_Card_ArmoredShadowWard_C) == 0x000008, "Wrong alignment on ABP_Card_ArmoredShadowWard_C");
static_assert(sizeof(ABP_Card_ArmoredShadowWard_C) == 0x000708, "Wrong size on ABP_Card_ArmoredShadowWard_C");
static_assert(offsetof(ABP_Card_ArmoredShadowWard_C, UberGraphFrame_BP_Card_ArmoredShadowWard_C) == 0x0006C0, "Member 'ABP_Card_ArmoredShadowWard_C::UberGraphFrame_BP_Card_ArmoredShadowWard_C' has a wrong offset!");
static_assert(offsetof(ABP_Card_ArmoredShadowWard_C, CollisionSphere) == 0x0006C8, "Member 'ABP_Card_ArmoredShadowWard_C::CollisionSphere' has a wrong offset!");
static_assert(offsetof(ABP_Card_ArmoredShadowWard_C, OrionGameplayVolume) == 0x0006D0, "Member 'ABP_Card_ArmoredShadowWard_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_Card_ArmoredShadowWard_C, DelayBeforeGoingToStealth) == 0x0006D8, "Member 'ABP_Card_ArmoredShadowWard_C::DelayBeforeGoingToStealth' has a wrong offset!");
static_assert(offsetof(ABP_Card_ArmoredShadowWard_C, StealthGameplayEffectHandle) == 0x0006DC, "Member 'ABP_Card_ArmoredShadowWard_C::StealthGameplayEffectHandle' has a wrong offset!");
static_assert(offsetof(ABP_Card_ArmoredShadowWard_C, DelayBeforeReturningToStealth) == 0x0006E4, "Member 'ABP_Card_ArmoredShadowWard_C::DelayBeforeReturningToStealth' has a wrong offset!");
static_assert(offsetof(ABP_Card_ArmoredShadowWard_C, TargetFilter) == 0x0006E8, "Member 'ABP_Card_ArmoredShadowWard_C::TargetFilter' has a wrong offset!");

}

