#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_Suppress_GroundPickup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Card_Suppress_GroundPickup.BP_Card_Suppress_GroundPickup_C
// 0x0030 (0x0418 - 0x03E8)
class ABP_Card_Suppress_GroundPickup_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Suppress_Projectile;                             // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CollisionSphere;                                   // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ProjTimeout;                                       // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldStartLoc;                                     // 0x040C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Card_Suppress_GroundPickup(int32 EntryPoint);
	void Gameplay_Effect_Applied();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Card_Suppress_GroundPickup_C">();
	}
	static class ABP_Card_Suppress_GroundPickup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Card_Suppress_GroundPickup_C>();
	}
};
static_assert(alignof(ABP_Card_Suppress_GroundPickup_C) == 0x000008, "Wrong alignment on ABP_Card_Suppress_GroundPickup_C");
static_assert(sizeof(ABP_Card_Suppress_GroundPickup_C) == 0x000418, "Wrong size on ABP_Card_Suppress_GroundPickup_C");
static_assert(offsetof(ABP_Card_Suppress_GroundPickup_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_Card_Suppress_GroundPickup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Card_Suppress_GroundPickup_C, P_Suppress_Projectile) == 0x0003F0, "Member 'ABP_Card_Suppress_GroundPickup_C::P_Suppress_Projectile' has a wrong offset!");
static_assert(offsetof(ABP_Card_Suppress_GroundPickup_C, CollisionSphere) == 0x0003F8, "Member 'ABP_Card_Suppress_GroundPickup_C::CollisionSphere' has a wrong offset!");
static_assert(offsetof(ABP_Card_Suppress_GroundPickup_C, OrionGameplayVolume) == 0x000400, "Member 'ABP_Card_Suppress_GroundPickup_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_Card_Suppress_GroundPickup_C, ProjTimeout) == 0x000408, "Member 'ABP_Card_Suppress_GroundPickup_C::ProjTimeout' has a wrong offset!");
static_assert(offsetof(ABP_Card_Suppress_GroundPickup_C, WorldStartLoc) == 0x00040C, "Member 'ABP_Card_Suppress_GroundPickup_C::WorldStartLoc' has a wrong offset!");

}

