#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_Metamorphosis

#include "Basic.hpp"

#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Card_Metamorphosis.BP_Card_Metamorphosis_C
// 0x0030 (0x0418 - 0x03E8)
class ABP_Card_Metamorphosis_C final : public AOrionBaseActor
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh_Illusion;                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             SpawningActor;                                     // 0x03F8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     ShadowPlaneMaterial;                               // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     BugMaterial;                                       // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InShadowPlane;                                     // 0x0410(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          IsVisible;                                         // 0x0411(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor)

public:
	void UserConstructionScript();
	void OnRep_InShadowPlane();
	void OnRep_isVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Card_Metamorphosis_C">();
	}
	static class ABP_Card_Metamorphosis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Card_Metamorphosis_C>();
	}
};
static_assert(alignof(ABP_Card_Metamorphosis_C) == 0x000008, "Wrong alignment on ABP_Card_Metamorphosis_C");
static_assert(sizeof(ABP_Card_Metamorphosis_C) == 0x000418, "Wrong size on ABP_Card_Metamorphosis_C");
static_assert(offsetof(ABP_Card_Metamorphosis_C, SkeletalMesh_Illusion) == 0x0003E8, "Member 'ABP_Card_Metamorphosis_C::SkeletalMesh_Illusion' has a wrong offset!");
static_assert(offsetof(ABP_Card_Metamorphosis_C, DefaultSceneRoot) == 0x0003F0, "Member 'ABP_Card_Metamorphosis_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Card_Metamorphosis_C, SpawningActor) == 0x0003F8, "Member 'ABP_Card_Metamorphosis_C::SpawningActor' has a wrong offset!");
static_assert(offsetof(ABP_Card_Metamorphosis_C, ShadowPlaneMaterial) == 0x000400, "Member 'ABP_Card_Metamorphosis_C::ShadowPlaneMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Card_Metamorphosis_C, BugMaterial) == 0x000408, "Member 'ABP_Card_Metamorphosis_C::BugMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Card_Metamorphosis_C, InShadowPlane) == 0x000410, "Member 'ABP_Card_Metamorphosis_C::InShadowPlane' has a wrong offset!");
static_assert(offsetof(ABP_Card_Metamorphosis_C, IsVisible) == 0x000411, "Member 'ABP_Card_Metamorphosis_C::IsVisible' has a wrong offset!");

}

