#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_MinionsBuffMe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Card_MinionsBuffMe.BP_Card_MinionsBuffMe_C
// 0x0060 (0x0448 - 0x03E8)
class ABP_Card_MinionsBuffMe_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CollisionSphere;                                   // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventAddTag;                                       // 0x0408(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventRemoveTag;                                    // 0x0410(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         LevelOfAbility;                                    // 0x0418(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            GE_ToApply;                                        // 0x0440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Card_MinionsBuffMe(int32 EntryPoint);
	void BndEvt__OrionGameplayVolume_K2Node_ComponentBoundEvent_1_ContainerEffectApplied__DelegateSignature(class AActor* Target);
	void BndEvt__OrionGameplayVolume_K2Node_ComponentBoundEvent_1_ContainerEffectRemoved__DelegateSignature(class AActor* Target);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Card_MinionsBuffMe_C">();
	}
	static class ABP_Card_MinionsBuffMe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Card_MinionsBuffMe_C>();
	}
};
static_assert(alignof(ABP_Card_MinionsBuffMe_C) == 0x000008, "Wrong alignment on ABP_Card_MinionsBuffMe_C");
static_assert(sizeof(ABP_Card_MinionsBuffMe_C) == 0x000448, "Wrong size on ABP_Card_MinionsBuffMe_C");
static_assert(offsetof(ABP_Card_MinionsBuffMe_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_Card_MinionsBuffMe_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Card_MinionsBuffMe_C, OrionGameplayVolume) == 0x0003F0, "Member 'ABP_Card_MinionsBuffMe_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_Card_MinionsBuffMe_C, CollisionSphere) == 0x0003F8, "Member 'ABP_Card_MinionsBuffMe_C::CollisionSphere' has a wrong offset!");
static_assert(offsetof(ABP_Card_MinionsBuffMe_C, DefaultSceneRoot) == 0x000400, "Member 'ABP_Card_MinionsBuffMe_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Card_MinionsBuffMe_C, EventAddTag) == 0x000408, "Member 'ABP_Card_MinionsBuffMe_C::EventAddTag' has a wrong offset!");
static_assert(offsetof(ABP_Card_MinionsBuffMe_C, EventRemoveTag) == 0x000410, "Member 'ABP_Card_MinionsBuffMe_C::EventRemoveTag' has a wrong offset!");
static_assert(offsetof(ABP_Card_MinionsBuffMe_C, LevelOfAbility) == 0x000418, "Member 'ABP_Card_MinionsBuffMe_C::LevelOfAbility' has a wrong offset!");
static_assert(offsetof(ABP_Card_MinionsBuffMe_C, GE_ToApply) == 0x000440, "Member 'ABP_Card_MinionsBuffMe_C::GE_ToApply' has a wrong offset!");

}

