#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Card_Fireball_ImpactDecal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Card_Fireball_ImpactDecal.BP_Card_Fireball_ImpactDecal_C.ExecuteUbergraph_BP_Card_Fireball_ImpactDecal
// 0x0058 (0x0058 - 0x0000)
struct BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0004(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue2;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal) == 0x000008, "Wrong alignment on BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal");
static_assert(sizeof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal) == 0x000058, "Wrong size on BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal");
static_assert(offsetof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal, EntryPoint) == 0x000000, "Member 'BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000004, "Member 'BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal, CallFunc_GetForwardVector_ReturnValue) == 0x000010, "Member 'BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00001C, "Member 'BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000028, "Member 'BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal, CallFunc_GetDecalMaterial_ReturnValue) == 0x000038, "Member 'BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal::CallFunc_GetDecalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal, CallFunc_GetDecalMaterial_ReturnValue2) == 0x000048, "Member 'BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal::CallFunc_GetDecalMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000050, "Member 'BP_Card_Fireball_ImpactDecal_C_ExecuteUbergraph_BP_Card_Fireball_ImpactDecal::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");

}

