#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decal_SentryTurret_Death

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Decal_SentryTurret_Death.BP_Decal_SentryTurret_Death_C
// 0x0018 (0x0338 - 0x0320)
class ABP_Decal_SentryTurret_Death_C final : public ADecalActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(Transient, DuplicateTransient)
	class UDecalComponent*                        Embers;                                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Shockwave;                                         // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Decal_SentryTurret_Death(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Decal_SentryTurret_Death_C">();
	}
	static class ABP_Decal_SentryTurret_Death_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Decal_SentryTurret_Death_C>();
	}
};
static_assert(alignof(ABP_Decal_SentryTurret_Death_C) == 0x000008, "Wrong alignment on ABP_Decal_SentryTurret_Death_C");
static_assert(sizeof(ABP_Decal_SentryTurret_Death_C) == 0x000338, "Wrong size on ABP_Decal_SentryTurret_Death_C");
static_assert(offsetof(ABP_Decal_SentryTurret_Death_C, UberGraphFrame) == 0x000320, "Member 'ABP_Decal_SentryTurret_Death_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Decal_SentryTurret_Death_C, Embers) == 0x000328, "Member 'ABP_Decal_SentryTurret_Death_C::Embers' has a wrong offset!");
static_assert(offsetof(ABP_Decal_SentryTurret_Death_C, Shockwave) == 0x000330, "Member 'ABP_Decal_SentryTurret_Death_C::Shockwave' has a wrong offset!");

}

