#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decal_Prime_Landing

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Decal_Prime_Landing.BP_Decal_Prime_Landing_C
// 0x0050 (0x0370 - 0x0320)
class ABP_Decal_Prime_Landing_C final : public ADecalActor
{
public:
	class UParticleSystemComponent*               ResdiualSmokeFX_FrontLeft;                         // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ResidualSmokeFX_FrontRight;                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Front_Emissive_Decal_Left;                         // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Front_Base_Decal_Left;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Front_Base_Decal_right;                            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Front_Emissive_Decal_Right;                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Base_Decal_left;                                   // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Emissive_Decal_Left;                               // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Base_Decal_Right;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Emissive_Decal_Right;                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Decal_Prime_Landing_C">();
	}
	static class ABP_Decal_Prime_Landing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Decal_Prime_Landing_C>();
	}
};
static_assert(alignof(ABP_Decal_Prime_Landing_C) == 0x000008, "Wrong alignment on ABP_Decal_Prime_Landing_C");
static_assert(sizeof(ABP_Decal_Prime_Landing_C) == 0x000370, "Wrong size on ABP_Decal_Prime_Landing_C");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, ResdiualSmokeFX_FrontLeft) == 0x000320, "Member 'ABP_Decal_Prime_Landing_C::ResdiualSmokeFX_FrontLeft' has a wrong offset!");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, ResidualSmokeFX_FrontRight) == 0x000328, "Member 'ABP_Decal_Prime_Landing_C::ResidualSmokeFX_FrontRight' has a wrong offset!");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, Front_Emissive_Decal_Left) == 0x000330, "Member 'ABP_Decal_Prime_Landing_C::Front_Emissive_Decal_Left' has a wrong offset!");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, Front_Base_Decal_Left) == 0x000338, "Member 'ABP_Decal_Prime_Landing_C::Front_Base_Decal_Left' has a wrong offset!");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, Front_Base_Decal_right) == 0x000340, "Member 'ABP_Decal_Prime_Landing_C::Front_Base_Decal_right' has a wrong offset!");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, Front_Emissive_Decal_Right) == 0x000348, "Member 'ABP_Decal_Prime_Landing_C::Front_Emissive_Decal_Right' has a wrong offset!");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, Base_Decal_left) == 0x000350, "Member 'ABP_Decal_Prime_Landing_C::Base_Decal_left' has a wrong offset!");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, Emissive_Decal_Left) == 0x000358, "Member 'ABP_Decal_Prime_Landing_C::Emissive_Decal_Left' has a wrong offset!");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, Base_Decal_Right) == 0x000360, "Member 'ABP_Decal_Prime_Landing_C::Base_Decal_Right' has a wrong offset!");
static_assert(offsetof(ABP_Decal_Prime_Landing_C, Emissive_Decal_Right) == 0x000368, "Member 'ABP_Decal_Prime_Landing_C::Emissive_Decal_Right' has a wrong offset!");

}

