#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decal_Card_AOEHealBurst

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Decal_Card_AOEHealBurst.BP_Decal_Card_AOEHealBurst_C.ExecuteUbergraph_BP_Decal_Card_AOEHealBurst
// 0x0004 (0x0004 - 0x0000)
struct BP_Decal_Card_AOEHealBurst_C_ExecuteUbergraph_BP_Decal_Card_AOEHealBurst final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_Card_AOEHealBurst_C_ExecuteUbergraph_BP_Decal_Card_AOEHealBurst) == 0x000004, "Wrong alignment on BP_Decal_Card_AOEHealBurst_C_ExecuteUbergraph_BP_Decal_Card_AOEHealBurst");
static_assert(sizeof(BP_Decal_Card_AOEHealBurst_C_ExecuteUbergraph_BP_Decal_Card_AOEHealBurst) == 0x000004, "Wrong size on BP_Decal_Card_AOEHealBurst_C_ExecuteUbergraph_BP_Decal_Card_AOEHealBurst");
static_assert(offsetof(BP_Decal_Card_AOEHealBurst_C_ExecuteUbergraph_BP_Decal_Card_AOEHealBurst, EntryPoint) == 0x000000, "Member 'BP_Decal_Card_AOEHealBurst_C_ExecuteUbergraph_BP_Decal_Card_AOEHealBurst::EntryPoint' has a wrong offset!");

// Function BP_Decal_Card_AOEHealBurst.BP_Decal_Card_AOEHealBurst_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_Decal_Card_AOEHealBurst_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decal_Card_AOEHealBurst_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Decal_Card_AOEHealBurst_C_UserConstructionScript");
static_assert(sizeof(BP_Decal_Card_AOEHealBurst_C_UserConstructionScript) == 0x000008, "Wrong size on BP_Decal_Card_AOEHealBurst_C_UserConstructionScript");
static_assert(offsetof(BP_Decal_Card_AOEHealBurst_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Decal_Card_AOEHealBurst_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

