#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decal_SentryTurret_Death

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Decal_SentryTurret_Death.BP_Decal_SentryTurret_Death_C.ExecuteUbergraph_BP_Decal_SentryTurret_Death
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddActorLocalRotation_SweepHitResult;  // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death) == 0x000008, "Wrong alignment on BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death");
static_assert(sizeof(BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death) == 0x0000A0, "Wrong size on BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death");
static_assert(offsetof(BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death, EntryPoint) == 0x000000, "Member 'BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death, CallFunc_K2_AddActorLocalRotation_SweepHitResult) == 0x000018, "Member 'BP_Decal_SentryTurret_Death_C_ExecuteUbergraph_BP_Decal_SentryTurret_Death::CallFunc_K2_AddActorLocalRotation_SweepHitResult' has a wrong offset!");

}

