#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FronEndSkybox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FronEndSkybox.BP_FronEndSkybox_C.UserConstructionScript
// 0x00E0 (0x00E0 - 0x0000)
struct BP_FronEndSkybox_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0008(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FronEndSkybox_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_FronEndSkybox_C_UserConstructionScript");
static_assert(sizeof(BP_FronEndSkybox_C_UserConstructionScript) == 0x0000E0, "Wrong size on BP_FronEndSkybox_C_UserConstructionScript");
static_assert(offsetof(BP_FronEndSkybox_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_FronEndSkybox_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FronEndSkybox_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000008, "Member 'BP_FronEndSkybox_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FronEndSkybox_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_FronEndSkybox_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FronEndSkybox_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000050, "Member 'BP_FronEndSkybox_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");

}

