#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FogSheet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FogSheet.BP_FogSheet_C
// 0x00A0 (0x03B8 - 0x0318)
class ABP_FogSheet_C final : public AActor
{
public:
	class UBillboardComponent*                    FogSheet;                                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Additive;                                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              FogSheetMasterMaterial;                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FogSheetMID;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               NoiseTexture;                                      // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_0;                                           // 0x0340(0x0010)(Edit, ConstParm, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Brightness;                                        // 0x0350(0x0004)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size;                                              // 0x0360(0x000C)(Edit, ConstParm, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Opacity;                                           // 0x036C(0x0004)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         DepthFadeDistance;                                 // 0x0370(0x0004)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         NoiseSize;                                         // 0x0374(0x0004)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PanningSpeed;                                      // 0x0378(0x0004)(Edit, ConstParm, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraFadeBias;                                    // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraFadeScale;                                   // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraFalloff;                                     // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTessellatedMesh;                                // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Animated;                                          // 0x0389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              FogSheetMasterMaterial_Additive;                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cine;                                              // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseSeperateTranslucency;                           // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              FogSheetMasterMaterial_SepOFF;                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              FogSheetMasterMaterial_Additive_SepOFF;            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FogSheet_C">();
	}
	static class ABP_FogSheet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FogSheet_C>();
	}
};
static_assert(alignof(ABP_FogSheet_C) == 0x000008, "Wrong alignment on ABP_FogSheet_C");
static_assert(sizeof(ABP_FogSheet_C) == 0x0003B8, "Wrong size on ABP_FogSheet_C");
static_assert(offsetof(ABP_FogSheet_C, FogSheet) == 0x000318, "Member 'ABP_FogSheet_C::FogSheet' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, Additive) == 0x000320, "Member 'ABP_FogSheet_C::Additive' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, FogSheetMasterMaterial) == 0x000328, "Member 'ABP_FogSheet_C::FogSheetMasterMaterial' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, FogSheetMID) == 0x000330, "Member 'ABP_FogSheet_C::FogSheetMID' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, NoiseTexture) == 0x000338, "Member 'ABP_FogSheet_C::NoiseTexture' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, Color_0) == 0x000340, "Member 'ABP_FogSheet_C::Color_0' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, Brightness) == 0x000350, "Member 'ABP_FogSheet_C::Brightness' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, ParticleSystem) == 0x000358, "Member 'ABP_FogSheet_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, Size) == 0x000360, "Member 'ABP_FogSheet_C::Size' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, Opacity) == 0x00036C, "Member 'ABP_FogSheet_C::Opacity' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, DepthFadeDistance) == 0x000370, "Member 'ABP_FogSheet_C::DepthFadeDistance' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, NoiseSize) == 0x000374, "Member 'ABP_FogSheet_C::NoiseSize' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, PanningSpeed) == 0x000378, "Member 'ABP_FogSheet_C::PanningSpeed' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, CameraFadeBias) == 0x00037C, "Member 'ABP_FogSheet_C::CameraFadeBias' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, CameraFadeScale) == 0x000380, "Member 'ABP_FogSheet_C::CameraFadeScale' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, CameraFalloff) == 0x000384, "Member 'ABP_FogSheet_C::CameraFalloff' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, UseTessellatedMesh) == 0x000388, "Member 'ABP_FogSheet_C::UseTessellatedMesh' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, Animated) == 0x000389, "Member 'ABP_FogSheet_C::Animated' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, FogSheetMasterMaterial_Additive) == 0x000390, "Member 'ABP_FogSheet_C::FogSheetMasterMaterial_Additive' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, Mesh) == 0x000398, "Member 'ABP_FogSheet_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, Cine) == 0x0003A0, "Member 'ABP_FogSheet_C::Cine' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, UseSeperateTranslucency) == 0x0003A1, "Member 'ABP_FogSheet_C::UseSeperateTranslucency' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, FogSheetMasterMaterial_SepOFF) == 0x0003A8, "Member 'ABP_FogSheet_C::FogSheetMasterMaterial_SepOFF' has a wrong offset!");
static_assert(offsetof(ABP_FogSheet_C, FogSheetMasterMaterial_Additive_SepOFF) == 0x0003B0, "Member 'ABP_FogSheet_C::FogSheetMasterMaterial_Additive_SepOFF' has a wrong offset!");

}

