#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeroPedestal_Sparrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HeroPedestal_classes.hpp"
#include "OrionGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HeroPedestal_Sparrow.BP_HeroPedestal_Sparrow_C
// 0x0020 (0x06C0 - 0x06A0)
class ABP_HeroPedestal_Sparrow_C final : public ABP_HeroPedestal_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_HeroPedestal_Sparrow_C;          // 0x0698(0x0008)(Transient, DuplicateTransient)
	class UParticleSystem*                        Bow_Highlight_VFX;                                 // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Spawned_FX;                                        // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RespawnTimer;                                      // 0x06B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         VFX_Time_Dilation;                                 // 0x06B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HeroPedestal_Sparrow(int32 EntryPoint);
	void Spawn();
	void OnPedestalActorTypeSet(EPedestalActorType PedestalActorType_0);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HeroPedestal_Sparrow_C">();
	}
	static class ABP_HeroPedestal_Sparrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HeroPedestal_Sparrow_C>();
	}
};
static_assert(alignof(ABP_HeroPedestal_Sparrow_C) == 0x000010, "Wrong alignment on ABP_HeroPedestal_Sparrow_C");
static_assert(sizeof(ABP_HeroPedestal_Sparrow_C) == 0x0006C0, "Wrong size on ABP_HeroPedestal_Sparrow_C");
static_assert(offsetof(ABP_HeroPedestal_Sparrow_C, UberGraphFrame_BP_HeroPedestal_Sparrow_C) == 0x000698, "Member 'ABP_HeroPedestal_Sparrow_C::UberGraphFrame_BP_HeroPedestal_Sparrow_C' has a wrong offset!");
static_assert(offsetof(ABP_HeroPedestal_Sparrow_C, Bow_Highlight_VFX) == 0x0006A0, "Member 'ABP_HeroPedestal_Sparrow_C::Bow_Highlight_VFX' has a wrong offset!");
static_assert(offsetof(ABP_HeroPedestal_Sparrow_C, Spawned_FX) == 0x0006A8, "Member 'ABP_HeroPedestal_Sparrow_C::Spawned_FX' has a wrong offset!");
static_assert(offsetof(ABP_HeroPedestal_Sparrow_C, RespawnTimer) == 0x0006B0, "Member 'ABP_HeroPedestal_Sparrow_C::RespawnTimer' has a wrong offset!");
static_assert(offsetof(ABP_HeroPedestal_Sparrow_C, VFX_Time_Dilation) == 0x0006B8, "Member 'ABP_HeroPedestal_Sparrow_C::VFX_Time_Dilation' has a wrong offset!");

}

