#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hero

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function BP_Hero.BP_Hero_C.ExecuteUbergraph_BP_Hero
// 0x07E8 (0x07E8 - 0x0000)
struct BP_Hero_C_ExecuteUbergraph_BP_Hero final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x0008(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_TestActivateBanner_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType7;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters7;               // 0x0028(0x00B8)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetInstigatorActor_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionPlayerState_Game*                 K2Node_DynamicCast_AsOrion_Player_State_Game;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             CallFunc_GetCurrentPawn_ReturnValue;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_PlaySoundTeamAdjustedForSelf_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType6;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters6;               // 0x0120(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue2;         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType5;                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters5;               // 0x01E0(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue3;         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType4;                // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters4;               // 0x02A0(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x035C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetTeamColorFromMPC_ReturnValue;          // 0x0370(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0380(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             K2Node_CustomEvent_DeadChar;                       // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_Killer;                         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GSM_BaseMOBA_C*                     K2Node_DynamicCast_AsBP_GSM_Base_MOBA;             // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType3;                // 0x03CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters3;               // 0x03D0(0x00B8)(ContainsInstancedReference)
	EOrionTeam                                    K2Node_Event_NewTeamIdx;                           // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType2;                // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters2;               // 0x0490(0x00B8)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetInstigatorActor_ReturnValue2;          // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionPlayerState_Game*                 K2Node_DynamicCast_AsOrion_Player_State_Game2;     // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundTeamAdjusted_ReturnValue;       // 0x0560(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             CallFunc_GetCurrentPawn_ReturnValue2;              // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestActivateBanner_ReturnValue2;          // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_572[0x6];                                      // 0x0572(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AOrionChar* DeadChar, class AController* Killer, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate;              // 0x0578(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0588(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAnimInstance*                     K2Node_DynamicCast_AsOrion_Anim_Instance;          // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue4;         // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA[0x6];                                      // 0x05AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_CustomEvent_Parameters;                     // 0x05B0(0x00B8)(ContainsInstancedReference)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0668(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2; // 0x0680(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_692[0x6];                                      // 0x0692(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0698(0x00B8)(ContainsInstancedReference)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue2;                // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GSM_BaseMOBA_C*                     K2Node_DynamicCast_AsBP_GSM_Base_MOBA2;            // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundTeamAdjusted_ReturnValue2;      // 0x0768(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundTeamAdjusted_ReturnValue3;      // 0x0770(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2; // 0x0778(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0782(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0783(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0784(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785[0x3];                                      // 0x0785(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionMcpCrownItemDefinition*           CallFunc_GetCurrentCrown_ReturnValue;              // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0791(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_792[0x6];                                      // 0x0792(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0798(0x0018)(HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetActiveRotationalContentTags_ReturnValue; // 0x07B0(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue2;  // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x07D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2[0x6];                                      // 0x07D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x07D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlledPlayer_ReturnValue;    // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hero_C_ExecuteUbergraph_BP_Hero) == 0x000008, "Wrong alignment on BP_Hero_C_ExecuteUbergraph_BP_Hero");
static_assert(sizeof(BP_Hero_C_ExecuteUbergraph_BP_Hero) == 0x0007E8, "Wrong size on BP_Hero_C_ExecuteUbergraph_BP_Hero");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, EntryPoint) == 0x000000, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_InputKeyEvent_Key2) == 0x000008, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_InputKeyEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_TestActivateBanner_ReturnValue) == 0x000020, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_TestActivateBanner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, Temp_bool_Has_Been_Initd_Variable) == 0x000021, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_EventType7) == 0x000022, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_EventType7' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_Parameters7) == 0x000028, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_Parameters7' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetInstigatorActor_ReturnValue) == 0x0000E0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_AsOrion_Player_State_Game) == 0x0000F0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_AsOrion_Player_State_Game' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetCurrentPawn_ReturnValue) == 0x000100, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetCurrentPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_IsValid_ReturnValue2) == 0x000108, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_IsLocallyControlled_ReturnValue) == 0x000109, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_PlaySoundTeamAdjustedForSelf_ReturnValue) == 0x000110, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_PlaySoundTeamAdjustedForSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_EventType6) == 0x000118, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_EventType6' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_Parameters6) == 0x000120, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_Parameters6' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_IsLocallyControlled_ReturnValue2) == 0x0001D8, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_IsLocallyControlled_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_EventType5) == 0x0001D9, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_EventType5' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_Parameters5) == 0x0001E0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_Parameters5' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_IsLocallyControlled_ReturnValue3) == 0x000298, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_IsLocallyControlled_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_EventType4) == 0x000299, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_EventType4' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_Parameters4) == 0x0002A0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_Parameters4' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_SwitchEnum_CmpSuccess) == 0x000358, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00035C, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000368, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetTeamColorFromMPC_ReturnValue) == 0x000370, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetTeamColorFromMPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000380, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_CustomEvent_DeadChar) == 0x000390, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_CustomEvent_DeadChar' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_CustomEvent_Killer) == 0x000398, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_CustomEvent_Killer' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_CustomEvent_DamageCauser) == 0x0003A0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0003A8, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x0003B0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetGameState_ReturnValue) == 0x0003B8, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_AsBP_GSM_Base_MOBA) == 0x0003C0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_AsBP_GSM_Base_MOBA' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_bSuccess2) == 0x0003C8, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetTeamNum_ReturnValue) == 0x0003C9, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, Temp_bool_IsClosed_Variable) == 0x0003CA, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_EventType3) == 0x0003CB, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_EventType3' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_Parameters3) == 0x0003D0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_Parameters3' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_Event_NewTeamIdx) == 0x000488, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_Event_NewTeamIdx' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_EventType2) == 0x000489, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_EventType2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_Parameters2) == 0x000490, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_Parameters2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetInstigatorActor_ReturnValue2) == 0x000548, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetInstigatorActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_AsOrion_Player_State_Game2) == 0x000550, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_AsOrion_Player_State_Game2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_bSuccess3) == 0x000558, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_SpawnSoundTeamAdjusted_ReturnValue) == 0x000560, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_SpawnSoundTeamAdjusted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetCurrentPawn_ReturnValue2) == 0x000568, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetCurrentPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_TestActivateBanner_ReturnValue2) == 0x000570, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_TestActivateBanner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_IsValid_ReturnValue3) == 0x000571, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_CreateDelegate_OutputDelegate) == 0x000578, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000588, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetAnimInstance_ReturnValue) == 0x000590, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, Temp_bool_Variable) == 0x000598, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_AsOrion_Anim_Instance) == 0x0005A0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_AsOrion_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_bSuccess4) == 0x0005A8, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_IsLocallyControlled_ReturnValue4) == 0x0005A9, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_IsLocallyControlled_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_CustomEvent_Parameters) == 0x0005B0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_CustomEvent_Parameters' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000668, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_bSuccess5) == 0x000678, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2) == 0x000680, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_bSuccess6) == 0x000690, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_EventType) == 0x000691, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_GameplayCueEvent_Parameters) == 0x000698, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetGameState_ReturnValue2) == 0x000750, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetGameState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_AsBP_GSM_Base_MOBA2) == 0x000758, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_AsBP_GSM_Base_MOBA2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_DynamicCast_bSuccess7) == 0x000760, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_SpawnSoundTeamAdjusted_ReturnValue2) == 0x000768, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_SpawnSoundTeamAdjusted_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_SpawnSoundTeamAdjusted_ReturnValue3) == 0x000770, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_SpawnSoundTeamAdjusted_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2) == 0x000778, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, Temp_bool_Variable2) == 0x000780, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_MatchesAnyTags_ReturnValue) == 0x000781, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_BooleanOR_ReturnValue) == 0x000782, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000783, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_HasAnyTags_ReturnValue) == 0x000784, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetCurrentCrown_ReturnValue) == 0x000788, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetCurrentCrown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_BooleanOR_ReturnValue2) == 0x000790, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_IsValid_ReturnValue4) == 0x000791, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, K2Node_InputKeyEvent_Key) == 0x000798, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_GetActiveRotationalContentTags_ReturnValue) == 0x0007B0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_GetActiveRotationalContentTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_HasAnyMatchingGameplayTags_ReturnValue2) == 0x0007D0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_HasAnyMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_HasTag_ReturnValue) == 0x0007D1, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0007D8, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_IsLocallyControlledPlayer_ReturnValue) == 0x0007E0, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_IsLocallyControlledPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_ExecuteUbergraph_BP_Hero, CallFunc_BooleanAND_ReturnValue) == 0x0007E1, "Member 'BP_Hero_C_ExecuteUbergraph_BP_Hero::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.GameplayCue.Damage
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Hero_C_GameplayCue_Damage final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Hero_C_GameplayCue_Damage) == 0x000008, "Wrong alignment on BP_Hero_C_GameplayCue_Damage");
static_assert(sizeof(BP_Hero_C_GameplayCue_Damage) == 0x0000C0, "Wrong size on BP_Hero_C_GameplayCue_Damage");
static_assert(offsetof(BP_Hero_C_GameplayCue_Damage, EventType) == 0x000000, "Member 'BP_Hero_C_GameplayCue_Damage::EventType' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_GameplayCue_Damage, Parameters) == 0x000008, "Member 'BP_Hero_C_GameplayCue_Damage::Parameters' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.DoDamageReaction
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Hero_C_DoDamageReaction final
{
public:
	struct FGameplayCueParameters                 Parameters;                                        // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Hero_C_DoDamageReaction) == 0x000008, "Wrong alignment on BP_Hero_C_DoDamageReaction");
static_assert(sizeof(BP_Hero_C_DoDamageReaction) == 0x0000B8, "Wrong size on BP_Hero_C_DoDamageReaction");
static_assert(offsetof(BP_Hero_C_DoDamageReaction, Parameters) == 0x000000, "Member 'BP_Hero_C_DoDamageReaction::Parameters' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.GameplayCue.Damage.Hero
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Hero_C_GameplayCue_Damage_Hero final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Hero_C_GameplayCue_Damage_Hero) == 0x000008, "Wrong alignment on BP_Hero_C_GameplayCue_Damage_Hero");
static_assert(sizeof(BP_Hero_C_GameplayCue_Damage_Hero) == 0x0000C0, "Wrong size on BP_Hero_C_GameplayCue_Damage_Hero");
static_assert(offsetof(BP_Hero_C_GameplayCue_Damage_Hero, EventType) == 0x000000, "Member 'BP_Hero_C_GameplayCue_Damage_Hero::EventType' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_GameplayCue_Damage_Hero, Parameters) == 0x000008, "Member 'BP_Hero_C_GameplayCue_Damage_Hero::Parameters' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.OnTeamChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Hero_C_OnTeamChanged final
{
public:
	EOrionTeam                                    NewTeamIdx;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hero_C_OnTeamChanged) == 0x000001, "Wrong alignment on BP_Hero_C_OnTeamChanged");
static_assert(sizeof(BP_Hero_C_OnTeamChanged) == 0x000001, "Wrong size on BP_Hero_C_OnTeamChanged");
static_assert(offsetof(BP_Hero_C_OnTeamChanged, NewTeamIdx) == 0x000000, "Member 'BP_Hero_C_OnTeamChanged::NewTeamIdx' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.GameplayCue.Death
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Hero_C_GameplayCue_Death final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Hero_C_GameplayCue_Death) == 0x000008, "Wrong alignment on BP_Hero_C_GameplayCue_Death");
static_assert(sizeof(BP_Hero_C_GameplayCue_Death) == 0x0000C0, "Wrong size on BP_Hero_C_GameplayCue_Death");
static_assert(offsetof(BP_Hero_C_GameplayCue_Death, EventType) == 0x000000, "Member 'BP_Hero_C_GameplayCue_Death::EventType' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_GameplayCue_Death, Parameters) == 0x000008, "Member 'BP_Hero_C_GameplayCue_Death::Parameters' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.OnDeath_Bind
// 0x0018 (0x0018 - 0x0000)
struct BP_Hero_C_OnDeath_Bind final
{
public:
	class AOrionChar*                             DeadChar;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hero_C_OnDeath_Bind) == 0x000008, "Wrong alignment on BP_Hero_C_OnDeath_Bind");
static_assert(sizeof(BP_Hero_C_OnDeath_Bind) == 0x000018, "Wrong size on BP_Hero_C_OnDeath_Bind");
static_assert(offsetof(BP_Hero_C_OnDeath_Bind, DeadChar) == 0x000000, "Member 'BP_Hero_C_OnDeath_Bind::DeadChar' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_OnDeath_Bind, Killer) == 0x000008, "Member 'BP_Hero_C_OnDeath_Bind::Killer' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_OnDeath_Bind, DamageCauser) == 0x000010, "Member 'BP_Hero_C_OnDeath_Bind::DamageCauser' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.GameplayCue.RecallTeleport
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Hero_C_GameplayCue_RecallTeleport final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Hero_C_GameplayCue_RecallTeleport) == 0x000008, "Wrong alignment on BP_Hero_C_GameplayCue_RecallTeleport");
static_assert(sizeof(BP_Hero_C_GameplayCue_RecallTeleport) == 0x0000C0, "Wrong size on BP_Hero_C_GameplayCue_RecallTeleport");
static_assert(offsetof(BP_Hero_C_GameplayCue_RecallTeleport, EventType) == 0x000000, "Member 'BP_Hero_C_GameplayCue_RecallTeleport::EventType' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_GameplayCue_RecallTeleport, Parameters) == 0x000008, "Member 'BP_Hero_C_GameplayCue_RecallTeleport::Parameters' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.GameplayCue.Damage.CriticalHit
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Hero_C_GameplayCue_Damage_CriticalHit final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Hero_C_GameplayCue_Damage_CriticalHit) == 0x000008, "Wrong alignment on BP_Hero_C_GameplayCue_Damage_CriticalHit");
static_assert(sizeof(BP_Hero_C_GameplayCue_Damage_CriticalHit) == 0x0000C0, "Wrong size on BP_Hero_C_GameplayCue_Damage_CriticalHit");
static_assert(offsetof(BP_Hero_C_GameplayCue_Damage_CriticalHit, EventType) == 0x000000, "Member 'BP_Hero_C_GameplayCue_Damage_CriticalHit::EventType' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_GameplayCue_Damage_CriticalHit, Parameters) == 0x000008, "Member 'BP_Hero_C_GameplayCue_Damage_CriticalHit::Parameters' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.GameplayCue.ShieldDamage
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Hero_C_GameplayCue_ShieldDamage final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Hero_C_GameplayCue_ShieldDamage) == 0x000008, "Wrong alignment on BP_Hero_C_GameplayCue_ShieldDamage");
static_assert(sizeof(BP_Hero_C_GameplayCue_ShieldDamage) == 0x0000C0, "Wrong size on BP_Hero_C_GameplayCue_ShieldDamage");
static_assert(offsetof(BP_Hero_C_GameplayCue_ShieldDamage, EventType) == 0x000000, "Member 'BP_Hero_C_GameplayCue_ShieldDamage::EventType' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_GameplayCue_ShieldDamage, Parameters) == 0x000008, "Member 'BP_Hero_C_GameplayCue_ShieldDamage::Parameters' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.GameplayCue.KnockBack
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Hero_C_GameplayCue_KnockBack final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_Hero_C_GameplayCue_KnockBack) == 0x000008, "Wrong alignment on BP_Hero_C_GameplayCue_KnockBack");
static_assert(sizeof(BP_Hero_C_GameplayCue_KnockBack) == 0x0000C0, "Wrong size on BP_Hero_C_GameplayCue_KnockBack");
static_assert(offsetof(BP_Hero_C_GameplayCue_KnockBack, EventType) == 0x000000, "Member 'BP_Hero_C_GameplayCue_KnockBack::EventType' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_GameplayCue_KnockBack, Parameters) == 0x000008, "Member 'BP_Hero_C_GameplayCue_KnockBack::Parameters' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.InpActEvt_Shift_L_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_Hero_C_InpActEvt_Shift_L_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hero_C_InpActEvt_Shift_L_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_Hero_C_InpActEvt_Shift_L_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_Hero_C_InpActEvt_Shift_L_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_Hero_C_InpActEvt_Shift_L_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_Hero_C_InpActEvt_Shift_L_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_Hero_C_InpActEvt_Shift_L_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.InpActEvt_L_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_Hero_C_InpActEvt_L_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hero_C_InpActEvt_L_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on BP_Hero_C_InpActEvt_L_K2Node_InputKeyEvent_1");
static_assert(sizeof(BP_Hero_C_InpActEvt_L_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on BP_Hero_C_InpActEvt_L_K2Node_InputKeyEvent_1");
static_assert(offsetof(BP_Hero_C_InpActEvt_L_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'BP_Hero_C_InpActEvt_L_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.UserConstructionScript
// 0x0120 (0x0120 - 0x0000)
struct BP_Hero_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0008(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hero_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Hero_C_UserConstructionScript");
static_assert(sizeof(BP_Hero_C_UserConstructionScript) == 0x000120, "Wrong size on BP_Hero_C_UserConstructionScript");
static_assert(offsetof(BP_Hero_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_Hero_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000008, "Member 'BP_Hero_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000090, "Member 'BP_Hero_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000118, "Member 'BP_Hero_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.DirectionalCameraHitFeedback
// 0x0110 (0x0110 - 0x0000)
struct BP_Hero_C_DirectionalCameraHitFeedback final
{
public:
	struct FGameplayCueParameters                 CueParams;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	class UCameraAnim*                            Anim;                                              // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x00D8(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimInst*                        CallFunc_PlayCameraAnim_ReturnValue;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hero_C_DirectionalCameraHitFeedback) == 0x000008, "Wrong alignment on BP_Hero_C_DirectionalCameraHitFeedback");
static_assert(sizeof(BP_Hero_C_DirectionalCameraHitFeedback) == 0x000110, "Wrong size on BP_Hero_C_DirectionalCameraHitFeedback");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CueParams) == 0x000000, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CueParams' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, Anim) == 0x0000B8, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::Anim' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CallFunc_GetMaxHealth_ReturnValue) == 0x0000C0, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000C4, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CallFunc_NegateVector_ReturnValue) == 0x0000C8, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000D4, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CallFunc_MakeRotFromX_ReturnValue) == 0x0000D8, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CallFunc_MapRangeClamped_ReturnValue) == 0x0000E4, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CallFunc_GetController_ReturnValue) == 0x0000E8, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CallFunc_FClamp_ReturnValue) == 0x0000F0, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, K2Node_DynamicCast_AsPlayer_Controller) == 0x0000F8, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Hero_C_DirectionalCameraHitFeedback, CallFunc_PlayCameraAnim_ReturnValue) == 0x000108, "Member 'BP_Hero_C_DirectionalCameraHitFeedback::CallFunc_PlayCameraAnim_ReturnValue' has a wrong offset!");

// Function BP_Hero.BP_Hero_C.SetupCrown
// 0x0160 (0x0160 - 0x0000)
struct BP_Hero_C_SetupCrown final
{
public:
	class UOrionMcpCrownItemDefinition*           CallFunc_GetCurrentCrown_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionMcpCrownItemDefinition*           CallFunc_GetCurrentCrown_ReturnValue2;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue2; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
