#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeroPedestal_Sparrow

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_HeroPedestal_Sparrow.BP_HeroPedestal_Sparrow_C.ExecuteUbergraph_BP_HeroPedestal_Sparrow
// 0x0048 (0x0048 - 0x0000)
struct BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
	EPedestalActorType                            Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPedestalActorType                            K2Node_Event_PedestalActorType;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue2;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow) == 0x000008, "Wrong alignment on BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow");
static_assert(sizeof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow) == 0x000048, "Wrong size on BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, EntryPoint) == 0x000000, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, Temp_bool_Variable) == 0x000004, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, Temp_bool_Variable2) == 0x000005, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, Temp_bool_Variable3) == 0x000006, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, Temp_bool_Variable4) == 0x000007, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, Temp_byte_Variable) == 0x000020, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, K2Node_Event_PedestalActorType) == 0x000021, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::K2Node_Event_PedestalActorType' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, K2Node_Select_Default) == 0x000022, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000028, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, CallFunc_IsValid_ReturnValue2) == 0x000031, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, CallFunc_SpawnEmitterAttached_ReturnValue2) == 0x000038, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::CallFunc_SpawnEmitterAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000040, "Member 'BP_HeroPedestal_Sparrow_C_ExecuteUbergraph_BP_HeroPedestal_Sparrow::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function BP_HeroPedestal_Sparrow.BP_HeroPedestal_Sparrow_C.OnPedestalActorTypeSet
// 0x0001 (0x0001 - 0x0000)
struct BP_HeroPedestal_Sparrow_C_OnPedestalActorTypeSet final
{
public:
	EPedestalActorType                            PedestalActorType_0;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeroPedestal_Sparrow_C_OnPedestalActorTypeSet) == 0x000001, "Wrong alignment on BP_HeroPedestal_Sparrow_C_OnPedestalActorTypeSet");
static_assert(sizeof(BP_HeroPedestal_Sparrow_C_OnPedestalActorTypeSet) == 0x000001, "Wrong size on BP_HeroPedestal_Sparrow_C_OnPedestalActorTypeSet");
static_assert(offsetof(BP_HeroPedestal_Sparrow_C_OnPedestalActorTypeSet, PedestalActorType_0) == 0x000000, "Member 'BP_HeroPedestal_Sparrow_C_OnPedestalActorTypeSet::PedestalActorType_0' has a wrong offset!");

}

