#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HomeBasePad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HomeBasePad.BP_HomeBasePad_C
// 0x0038 (0x0420 - 0x03E8)
class ABP_HomeBasePad_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               MurderField;                                       // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere1;                                           // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        PS_MurderField;                                    // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HomeBasePad(int32 EntryPoint);
	void OnGameplayEffectApplyCallback_Bind(class AActor* Target);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HomeBasePad_C">();
	}
	static class ABP_HomeBasePad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HomeBasePad_C>();
	}
};
static_assert(alignof(ABP_HomeBasePad_C) == 0x000008, "Wrong alignment on ABP_HomeBasePad_C");
static_assert(sizeof(ABP_HomeBasePad_C) == 0x000420, "Wrong size on ABP_HomeBasePad_C");
static_assert(offsetof(ABP_HomeBasePad_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_HomeBasePad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HomeBasePad_C, MurderField) == 0x0003F0, "Member 'ABP_HomeBasePad_C::MurderField' has a wrong offset!");
static_assert(offsetof(ABP_HomeBasePad_C, OrionGameplayVolume) == 0x0003F8, "Member 'ABP_HomeBasePad_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_HomeBasePad_C, Sphere1) == 0x000400, "Member 'ABP_HomeBasePad_C::Sphere1' has a wrong offset!");
static_assert(offsetof(ABP_HomeBasePad_C, Sphere) == 0x000408, "Member 'ABP_HomeBasePad_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_HomeBasePad_C, DefaultSceneRoot) == 0x000410, "Member 'ABP_HomeBasePad_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_HomeBasePad_C, PS_MurderField) == 0x000418, "Member 'ABP_HomeBasePad_C::PS_MurderField' has a wrong offset!");

}

