#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JumpPad_RootMotion_Master

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_JumpPad_RootMotion_Master.BP_JumpPad_RootMotion_Master_C.ExecuteUbergraph_BP_JumpPad_RootMotion_Master
// 0x0008 (0x0008 - 0x0000)
struct BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master) == 0x000004, "Wrong alignment on BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master");
static_assert(sizeof(BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master) == 0x000008, "Wrong size on BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master");
static_assert(offsetof(BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master, EntryPoint) == 0x000000, "Member 'BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'BP_JumpPad_RootMotion_Master_C_ExecuteUbergraph_BP_JumpPad_RootMotion_Master::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_JumpPad_RootMotion_Master.BP_JumpPad_RootMotion_Master_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_JumpPad_RootMotion_Master_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JumpPad_RootMotion_Master_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_JumpPad_RootMotion_Master_C_UserConstructionScript");
static_assert(sizeof(BP_JumpPad_RootMotion_Master_C_UserConstructionScript) == 0x000020, "Wrong size on BP_JumpPad_RootMotion_Master_C_UserConstructionScript");
static_assert(offsetof(BP_JumpPad_RootMotion_Master_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_JumpPad_RootMotion_Master_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JumpPad_RootMotion_Master_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'BP_JumpPad_RootMotion_Master_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JumpPad_RootMotion_Master_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_JumpPad_RootMotion_Master_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JumpPad_RootMotion_Master_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue2) == 0x000014, "Member 'BP_JumpPad_RootMotion_Master_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");

}

