#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAI_Core_Boss

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_OrionCharAI_Core_Boss.BP_OrionCharAI_Core_Boss_C.ExecuteUbergraph_BP_OrionCharAI_Core_Boss
// 0x02E0 (0x02E0 - 0x0000)
struct BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PrimeHelix_SpawnComet_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasFinishedSpawning_ReturnValue;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0110(0x00B8)(ContainsInstancedReference)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             K2Node_DynamicCast_AsOrion_Char;                   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x01E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0200(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0240(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Prime_Helix_PrimaryFire_ImpactFX_C* CallFunc_FinishSpawningActor_ReturnValue2;         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss) == 0x000010, "Wrong alignment on BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss");
static_assert(sizeof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss) == 0x0002E0, "Wrong size on BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, EntryPoint) == 0x000000, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_BreakVector_X) == 0x000004, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_BreakVector_Y) == 0x000008, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_BreakVector_Z) == 0x00000C, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_MakeVector_ReturnValue) == 0x000064, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_VLerp_ReturnValue) == 0x000070, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000080, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000108, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_HasFinishedSpawning_ReturnValue) == 0x000109, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_HasFinishedSpawning_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, K2Node_GameplayCueEvent_EventType) == 0x00010A, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, K2Node_GameplayCueEvent_Parameters) == 0x000110, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0001C8, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, K2Node_DynamicCast_AsOrion_Char) == 0x0001D0, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::K2Node_DynamicCast_AsOrion_Char' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001DC, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_GetSocketLocation_ReturnValue) == 0x0001E8, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001F4, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_MakeRotFromX_ReturnValue) == 0x000200, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_MakeTransform_ReturnValue) == 0x000210, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000240, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2) == 0x0002C8, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss, CallFunc_FinishSpawningActor_ReturnValue2) == 0x0002D0, "Member 'BP_OrionCharAI_Core_Boss_C_ExecuteUbergraph_BP_OrionCharAI_Core_Boss::CallFunc_FinishSpawningActor_ReturnValue2' has a wrong offset!");

// Function BP_OrionCharAI_Core_Boss.BP_OrionCharAI_Core_Boss_C.GameplayCue.PrimeHelix.PrimaryAttack
// 0x00C0 (0x00C0 - 0x0000)
struct BP_OrionCharAI_Core_Boss_C_GameplayCue_PrimeHelix_PrimaryAttack final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_OrionCharAI_Core_Boss_C_GameplayCue_PrimeHelix_PrimaryAttack) == 0x000008, "Wrong alignment on BP_OrionCharAI_Core_Boss_C_GameplayCue_PrimeHelix_PrimaryAttack");
static_assert(sizeof(BP_OrionCharAI_Core_Boss_C_GameplayCue_PrimeHelix_PrimaryAttack) == 0x0000C0, "Wrong size on BP_OrionCharAI_Core_Boss_C_GameplayCue_PrimeHelix_PrimaryAttack");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_GameplayCue_PrimeHelix_PrimaryAttack, EventType) == 0x000000, "Member 'BP_OrionCharAI_Core_Boss_C_GameplayCue_PrimeHelix_PrimaryAttack::EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_GameplayCue_PrimeHelix_PrimaryAttack, Parameters) == 0x000008, "Member 'BP_OrionCharAI_Core_Boss_C_GameplayCue_PrimeHelix_PrimaryAttack::Parameters' has a wrong offset!");

// Function BP_OrionCharAI_Core_Boss.BP_OrionCharAI_Core_Boss_C.CheckHealthPercentage
// 0x0010 (0x0010 - 0x0000)
struct BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage final
{
public:
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage) == 0x000004, "Wrong alignment on BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage");
static_assert(sizeof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage) == 0x000010, "Wrong size on BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_GetHealthPercent_ReturnValue) == 0x000000, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000007, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x000008, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_Not_PreBool_ReturnValue2) == 0x000009, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_Not_PreBool_ReturnValue3) == 0x00000A, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_BooleanAND_ReturnValue2) == 0x00000B, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage, CallFunc_BooleanAND_ReturnValue3) == 0x00000C, "Member 'BP_OrionCharAI_Core_Boss_C_CheckHealthPercentage::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");

}

