#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAISpawner

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_OrionCharAISpawner.BP_OrionCharAISpawner_C.ExecuteUbergraph_BP_OrionCharAISpawner
// 0x0068 (0x0068 - 0x0000)
struct BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharAI*                           K2Node_Event_SpawnedAI;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item2;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2; // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner) == 0x000008, "Wrong alignment on BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner");
static_assert(sizeof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner) == 0x000068, "Wrong size on BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, EntryPoint) == 0x000000, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, Temp_int_Loop_Counter_Variable2) == 0x000010, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_Add_IntInt_ReturnValue2) == 0x000014, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, Temp_int_Array_Index_Variable2) == 0x000018, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, K2Node_Event_SpawnedAI) == 0x000020, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::K2Node_Event_SpawnedAI' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000040, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_Array_Length_ReturnValue2) == 0x000048, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_Array_Get_Item2) == 0x000050, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_Less_IntInt_ReturnValue2) == 0x000058, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2) == 0x00005C, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner, CallFunc_IsValidClass_ReturnValue) == 0x000064, "Member 'BP_OrionCharAISpawner_C_ExecuteUbergraph_BP_OrionCharAISpawner::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function BP_OrionCharAISpawner.BP_OrionCharAISpawner_C.OnPostSpawnedAI
// 0x0008 (0x0008 - 0x0000)
struct BP_OrionCharAISpawner_C_OnPostSpawnedAI final
{
public:
	class AOrionCharAI*                           SpawnedAI;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OrionCharAISpawner_C_OnPostSpawnedAI) == 0x000008, "Wrong alignment on BP_OrionCharAISpawner_C_OnPostSpawnedAI");
static_assert(sizeof(BP_OrionCharAISpawner_C_OnPostSpawnedAI) == 0x000008, "Wrong size on BP_OrionCharAISpawner_C_OnPostSpawnedAI");
static_assert(offsetof(BP_OrionCharAISpawner_C_OnPostSpawnedAI, SpawnedAI) == 0x000000, "Member 'BP_OrionCharAISpawner_C_OnPostSpawnedAI::SpawnedAI' has a wrong offset!");

}

