#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAI_Prototype_Melee

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function BP_OrionCharAI_Prototype_Melee.BP_OrionCharAI_Prototype_Melee_C.ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee
// 0x01B8 (0x01B8 - 0x0000)
struct BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0008(0x00B8)(ContainsInstancedReference)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionPlayerController_Game*            CallFunc_GetLocalPlayerController_Game_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x00D8(0x00B8)(ContainsInstancedReference)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue2;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue2;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue3;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee) == 0x000008, "Wrong alignment on BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee");
static_assert(sizeof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee) == 0x0001B8, "Wrong size on BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, EntryPoint) == 0x000000, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, K2Node_Event_EventType) == 0x000004, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, K2Node_Event_Parameters) == 0x000008, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_GetTeamNum_ReturnValue) == 0x0000C0, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_GetLocalPlayerController_Game_ReturnValue) == 0x0000C8, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_GetLocalPlayerController_Game_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, K2Node_GameplayCueEvent_EventType) == 0x0000D0, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, K2Node_GameplayCueEvent_Parameters) == 0x0000D8, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_GetTeamNum_ReturnValue2) == 0x000190, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_GetTeamNum_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000191, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_Not_PreBool_ReturnValue) == 0x000192, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_GetHealth_ReturnValue) == 0x000194, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000198, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_GetHealth_ReturnValue2) == 0x00019C, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_GetHealth_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x0001A0, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_GetHealth_ReturnValue3) == 0x0001A4, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_GetHealth_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x0001A8, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee, CallFunc_GetMaterial_ReturnValue) == 0x0001B0, "Member 'BP_OrionCharAI_Prototype_Melee_C_ExecuteUbergraph_BP_OrionCharAI_Prototype_Melee::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");

// Function BP_OrionCharAI_Prototype_Melee.BP_OrionCharAI_Prototype_Melee_C.GameplayCue.Death
// 0x00C0 (0x00C0 - 0x0000)
struct BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Death final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Death) == 0x000008, "Wrong alignment on BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Death");
static_assert(sizeof(BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Death) == 0x0000C0, "Wrong size on BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Death");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Death, EventType) == 0x000000, "Member 'BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Death::EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Death, Parameters) == 0x000008, "Member 'BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Death::Parameters' has a wrong offset!");

// Function BP_OrionCharAI_Prototype_Melee.BP_OrionCharAI_Prototype_Melee_C.GameplayCue.Damage
// 0x00C0 (0x00C0 - 0x0000)
struct BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Damage final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Damage) == 0x000008, "Wrong alignment on BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Damage");
static_assert(sizeof(BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Damage) == 0x0000C0, "Wrong size on BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Damage");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Damage, EventType) == 0x000000, "Member 'BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Damage::EventType' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Damage, Parameters) == 0x000008, "Member 'BP_OrionCharAI_Prototype_Melee_C_GameplayCue_Damage::Parameters' has a wrong offset!");

// Function BP_OrionCharAI_Prototype_Melee.BP_OrionCharAI_Prototype_Melee_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript");
static_assert(sizeof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript) == 0x000038, "Wrong size on BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000020, "Member 'BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_OrionCharAI_Prototype_Melee_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

