#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OrionCharAI_JungleCreep_PrimeHelix_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OrionGame_structs.hpp"
#include "BP_OrionCharAI_JungleCreep_BaseBuff_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OrionCharAI_JungleCreep_PrimeHelix_V2.BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C
// 0x0080 (0x0E00 - 0x0D80)
class ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C final : public ABP_OrionCharAI_JungleCreep_BaseBuff_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D80(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_PrimeHelix_Attack;                               // 0x0D88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_PrimeHelix_LandingImpact;                        // 0x0D90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnFall_Timeline_FallTime_9C1EC25048D0275EFBD6A9B341E101F4; // 0x0D98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SpawnFall_Timeline__Direction_9C1EC25048D0275EFBD6A9B341E101F4; // 0x0D9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9D[0x3];                                      // 0x0D9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SpawnFall_Timeline;                                // 0x0DA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PrimeHelix_SpawnComet_C*            PH_SpawnComet;                                     // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLocation;                                       // 0x0DB0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnHeightOffset;                                 // 0x0DBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnXOffset;                                      // 0x0DC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SonicDelay;                                        // 0x0DC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnBPkillDelay;                                  // 0x0DC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DCC[0x4];                                      // 0x0DCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RowName;                                           // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TeamWideCardPoints;                                // 0x0DD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DDC[0x4];                                      // 0x0DDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            NewVar_0;                                          // 0x0DE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    TeamToRecieveCXP;                                  // 0x0DE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE9[0x7];                                      // 0x0DE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayEffect*                        Gameplay_Effect_for_Death_PP;                      // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Prime_Helix_PrimaryFire_BeamVol_C*  PrimaryBeamActor;                                  // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OrionCharAI_JungleCreep_PrimeHelix_V2(int32 EntryPoint);
	void GameplayCue_PrimeHelix_PrimaryAttack(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnDeath_Bind(class AOrionChar* DeadChar, class AController* Killer, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void SpawnFall_Timeline__FinishedFunc();
	void SpawnFall_Timeline__SonicBoom__EventFunc();
	void SpawnFall_Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OrionCharAI_JungleCreep_PrimeHelix_V2_C">();
	}
	static class ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C>();
	}
};
static_assert(alignof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C) == 0x000010, "Wrong alignment on ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C");
static_assert(sizeof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C) == 0x000E00, "Wrong size on ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, UberGraphFrame) == 0x000D80, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, P_PrimeHelix_Attack) == 0x000D88, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::P_PrimeHelix_Attack' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, P_PrimeHelix_LandingImpact) == 0x000D90, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::P_PrimeHelix_LandingImpact' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, SpawnFall_Timeline_FallTime_9C1EC25048D0275EFBD6A9B341E101F4) == 0x000D98, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::SpawnFall_Timeline_FallTime_9C1EC25048D0275EFBD6A9B341E101F4' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, SpawnFall_Timeline__Direction_9C1EC25048D0275EFBD6A9B341E101F4) == 0x000D9C, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::SpawnFall_Timeline__Direction_9C1EC25048D0275EFBD6A9B341E101F4' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, SpawnFall_Timeline) == 0x000DA0, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::SpawnFall_Timeline' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, PH_SpawnComet) == 0x000DA8, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::PH_SpawnComet' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, EndLocation) == 0x000DB0, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::EndLocation' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, SpawnHeightOffset) == 0x000DBC, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::SpawnHeightOffset' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, SpawnXOffset) == 0x000DC0, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::SpawnXOffset' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, SonicDelay) == 0x000DC4, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::SonicDelay' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, SpawnBPkillDelay) == 0x000DC8, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::SpawnBPkillDelay' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, RowName) == 0x000DD0, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::RowName' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, TeamWideCardPoints) == 0x000DD8, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::TeamWideCardPoints' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, NewVar_0) == 0x000DE0, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, TeamToRecieveCXP) == 0x000DE8, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::TeamToRecieveCXP' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, Gameplay_Effect_for_Death_PP) == 0x000DF0, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::Gameplay_Effect_for_Death_PP' has a wrong offset!");
static_assert(offsetof(ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C, PrimaryBeamActor) == 0x000DF8, "Member 'ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C::PrimaryBeamActor' has a wrong offset!");

}

