#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PrimeHelix_SpawnComet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PrimeHelix_SpawnComet.BP_PrimeHelix_SpawnComet_C
// 0x0028 (0x0410 - 0x03E8)
class ABP_PrimeHelix_SpawnComet_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class UAudioComponent*                        AppearInSkySound;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Prime_Spawn_Trail;                               // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Prime_Helix;                                       // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PrimeHelix_SpawnComet(int32 EntryPoint);
	void FireSonicBoom();
	void LandingImpact();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PrimeHelix_SpawnComet_C">();
	}
	static class ABP_PrimeHelix_SpawnComet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PrimeHelix_SpawnComet_C>();
	}
};
static_assert(alignof(ABP_PrimeHelix_SpawnComet_C) == 0x000008, "Wrong alignment on ABP_PrimeHelix_SpawnComet_C");
static_assert(sizeof(ABP_PrimeHelix_SpawnComet_C) == 0x000410, "Wrong size on ABP_PrimeHelix_SpawnComet_C");
static_assert(offsetof(ABP_PrimeHelix_SpawnComet_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_PrimeHelix_SpawnComet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PrimeHelix_SpawnComet_C, AppearInSkySound) == 0x0003F0, "Member 'ABP_PrimeHelix_SpawnComet_C::AppearInSkySound' has a wrong offset!");
static_assert(offsetof(ABP_PrimeHelix_SpawnComet_C, P_Prime_Spawn_Trail) == 0x0003F8, "Member 'ABP_PrimeHelix_SpawnComet_C::P_Prime_Spawn_Trail' has a wrong offset!");
static_assert(offsetof(ABP_PrimeHelix_SpawnComet_C, Prime_Helix) == 0x000400, "Member 'ABP_PrimeHelix_SpawnComet_C::Prime_Helix' has a wrong offset!");
static_assert(offsetof(ABP_PrimeHelix_SpawnComet_C, DefaultSceneRoot) == 0x000408, "Member 'ABP_PrimeHelix_SpawnComet_C::DefaultSceneRoot' has a wrong offset!");

}

