#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prime_SA01_Decal_N

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Prime_SA01_Decal_N.BP_Prime_SA01_Decal_N_C.ExecuteUbergraph_BP_Prime_SA01_Decal_N
// 0x0004 (0x0004 - 0x0000)
struct BP_Prime_SA01_Decal_N_C_ExecuteUbergraph_BP_Prime_SA01_Decal_N final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Prime_SA01_Decal_N_C_ExecuteUbergraph_BP_Prime_SA01_Decal_N) == 0x000004, "Wrong alignment on BP_Prime_SA01_Decal_N_C_ExecuteUbergraph_BP_Prime_SA01_Decal_N");
static_assert(sizeof(BP_Prime_SA01_Decal_N_C_ExecuteUbergraph_BP_Prime_SA01_Decal_N) == 0x000004, "Wrong size on BP_Prime_SA01_Decal_N_C_ExecuteUbergraph_BP_Prime_SA01_Decal_N");
static_assert(offsetof(BP_Prime_SA01_Decal_N_C_ExecuteUbergraph_BP_Prime_SA01_Decal_N, EntryPoint) == 0x000000, "Member 'BP_Prime_SA01_Decal_N_C_ExecuteUbergraph_BP_Prime_SA01_Decal_N::EntryPoint' has a wrong offset!");

// Function BP_Prime_SA01_Decal_N.BP_Prime_SA01_Decal_N_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_Prime_SA01_Decal_N_C_UserConstructionScript final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue2;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Prime_SA01_Decal_N_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Prime_SA01_Decal_N_C_UserConstructionScript");
static_assert(sizeof(BP_Prime_SA01_Decal_N_C_UserConstructionScript) == 0x000028, "Wrong size on BP_Prime_SA01_Decal_N_C_UserConstructionScript");
static_assert(offsetof(BP_Prime_SA01_Decal_N_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_Prime_SA01_Decal_N_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prime_SA01_Decal_N_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000004, "Member 'BP_Prime_SA01_Decal_N_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Prime_SA01_Decal_N_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000008, "Member 'BP_Prime_SA01_Decal_N_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prime_SA01_Decal_N_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue2) == 0x00000C, "Member 'BP_Prime_SA01_Decal_N_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Prime_SA01_Decal_N_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'BP_Prime_SA01_Decal_N_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prime_SA01_Decal_N_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_Prime_SA01_Decal_N_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

