#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prime_Helix_V2_SpecialAttack2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Prime_Helix_V2_SpecialAttack2.BP_Prime_Helix_V2_SpecialAttack2_C
// 0x0028 (0x0410 - 0x03E8)
class ABP_Prime_Helix_V2_SpecialAttack2_C final : public AOrionBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(Transient, DuplicateTransient)
	class UOrionGameplayVolumeComponent*          OrionGameplayVolume;                               // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       DamageVolume;                                      // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackDuration;                                 // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Prime_Helix_V2_SpecialAttack2(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Shutdown();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Prime_Helix_V2_SpecialAttack2_C">();
	}
	static class ABP_Prime_Helix_V2_SpecialAttack2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Prime_Helix_V2_SpecialAttack2_C>();
	}
};
static_assert(alignof(ABP_Prime_Helix_V2_SpecialAttack2_C) == 0x000008, "Wrong alignment on ABP_Prime_Helix_V2_SpecialAttack2_C");
static_assert(sizeof(ABP_Prime_Helix_V2_SpecialAttack2_C) == 0x000410, "Wrong size on ABP_Prime_Helix_V2_SpecialAttack2_C");
static_assert(offsetof(ABP_Prime_Helix_V2_SpecialAttack2_C, UberGraphFrame) == 0x0003E8, "Member 'ABP_Prime_Helix_V2_SpecialAttack2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_V2_SpecialAttack2_C, OrionGameplayVolume) == 0x0003F0, "Member 'ABP_Prime_Helix_V2_SpecialAttack2_C::OrionGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_V2_SpecialAttack2_C, DamageVolume) == 0x0003F8, "Member 'ABP_Prime_Helix_V2_SpecialAttack2_C::DamageVolume' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_V2_SpecialAttack2_C, DefaultSceneRoot) == 0x000400, "Member 'ABP_Prime_Helix_V2_SpecialAttack2_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Prime_Helix_V2_SpecialAttack2_C, KnockbackDuration) == 0x000408, "Member 'ABP_Prime_Helix_V2_SpecialAttack2_C::KnockbackDuration' has a wrong offset!");

}

