#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Planet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_HeroHomeWorld_structs.hpp"


namespace SDK::Params
{

// Function BP_Planet.BP_Planet_C.ExecuteUbergraph_BP_Planet
// 0x0120 (0x0120 - 0x0000)
struct BP_Planet_C_ExecuteUbergraph_BP_Planet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_HeroHomeWorld                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_HeroHomeWorld                            Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_HeroHomeWorld                            K2Node_CustomEvent_Moon;                           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select2_Default;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0040(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x004C(0x000C)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00E0(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0104(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0110(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Planet_C_ExecuteUbergraph_BP_Planet) == 0x000008, "Wrong alignment on BP_Planet_C_ExecuteUbergraph_BP_Planet");
static_assert(sizeof(BP_Planet_C_ExecuteUbergraph_BP_Planet) == 0x000120, "Wrong size on BP_Planet_C_ExecuteUbergraph_BP_Planet");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, EntryPoint) == 0x000000, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, Temp_byte_Variable) == 0x000004, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, Temp_byte_Variable2) == 0x000005, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, K2Node_CustomEvent_Moon) == 0x000006, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::K2Node_CustomEvent_Moon' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, K2Node_Select_Default) == 0x000008, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, K2Node_Select2_Default) == 0x000010, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000020, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_FindLookAtRotation_ReturnValue) == 0x000040, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_ComposeRotators_ReturnValue) == 0x00004C, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000058, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000E0, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_GetForwardVector_ReturnValue) == 0x0000EC, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000F8, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000104, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_ExecuteUbergraph_BP_Planet, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000110, "Member 'BP_Planet_C_ExecuteUbergraph_BP_Planet::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function BP_Planet.BP_Planet_C.Refresh MoonMat
// 0x0001 (0x0001 - 0x0000)
struct BP_Planet_C_Refresh_MoonMat final
{
public:
	Enum_HeroHomeWorld                            Moon;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Planet_C_Refresh_MoonMat) == 0x000001, "Wrong alignment on BP_Planet_C_Refresh_MoonMat");
static_assert(sizeof(BP_Planet_C_Refresh_MoonMat) == 0x000001, "Wrong size on BP_Planet_C_Refresh_MoonMat");
static_assert(offsetof(BP_Planet_C_Refresh_MoonMat, Moon) == 0x000000, "Member 'BP_Planet_C_Refresh_MoonMat::Moon' has a wrong offset!");

// Function BP_Planet.BP_Planet_C.UserConstructionScript
// 0x0100 (0x0100 - 0x0000)
struct BP_Planet_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0024(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0058(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0064(0x000C)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Planet_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Planet_C_UserConstructionScript");
static_assert(sizeof(BP_Planet_C_UserConstructionScript) == 0x000100, "Wrong size on BP_Planet_C_UserConstructionScript");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_GetForwardVector_ReturnValue) == 0x00000C, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000018, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000024, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_FindLookAtRotation_ReturnValue) == 0x000058, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_ComposeRotators_ReturnValue) == 0x000064, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000070, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Planet_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x0000F8, "Member 'BP_Planet_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");

}

