#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Reticle3D_AbilityTargeting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Reticle3D_AbilityTargeting.BP_Reticle3D_AbilityTargeting_C
// 0x0018 (0x0350 - 0x0338)
class ABP_Reticle3D_AbilityTargeting_C final : public AGameplayAbilityWorldReticle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(Transient, DuplicateTransient)
	class UMaterialBillboardComponent*            MB_TargetingBrackets;                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Reticle3D_AbilityTargeting(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Reticle3D_AbilityTargeting_C">();
	}
	static class ABP_Reticle3D_AbilityTargeting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Reticle3D_AbilityTargeting_C>();
	}
};
static_assert(alignof(ABP_Reticle3D_AbilityTargeting_C) == 0x000008, "Wrong alignment on ABP_Reticle3D_AbilityTargeting_C");
static_assert(sizeof(ABP_Reticle3D_AbilityTargeting_C) == 0x000350, "Wrong size on ABP_Reticle3D_AbilityTargeting_C");
static_assert(offsetof(ABP_Reticle3D_AbilityTargeting_C, UberGraphFrame) == 0x000338, "Member 'ABP_Reticle3D_AbilityTargeting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Reticle3D_AbilityTargeting_C, MB_TargetingBrackets) == 0x000340, "Member 'ABP_Reticle3D_AbilityTargeting_C::MB_TargetingBrackets' has a wrong offset!");
static_assert(offsetof(ABP_Reticle3D_AbilityTargeting_C, StaticMesh1) == 0x000348, "Member 'ABP_Reticle3D_AbilityTargeting_C::StaticMesh1' has a wrong offset!");

}

