#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreeGroup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TreeGroup.BP_TreeGroup_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct BP_TreeGroup_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             Temp_struct_Variable2;                             // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue2;                // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable3;                             // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             Temp_struct_Variable4;                             // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue3;                // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue4;                // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TreeGroup_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_TreeGroup_C_UserConstructionScript");
static_assert(sizeof(BP_TreeGroup_C_UserConstructionScript) == 0x0000F0, "Wrong size on BP_TreeGroup_C_UserConstructionScript");
static_assert(offsetof(BP_TreeGroup_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'BP_TreeGroup_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_TreeGroup_C_UserConstructionScript, Temp_struct_Variable2) == 0x000030, "Member 'BP_TreeGroup_C_UserConstructionScript::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TreeGroup_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'BP_TreeGroup_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TreeGroup_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue2) == 0x000068, "Member 'BP_TreeGroup_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TreeGroup_C_UserConstructionScript, Temp_struct_Variable3) == 0x000070, "Member 'BP_TreeGroup_C_UserConstructionScript::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_TreeGroup_C_UserConstructionScript, Temp_struct_Variable4) == 0x0000A0, "Member 'BP_TreeGroup_C_UserConstructionScript::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(BP_TreeGroup_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue3) == 0x0000D0, "Member 'BP_TreeGroup_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TreeGroup_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue4) == 0x0000D8, "Member 'BP_TreeGroup_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TreeGroup_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x0000E0, "Member 'BP_TreeGroup_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

