#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreeGroup

#include "Basic.hpp"

#include "TreesList_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TreeGroup.BP_TreeGroup_C
// 0x0018 (0x0330 - 0x0318)
class ABP_TreeGroup_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_CoverTree_02_ShadowCaster;                      // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETreesList                                    SelectTree;                                        // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ForceLod;                                          // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TreeGroup_C">();
	}
	static class ABP_TreeGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TreeGroup_C>();
	}
};
static_assert(alignof(ABP_TreeGroup_C) == 0x000008, "Wrong alignment on ABP_TreeGroup_C");
static_assert(sizeof(ABP_TreeGroup_C) == 0x000330, "Wrong size on ABP_TreeGroup_C");
static_assert(offsetof(ABP_TreeGroup_C, SM_CoverTree_02_ShadowCaster) == 0x000318, "Member 'ABP_TreeGroup_C::SM_CoverTree_02_ShadowCaster' has a wrong offset!");
static_assert(offsetof(ABP_TreeGroup_C, DefaultSceneRoot) == 0x000320, "Member 'ABP_TreeGroup_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TreeGroup_C, SelectTree) == 0x000328, "Member 'ABP_TreeGroup_C::SelectTree' has a wrong offset!");
static_assert(offsetof(ABP_TreeGroup_C, ForceLod) == 0x00032C, "Member 'ABP_TreeGroup_C::ForceLod' has a wrong offset!");

}

