#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Buff_Blue_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Buff_Blue_AnimBP.Buff_Blue_AnimBP_C
// 0x0620 (0x1250 - 0x0C30)
class UBuff_Blue_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3F222F3C483FD18F4DAB5783AA6E2D37; // 0x0C38(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_70F02DBB43E89840A0B8BDB9436A0748; // 0x0C80(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8A46E8D84293C9A838666B9DC9407BA0; // 0x0D50(0x0070)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_F3A1ACF845544609489E9F83535BD10D; // 0x0DC0(0x02F0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_BB244E324A6E32213A9576AC568373A6; // 0x10B0(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_495DE6954003FEF9725CC18B101EE753; // 0x11D8(0x0068)()
	int32                                         RandomPose;                                        // 0x1240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Blue_AnimBP_AnimGraphNode_BlendListByInt_70F02DBB43E89840A0B8BDB9436A0748();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Blue_AnimBP_AnimGraphNode_BlendSpacePlayer_BB244E324A6E32213A9576AC568373A6();
	void ExecuteUbergraph_Buff_Blue_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Buff_Blue_AnimBP_C">();
	}
	static class UBuff_Blue_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuff_Blue_AnimBP_C>();
	}
};
static_assert(alignof(UBuff_Blue_AnimBP_C) == 0x000010, "Wrong alignment on UBuff_Blue_AnimBP_C");
static_assert(sizeof(UBuff_Blue_AnimBP_C) == 0x001250, "Wrong size on UBuff_Blue_AnimBP_C");
static_assert(offsetof(UBuff_Blue_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'UBuff_Blue_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBuff_Blue_AnimBP_C, AnimGraphNode_Root_3F222F3C483FD18F4DAB5783AA6E2D37) == 0x000C38, "Member 'UBuff_Blue_AnimBP_C::AnimGraphNode_Root_3F222F3C483FD18F4DAB5783AA6E2D37' has a wrong offset!");
static_assert(offsetof(UBuff_Blue_AnimBP_C, AnimGraphNode_BlendListByInt_70F02DBB43E89840A0B8BDB9436A0748) == 0x000C80, "Member 'UBuff_Blue_AnimBP_C::AnimGraphNode_BlendListByInt_70F02DBB43E89840A0B8BDB9436A0748' has a wrong offset!");
static_assert(offsetof(UBuff_Blue_AnimBP_C, AnimGraphNode_SequencePlayer_8A46E8D84293C9A838666B9DC9407BA0) == 0x000D50, "Member 'UBuff_Blue_AnimBP_C::AnimGraphNode_SequencePlayer_8A46E8D84293C9A838666B9DC9407BA0' has a wrong offset!");
static_assert(offsetof(UBuff_Blue_AnimBP_C, OrionAnimGraphNode_MinionBehavior_F3A1ACF845544609489E9F83535BD10D) == 0x000DC0, "Member 'UBuff_Blue_AnimBP_C::OrionAnimGraphNode_MinionBehavior_F3A1ACF845544609489E9F83535BD10D' has a wrong offset!");
static_assert(offsetof(UBuff_Blue_AnimBP_C, AnimGraphNode_BlendSpacePlayer_BB244E324A6E32213A9576AC568373A6) == 0x0010B0, "Member 'UBuff_Blue_AnimBP_C::AnimGraphNode_BlendSpacePlayer_BB244E324A6E32213A9576AC568373A6' has a wrong offset!");
static_assert(offsetof(UBuff_Blue_AnimBP_C, AnimGraphNode_Slot_495DE6954003FEF9725CC18B101EE753) == 0x0011D8, "Member 'UBuff_Blue_AnimBP_C::AnimGraphNode_Slot_495DE6954003FEF9725CC18B101EE753' has a wrong offset!");
static_assert(offsetof(UBuff_Blue_AnimBP_C, RandomPose) == 0x001240, "Member 'UBuff_Blue_AnimBP_C::RandomPose' has a wrong offset!");

}

