#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Buff_Black_AnimBP

#include "Basic.hpp"

#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Buff_Black_AnimBP.Buff_Black_AnimBP_C
// 0x1450 (0x2610 - 0x11C0)
class UBuff_Black_AnimBP_C final : public UOrionHeroAnimInstance
{
public:
	uint8                                         Pad_11B8[0x8];                                     // 0x11B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11C0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_DE00698843B0B84FD06841A5486077D3; // 0x11C8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_79E169D842F36182DFEFA1BCE8E1F096; // 0x1210(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_00AF2B20463583093DAC5D996455AE00; // 0x1278(0x0078)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_3A1A966A472E493FA3EB04AFBDE3FE1F; // 0x12F0(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E6E13FF84724C9C6583C1CB54525DA2F; // 0x1350(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_314F5F5E4D65764A353765826FDDAEBE; // 0x13D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154; // 0x1450(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E6830DD74203A90AAFE9AE89BB7DF39B; // 0x14D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726; // 0x1550(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676; // 0x15D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D; // 0x1650(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B4F6A27D4E6A41A423139294B590EAB0; // 0x16D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87D74D354E92E9B20FF647AA046A9F59; // 0x1750(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8A09EC4F457B1D1E5947FCA4504C6039; // 0x17D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D587A99B4B8E3B24D2C0BB8620E9232A; // 0x1850(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336; // 0x18D0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_399A7B6F4D5879460894B0A7A42BB027; // 0x1950(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_216F0C0F4E6CB81CE3E12E988226D814; // 0x19C0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22D239114377396BFC4D2B8B8C335BA1; // 0x1A08(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_5152ACBB4F2D993D2F9D41B6BAD9E2E8; // 0x1A78(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_C386B8FA414394714BD155A4B725FEED; // 0x1AC0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C30C348B4B75C3278E5445ADC7C8A3DD; // 0x1B30(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_EC4B3F3A44DB311D0BB79BB293977940; // 0x1B78(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_AF59F8784DB0FD0B177E4581A8D4ADC8; // 0x1BE8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_66A47A0340C6BC0D58E3B9B64521B996; // 0x1C30(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_56ABEE054FAD34A266BF5A9B7BF662D1; // 0x1D58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9DC1F13042F0D18A69C491884EC1262F; // 0x1DA0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_69889BAE4F5E7DC78D5FA6A5424E3604; // 0x1E10(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_F3F8B6134B98181AC446F083D85030E8; // 0x1E58(0x00D8)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_00F0030E49A0543B7691E4961F393B6C; // 0x1F30(0x0158)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2DB117B64D7F2ED5E6E314B971C975BE; // 0x2088(0x0070)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_D994A3C04CB36E96372932ADB6D10CB0; // 0x20F8(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_08E9381843FE7BA9D1F2FD91B4A0789E; // 0x2160(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A1A6FCEF4C0FBE885B2B19A657752354; // 0x2240(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_CF1B31754DFD9EAB3393BBBF0B32C716; // 0x2310(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_182AA25C467843CF82F81585A996C50D; // 0x2378(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_AF67366E4BD2EDA4E4775081B0797052; // 0x2420(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_897F61424086BFEDC65B9AB4A99D1A81; // 0x2470(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1B84EB6F4D3389172BF9E6ACC0FB6073; // 0x24C0(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_56A91786431B11E7C2BDDAA29C5C6C47; // 0x2510(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2DDA29774E3E680AD757E9860586803C; // 0x25B8(0x0050)()

public:
	void ExecuteUbergraph_Buff_Black_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_ApplyAdditive_00AF2B20463583093DAC5D996455AE00();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_BlendListByBool_A1A6FCEF4C0FBE885B2B19A657752354();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_BlendSpacePlayer_66A47A0340C6BC0D58E3B9B64521B996();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_RotateRootBone_3A1A966A472E493FA3EB04AFBDE3FE1F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_00F0030E49A0543B7691E4961F393B6C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_SequenceEvaluator_2DB117B64D7F2ED5E6E314B971C975BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_SequenceEvaluator_C386B8FA414394714BD155A4B725FEED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_SequenceEvaluator_EC4B3F3A44DB311D0BB79BB293977940();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_314F5F5E4D65764A353765826FDDAEBE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_87D74D354E92E9B20FF647AA046A9F59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_8A09EC4F457B1D1E5947FCA4504C6039();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_B4F6A27D4E6A41A423139294B590EAB0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_D587A99B4B8E3B24D2C0BB8620E9232A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Buff_Black_AnimBP_AnimGraphNode_TransitionResult_E6E13FF84724C9C6583C1CB54525DA2F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Buff_Black_AnimBP_C">();
	}
	static class UBuff_Black_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuff_Black_AnimBP_C>();
	}
};
static_assert(alignof(UBuff_Black_AnimBP_C) == 0x000010, "Wrong alignment on UBuff_Black_AnimBP_C");
static_assert(sizeof(UBuff_Black_AnimBP_C) == 0x002610, "Wrong size on UBuff_Black_AnimBP_C");
static_assert(offsetof(UBuff_Black_AnimBP_C, UberGraphFrame) == 0x0011C0, "Member 'UBuff_Black_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_Root_DE00698843B0B84FD06841A5486077D3) == 0x0011C8, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_Root_DE00698843B0B84FD06841A5486077D3' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_Slot_79E169D842F36182DFEFA1BCE8E1F096) == 0x001210, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_Slot_79E169D842F36182DFEFA1BCE8E1F096' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_ApplyAdditive_00AF2B20463583093DAC5D996455AE00) == 0x001278, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_ApplyAdditive_00AF2B20463583093DAC5D996455AE00' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_RotateRootBone_3A1A966A472E493FA3EB04AFBDE3FE1F) == 0x0012F0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_RotateRootBone_3A1A966A472E493FA3EB04AFBDE3FE1F' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_E6E13FF84724C9C6583C1CB54525DA2F) == 0x001350, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_E6E13FF84724C9C6583C1CB54525DA2F' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_314F5F5E4D65764A353765826FDDAEBE) == 0x0013D0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_314F5F5E4D65764A353765826FDDAEBE' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154) == 0x001450, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_E6830DD74203A90AAFE9AE89BB7DF39B) == 0x0014D0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_E6830DD74203A90AAFE9AE89BB7DF39B' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726) == 0x001550, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676) == 0x0015D0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D) == 0x001650, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_B4F6A27D4E6A41A423139294B590EAB0) == 0x0016D0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_B4F6A27D4E6A41A423139294B590EAB0' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_87D74D354E92E9B20FF647AA046A9F59) == 0x001750, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_87D74D354E92E9B20FF647AA046A9F59' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_8A09EC4F457B1D1E5947FCA4504C6039) == 0x0017D0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_8A09EC4F457B1D1E5947FCA4504C6039' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_D587A99B4B8E3B24D2C0BB8620E9232A) == 0x001850, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_D587A99B4B8E3B24D2C0BB8620E9232A' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336) == 0x0018D0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_SequencePlayer_399A7B6F4D5879460894B0A7A42BB027) == 0x001950, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_SequencePlayer_399A7B6F4D5879460894B0A7A42BB027' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_StateResult_216F0C0F4E6CB81CE3E12E988226D814) == 0x0019C0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_StateResult_216F0C0F4E6CB81CE3E12E988226D814' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_SequencePlayer_22D239114377396BFC4D2B8B8C335BA1) == 0x001A08, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_SequencePlayer_22D239114377396BFC4D2B8B8C335BA1' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_StateResult_5152ACBB4F2D993D2F9D41B6BAD9E2E8) == 0x001A78, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_StateResult_5152ACBB4F2D993D2F9D41B6BAD9E2E8' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_SequenceEvaluator_C386B8FA414394714BD155A4B725FEED) == 0x001AC0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_SequenceEvaluator_C386B8FA414394714BD155A4B725FEED' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_StateResult_C30C348B4B75C3278E5445ADC7C8A3DD) == 0x001B30, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_StateResult_C30C348B4B75C3278E5445ADC7C8A3DD' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_SequenceEvaluator_EC4B3F3A44DB311D0BB79BB293977940) == 0x001B78, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_SequenceEvaluator_EC4B3F3A44DB311D0BB79BB293977940' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_StateResult_AF59F8784DB0FD0B177E4581A8D4ADC8) == 0x001BE8, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_StateResult_AF59F8784DB0FD0B177E4581A8D4ADC8' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_BlendSpacePlayer_66A47A0340C6BC0D58E3B9B64521B996) == 0x001C30, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_BlendSpacePlayer_66A47A0340C6BC0D58E3B9B64521B996' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_StateResult_56ABEE054FAD34A266BF5A9B7BF662D1) == 0x001D58, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_StateResult_56ABEE054FAD34A266BF5A9B7BF662D1' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_SequencePlayer_9DC1F13042F0D18A69C491884EC1262F) == 0x001DA0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_SequencePlayer_9DC1F13042F0D18A69C491884EC1262F' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_StateResult_69889BAE4F5E7DC78D5FA6A5424E3604) == 0x001E10, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_StateResult_69889BAE4F5E7DC78D5FA6A5424E3604' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_StateMachine_F3F8B6134B98181AC446F083D85030E8) == 0x001E58, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_StateMachine_F3F8B6134B98181AC446F083D85030E8' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_00F0030E49A0543B7691E4961F393B6C) == 0x001F30, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_00F0030E49A0543B7691E4961F393B6C' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_SequenceEvaluator_2DB117B64D7F2ED5E6E314B971C975BE) == 0x002088, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_SequenceEvaluator_2DB117B64D7F2ED5E6E314B971C975BE' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_Slot_D994A3C04CB36E96372932ADB6D10CB0) == 0x0020F8, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_Slot_D994A3C04CB36E96372932ADB6D10CB0' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_LayeredBoneBlend_08E9381843FE7BA9D1F2FD91B4A0789E) == 0x002160, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_LayeredBoneBlend_08E9381843FE7BA9D1F2FD91B4A0789E' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_BlendListByBool_A1A6FCEF4C0FBE885B2B19A657752354) == 0x002240, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_BlendListByBool_A1A6FCEF4C0FBE885B2B19A657752354' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_Slot_CF1B31754DFD9EAB3393BBBF0B32C716) == 0x002310, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_Slot_CF1B31754DFD9EAB3393BBBF0B32C716' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_SaveCachedPose_182AA25C467843CF82F81585A996C50D) == 0x002378, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_SaveCachedPose_182AA25C467843CF82F81585A996C50D' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_UseCachedPose_AF67366E4BD2EDA4E4775081B0797052) == 0x002420, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_UseCachedPose_AF67366E4BD2EDA4E4775081B0797052' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_UseCachedPose_897F61424086BFEDC65B9AB4A99D1A81) == 0x002470, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_UseCachedPose_897F61424086BFEDC65B9AB4A99D1A81' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_UseCachedPose_1B84EB6F4D3389172BF9E6ACC0FB6073) == 0x0024C0, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_UseCachedPose_1B84EB6F4D3389172BF9E6ACC0FB6073' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_SaveCachedPose_56A91786431B11E7C2BDDAA29C5C6C47) == 0x002510, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_SaveCachedPose_56A91786431B11E7C2BDDAA29C5C6C47' has a wrong offset!");
static_assert(offsetof(UBuff_Black_AnimBP_C, AnimGraphNode_UseCachedPose_2DDA29774E3E680AD757E9860586803C) == 0x0025B8, "Member 'UBuff_Black_AnimBP_C::AnimGraphNode_UseCachedPose_2DDA29774E3E680AD757E9860586803C' has a wrong offset!");

}

