#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CardParticleCameraCapture_Blueprint

#include "Basic.hpp"


namespace SDK::Params
{

// Function CardParticleCameraCapture_Blueprint.CardParticleCameraCapture_Blueprint_C.ExecuteUbergraph_CardParticleCameraCapture_Blueprint
// 0x0030 (0x0030 - 0x0000)
struct CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NewScene)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UMenuContext*                           CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NewScene;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint) == 0x000008, "Wrong alignment on CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint");
static_assert(sizeof(CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint) == 0x000030, "Wrong size on CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint");
static_assert(offsetof(CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint, EntryPoint) == 0x000000, "Member 'CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint, K2Node_CustomEvent_NewScene) == 0x000020, "Member 'CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint::K2Node_CustomEvent_NewScene' has a wrong offset!");
static_assert(offsetof(CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000028, "Member 'CardParticleCameraCapture_Blueprint_C_ExecuteUbergraph_CardParticleCameraCapture_Blueprint::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function CardParticleCameraCapture_Blueprint.CardParticleCameraCapture_Blueprint_C.OnMenuSceneChanged_Event_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) CardParticleCameraCapture_Blueprint_C_OnMenuSceneChanged_Event_0 final
{
public:
	class FName                                   NewScene;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CardParticleCameraCapture_Blueprint_C_OnMenuSceneChanged_Event_0) == 0x000008, "Wrong alignment on CardParticleCameraCapture_Blueprint_C_OnMenuSceneChanged_Event_0");
static_assert(sizeof(CardParticleCameraCapture_Blueprint_C_OnMenuSceneChanged_Event_0) == 0x000008, "Wrong size on CardParticleCameraCapture_Blueprint_C_OnMenuSceneChanged_Event_0");
static_assert(offsetof(CardParticleCameraCapture_Blueprint_C_OnMenuSceneChanged_Event_0, NewScene) == 0x000000, "Member 'CardParticleCameraCapture_Blueprint_C_OnMenuSceneChanged_Event_0::NewScene' has a wrong offset!");

}

