#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CardProgressBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CardProgressBar.CardProgressBar_C
// 0x0020 (0x03D0 - 0x03B0)
class UCardProgressBar_C final : public UOrionCardProgressBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_For_Level;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Preview;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrows;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CardProgressBar(int32 EntryPoint);
	void SetPreviewLevelDisplay(bool bIsVisible);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CardProgressBar_C">();
	}
	static class UCardProgressBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCardProgressBar_C>();
	}
};
static_assert(alignof(UCardProgressBar_C) == 0x000008, "Wrong alignment on UCardProgressBar_C");
static_assert(sizeof(UCardProgressBar_C) == 0x0003D0, "Wrong size on UCardProgressBar_C");
static_assert(offsetof(UCardProgressBar_C, UberGraphFrame) == 0x0003B0, "Member 'UCardProgressBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCardProgressBar_C, Hover_For_Level) == 0x0003B8, "Member 'UCardProgressBar_C::Hover_For_Level' has a wrong offset!");
static_assert(offsetof(UCardProgressBar_C, HBox_Preview) == 0x0003C0, "Member 'UCardProgressBar_C::HBox_Preview' has a wrong offset!");
static_assert(offsetof(UCardProgressBar_C, Image_Arrows) == 0x0003C8, "Member 'UCardProgressBar_C::Image_Arrows' has a wrong offset!");

}

