#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Central_message_Widget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Central_message_Widget.Central_message_Widget_C
// 0x0018 (0x0218 - 0x0200)
class UCentral_message_Widget_C final : public UUserWidget
{
public:
	class UImage*                                 ICON_Kill;                                         // 0x0200(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Red_Glow;                                          // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Central_message_Widget_C">();
	}
	static class UCentral_message_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCentral_message_Widget_C>();
	}
};
static_assert(alignof(UCentral_message_Widget_C) == 0x000008, "Wrong alignment on UCentral_message_Widget_C");
static_assert(sizeof(UCentral_message_Widget_C) == 0x000218, "Wrong size on UCentral_message_Widget_C");
static_assert(offsetof(UCentral_message_Widget_C, ICON_Kill) == 0x000200, "Member 'UCentral_message_Widget_C::ICON_Kill' has a wrong offset!");
static_assert(offsetof(UCentral_message_Widget_C, Image_5) == 0x000208, "Member 'UCentral_message_Widget_C::Image_5' has a wrong offset!");
static_assert(offsetof(UCentral_message_Widget_C, Red_Glow) == 0x000210, "Member 'UCentral_message_Widget_C::Red_Glow' has a wrong offset!");

}

