#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfirmationRoot

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ConfirmationRoot.ConfirmationRoot_C.ExecuteUbergraph_ConfirmationRoot
// 0x0050 (0x0050 - 0x0000)
struct ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0018(0x0008)(NoDestructor)
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button3;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button2;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot) == 0x000008, "Wrong alignment on ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot");
static_assert(sizeof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot) == 0x000050, "Wrong size on ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, EntryPoint) == 0x000000, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, Temp_byte_Variable) == 0x000004, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, Temp_byte_Variable2) == 0x000005, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000006, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000008, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, Temp_bool_Variable) == 0x000010, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, K2Node_Select_Default) == 0x000011, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, CallFunc_K2_SetTimer_ReturnValue) == 0x000018, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, K2Node_ComponentBoundEvent_Button3) == 0x000020, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, CallFunc_PauseAnimation_ReturnValue) == 0x000028, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, K2Node_ComponentBoundEvent_Button2) == 0x000030, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000048, "Member 'ConfirmationRoot_C_ExecuteUbergraph_ConfirmationRoot::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");

// Function ConfirmationRoot.ConfirmationRoot_C.BndEvt__[Default Button] Cancel_K2Node_ComponentBoundEvent_811_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ConfirmationRoot_C_BndEvt___Default_Button__Cancel_K2Node_ComponentBoundEvent_811_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationRoot_C_BndEvt___Default_Button__Cancel_K2Node_ComponentBoundEvent_811_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ConfirmationRoot_C_BndEvt___Default_Button__Cancel_K2Node_ComponentBoundEvent_811_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(ConfirmationRoot_C_BndEvt___Default_Button__Cancel_K2Node_ComponentBoundEvent_811_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ConfirmationRoot_C_BndEvt___Default_Button__Cancel_K2Node_ComponentBoundEvent_811_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(ConfirmationRoot_C_BndEvt___Default_Button__Cancel_K2Node_ComponentBoundEvent_811_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ConfirmationRoot_C_BndEvt___Default_Button__Cancel_K2Node_ComponentBoundEvent_811_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ConfirmationRoot.ConfirmationRoot_C.BndEvt__[Default Button] Decline_K2Node_ComponentBoundEvent_212_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ConfirmationRoot_C_BndEvt___Default_Button__Decline_K2Node_ComponentBoundEvent_212_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationRoot_C_BndEvt___Default_Button__Decline_K2Node_ComponentBoundEvent_212_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ConfirmationRoot_C_BndEvt___Default_Button__Decline_K2Node_ComponentBoundEvent_212_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(ConfirmationRoot_C_BndEvt___Default_Button__Decline_K2Node_ComponentBoundEvent_212_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ConfirmationRoot_C_BndEvt___Default_Button__Decline_K2Node_ComponentBoundEvent_212_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(ConfirmationRoot_C_BndEvt___Default_Button__Decline_K2Node_ComponentBoundEvent_212_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ConfirmationRoot_C_BndEvt___Default_Button__Decline_K2Node_ComponentBoundEvent_212_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ConfirmationRoot.ConfirmationRoot_C.BndEvt__[Default Button] Accept_K2Node_ComponentBoundEvent_205_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ConfirmationRoot_C_BndEvt___Default_Button__Accept_K2Node_ComponentBoundEvent_205_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationRoot_C_BndEvt___Default_Button__Accept_K2Node_ComponentBoundEvent_205_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ConfirmationRoot_C_BndEvt___Default_Button__Accept_K2Node_ComponentBoundEvent_205_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(ConfirmationRoot_C_BndEvt___Default_Button__Accept_K2Node_ComponentBoundEvent_205_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ConfirmationRoot_C_BndEvt___Default_Button__Accept_K2Node_ComponentBoundEvent_205_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(ConfirmationRoot_C_BndEvt___Default_Button__Accept_K2Node_ComponentBoundEvent_205_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ConfirmationRoot_C_BndEvt___Default_Button__Accept_K2Node_ComponentBoundEvent_205_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ConfirmationRoot.ConfirmationRoot_C.Get Timer
// 0x0040 (0x0040 - 0x0000)
struct ConfirmationRoot_C_Get_Timer final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue;          // 0x0028(0x0018)()
};
static_assert(alignof(ConfirmationRoot_C_Get_Timer) == 0x000008, "Wrong alignment on ConfirmationRoot_C_Get_Timer");
static_assert(sizeof(ConfirmationRoot_C_Get_Timer) == 0x000040, "Wrong size on ConfirmationRoot_C_Get_Timer");
static_assert(offsetof(ConfirmationRoot_C_Get_Timer, ReturnValue) == 0x000000, "Member 'ConfirmationRoot_C_Get_Timer::ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_Get_Timer, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000018, "Member 'ConfirmationRoot_C_Get_Timer::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_Get_Timer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'ConfirmationRoot_C_Get_Timer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_Get_Timer, CallFunc_FromSeconds_ReturnValue) == 0x000020, "Member 'ConfirmationRoot_C_Get_Timer::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_Get_Timer, CallFunc_AsTimespan_Timespan_ReturnValue) == 0x000028, "Member 'ConfirmationRoot_C_Get_Timer::CallFunc_AsTimespan_Timespan_ReturnValue' has a wrong offset!");

// Function ConfirmationRoot.ConfirmationRoot_C.Is Timer Visible
// 0x0006 (0x0006 - 0x0000)
struct ConfirmationRoot_C_Is_Timer_Visible final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationRoot_C_Is_Timer_Visible) == 0x000001, "Wrong alignment on ConfirmationRoot_C_Is_Timer_Visible");
static_assert(sizeof(ConfirmationRoot_C_Is_Timer_Visible) == 0x000006, "Wrong size on ConfirmationRoot_C_Is_Timer_Visible");
static_assert(offsetof(ConfirmationRoot_C_Is_Timer_Visible, ReturnValue) == 0x000000, "Member 'ConfirmationRoot_C_Is_Timer_Visible::ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_Is_Timer_Visible, Temp_bool_Variable) == 0x000001, "Member 'ConfirmationRoot_C_Is_Timer_Visible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_Is_Timer_Visible, Temp_byte_Variable) == 0x000002, "Member 'ConfirmationRoot_C_Is_Timer_Visible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_Is_Timer_Visible, Temp_byte_Variable2) == 0x000003, "Member 'ConfirmationRoot_C_Is_Timer_Visible::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_Is_Timer_Visible, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'ConfirmationRoot_C_Is_Timer_Visible::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_Is_Timer_Visible, K2Node_Select_Default) == 0x000005, "Member 'ConfirmationRoot_C_Is_Timer_Visible::K2Node_Select_Default' has a wrong offset!");

// Function ConfirmationRoot.ConfirmationRoot_C.UpdateButton
// 0x0028 (0x0028 - 0x0000)
struct ConfirmationRoot_C_UpdateButton final
{
public:
	class UDefaultButton_C*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationRoot_C_UpdateButton) == 0x000008, "Wrong alignment on ConfirmationRoot_C_UpdateButton");
static_assert(sizeof(ConfirmationRoot_C_UpdateButton) == 0x000028, "Wrong size on ConfirmationRoot_C_UpdateButton");
static_assert(offsetof(ConfirmationRoot_C_UpdateButton, Button) == 0x000000, "Member 'ConfirmationRoot_C_UpdateButton::Button' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_UpdateButton, Text) == 0x000008, "Member 'ConfirmationRoot_C_UpdateButton::Text' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_UpdateButton, Temp_bool_Variable) == 0x000020, "Member 'ConfirmationRoot_C_UpdateButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_UpdateButton, CallFunc_TextIsEmpty_ReturnValue) == 0x000021, "Member 'ConfirmationRoot_C_UpdateButton::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_UpdateButton, Temp_byte_Variable) == 0x000022, "Member 'ConfirmationRoot_C_UpdateButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_UpdateButton, Temp_byte_Variable2) == 0x000023, "Member 'ConfirmationRoot_C_UpdateButton::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_UpdateButton, K2Node_Select_Default) == 0x000024, "Member 'ConfirmationRoot_C_UpdateButton::K2Node_Select_Default' has a wrong offset!");

// Function ConfirmationRoot.ConfirmationRoot_C.HandleResult
// 0x0001 (0x0001 - 0x0000)
struct ConfirmationRoot_C_HandleResult final
{
public:
	EOrionDialogResult                            Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationRoot_C_HandleResult) == 0x000001, "Wrong alignment on ConfirmationRoot_C_HandleResult");
static_assert(sizeof(ConfirmationRoot_C_HandleResult) == 0x000001, "Wrong size on ConfirmationRoot_C_HandleResult");
static_assert(offsetof(ConfirmationRoot_C_HandleResult, Result) == 0x000000, "Member 'ConfirmationRoot_C_HandleResult::Result' has a wrong offset!");

// Function ConfirmationRoot.ConfirmationRoot_C.SetErrorMode
// 0x0018 (0x0018 - 0x0000)
struct ConfirmationRoot_C_SetErrorMode final
{
public:
	bool                                          InErrorMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ConfirmationRoot_C_SetErrorMode) == 0x000008, "Wrong alignment on ConfirmationRoot_C_SetErrorMode");
static_assert(sizeof(ConfirmationRoot_C_SetErrorMode) == 0x000018, "Wrong size on ConfirmationRoot_C_SetErrorMode");
static_assert(offsetof(ConfirmationRoot_C_SetErrorMode, InErrorMode) == 0x000000, "Member 'ConfirmationRoot_C_SetErrorMode::InErrorMode' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_SetErrorMode, Temp_bool_Variable) == 0x000001, "Member 'ConfirmationRoot_C_SetErrorMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_SetErrorMode, K2Node_Select_Default) == 0x000008, "Member 'ConfirmationRoot_C_SetErrorMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ConfirmationRoot_C_SetErrorMode, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000010, "Member 'ConfirmationRoot_C_SetErrorMode::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

