#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeckWarningIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DeckWarningIcon.DeckWarningIcon_C
// 0x0028 (0x02E0 - 0x02B8)
class UDeckWarningIcon_C final : public UOrionUserWidgetBase
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Backing;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DeckWarningIcon(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeckWarningIcon_C">();
	}
	static class UDeckWarningIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeckWarningIcon_C>();
	}
};
static_assert(alignof(UDeckWarningIcon_C) == 0x000008, "Wrong alignment on UDeckWarningIcon_C");
static_assert(sizeof(UDeckWarningIcon_C) == 0x0002E0, "Wrong size on UDeckWarningIcon_C");
static_assert(offsetof(UDeckWarningIcon_C, UberGraphFrame) == 0x0002C0, "Member 'UDeckWarningIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeckWarningIcon_C, Hover) == 0x0002C8, "Member 'UDeckWarningIcon_C::Hover' has a wrong offset!");
static_assert(offsetof(UDeckWarningIcon_C, Image_0) == 0x0002D0, "Member 'UDeckWarningIcon_C::Image_0' has a wrong offset!");
static_assert(offsetof(UDeckWarningIcon_C, Image_Backing) == 0x0002D8, "Member 'UDeckWarningIcon_C::Image_Backing' has a wrong offset!");

}

