#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DisplayNameSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DisplayNameSelect.DisplayNameSelect_C.ExecuteUbergraph_DisplayNameSelect
// 0x0070 (0x0070 - 0x0000)
struct DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSuccess, class FText& MESSAGE)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMcpContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message;                        // 0x0030(0x0018)(ConstParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0048(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect) == 0x000008, "Wrong alignment on DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect");
static_assert(sizeof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect) == 0x000070, "Wrong size on DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect");
static_assert(offsetof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect, EntryPoint) == 0x000000, "Member 'DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect, K2Node_CustomEvent_bSuccess) == 0x000028, "Member 'DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect, K2Node_CustomEvent_Message) == 0x000030, "Member 'DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect, CallFunc_GetText_ReturnValue) == 0x000048, "Member 'DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'DisplayNameSelect_C_ExecuteUbergraph_DisplayNameSelect::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function DisplayNameSelect.DisplayNameSelect_C.OnUpdateDisplayName
// 0x0020 (0x0020 - 0x0000)
struct DisplayNameSelect_C_OnUpdateDisplayName final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MESSAGE;                                           // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(DisplayNameSelect_C_OnUpdateDisplayName) == 0x000008, "Wrong alignment on DisplayNameSelect_C_OnUpdateDisplayName");
static_assert(sizeof(DisplayNameSelect_C_OnUpdateDisplayName) == 0x000020, "Wrong size on DisplayNameSelect_C_OnUpdateDisplayName");
static_assert(offsetof(DisplayNameSelect_C_OnUpdateDisplayName, bSuccess) == 0x000000, "Member 'DisplayNameSelect_C_OnUpdateDisplayName::bSuccess' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_OnUpdateDisplayName, MESSAGE) == 0x000008, "Member 'DisplayNameSelect_C_OnUpdateDisplayName::MESSAGE' has a wrong offset!");

// Function DisplayNameSelect.DisplayNameSelect_C.BndEvt__UpdateButton_K2Node_ComponentBoundEvent_1_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DisplayNameSelect_C_BndEvt__UpdateButton_K2Node_ComponentBoundEvent_1_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DisplayNameSelect_C_BndEvt__UpdateButton_K2Node_ComponentBoundEvent_1_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on DisplayNameSelect_C_BndEvt__UpdateButton_K2Node_ComponentBoundEvent_1_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(DisplayNameSelect_C_BndEvt__UpdateButton_K2Node_ComponentBoundEvent_1_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on DisplayNameSelect_C_BndEvt__UpdateButton_K2Node_ComponentBoundEvent_1_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(DisplayNameSelect_C_BndEvt__UpdateButton_K2Node_ComponentBoundEvent_1_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'DisplayNameSelect_C_BndEvt__UpdateButton_K2Node_ComponentBoundEvent_1_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function DisplayNameSelect.DisplayNameSelect_C.ShowErrorMessage
// 0x0020 (0x0020 - 0x0000)
struct DisplayNameSelect_C_ShowErrorMessage final
{
public:
	class FText                                   MESSAGE;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          PlaySoundOnError;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DisplayNameSelect_C_ShowErrorMessage) == 0x000008, "Wrong alignment on DisplayNameSelect_C_ShowErrorMessage");
static_assert(sizeof(DisplayNameSelect_C_ShowErrorMessage) == 0x000020, "Wrong size on DisplayNameSelect_C_ShowErrorMessage");
static_assert(offsetof(DisplayNameSelect_C_ShowErrorMessage, MESSAGE) == 0x000000, "Member 'DisplayNameSelect_C_ShowErrorMessage::MESSAGE' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ShowErrorMessage, PlaySoundOnError) == 0x000018, "Member 'DisplayNameSelect_C_ShowErrorMessage::PlaySoundOnError' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ShowErrorMessage, Temp_bool_Variable) == 0x000019, "Member 'DisplayNameSelect_C_ShowErrorMessage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ShowErrorMessage, CallFunc_TextIsEmpty_ReturnValue) == 0x00001A, "Member 'DisplayNameSelect_C_ShowErrorMessage::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ShowErrorMessage, Temp_byte_Variable) == 0x00001B, "Member 'DisplayNameSelect_C_ShowErrorMessage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ShowErrorMessage, Temp_byte_Variable2) == 0x00001C, "Member 'DisplayNameSelect_C_ShowErrorMessage::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_ShowErrorMessage, K2Node_Select_Default) == 0x00001D, "Member 'DisplayNameSelect_C_ShowErrorMessage::K2Node_Select_Default' has a wrong offset!");

// Function DisplayNameSelect.DisplayNameSelect_C.GetWelcomeTextBlock
// 0x00B8 (0x00B8 - 0x0000)
struct DisplayNameSelect_C_GetWelcomeTextBlock final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMcpContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class FText                                   CallFunc_GetUsername_ReturnValue;                  // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
};
static_assert(alignof(DisplayNameSelect_C_GetWelcomeTextBlock) == 0x000008, "Wrong alignment on DisplayNameSelect_C_GetWelcomeTextBlock");
static_assert(sizeof(DisplayNameSelect_C_GetWelcomeTextBlock) == 0x0000B8, "Wrong size on DisplayNameSelect_C_GetWelcomeTextBlock");
static_assert(offsetof(DisplayNameSelect_C_GetWelcomeTextBlock, ReturnValue) == 0x000000, "Member 'DisplayNameSelect_C_GetWelcomeTextBlock::ReturnValue' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_GetWelcomeTextBlock, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'DisplayNameSelect_C_GetWelcomeTextBlock::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_GetWelcomeTextBlock, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'DisplayNameSelect_C_GetWelcomeTextBlock::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_GetWelcomeTextBlock, CallFunc_GetUsername_ReturnValue) == 0x000038, "Member 'DisplayNameSelect_C_GetWelcomeTextBlock::CallFunc_GetUsername_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_GetWelcomeTextBlock, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'DisplayNameSelect_C_GetWelcomeTextBlock::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_GetWelcomeTextBlock, K2Node_MakeArray_Array) == 0x000090, "Member 'DisplayNameSelect_C_GetWelcomeTextBlock::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DisplayNameSelect_C_GetWelcomeTextBlock, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'DisplayNameSelect_C_GetWelcomeTextBlock::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function DisplayNameSelect.DisplayNameSelect_C.IsInteractable
// 0x0001 (0x0001 - 0x0000)
struct DisplayNameSelect_C_IsInteractable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DisplayNameSelect_C_IsInteractable) == 0x000001, "Wrong alignment on DisplayNameSelect_C_IsInteractable");
static_assert(sizeof(DisplayNameSelect_C_IsInteractable) == 0x000001, "Wrong size on DisplayNameSelect_C_IsInteractable");
static_assert(offsetof(DisplayNameSelect_C_IsInteractable, ReturnValue) == 0x000000, "Member 'DisplayNameSelect_C_IsInteractable::ReturnValue' has a wrong offset!");

}

