#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DisplayNameSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DisplayNameSelect.DisplayNameSelect_C
// 0x0060 (0x0260 - 0x0200)
class UDisplayNameSelect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0200(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Lines_;                                            // 0x0208(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionEditableTextBox*                  DisplayName;                                       // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        DisplayNameErrorText;                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DisplayNameWidgets;                                // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       UpdateButton;                                      // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrionTextBlock*                        WelcomeToParagonText;                              // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             RememberBoxSound;                                  // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AttemptLoginSound;                                 // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LoginErrorSound;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnDisplayNameUpdateComplete;                       // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnDisplayNameUpdateComplete__DelegateSignature();
	void ExecuteUbergraph_DisplayNameSelect(int32 EntryPoint);
	void OnUpdateDisplayName(bool bSuccess, const class FText& MESSAGE);
	void BndEvt__UpdateButton_K2Node_ComponentBoundEvent_1_OrionBaseButtonClicked__DelegateSignature(class UOrionBaseButton* Button);
	void Construct();
	void ShowErrorMessage(const class FText& MESSAGE, bool PlaySoundOnError);
	class FText GetWelcomeTextBlock();

	bool IsInteractable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DisplayNameSelect_C">();
	}
	static class UDisplayNameSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisplayNameSelect_C>();
	}
};
static_assert(alignof(UDisplayNameSelect_C) == 0x000008, "Wrong alignment on UDisplayNameSelect_C");
static_assert(sizeof(UDisplayNameSelect_C) == 0x000260, "Wrong size on UDisplayNameSelect_C");
static_assert(offsetof(UDisplayNameSelect_C, UberGraphFrame) == 0x000200, "Member 'UDisplayNameSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, Lines_) == 0x000208, "Member 'UDisplayNameSelect_C::Lines_' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, DisplayName) == 0x000210, "Member 'UDisplayNameSelect_C::DisplayName' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, DisplayNameErrorText) == 0x000218, "Member 'UDisplayNameSelect_C::DisplayNameErrorText' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, DisplayNameWidgets) == 0x000220, "Member 'UDisplayNameSelect_C::DisplayNameWidgets' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, UpdateButton) == 0x000228, "Member 'UDisplayNameSelect_C::UpdateButton' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, WelcomeToParagonText) == 0x000230, "Member 'UDisplayNameSelect_C::WelcomeToParagonText' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, RememberBoxSound) == 0x000238, "Member 'UDisplayNameSelect_C::RememberBoxSound' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, AttemptLoginSound) == 0x000240, "Member 'UDisplayNameSelect_C::AttemptLoginSound' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, LoginErrorSound) == 0x000248, "Member 'UDisplayNameSelect_C::LoginErrorSound' has a wrong offset!");
static_assert(offsetof(UDisplayNameSelect_C, OnDisplayNameUpdateComplete) == 0x000250, "Member 'UDisplayNameSelect_C::OnDisplayNameUpdateComplete' has a wrong offset!");

}

