#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dragon_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Dragon_AnimBP.Dragon_AnimBP_C.ExecuteUbergraph_Dragon_AnimBP
// 0x000C (0x000C - 0x0000)
struct Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP) == 0x000004, "Wrong alignment on Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP");
static_assert(sizeof(Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP) == 0x00000C, "Wrong size on Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP");
static_assert(offsetof(Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP, EntryPoint) == 0x000000, "Member 'Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP, CallFunc_Not_PreBool_ReturnValue2) == 0x000009, "Member 'Dragon_AnimBP_C_ExecuteUbergraph_Dragon_AnimBP::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");

}

