#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dragon_AnimBP

#include "Basic.hpp"

#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Dragon_AnimBP.Dragon_AnimBP_C
// 0x1610 (0x27D0 - 0x11C0)
class UDragon_AnimBP_C final : public UOrionHeroAnimInstance
{
public:
	uint8                                         Pad_11B8[0x8];                                     // 0x11B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11C0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_E0D57450465071444BF6ACAFBAACF14A; // 0x11C8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4B8A14FD49480819982A4BAA49E2E6D5; // 0x1210(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_9672CE114099D1F1C0F27E9E87D94852; // 0x1278(0x0078)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_D57CA2464FDB1E1729FBA2B48F647602; // 0x12F0(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7091B7F14DAB246132205B9F16E14812; // 0x1350(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DA7E00D246438F2D87C170B02A1FCC8D; // 0x13D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B91B32844F24F0FC6F8B43B3B8A63421; // 0x1450(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BFB8F93A4AFDE8454FE2A7BC57EFEDC6; // 0x14D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5068BDBB4D4265425AED158C1CA33711; // 0x1550(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E5836A22493DCB08B1E1FF9450B3C022; // 0x15D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_069C5D0D44D916802B6D94BE5D220719; // 0x1650(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62B2BCCB4A60AB72860E43861674AC32; // 0x16D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EF0CC2744FF317EDD4E743BB88833C7B; // 0x1750(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BFDEA2AE47638C60A0F87B9840A24AE4; // 0x17D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94F3F95A4B241CC7B5D80EB59D057FC9; // 0x1850(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2333E71544C33F8DC5BB58A2F21C2249; // 0x18D0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C079754D475F7C35C93EBDBB6E0B771E; // 0x1950(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C7BBDFF649B2845590A100A8B1A07E6A; // 0x19C0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1B07012F4742E4D3CF0948B6090199B9; // 0x1A08(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_F36EEF5B459EAC9865CCEEB424CDE2BD; // 0x1A78(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_019E476A4F0DB19D38B7649B4776C83E; // 0x1AC0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_56D164764E529464D573D2B86DE237CA; // 0x1B30(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_57D396F64D3CA37103EBC2AAF29DE750; // 0x1B78(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_57A4ECC747E12FD1A7DB2BB574DD56FA; // 0x1BE8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_BBE41E2B4493985BBDCDFEA46020336D; // 0x1C30(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_6BCFCD0F492280A301B16B9764A61FA9; // 0x1D58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E750433141449BEFA8F0ACA83D614688; // 0x1DA0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_7149BF9840C5A8EA0EF8AC9ED7A322EE; // 0x1E10(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_79917DF04FB50FCA52110B9C9398C84D; // 0x1E58(0x00D8)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_749CABDA4678EBA63D136E9191BD5D13; // 0x1F30(0x0158)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4451E5BC424B6C28E2050CB4369CE35F; // 0x2088(0x0070)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_510C31DC4E52C6CA6D63FE971E41176C; // 0x20F8(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_378326EE49EB9BCE8E97B88CF89CA741; // 0x2160(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4C643FB941F49AF16860769130A40373; // 0x2240(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_DEE5CEB5496FBFA7303EC892AEDF1F8B; // 0x2310(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_C596B3BA48B8ADB85691D981C98A048F; // 0x2378(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80CAFECE4BA2DC0231B53AABE20C4B58; // 0x2420(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15FA20BD467E0DD535606687312083AB; // 0x2470(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_360EE5D843958B53D72EF3981D336292; // 0x24C0(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7B6238FB4BBF484D73667EB038A1D685; // 0x2510(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A7F422C94BCFCB1009AA85B5D48FCD59; // 0x25B8(0x0050)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D7A90B9D4B4A1ECD7A782A8E1C3787B9; // 0x2608(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_A7A3AD514D00B080B7C9EF94FBBF8D73; // 0x2650(0x0048)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_A7245E6345BF8A5D2C994A9C32D04349; // 0x2698(0x0098)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_A3E12F3E442E452C1DA9C2974B9E16E2; // 0x2730(0x0098)()

public:
	void ExecuteUbergraph_Dragon_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_ApplyAdditive_9672CE114099D1F1C0F27E9E87D94852();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_BlendListByBool_4C643FB941F49AF16860769130A40373();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_BlendSpacePlayer_BBE41E2B4493985BBDCDFEA46020336D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_RotateRootBone_D57CA2464FDB1E1729FBA2B48F647602();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_749CABDA4678EBA63D136E9191BD5D13();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_SequenceEvaluator_019E476A4F0DB19D38B7649B4776C83E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_SequenceEvaluator_4451E5BC424B6C28E2050CB4369CE35F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_SequenceEvaluator_57D396F64D3CA37103EBC2AAF29DE750();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_069C5D0D44D916802B6D94BE5D220719();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_2333E71544C33F8DC5BB58A2F21C2249();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_5068BDBB4D4265425AED158C1CA33711();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_62B2BCCB4A60AB72860E43861674AC32();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_7091B7F14DAB246132205B9F16E14812();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_94F3F95A4B241CC7B5D80EB59D057FC9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_B91B32844F24F0FC6F8B43B3B8A63421();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_BFDEA2AE47638C60A0F87B9840A24AE4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_DA7E00D246438F2D87C170B02A1FCC8D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_E5836A22493DCB08B1E1FF9450B3C022();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Dragon_AnimBP_AnimGraphNode_TransitionResult_EF0CC2744FF317EDD4E743BB88833C7B();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dragon_AnimBP_C">();
	}
	static class UDragon_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDragon_AnimBP_C>();
	}
};
static_assert(alignof(UDragon_AnimBP_C) == 0x000010, "Wrong alignment on UDragon_AnimBP_C");
static_assert(sizeof(UDragon_AnimBP_C) == 0x0027D0, "Wrong size on UDragon_AnimBP_C");
static_assert(offsetof(UDragon_AnimBP_C, UberGraphFrame) == 0x0011C0, "Member 'UDragon_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_Root_E0D57450465071444BF6ACAFBAACF14A) == 0x0011C8, "Member 'UDragon_AnimBP_C::AnimGraphNode_Root_E0D57450465071444BF6ACAFBAACF14A' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_Slot_4B8A14FD49480819982A4BAA49E2E6D5) == 0x001210, "Member 'UDragon_AnimBP_C::AnimGraphNode_Slot_4B8A14FD49480819982A4BAA49E2E6D5' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_ApplyAdditive_9672CE114099D1F1C0F27E9E87D94852) == 0x001278, "Member 'UDragon_AnimBP_C::AnimGraphNode_ApplyAdditive_9672CE114099D1F1C0F27E9E87D94852' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_RotateRootBone_D57CA2464FDB1E1729FBA2B48F647602) == 0x0012F0, "Member 'UDragon_AnimBP_C::AnimGraphNode_RotateRootBone_D57CA2464FDB1E1729FBA2B48F647602' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_7091B7F14DAB246132205B9F16E14812) == 0x001350, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_7091B7F14DAB246132205B9F16E14812' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_DA7E00D246438F2D87C170B02A1FCC8D) == 0x0013D0, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_DA7E00D246438F2D87C170B02A1FCC8D' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_B91B32844F24F0FC6F8B43B3B8A63421) == 0x001450, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_B91B32844F24F0FC6F8B43B3B8A63421' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_BFB8F93A4AFDE8454FE2A7BC57EFEDC6) == 0x0014D0, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_BFB8F93A4AFDE8454FE2A7BC57EFEDC6' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_5068BDBB4D4265425AED158C1CA33711) == 0x001550, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_5068BDBB4D4265425AED158C1CA33711' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_E5836A22493DCB08B1E1FF9450B3C022) == 0x0015D0, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_E5836A22493DCB08B1E1FF9450B3C022' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_069C5D0D44D916802B6D94BE5D220719) == 0x001650, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_069C5D0D44D916802B6D94BE5D220719' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_62B2BCCB4A60AB72860E43861674AC32) == 0x0016D0, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_62B2BCCB4A60AB72860E43861674AC32' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_EF0CC2744FF317EDD4E743BB88833C7B) == 0x001750, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_EF0CC2744FF317EDD4E743BB88833C7B' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_BFDEA2AE47638C60A0F87B9840A24AE4) == 0x0017D0, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_BFDEA2AE47638C60A0F87B9840A24AE4' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_94F3F95A4B241CC7B5D80EB59D057FC9) == 0x001850, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_94F3F95A4B241CC7B5D80EB59D057FC9' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_TransitionResult_2333E71544C33F8DC5BB58A2F21C2249) == 0x0018D0, "Member 'UDragon_AnimBP_C::AnimGraphNode_TransitionResult_2333E71544C33F8DC5BB58A2F21C2249' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_SequencePlayer_C079754D475F7C35C93EBDBB6E0B771E) == 0x001950, "Member 'UDragon_AnimBP_C::AnimGraphNode_SequencePlayer_C079754D475F7C35C93EBDBB6E0B771E' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_StateResult_C7BBDFF649B2845590A100A8B1A07E6A) == 0x0019C0, "Member 'UDragon_AnimBP_C::AnimGraphNode_StateResult_C7BBDFF649B2845590A100A8B1A07E6A' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_SequencePlayer_1B07012F4742E4D3CF0948B6090199B9) == 0x001A08, "Member 'UDragon_AnimBP_C::AnimGraphNode_SequencePlayer_1B07012F4742E4D3CF0948B6090199B9' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_StateResult_F36EEF5B459EAC9865CCEEB424CDE2BD) == 0x001A78, "Member 'UDragon_AnimBP_C::AnimGraphNode_StateResult_F36EEF5B459EAC9865CCEEB424CDE2BD' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_SequenceEvaluator_019E476A4F0DB19D38B7649B4776C83E) == 0x001AC0, "Member 'UDragon_AnimBP_C::AnimGraphNode_SequenceEvaluator_019E476A4F0DB19D38B7649B4776C83E' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_StateResult_56D164764E529464D573D2B86DE237CA) == 0x001B30, "Member 'UDragon_AnimBP_C::AnimGraphNode_StateResult_56D164764E529464D573D2B86DE237CA' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_SequenceEvaluator_57D396F64D3CA37103EBC2AAF29DE750) == 0x001B78, "Member 'UDragon_AnimBP_C::AnimGraphNode_SequenceEvaluator_57D396F64D3CA37103EBC2AAF29DE750' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_StateResult_57A4ECC747E12FD1A7DB2BB574DD56FA) == 0x001BE8, "Member 'UDragon_AnimBP_C::AnimGraphNode_StateResult_57A4ECC747E12FD1A7DB2BB574DD56FA' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_BlendSpacePlayer_BBE41E2B4493985BBDCDFEA46020336D) == 0x001C30, "Member 'UDragon_AnimBP_C::AnimGraphNode_BlendSpacePlayer_BBE41E2B4493985BBDCDFEA46020336D' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_StateResult_6BCFCD0F492280A301B16B9764A61FA9) == 0x001D58, "Member 'UDragon_AnimBP_C::AnimGraphNode_StateResult_6BCFCD0F492280A301B16B9764A61FA9' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_SequencePlayer_E750433141449BEFA8F0ACA83D614688) == 0x001DA0, "Member 'UDragon_AnimBP_C::AnimGraphNode_SequencePlayer_E750433141449BEFA8F0ACA83D614688' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_StateResult_7149BF9840C5A8EA0EF8AC9ED7A322EE) == 0x001E10, "Member 'UDragon_AnimBP_C::AnimGraphNode_StateResult_7149BF9840C5A8EA0EF8AC9ED7A322EE' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_StateMachine_79917DF04FB50FCA52110B9C9398C84D) == 0x001E58, "Member 'UDragon_AnimBP_C::AnimGraphNode_StateMachine_79917DF04FB50FCA52110B9C9398C84D' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_749CABDA4678EBA63D136E9191BD5D13) == 0x001F30, "Member 'UDragon_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_749CABDA4678EBA63D136E9191BD5D13' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_SequenceEvaluator_4451E5BC424B6C28E2050CB4369CE35F) == 0x002088, "Member 'UDragon_AnimBP_C::AnimGraphNode_SequenceEvaluator_4451E5BC424B6C28E2050CB4369CE35F' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_Slot_510C31DC4E52C6CA6D63FE971E41176C) == 0x0020F8, "Member 'UDragon_AnimBP_C::AnimGraphNode_Slot_510C31DC4E52C6CA6D63FE971E41176C' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_LayeredBoneBlend_378326EE49EB9BCE8E97B88CF89CA741) == 0x002160, "Member 'UDragon_AnimBP_C::AnimGraphNode_LayeredBoneBlend_378326EE49EB9BCE8E97B88CF89CA741' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_BlendListByBool_4C643FB941F49AF16860769130A40373) == 0x002240, "Member 'UDragon_AnimBP_C::AnimGraphNode_BlendListByBool_4C643FB941F49AF16860769130A40373' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_Slot_DEE5CEB5496FBFA7303EC892AEDF1F8B) == 0x002310, "Member 'UDragon_AnimBP_C::AnimGraphNode_Slot_DEE5CEB5496FBFA7303EC892AEDF1F8B' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_SaveCachedPose_C596B3BA48B8ADB85691D981C98A048F) == 0x002378, "Member 'UDragon_AnimBP_C::AnimGraphNode_SaveCachedPose_C596B3BA48B8ADB85691D981C98A048F' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_UseCachedPose_80CAFECE4BA2DC0231B53AABE20C4B58) == 0x002420, "Member 'UDragon_AnimBP_C::AnimGraphNode_UseCachedPose_80CAFECE4BA2DC0231B53AABE20C4B58' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_UseCachedPose_15FA20BD467E0DD535606687312083AB) == 0x002470, "Member 'UDragon_AnimBP_C::AnimGraphNode_UseCachedPose_15FA20BD467E0DD535606687312083AB' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_UseCachedPose_360EE5D843958B53D72EF3981D336292) == 0x0024C0, "Member 'UDragon_AnimBP_C::AnimGraphNode_UseCachedPose_360EE5D843958B53D72EF3981D336292' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_SaveCachedPose_7B6238FB4BBF484D73667EB038A1D685) == 0x002510, "Member 'UDragon_AnimBP_C::AnimGraphNode_SaveCachedPose_7B6238FB4BBF484D73667EB038A1D685' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_UseCachedPose_A7F422C94BCFCB1009AA85B5D48FCD59) == 0x0025B8, "Member 'UDragon_AnimBP_C::AnimGraphNode_UseCachedPose_A7F422C94BCFCB1009AA85B5D48FCD59' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_LocalToComponentSpace_D7A90B9D4B4A1ECD7A782A8E1C3787B9) == 0x002608, "Member 'UDragon_AnimBP_C::AnimGraphNode_LocalToComponentSpace_D7A90B9D4B4A1ECD7A782A8E1C3787B9' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_A7A3AD514D00B080B7C9EF94FBBF8D73) == 0x002650, "Member 'UDragon_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_A7A3AD514D00B080B7C9EF94FBBF8D73' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_LegIK_A7245E6345BF8A5D2C994A9C32D04349) == 0x002698, "Member 'UDragon_AnimBP_C::AnimGraphNode_LegIK_A7245E6345BF8A5D2C994A9C32D04349' has a wrong offset!");
static_assert(offsetof(UDragon_AnimBP_C, AnimGraphNode_LegIK_A3E12F3E442E452C1DA9C2974B9E16E2) == 0x002730, "Member 'UDragon_AnimBP_C::AnimGraphNode_LegIK_A3E12F3E442E452C1DA9C2974B9E16E2' has a wrong offset!");

}

