#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicPurchaseFlowDisplay

#include "Basic.hpp"


namespace SDK::Params
{

// Function EpicPurchaseFlowDisplay.EpicPurchaseFlowDisplay_C.ExecuteUbergraph_EpicPurchaseFlowDisplay
// 0x0078 (0x0078 - 0x0000)
struct EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStoreContext*                          CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreContext*                          CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UStoreContext*                          CallFunc_GetContext_ReturnValue3;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_WebWidget;                      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_OfferId;                        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* WebWidget, const class FString& OfferId)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionUIManagerWidget*                  CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay) == 0x000008, "Wrong alignment on EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay");
static_assert(sizeof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay) == 0x000078, "Wrong size on EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, EntryPoint) == 0x000000, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, CallFunc_GetContext_ReturnValue3) == 0x000028, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, K2Node_CustomEvent_WebWidget) == 0x000038, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::K2Node_CustomEvent_WebWidget' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, K2Node_CustomEvent_OfferId) == 0x000040, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::K2Node_CustomEvent_OfferId' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, K2Node_ComponentBoundEvent_Button) == 0x000060, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000068, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay, CallFunc_AddChild_ReturnValue) == 0x000070, "Member 'EpicPurchaseFlowDisplay_C_ExecuteUbergraph_EpicPurchaseFlowDisplay::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function EpicPurchaseFlowDisplay.EpicPurchaseFlowDisplay_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_462_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EpicPurchaseFlowDisplay_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_462_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EpicPurchaseFlowDisplay_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_462_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on EpicPurchaseFlowDisplay_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_462_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(EpicPurchaseFlowDisplay_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_462_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on EpicPurchaseFlowDisplay_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_462_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_462_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'EpicPurchaseFlowDisplay_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_462_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function EpicPurchaseFlowDisplay.EpicPurchaseFlowDisplay_C.Display Widget
// 0x0018 (0x0018 - 0x0000)
struct EpicPurchaseFlowDisplay_C_Display_Widget final
{
public:
	class UWidget*                                WebWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OfferId;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(EpicPurchaseFlowDisplay_C_Display_Widget) == 0x000008, "Wrong alignment on EpicPurchaseFlowDisplay_C_Display_Widget");
static_assert(sizeof(EpicPurchaseFlowDisplay_C_Display_Widget) == 0x000018, "Wrong size on EpicPurchaseFlowDisplay_C_Display_Widget");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_Display_Widget, WebWidget) == 0x000000, "Member 'EpicPurchaseFlowDisplay_C_Display_Widget::WebWidget' has a wrong offset!");
static_assert(offsetof(EpicPurchaseFlowDisplay_C_Display_Widget, OfferId) == 0x000008, "Member 'EpicPurchaseFlowDisplay_C_Display_Widget::OfferId' has a wrong offset!");

}

