#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEnd_HeroAndQuickMatch

#include "Basic.hpp"

#include "Struct_MoonMaterial_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_HeroHomeWorld_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass FrontEnd_HeroAndQuickMatch.FrontEnd_HeroAndQuickMatch_C
// 0x0080 (0x03A0 - 0x0320)
class AFrontEnd_HeroAndQuickMatch_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(Transient, DuplicateTransient)
	class FName                                   SceneName;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NearView_Fstop;                                    // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarView_Fstop;                                     // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_HeroHomeWorld                            Moon;                                              // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_MoonMaterial                   AtmosphereMaterial;                                // 0x0340(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         NearCamDistance;                                   // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarCamDistance;                                    // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     HeroSelect_POST_ExecuteUbergraph_FrontEnd_HeroAndQuickMatch_RefProperty; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionHeroPlacementActor*               HeroPlacementActor_ExecuteUbergraph_FrontEnd_HeroAndQuickMatch_RefProperty; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           HeroCamera_ExecuteUbergraph_FrontEnd_HeroAndQuickMatch_RefProperty; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FrontEnd_HeroAndQuickMatch(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SendMoon(Enum_HeroHomeWorld NewParam, Enum_HeroHomeWorld* NewParam1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEnd_HeroAndQuickMatch_C">();
	}
	static class AFrontEnd_HeroAndQuickMatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontEnd_HeroAndQuickMatch_C>();
	}
};
static_assert(alignof(AFrontEnd_HeroAndQuickMatch_C) == 0x000008, "Wrong alignment on AFrontEnd_HeroAndQuickMatch_C");
static_assert(sizeof(AFrontEnd_HeroAndQuickMatch_C) == 0x0003A0, "Wrong size on AFrontEnd_HeroAndQuickMatch_C");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, UberGraphFrame) == 0x000320, "Member 'AFrontEnd_HeroAndQuickMatch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, SceneName) == 0x000328, "Member 'AFrontEnd_HeroAndQuickMatch_C::SceneName' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, NearView_Fstop) == 0x000330, "Member 'AFrontEnd_HeroAndQuickMatch_C::NearView_Fstop' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, FarView_Fstop) == 0x000334, "Member 'AFrontEnd_HeroAndQuickMatch_C::FarView_Fstop' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, Moon) == 0x000338, "Member 'AFrontEnd_HeroAndQuickMatch_C::Moon' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, AtmosphereMaterial) == 0x000340, "Member 'AFrontEnd_HeroAndQuickMatch_C::AtmosphereMaterial' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, NearCamDistance) == 0x000380, "Member 'AFrontEnd_HeroAndQuickMatch_C::NearCamDistance' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, FarCamDistance) == 0x000384, "Member 'AFrontEnd_HeroAndQuickMatch_C::FarCamDistance' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, HeroSelect_POST_ExecuteUbergraph_FrontEnd_HeroAndQuickMatch_RefProperty) == 0x000388, "Member 'AFrontEnd_HeroAndQuickMatch_C::HeroSelect_POST_ExecuteUbergraph_FrontEnd_HeroAndQuickMatch_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, HeroPlacementActor_ExecuteUbergraph_FrontEnd_HeroAndQuickMatch_RefProperty) == 0x000390, "Member 'AFrontEnd_HeroAndQuickMatch_C::HeroPlacementActor_ExecuteUbergraph_FrontEnd_HeroAndQuickMatch_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontEnd_HeroAndQuickMatch_C, HeroCamera_ExecuteUbergraph_FrontEnd_HeroAndQuickMatch_RefProperty) == 0x000398, "Member 'AFrontEnd_HeroAndQuickMatch_C::HeroCamera_ExecuteUbergraph_FrontEnd_HeroAndQuickMatch_RefProperty' has a wrong offset!");

}

