#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BaseSentryTurret_Attack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_BaseSentryTurret_Attack.GA_BaseSentryTurret_Attack_C.ExecuteUbergraph_GA_BaseSentryTurret_Attack
// 0x00E0 (0x00E0 - 0x0000)
struct GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile4;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile3;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile2;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0080(0x0020)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x00A0(0x0020)()
	class UOrionAbilityTask_WaitTowerTargetAcquired* CallFunc_WaitTowerTargetAcquired_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_SpawnProjectile*      CallFunc_SpawnProjectile_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       CallFunc_BeginSpawningActor_SpawnedActor;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack) == 0x000008, "Wrong alignment on GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack");
static_assert(sizeof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack) == 0x0000E0, "Wrong size on GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, EntryPoint) == 0x000000, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CustomEvent_SpawnedProjectile4) == 0x000008, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CustomEvent_SpawnedProjectile4' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CustomEvent_SpawnedProjectile3) == 0x000020, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CustomEvent_SpawnedProjectile3' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CustomEvent_SpawnedProjectile2) == 0x000038, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CustomEvent_SpawnedProjectile2' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CustomEvent_SpawnedProjectile) == 0x000050, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CustomEvent_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, Temp_object_Variable) == 0x000068, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CreateDelegate_OutputDelegate5) == 0x000070, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, K2Node_CustomEvent_Targets) == 0x000080, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, Temp_struct_Variable) == 0x0000A0, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, CallFunc_WaitTowerTargetAcquired_ReturnValue) == 0x0000C0, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::CallFunc_WaitTowerTargetAcquired_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, CallFunc_SpawnProjectile_ReturnValue) == 0x0000C8, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0000D0, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, CallFunc_BeginSpawningActor_ReturnValue) == 0x0000D8, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, CallFunc_IsValid_ReturnValue) == 0x0000D9, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, CallFunc_IsValid_ReturnValue2) == 0x0000DA, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000DB, "Member 'GA_BaseSentryTurret_Attack_C_ExecuteUbergraph_GA_BaseSentryTurret_Attack::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_BaseSentryTurret_Attack.GA_BaseSentryTurret_Attack_C.FireProjectile_51E39CA447DC49AFD94A399C5EDBE057
// 0x0020 (0x0020 - 0x0000)
struct GA_BaseSentryTurret_Attack_C_FireProjectile_51E39CA447DC49AFD94A399C5EDBE057 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_BaseSentryTurret_Attack_C_FireProjectile_51E39CA447DC49AFD94A399C5EDBE057) == 0x000008, "Wrong alignment on GA_BaseSentryTurret_Attack_C_FireProjectile_51E39CA447DC49AFD94A399C5EDBE057");
static_assert(sizeof(GA_BaseSentryTurret_Attack_C_FireProjectile_51E39CA447DC49AFD94A399C5EDBE057) == 0x000020, "Wrong size on GA_BaseSentryTurret_Attack_C_FireProjectile_51E39CA447DC49AFD94A399C5EDBE057");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_FireProjectile_51E39CA447DC49AFD94A399C5EDBE057, Targets) == 0x000000, "Member 'GA_BaseSentryTurret_Attack_C_FireProjectile_51E39CA447DC49AFD94A399C5EDBE057::Targets' has a wrong offset!");

// Function GA_BaseSentryTurret_Attack.GA_BaseSentryTurret_Attack_C.Success_98A59FAA48A79E5BF0C87294C2A44329
// 0x0008 (0x0008 - 0x0000)
struct GA_BaseSentryTurret_Attack_C_Success_98A59FAA48A79E5BF0C87294C2A44329 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BaseSentryTurret_Attack_C_Success_98A59FAA48A79E5BF0C87294C2A44329) == 0x000008, "Wrong alignment on GA_BaseSentryTurret_Attack_C_Success_98A59FAA48A79E5BF0C87294C2A44329");
static_assert(sizeof(GA_BaseSentryTurret_Attack_C_Success_98A59FAA48A79E5BF0C87294C2A44329) == 0x000008, "Wrong size on GA_BaseSentryTurret_Attack_C_Success_98A59FAA48A79E5BF0C87294C2A44329");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_Success_98A59FAA48A79E5BF0C87294C2A44329, SpawnedProjectile) == 0x000000, "Member 'GA_BaseSentryTurret_Attack_C_Success_98A59FAA48A79E5BF0C87294C2A44329::SpawnedProjectile' has a wrong offset!");

// Function GA_BaseSentryTurret_Attack.GA_BaseSentryTurret_Attack_C.PreSpawned_98A59FAA48A79E5BF0C87294C2A44329
// 0x0008 (0x0008 - 0x0000)
struct GA_BaseSentryTurret_Attack_C_PreSpawned_98A59FAA48A79E5BF0C87294C2A44329 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BaseSentryTurret_Attack_C_PreSpawned_98A59FAA48A79E5BF0C87294C2A44329) == 0x000008, "Wrong alignment on GA_BaseSentryTurret_Attack_C_PreSpawned_98A59FAA48A79E5BF0C87294C2A44329");
static_assert(sizeof(GA_BaseSentryTurret_Attack_C_PreSpawned_98A59FAA48A79E5BF0C87294C2A44329) == 0x000008, "Wrong size on GA_BaseSentryTurret_Attack_C_PreSpawned_98A59FAA48A79E5BF0C87294C2A44329");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_PreSpawned_98A59FAA48A79E5BF0C87294C2A44329, SpawnedProjectile) == 0x000000, "Member 'GA_BaseSentryTurret_Attack_C_PreSpawned_98A59FAA48A79E5BF0C87294C2A44329::SpawnedProjectile' has a wrong offset!");

// Function GA_BaseSentryTurret_Attack.GA_BaseSentryTurret_Attack_C.NotAuthority_98A59FAA48A79E5BF0C87294C2A44329
// 0x0008 (0x0008 - 0x0000)
struct GA_BaseSentryTurret_Attack_C_NotAuthority_98A59FAA48A79E5BF0C87294C2A44329 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BaseSentryTurret_Attack_C_NotAuthority_98A59FAA48A79E5BF0C87294C2A44329) == 0x000008, "Wrong alignment on GA_BaseSentryTurret_Attack_C_NotAuthority_98A59FAA48A79E5BF0C87294C2A44329");
static_assert(sizeof(GA_BaseSentryTurret_Attack_C_NotAuthority_98A59FAA48A79E5BF0C87294C2A44329) == 0x000008, "Wrong size on GA_BaseSentryTurret_Attack_C_NotAuthority_98A59FAA48A79E5BF0C87294C2A44329");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_NotAuthority_98A59FAA48A79E5BF0C87294C2A44329, SpawnedProjectile) == 0x000000, "Member 'GA_BaseSentryTurret_Attack_C_NotAuthority_98A59FAA48A79E5BF0C87294C2A44329::SpawnedProjectile' has a wrong offset!");

// Function GA_BaseSentryTurret_Attack.GA_BaseSentryTurret_Attack_C.FailedToSpawn_98A59FAA48A79E5BF0C87294C2A44329
// 0x0008 (0x0008 - 0x0000)
struct GA_BaseSentryTurret_Attack_C_FailedToSpawn_98A59FAA48A79E5BF0C87294C2A44329 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BaseSentryTurret_Attack_C_FailedToSpawn_98A59FAA48A79E5BF0C87294C2A44329) == 0x000008, "Wrong alignment on GA_BaseSentryTurret_Attack_C_FailedToSpawn_98A59FAA48A79E5BF0C87294C2A44329");
static_assert(sizeof(GA_BaseSentryTurret_Attack_C_FailedToSpawn_98A59FAA48A79E5BF0C87294C2A44329) == 0x000008, "Wrong size on GA_BaseSentryTurret_Attack_C_FailedToSpawn_98A59FAA48A79E5BF0C87294C2A44329");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_FailedToSpawn_98A59FAA48A79E5BF0C87294C2A44329, SpawnedProjectile) == 0x000000, "Member 'GA_BaseSentryTurret_Attack_C_FailedToSpawn_98A59FAA48A79E5BF0C87294C2A44329::SpawnedProjectile' has a wrong offset!");

// Function GA_BaseSentryTurret_Attack.GA_BaseSentryTurret_Attack_C.K2_CanActivateAbility
// 0x0068 (0x0068 - 0x0000)
struct GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility");
static_assert(sizeof(GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility) == 0x000068, "Wrong size on GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_BaseSentryTurret_Attack_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");

}

