#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_Gold_PrimaryAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Buff_Gold_PrimaryAttack.GA_Buff_Gold_PrimaryAttack_C
// 0x0060 (0x0BD0 - 0x0B70)
class UGA_Buff_Gold_PrimaryAttack_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class FName                                   NewVar_0;                                          // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Uppercut;                                          // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           BigSmash;                                          // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Attack2;                                           // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Attack1;                                           // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionAbilityMontageContainer          Punch01;                                           // 0x0BA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOrionAbilityMontageContainer          Punch02;                                           // 0x0BB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 DamageGE;                                          // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Buff_Gold_PrimaryAttack(int32 EntryPoint);
	void Cancelled_E7B86EA84984694E31D659AC2514E6D8(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_E7B86EA84984694E31D659AC2514E6D8(const struct FGameplayAbilityTargetDataHandle& Targets);
	void K2_ActivateAbility();
	void OnBlendOut_0DCFD75043AB4FC79A8AC58407987B24(class FName NotifyName);
	void OnCancelled_0DCFD75043AB4FC79A8AC58407987B24(class FName NotifyName);
	void OnCompleted_0DCFD75043AB4FC79A8AC58407987B24(class FName NotifyName);
	void OnInterrupted_0DCFD75043AB4FC79A8AC58407987B24(class FName NotifyName);
	void OnNotifyBegin_0DCFD75043AB4FC79A8AC58407987B24(class FName NotifyName);
	void OnNotifyEnd_0DCFD75043AB4FC79A8AC58407987B24(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Buff_Gold_PrimaryAttack_C">();
	}
	static class UGA_Buff_Gold_PrimaryAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Buff_Gold_PrimaryAttack_C>();
	}
};
static_assert(alignof(UGA_Buff_Gold_PrimaryAttack_C) == 0x000010, "Wrong alignment on UGA_Buff_Gold_PrimaryAttack_C");
static_assert(sizeof(UGA_Buff_Gold_PrimaryAttack_C) == 0x000BD0, "Wrong size on UGA_Buff_Gold_PrimaryAttack_C");
static_assert(offsetof(UGA_Buff_Gold_PrimaryAttack_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Buff_Gold_PrimaryAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Gold_PrimaryAttack_C, NewVar_0) == 0x000B78, "Member 'UGA_Buff_Gold_PrimaryAttack_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Gold_PrimaryAttack_C, Uppercut) == 0x000B80, "Member 'UGA_Buff_Gold_PrimaryAttack_C::Uppercut' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Gold_PrimaryAttack_C, BigSmash) == 0x000B88, "Member 'UGA_Buff_Gold_PrimaryAttack_C::BigSmash' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Gold_PrimaryAttack_C, Attack2) == 0x000B90, "Member 'UGA_Buff_Gold_PrimaryAttack_C::Attack2' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Gold_PrimaryAttack_C, Attack1) == 0x000B98, "Member 'UGA_Buff_Gold_PrimaryAttack_C::Attack1' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Gold_PrimaryAttack_C, Punch01) == 0x000BA0, "Member 'UGA_Buff_Gold_PrimaryAttack_C::Punch01' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Gold_PrimaryAttack_C, Punch02) == 0x000BB0, "Member 'UGA_Buff_Gold_PrimaryAttack_C::Punch02' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Gold_PrimaryAttack_C, DamageGE) == 0x000BC0, "Member 'UGA_Buff_Gold_PrimaryAttack_C::DamageGE' has a wrong offset!");

}

