#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_River_ShadowPlane

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Buff_River_ShadowPlane.GA_Buff_River_ShadowPlane_C.ExecuteUbergraph_GA_Buff_River_ShadowPlane
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAbilityCommit*         CallFunc_WaitForAbilityCommit_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue2;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00A4(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane) == 0x000008, "Wrong alignment on GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane");
static_assert(sizeof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane) == 0x0000B0, "Wrong size on GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, EntryPoint) == 0x000000, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000008, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, K2Node_CustomEvent_ActivatedAbility) == 0x000028, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, Temp_object_Variable) == 0x000030, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_WaitForAbilityCommit_ReturnValue) == 0x000038, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_WaitForAbilityCommit_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_IsValid_ReturnValue2) == 0x000040, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, K2Node_CreateDelegate_OutputDelegate2) == 0x000048, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, K2Node_CreateDelegate_OutputDelegate3) == 0x000058, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000068, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, K2Node_CreateDelegate_OutputDelegate4) == 0x000070, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_IsValid_ReturnValue3) == 0x000080, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000088, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_ActorHasTag_ReturnValue) == 0x000090, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_WaitGameplayTagAdd_ReturnValue2) == 0x000098, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_WaitGameplayTagAdd_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_IsValid_ReturnValue4) == 0x0000A0, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000A4, "Member 'GA_Buff_River_ShadowPlane_C_ExecuteUbergraph_GA_Buff_River_ShadowPlane::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Buff_River_ShadowPlane.GA_Buff_River_ShadowPlane_C.OnCommit_67A8D7844AABC56BCED2879660EC473F
// 0x0008 (0x0008 - 0x0000)
struct GA_Buff_River_ShadowPlane_C_OnCommit_67A8D7844AABC56BCED2879660EC473F final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_River_ShadowPlane_C_OnCommit_67A8D7844AABC56BCED2879660EC473F) == 0x000008, "Wrong alignment on GA_Buff_River_ShadowPlane_C_OnCommit_67A8D7844AABC56BCED2879660EC473F");
static_assert(sizeof(GA_Buff_River_ShadowPlane_C_OnCommit_67A8D7844AABC56BCED2879660EC473F) == 0x000008, "Wrong size on GA_Buff_River_ShadowPlane_C_OnCommit_67A8D7844AABC56BCED2879660EC473F");
static_assert(offsetof(GA_Buff_River_ShadowPlane_C_OnCommit_67A8D7844AABC56BCED2879660EC473F, ActivatedAbility) == 0x000000, "Member 'GA_Buff_River_ShadowPlane_C_OnCommit_67A8D7844AABC56BCED2879660EC473F::ActivatedAbility' has a wrong offset!");

}

