#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_River_ShadowPlane

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Buff_River_ShadowPlane.GA_Buff_River_ShadowPlane_C
// 0x0050 (0x0BC0 - 0x0B70)
class UGA_Buff_River_ShadowPlane_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_to_Apply_to_Self;                               // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_MidBaseRegen;                                   // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StatusBuffRiverShadowPlaneName;                    // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StatusBuffRiverShadowPlaneTag;                     // 0x0B90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  GEBuffRiverShadowPlane;                            // 0x0B98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_ShadowPlaneButVisible;                          // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Buff_River_ShadowPlane(int32 EntryPoint);
	void Added_AE1BB70A48B8AF69120D948839B9FA0C();
	void Added_C7225D674CD95B0723C8C08BE0E6B44E();
	void K2_ActivateAbility();
	void OnCommit_67A8D7844AABC56BCED2879660EC473F(class UGameplayAbility* ActivatedAbility);
	void Removed_9D786FB845EAAB640FD4218ED34EF9CD();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Buff_River_ShadowPlane_C">();
	}
	static class UGA_Buff_River_ShadowPlane_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Buff_River_ShadowPlane_C>();
	}
};
static_assert(alignof(UGA_Buff_River_ShadowPlane_C) == 0x000010, "Wrong alignment on UGA_Buff_River_ShadowPlane_C");
static_assert(sizeof(UGA_Buff_River_ShadowPlane_C) == 0x000BC0, "Wrong size on UGA_Buff_River_ShadowPlane_C");
static_assert(offsetof(UGA_Buff_River_ShadowPlane_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Buff_River_ShadowPlane_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Buff_River_ShadowPlane_C, GE_to_Apply_to_Self) == 0x000B78, "Member 'UGA_Buff_River_ShadowPlane_C::GE_to_Apply_to_Self' has a wrong offset!");
static_assert(offsetof(UGA_Buff_River_ShadowPlane_C, GE_MidBaseRegen) == 0x000B80, "Member 'UGA_Buff_River_ShadowPlane_C::GE_MidBaseRegen' has a wrong offset!");
static_assert(offsetof(UGA_Buff_River_ShadowPlane_C, StatusBuffRiverShadowPlaneName) == 0x000B88, "Member 'UGA_Buff_River_ShadowPlane_C::StatusBuffRiverShadowPlaneName' has a wrong offset!");
static_assert(offsetof(UGA_Buff_River_ShadowPlane_C, StatusBuffRiverShadowPlaneTag) == 0x000B90, "Member 'UGA_Buff_River_ShadowPlane_C::StatusBuffRiverShadowPlaneTag' has a wrong offset!");
static_assert(offsetof(UGA_Buff_River_ShadowPlane_C, GEBuffRiverShadowPlane) == 0x000B98, "Member 'UGA_Buff_River_ShadowPlane_C::GEBuffRiverShadowPlane' has a wrong offset!");
static_assert(offsetof(UGA_Buff_River_ShadowPlane_C, GE_ShadowPlaneButVisible) == 0x000BB8, "Member 'UGA_Buff_River_ShadowPlane_C::GE_ShadowPlaneButVisible' has a wrong offset!");

}

