#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_Red_PrimaryAttack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.ExecuteUbergraph_GA_Buff_Red_PrimaryAttack
// 0x0360 (0x0360 - 0x0000)
struct GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName24;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName23;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName22;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName21;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName20;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName19;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName18;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName17;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName16;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName15;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName14;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate10;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName13;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable2;                               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate12;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName12;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName11;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate13;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName10;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate14;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate15;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate16;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate17;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable3;                               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate18;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate19;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate20;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate21;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate22;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate23;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable4;                               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate24;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0288(0x0020)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x02A8(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate25;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x02D8(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0308(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate26;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue2; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue3; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue4; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack) == 0x000360, "Wrong size on GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, EntryPoint) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName24) == 0x000008, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName24' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName23) == 0x000010, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName23' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName22) == 0x000028, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName22' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName21) == 0x000040, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName21' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName20) == 0x000058, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName20' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName19) == 0x000070, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName19' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate5) == 0x000078, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, Temp_name_Variable) == 0x000088, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate6) == 0x000090, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A0, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName18) == 0x0000A8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName18' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName17) == 0x0000B0, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName17' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName16) == 0x0000C8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName16' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate8) == 0x0000D0, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName15) == 0x0000E0, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName15' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate9) == 0x0000E8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName14) == 0x0000F8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName14' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate10) == 0x000100, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName13) == 0x000110, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName13' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate11) == 0x000118, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, Temp_name_Variable2) == 0x000128, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate12) == 0x000130, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000140, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName12) == 0x000148, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName12' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName11) == 0x000150, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName11' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate13) == 0x000158, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName10) == 0x000168, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName10' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate14) == 0x000170, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName9) == 0x000180, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate15) == 0x000188, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName8) == 0x000198, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate16) == 0x0001A0, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName7) == 0x0001B0, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate17) == 0x0001B8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, Temp_name_Variable3) == 0x0001C8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate18) == 0x0001D0, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate18' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x0001E0, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName6) == 0x0001E8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName5) == 0x0001F0, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate19) == 0x0001F8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate19' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName4) == 0x000208, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate20) == 0x000210, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate20' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName3) == 0x000220, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate21) == 0x000228, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate21' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName2) == 0x000238, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate22) == 0x000240, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate22' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_NotifyName) == 0x000250, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate23) == 0x000258, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate23' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, Temp_name_Variable4) == 0x000268, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate24) == 0x000270, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate24' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x000280, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_Targets2) == 0x000288, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CustomEvent_Targets) == 0x0002A8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate25) == 0x0002C8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate25' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, Temp_struct_Variable) == 0x0002D8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_StartTargeting_ReturnValue) == 0x0002F8, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_IsValid_ReturnValue) == 0x000300, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000308, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000318, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_SwitchInteger_CmpSuccess) == 0x00031C, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate26) == 0x000320, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate26' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000330, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue2) == 0x000338, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_IsValid_ReturnValue2) == 0x000340, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_IsValid_ReturnValue3) == 0x000341, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue3) == 0x000348, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue4) == 0x000350, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_IsValid_ReturnValue4) == 0x000358, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack, CallFunc_IsValid_ReturnValue5) == 0x000359, "Member 'GA_Buff_Red_PrimaryAttack_C_ExecuteUbergraph_GA_Buff_Red_PrimaryAttack::CallFunc_IsValid_ReturnValue5' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.Cancelled_2EAD026045E93D20A19BB088C38760CB
// 0x0020 (0x0020 - 0x0000)
struct GA_Buff_Red_PrimaryAttack_C_Cancelled_2EAD026045E93D20A19BB088C38760CB final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_Cancelled_2EAD026045E93D20A19BB088C38760CB) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_Cancelled_2EAD026045E93D20A19BB088C38760CB");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_Cancelled_2EAD026045E93D20A19BB088C38760CB) == 0x000020, "Wrong size on GA_Buff_Red_PrimaryAttack_C_Cancelled_2EAD026045E93D20A19BB088C38760CB");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_Cancelled_2EAD026045E93D20A19BB088C38760CB, Targets) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_Cancelled_2EAD026045E93D20A19BB088C38760CB::Targets' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.Confirmed_2EAD026045E93D20A19BB088C38760CB
// 0x0020 (0x0020 - 0x0000)
struct GA_Buff_Red_PrimaryAttack_C_Confirmed_2EAD026045E93D20A19BB088C38760CB final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_Confirmed_2EAD026045E93D20A19BB088C38760CB) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_Confirmed_2EAD026045E93D20A19BB088C38760CB");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_Confirmed_2EAD026045E93D20A19BB088C38760CB) == 0x000020, "Wrong size on GA_Buff_Red_PrimaryAttack_C_Confirmed_2EAD026045E93D20A19BB088C38760CB");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_Confirmed_2EAD026045E93D20A19BB088C38760CB, Targets) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_Confirmed_2EAD026045E93D20A19BB088C38760CB::Targets' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnBlendOut_312C16D2459472D9C8AE11B9E8146D85
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnBlendOut_312C16D2459472D9C8AE11B9E8146D85 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnBlendOut_312C16D2459472D9C8AE11B9E8146D85");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnBlendOut_312C16D2459472D9C8AE11B9E8146D85");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_312C16D2459472D9C8AE11B9E8146D85, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnBlendOut_312C16D2459472D9C8AE11B9E8146D85::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnBlendOut_A7EC350E43DEB7B9D3D809B02BAA6E7C::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnBlendOut_CB8233F548BE64B22B4288B726D3CBFD::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnBlendOut_F2C5B4274F278F2F3D93A18C0A71D3A1::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCancelled_312C16D2459472D9C8AE11B9E8146D85
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnCancelled_312C16D2459472D9C8AE11B9E8146D85 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnCancelled_312C16D2459472D9C8AE11B9E8146D85");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnCancelled_312C16D2459472D9C8AE11B9E8146D85");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_312C16D2459472D9C8AE11B9E8146D85, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnCancelled_312C16D2459472D9C8AE11B9E8146D85::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnCancelled_A7EC350E43DEB7B9D3D809B02BAA6E7C::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCancelled_CB8233F548BE64B22B4288B726D3CBFD
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnCancelled_CB8233F548BE64B22B4288B726D3CBFD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnCancelled_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnCancelled_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_CB8233F548BE64B22B4288B726D3CBFD, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnCancelled_CB8233F548BE64B22B4288B726D3CBFD::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnCancelled_F2C5B4274F278F2F3D93A18C0A71D3A1::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCompleted_312C16D2459472D9C8AE11B9E8146D85
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnCompleted_312C16D2459472D9C8AE11B9E8146D85 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnCompleted_312C16D2459472D9C8AE11B9E8146D85");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnCompleted_312C16D2459472D9C8AE11B9E8146D85");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_312C16D2459472D9C8AE11B9E8146D85, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnCompleted_312C16D2459472D9C8AE11B9E8146D85::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnCompleted_A7EC350E43DEB7B9D3D809B02BAA6E7C::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCompleted_CB8233F548BE64B22B4288B726D3CBFD
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnCompleted_CB8233F548BE64B22B4288B726D3CBFD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnCompleted_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnCompleted_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_CB8233F548BE64B22B4288B726D3CBFD, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnCompleted_CB8233F548BE64B22B4288B726D3CBFD::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnCompleted_F2C5B4274F278F2F3D93A18C0A71D3A1::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnInterrupted_312C16D2459472D9C8AE11B9E8146D85
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnInterrupted_312C16D2459472D9C8AE11B9E8146D85 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnInterrupted_312C16D2459472D9C8AE11B9E8146D85");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnInterrupted_312C16D2459472D9C8AE11B9E8146D85");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_312C16D2459472D9C8AE11B9E8146D85, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnInterrupted_312C16D2459472D9C8AE11B9E8146D85::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnInterrupted_A7EC350E43DEB7B9D3D809B02BAA6E7C::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnInterrupted_CB8233F548BE64B22B4288B726D3CBFD::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnInterrupted_F2C5B4274F278F2F3D93A18C0A71D3A1::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_312C16D2459472D9C8AE11B9E8146D85::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_A7EC350E43DEB7B9D3D809B02BAA6E7C::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong alignment on GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(sizeof(GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD) == 0x000008, "Wrong size on GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD");
static_assert(offsetof(GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD, NotifyName) == 0x000000, "Member 'GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_CB8233F548BE64B22B4288B726D3CBFD::NotifyName' has a wrong offset!");

// Function GA_Buff_Red_PrimaryAttack.GA_Buff_Red_PrimaryAttack_C.OnNotifyBegin_F2C5B4274F278F2F3D93A18C0A71D3A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Buff_Red_PrimaryAttack_C_OnNotifyBegin_F2C5B4274F278F2F3D93A18C0A71D3A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
