#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Blink

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Blink.GA_Card_Blink_C.ExecuteUbergraph_GA_Card_Blink
// 0x01F0 (0x01F0 - 0x0000)
struct GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0040)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0048(0x0020)()
	struct FVector                                CallFunc_GetTargetDataEndPoint_ReturnValue;        // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x00A0(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x00C8(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x00E0(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable3;                             // 0x00F8(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageTaken_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0178(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0188(0x0020)(ConstParm)
	bool                                          CallFunc_AbilityTeleportActor_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate4;             // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x01C8(0x0020)(ConstParm)
	class UAudioComponent*                        CallFunc_SpawnSoundTeamAdjustedAtLocation_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink) == 0x000008, "Wrong alignment on GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink");
static_assert(sizeof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink) == 0x0001F0, "Wrong size on GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, EntryPoint) == 0x000000, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, Temp_struct_Variable) == 0x000048, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_GetTargetDataEndPoint_ReturnValue) == 0x000068, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_GetTargetDataEndPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_StartTargeting_ReturnValue) == 0x000078, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, K2Node_CustomEvent_AuxillaryASC) == 0x000098, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, K2Node_CustomEvent_DamageInfo) == 0x0000A0, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, K2Node_CustomEvent_SpecHandle) == 0x0000C8, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, Temp_struct_Variable2) == 0x0000E0, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, Temp_struct_Variable3) == 0x0000F8, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, Temp_object_Variable) == 0x000120, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, K2Node_CreateDelegate_OutputDelegate2) == 0x000128, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_WaitNetSync_ReturnValue) == 0x000138, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_WaitDamageTaken_ReturnValue) == 0x000140, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_WaitDamageTaken_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_IsValid_ReturnValue2) == 0x000148, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_IsValid_ReturnValue3) == 0x000149, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, K2Node_CreateDelegate_OutputDelegate3) == 0x000150, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_K2_CommitAbility_ReturnValue) == 0x000160, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue) == 0x000168, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2) == 0x000170, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000178, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, K2Node_CustomEvent_Targets) == 0x000188, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_AbilityTeleportActor_ReturnValue) == 0x0001A8, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_AbilityTeleportActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_GetForwardVector_ReturnValue) == 0x0001AC, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, K2Node_CreateDelegate_OutputDelegate4) == 0x0001B8, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, K2Node_CustomEvent_Targets2) == 0x0001C8, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink, CallFunc_SpawnSoundTeamAdjustedAtLocation_ReturnValue) == 0x0001E8, "Member 'GA_Card_Blink_C_ExecuteUbergraph_GA_Card_Blink::CallFunc_SpawnSoundTeamAdjustedAtLocation_ReturnValue' has a wrong offset!");

// Function GA_Card_Blink.GA_Card_Blink_C.Cancelled_0C63DBB4475A3EB168D94CA109DABEC2
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_Blink_C_Cancelled_0C63DBB4475A3EB168D94CA109DABEC2 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_Blink_C_Cancelled_0C63DBB4475A3EB168D94CA109DABEC2) == 0x000008, "Wrong alignment on GA_Card_Blink_C_Cancelled_0C63DBB4475A3EB168D94CA109DABEC2");
static_assert(sizeof(GA_Card_Blink_C_Cancelled_0C63DBB4475A3EB168D94CA109DABEC2) == 0x000020, "Wrong size on GA_Card_Blink_C_Cancelled_0C63DBB4475A3EB168D94CA109DABEC2");
static_assert(offsetof(GA_Card_Blink_C_Cancelled_0C63DBB4475A3EB168D94CA109DABEC2, Targets) == 0x000000, "Member 'GA_Card_Blink_C_Cancelled_0C63DBB4475A3EB168D94CA109DABEC2::Targets' has a wrong offset!");

// Function GA_Card_Blink.GA_Card_Blink_C.Confirmed_0C63DBB4475A3EB168D94CA109DABEC2
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_Blink_C_Confirmed_0C63DBB4475A3EB168D94CA109DABEC2 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_Blink_C_Confirmed_0C63DBB4475A3EB168D94CA109DABEC2) == 0x000008, "Wrong alignment on GA_Card_Blink_C_Confirmed_0C63DBB4475A3EB168D94CA109DABEC2");
static_assert(sizeof(GA_Card_Blink_C_Confirmed_0C63DBB4475A3EB168D94CA109DABEC2) == 0x000020, "Wrong size on GA_Card_Blink_C_Confirmed_0C63DBB4475A3EB168D94CA109DABEC2");
static_assert(offsetof(GA_Card_Blink_C_Confirmed_0C63DBB4475A3EB168D94CA109DABEC2, Targets) == 0x000000, "Member 'GA_Card_Blink_C_Confirmed_0C63DBB4475A3EB168D94CA109DABEC2::Targets' has a wrong offset!");

// Function GA_Card_Blink.GA_Card_Blink_C.OnDamage_D694D707434DB2F26F6520BD7AAEE0EC
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC) == 0x000008, "Wrong alignment on GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC");
static_assert(sizeof(GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC) == 0x000048, "Wrong size on GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC");
static_assert(offsetof(GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC, AuxillaryASC) == 0x000000, "Member 'GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC, DamageInfo) == 0x000008, "Member 'GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC, SpecHandle) == 0x000030, "Member 'GA_Card_Blink_C_OnDamage_D694D707434DB2F26F6520BD7AAEE0EC::SpecHandle' has a wrong offset!");

}

