#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Cleanse_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Cleanse_Projectile.GA_Card_Cleanse_Projectile_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_Cleanse_Projectile_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 TargetingCamera;                                   // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Projectile;                                        // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Cleanse_Projectile(int32 EntryPoint);
	void Cancelled_9F48394E40C4A9F60F08188CEE97E418(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_9F48394E40C4A9F60F08188CEE97E418(const struct FGameplayAbilityTargetDataHandle& Targets);
	void FailedToSpawn_B27DC10B4A143B07A055FF82AB905F2D(class AOrionProjectile* SpawnedProjectile);
	void K2_ActivateAbility();
	void NotAuthority_B27DC10B4A143B07A055FF82AB905F2D(class AOrionProjectile* SpawnedProjectile);
	void PreSpawned_B27DC10B4A143B07A055FF82AB905F2D(class AOrionProjectile* SpawnedProjectile);
	void Success_B27DC10B4A143B07A055FF82AB905F2D(class AOrionProjectile* SpawnedProjectile);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Cleanse_Projectile_C">();
	}
	static class UGA_Card_Cleanse_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Cleanse_Projectile_C>();
	}
};
static_assert(alignof(UGA_Card_Cleanse_Projectile_C) == 0x000010, "Wrong alignment on UGA_Card_Cleanse_Projectile_C");
static_assert(sizeof(UGA_Card_Cleanse_Projectile_C) == 0x000B90, "Wrong size on UGA_Card_Cleanse_Projectile_C");
static_assert(offsetof(UGA_Card_Cleanse_Projectile_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Cleanse_Projectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Cleanse_Projectile_C, TargetingCamera) == 0x000B78, "Member 'UGA_Card_Cleanse_Projectile_C::TargetingCamera' has a wrong offset!");
static_assert(offsetof(UGA_Card_Cleanse_Projectile_C, Projectile) == 0x000B80, "Member 'UGA_Card_Cleanse_Projectile_C::Projectile' has a wrong offset!");

}

