#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_CarriedBuff_MoveSpeedOnHit

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_CarriedBuff_MoveSpeedOnHit.GA_CarriedBuff_MoveSpeedOnHit_C.ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit
// 0x0130 (0x0130 - 0x0000)
struct GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0028(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0050(0x0018)()
	class AActor*                                 Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0070(0x0040)()
	EOrionTeam                                    Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionAbilityTargetDataFilter          K2Node_MakeStruct_OrionAbilityTargetDataFilter;    // 0x00B8(0x0030)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IOrionTeamActorInterface> K2Node_DynamicCast_AsOrion_Team_Actor_Interface;   // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeOrionFilterHandle_ReturnValue;        // 0x0108(0x0010)()
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEffectApplied_Target* CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit) == 0x000008, "Wrong alignment on GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit");
static_assert(sizeof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit) == 0x000130, "Wrong size on GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, EntryPoint) == 0x000000, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, K2Node_CustomEvent_Target) == 0x000020, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, K2Node_CustomEvent_SpecHandle) == 0x000028, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, K2Node_CustomEvent_ActiveHandle) == 0x000040, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, Temp_struct_Variable) == 0x000048, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, Temp_struct_Variable2) == 0x000050, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, Temp_object_Variable) == 0x000068, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, K2Node_MakeStruct_GameplayTagRequirements) == 0x000070, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, Temp_byte_Variable) == 0x0000B0, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, K2Node_MakeStruct_OrionAbilityTargetDataFilter) == 0x0000B8, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::K2Node_MakeStruct_OrionAbilityTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000E8, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, K2Node_DynamicCast_AsOrion_Team_Actor_Interface) == 0x0000F0, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::K2Node_DynamicCast_AsOrion_Team_Actor_Interface' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, CallFunc_MakeOrionFilterHandle_ReturnValue) == 0x000108, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::CallFunc_MakeOrionFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, CallFunc_GetTeamNum_ReturnValue) == 0x000118, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue) == 0x000120, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_CarriedBuff_MoveSpeedOnHit.GA_CarriedBuff_MoveSpeedOnHit_C.OnApplied_06FF9A3D4ECEBF76962748A14DD149EB
// 0x0028 (0x0028 - 0x0000)
struct GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB) == 0x000008, "Wrong alignment on GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB");
static_assert(sizeof(GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB) == 0x000028, "Wrong size on GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB, Target) == 0x000000, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB::Target' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB, SpecHandle) == 0x000008, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB, ActiveHandle) == 0x000020, "Member 'GA_CarriedBuff_MoveSpeedOnHit_C_OnApplied_06FF9A3D4ECEBF76962748A14DD149EB::ActiveHandle' has a wrong offset!");

}

