#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Blink_CD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Blink_CD.GA_Card_Blink_CD_C
// 0x0090 (0x0C00 - 0x0B70)
class UGA_Card_Blink_CD_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_Blink_CD_On_Hero_Damage;                        // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageQualifierKeywordsWithContext    DamageQualifiers;                                  // 0x0B80(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_Blink_CD(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnDamage_AB0EBC97451544BD67D023855E8CB7D3(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Blink_CD_C">();
	}
	static class UGA_Card_Blink_CD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Blink_CD_C>();
	}
};
static_assert(alignof(UGA_Card_Blink_CD_C) == 0x000010, "Wrong alignment on UGA_Card_Blink_CD_C");
static_assert(sizeof(UGA_Card_Blink_CD_C) == 0x000C00, "Wrong size on UGA_Card_Blink_CD_C");
static_assert(offsetof(UGA_Card_Blink_CD_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Blink_CD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Blink_CD_C, GE_Blink_CD_On_Hero_Damage) == 0x000B78, "Member 'UGA_Card_Blink_CD_C::GE_Blink_CD_On_Hero_Damage' has a wrong offset!");
static_assert(offsetof(UGA_Card_Blink_CD_C, DamageQualifiers) == 0x000B80, "Member 'UGA_Card_Blink_CD_C::DamageQualifiers' has a wrong offset!");

}

