#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_LoneBonusGold

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_LoneBonusGold.GA_Card_LoneBonusGold_C.ExecuteUbergraph_GA_Card_LoneBonusGold
// 0x01D0 (0x01D0 - 0x0000)
struct GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0008(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0038(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0068(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewValue4;                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_KilledActor4;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext4;          // 0x00D0(0x0018)()
	int32                                         K2Node_CustomEvent_NewValue3;                      // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor3;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext3;          // 0x00F8(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewValue2;                      // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor2;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext2;          // 0x0130(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext;           // 0x0168(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectContextHandle           Temp_struct_Variable2;                             // 0x0190(0x0018)()
	class AActor*                                 Temp_object_Variable;                              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_AddPlayerScoreListener* CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x01C4(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold) == 0x000008, "Wrong alignment on GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold");
static_assert(sizeof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold) == 0x0001D0, "Wrong size on GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, EntryPoint) == 0x000000, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, CallFunc_GetAbilityLevel_ReturnValue) == 0x000004, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_Targets2) == 0x000008, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_Targets) == 0x000038, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, Temp_struct_Variable) == 0x000068, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, CallFunc_StartTargeting_ReturnValue) == 0x000088, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000098, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B0, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_NewValue4) == 0x0000C4, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_NewValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_KilledActor4) == 0x0000C8, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_KilledActor4' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_KillingEffectContext4) == 0x0000D0, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_KillingEffectContext4' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_NewValue3) == 0x0000E8, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_NewValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_KilledActor3) == 0x0000F0, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_KilledActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_KillingEffectContext3) == 0x0000F8, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_KillingEffectContext3' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CreateDelegate_OutputDelegate4) == 0x000110, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_NewValue2) == 0x000120, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_NewValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_KilledActor2) == 0x000128, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_KilledActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_KillingEffectContext2) == 0x000130, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_KillingEffectContext2' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CreateDelegate_OutputDelegate5) == 0x000148, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_NewValue) == 0x000158, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_KilledActor) == 0x000160, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CustomEvent_KillingEffectContext) == 0x000168, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CustomEvent_KillingEffectContext' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, K2Node_CreateDelegate_OutputDelegate6) == 0x000180, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, Temp_struct_Variable2) == 0x000190, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, Temp_object_Variable) == 0x0001A8, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, Temp_int_Variable) == 0x0001B0, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue) == 0x0001B8, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, CallFunc_IsValid_ReturnValue2) == 0x0001C0, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0001C4, "Member 'GA_Card_LoneBonusGold_C_ExecuteUbergraph_GA_Card_LoneBonusGold::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Card_LoneBonusGold.GA_Card_LoneBonusGold_C.Cancelled_F6E462194E5B72D9F1FCE0A07F85A008
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_LoneBonusGold_C_Cancelled_F6E462194E5B72D9F1FCE0A07F85A008 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_LoneBonusGold_C_Cancelled_F6E462194E5B72D9F1FCE0A07F85A008) == 0x000008, "Wrong alignment on GA_Card_LoneBonusGold_C_Cancelled_F6E462194E5B72D9F1FCE0A07F85A008");
static_assert(sizeof(GA_Card_LoneBonusGold_C_Cancelled_F6E462194E5B72D9F1FCE0A07F85A008) == 0x000020, "Wrong size on GA_Card_LoneBonusGold_C_Cancelled_F6E462194E5B72D9F1FCE0A07F85A008");
static_assert(offsetof(GA_Card_LoneBonusGold_C_Cancelled_F6E462194E5B72D9F1FCE0A07F85A008, Targets) == 0x000000, "Member 'GA_Card_LoneBonusGold_C_Cancelled_F6E462194E5B72D9F1FCE0A07F85A008::Targets' has a wrong offset!");

// Function GA_Card_LoneBonusGold.GA_Card_LoneBonusGold_C.Confirmed_F6E462194E5B72D9F1FCE0A07F85A008
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_LoneBonusGold_C_Confirmed_F6E462194E5B72D9F1FCE0A07F85A008 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_LoneBonusGold_C_Confirmed_F6E462194E5B72D9F1FCE0A07F85A008) == 0x000008, "Wrong alignment on GA_Card_LoneBonusGold_C_Confirmed_F6E462194E5B72D9F1FCE0A07F85A008");
static_assert(sizeof(GA_Card_LoneBonusGold_C_Confirmed_F6E462194E5B72D9F1FCE0A07F85A008) == 0x000020, "Wrong size on GA_Card_LoneBonusGold_C_Confirmed_F6E462194E5B72D9F1FCE0A07F85A008");
static_assert(offsetof(GA_Card_LoneBonusGold_C_Confirmed_F6E462194E5B72D9F1FCE0A07F85A008, Targets) == 0x000000, "Member 'GA_Card_LoneBonusGold_C_Confirmed_F6E462194E5B72D9F1FCE0A07F85A008::Targets' has a wrong offset!");

// Function GA_Card_LoneBonusGold.GA_Card_LoneBonusGold_C.OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE) == 0x000008, "Wrong alignment on GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE");
static_assert(sizeof(GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE) == 0x000028, "Wrong size on GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE, NewValue) == 0x000000, "Member 'GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE, KilledActor) == 0x000008, "Member 'GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE, KillingEffectContext) == 0x000010, "Member 'GA_Card_LoneBonusGold_C_OnMinionAssist_E8EFD428448A47D1F42967A3FECC21BE::KillingEffectContext' has a wrong offset!");

// Function GA_Card_LoneBonusGold.GA_Card_LoneBonusGold_C.OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE) == 0x000008, "Wrong alignment on GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE");
static_assert(sizeof(GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE) == 0x000028, "Wrong size on GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE, NewValue) == 0x000000, "Member 'GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE, KilledActor) == 0x000008, "Member 'GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE, KillingEffectContext) == 0x000010, "Member 'GA_Card_LoneBonusGold_C_OnMinionKill_E8EFD428448A47D1F42967A3FECC21BE::KillingEffectContext' has a wrong offset!");

// Function GA_Card_LoneBonusGold.GA_Card_LoneBonusGold_C.OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE) == 0x000008, "Wrong alignment on GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE");
static_assert(sizeof(GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE) == 0x000028, "Wrong size on GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE, NewValue) == 0x000000, "Member 'GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE, KilledActor) == 0x000008, "Member 'GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE, KillingEffectContext) == 0x000010, "Member 'GA_Card_LoneBonusGold_C_OnPlayerAssist_E8EFD428448A47D1F42967A3FECC21BE::KillingEffectContext' has a wrong offset!");

// Function GA_Card_LoneBonusGold.GA_Card_LoneBonusGold_C.OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE) == 0x000008, "Wrong alignment on GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE");
static_assert(sizeof(GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE) == 0x000028, "Wrong size on GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE, NewValue) == 0x000000, "Member 'GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE, KilledActor) == 0x000008, "Member 'GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE, KillingEffectContext) == 0x000010, "Member 'GA_Card_LoneBonusGold_C_OnPlayerKill_E8EFD428448A47D1F42967A3FECC21BE::KillingEffectContext' has a wrong offset!");

}

