#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Weaken

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Weaken.GA_Card_Weaken_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_Weaken_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 Projectile;                                        // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GameplayCue;                                       // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Weaken(int32 EntryPoint);
	void Cancelled_793D798141140C37E4D794AC817EDF6A(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_793D798141140C37E4D794AC817EDF6A(const struct FGameplayAbilityTargetDataHandle& Targets);
	void FailedToSpawn_EB5ACFA54A9C852E734C4FB8DBF78EE1(class AOrionProjectile* SpawnedProjectile);
	void K2_ActivateAbility();
	void NotAuthority_EB5ACFA54A9C852E734C4FB8DBF78EE1(class AOrionProjectile* SpawnedProjectile);
	void PreSpawned_EB5ACFA54A9C852E734C4FB8DBF78EE1(class AOrionProjectile* SpawnedProjectile);
	void Success_EB5ACFA54A9C852E734C4FB8DBF78EE1(class AOrionProjectile* SpawnedProjectile);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Weaken_C">();
	}
	static class UGA_Card_Weaken_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Weaken_C>();
	}
};
static_assert(alignof(UGA_Card_Weaken_C) == 0x000010, "Wrong alignment on UGA_Card_Weaken_C");
static_assert(sizeof(UGA_Card_Weaken_C) == 0x000B90, "Wrong size on UGA_Card_Weaken_C");
static_assert(offsetof(UGA_Card_Weaken_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Weaken_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Weaken_C, Projectile) == 0x000B78, "Member 'UGA_Card_Weaken_C::Projectile' has a wrong offset!");
static_assert(offsetof(UGA_Card_Weaken_C, GameplayCue) == 0x000B80, "Member 'UGA_Card_Weaken_C::GameplayCue' has a wrong offset!");

}

