#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Suppress

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Suppress.GA_Card_Suppress_C.ExecuteUbergraph_GA_Card_Suppress
// 0x03B0 (0x03B0 - 0x0000)
struct GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0018(0x0020)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0038(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnProjectile*      CallFunc_SpawnProjectile_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile4;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile3;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile2;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       Temp_object_Variable;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate6;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionAbilityTask_WaitProjectileHitActor* CallFunc_WaitProjectileHitActor_ReturnValue;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitProjectileShutdown* CallFunc_WaitProjectileShutdown_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate7;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor2;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue2;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate8;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable2;                             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_HitResult2;                     // 0x01A0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(struct FHitResult& HitResult)> K2Node_CreateDelegate_OutputDelegate9;             // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FHitResult& HitResult)> K2Node_CreateDelegate_OutputDelegate10;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x0248(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             Temp_struct_Variable2;                             // 0x02D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0368(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate12;            // 0x0388(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress) == 0x000010, "Wrong alignment on GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress");
static_assert(sizeof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress) == 0x0003B0, "Wrong size on GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, EntryPoint) == 0x000000, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_Targets) == 0x000018, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, Temp_struct_Variable) == 0x000038, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_StartTargeting_ReturnValue) == 0x000058, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_SpawnProjectile_ReturnValue) == 0x000068, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000070, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_BeginSpawningActor_ReturnValue) == 0x000078, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_IsValid_ReturnValue2) == 0x000079, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_SpawnedProjectile4) == 0x000080, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_SpawnedProjectile4' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate2) == 0x000088, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate3) == 0x000098, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_SpawnedProjectile3) == 0x0000A8, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_SpawnedProjectile3' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_SpawnedProjectile2) == 0x0000B0, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_SpawnedProjectile2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate4) == 0x0000B8, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate5) == 0x0000C8, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_SpawnedProjectile) == 0x0000D8, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, Temp_object_Variable) == 0x0000E0, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate6) == 0x0000E8, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_WaitProjectileHitActor_ReturnValue) == 0x0000F8, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_WaitProjectileHitActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_WaitProjectileShutdown_ReturnValue) == 0x000100, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_WaitProjectileShutdown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_IsValid_ReturnValue3) == 0x000108, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_IsValid_ReturnValue4) == 0x000109, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00010C, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_SpawnedActor3) == 0x000118, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x000150, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate7) == 0x000158, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_BeginSpawningActor_SpawnedActor2) == 0x000168, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_BeginSpawningActor_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_BeginSpawningActor_ReturnValue2) == 0x000170, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_BeginSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_IsValid_ReturnValue5) == 0x000171, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_SpawnedActor2) == 0x000178, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_SpawnedActor) == 0x000180, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate8) == 0x000188, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, Temp_object_Variable2) == 0x000198, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_HitResult2) == 0x0001A0, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_HitResult2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate9) == 0x000228, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate10) == 0x000238, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_HitResult) == 0x000248, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, Temp_struct_Variable2) == 0x0002D0, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate11) == 0x000358, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CustomEvent_Targets2) == 0x000368, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, K2Node_CreateDelegate_OutputDelegate12) == 0x000388, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000398, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress, CallFunc_GetActorTeam_ReturnValue) == 0x0003A0, "Member 'GA_Card_Suppress_C_ExecuteUbergraph_GA_Card_Suppress::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.Cancelled_D94145F04956AC8573349697B24CA766
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_Suppress_C_Cancelled_D94145F04956AC8573349697B24CA766 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_Suppress_C_Cancelled_D94145F04956AC8573349697B24CA766) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_Cancelled_D94145F04956AC8573349697B24CA766");
static_assert(sizeof(GA_Card_Suppress_C_Cancelled_D94145F04956AC8573349697B24CA766) == 0x000020, "Wrong size on GA_Card_Suppress_C_Cancelled_D94145F04956AC8573349697B24CA766");
static_assert(offsetof(GA_Card_Suppress_C_Cancelled_D94145F04956AC8573349697B24CA766, Targets) == 0x000000, "Member 'GA_Card_Suppress_C_Cancelled_D94145F04956AC8573349697B24CA766::Targets' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.Confirmed_D94145F04956AC8573349697B24CA766
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_Suppress_C_Confirmed_D94145F04956AC8573349697B24CA766 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_Suppress_C_Confirmed_D94145F04956AC8573349697B24CA766) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_Confirmed_D94145F04956AC8573349697B24CA766");
static_assert(sizeof(GA_Card_Suppress_C_Confirmed_D94145F04956AC8573349697B24CA766) == 0x000020, "Wrong size on GA_Card_Suppress_C_Confirmed_D94145F04956AC8573349697B24CA766");
static_assert(offsetof(GA_Card_Suppress_C_Confirmed_D94145F04956AC8573349697B24CA766, Targets) == 0x000000, "Member 'GA_Card_Suppress_C_Confirmed_D94145F04956AC8573349697B24CA766::Targets' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.FailedToSpawn_216B6EAF4EA61B256984D380A44CA105
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Suppress_C_FailedToSpawn_216B6EAF4EA61B256984D380A44CA105 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Suppress_C_FailedToSpawn_216B6EAF4EA61B256984D380A44CA105) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_FailedToSpawn_216B6EAF4EA61B256984D380A44CA105");
static_assert(sizeof(GA_Card_Suppress_C_FailedToSpawn_216B6EAF4EA61B256984D380A44CA105) == 0x000008, "Wrong size on GA_Card_Suppress_C_FailedToSpawn_216B6EAF4EA61B256984D380A44CA105");
static_assert(offsetof(GA_Card_Suppress_C_FailedToSpawn_216B6EAF4EA61B256984D380A44CA105, SpawnedActor) == 0x000000, "Member 'GA_Card_Suppress_C_FailedToSpawn_216B6EAF4EA61B256984D380A44CA105::SpawnedActor' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.FailedToSpawn_FE3477E7495935720CD435AC6B212872
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Suppress_C_FailedToSpawn_FE3477E7495935720CD435AC6B212872 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Suppress_C_FailedToSpawn_FE3477E7495935720CD435AC6B212872) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_FailedToSpawn_FE3477E7495935720CD435AC6B212872");
static_assert(sizeof(GA_Card_Suppress_C_FailedToSpawn_FE3477E7495935720CD435AC6B212872) == 0x000008, "Wrong size on GA_Card_Suppress_C_FailedToSpawn_FE3477E7495935720CD435AC6B212872");
static_assert(offsetof(GA_Card_Suppress_C_FailedToSpawn_FE3477E7495935720CD435AC6B212872, SpawnedProjectile) == 0x000000, "Member 'GA_Card_Suppress_C_FailedToSpawn_FE3477E7495935720CD435AC6B212872::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.NotAuthority_216B6EAF4EA61B256984D380A44CA105
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Suppress_C_NotAuthority_216B6EAF4EA61B256984D380A44CA105 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Suppress_C_NotAuthority_216B6EAF4EA61B256984D380A44CA105) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_NotAuthority_216B6EAF4EA61B256984D380A44CA105");
static_assert(sizeof(GA_Card_Suppress_C_NotAuthority_216B6EAF4EA61B256984D380A44CA105) == 0x000008, "Wrong size on GA_Card_Suppress_C_NotAuthority_216B6EAF4EA61B256984D380A44CA105");
static_assert(offsetof(GA_Card_Suppress_C_NotAuthority_216B6EAF4EA61B256984D380A44CA105, SpawnedActor) == 0x000000, "Member 'GA_Card_Suppress_C_NotAuthority_216B6EAF4EA61B256984D380A44CA105::SpawnedActor' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.NotAuthority_FE3477E7495935720CD435AC6B212872
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Suppress_C_NotAuthority_FE3477E7495935720CD435AC6B212872 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Suppress_C_NotAuthority_FE3477E7495935720CD435AC6B212872) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_NotAuthority_FE3477E7495935720CD435AC6B212872");
static_assert(sizeof(GA_Card_Suppress_C_NotAuthority_FE3477E7495935720CD435AC6B212872) == 0x000008, "Wrong size on GA_Card_Suppress_C_NotAuthority_FE3477E7495935720CD435AC6B212872");
static_assert(offsetof(GA_Card_Suppress_C_NotAuthority_FE3477E7495935720CD435AC6B212872, SpawnedProjectile) == 0x000000, "Member 'GA_Card_Suppress_C_NotAuthority_FE3477E7495935720CD435AC6B212872::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.OnHitActor_BB5B99B94EF8674922F4ABB713E99DDA
// 0x0088 (0x0088 - 0x0000)
struct GA_Card_Suppress_C_OnHitActor_BB5B99B94EF8674922F4ABB713E99DDA final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Card_Suppress_C_OnHitActor_BB5B99B94EF8674922F4ABB713E99DDA) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_OnHitActor_BB5B99B94EF8674922F4ABB713E99DDA");
static_assert(sizeof(GA_Card_Suppress_C_OnHitActor_BB5B99B94EF8674922F4ABB713E99DDA) == 0x000088, "Wrong size on GA_Card_Suppress_C_OnHitActor_BB5B99B94EF8674922F4ABB713E99DDA");
static_assert(offsetof(GA_Card_Suppress_C_OnHitActor_BB5B99B94EF8674922F4ABB713E99DDA, HitResult) == 0x000000, "Member 'GA_Card_Suppress_C_OnHitActor_BB5B99B94EF8674922F4ABB713E99DDA::HitResult' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.OnShutdown_BB5B99B94EF8674922F4ABB713E99DDA
// 0x0088 (0x0088 - 0x0000)
struct GA_Card_Suppress_C_OnShutdown_BB5B99B94EF8674922F4ABB713E99DDA final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Card_Suppress_C_OnShutdown_BB5B99B94EF8674922F4ABB713E99DDA) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_OnShutdown_BB5B99B94EF8674922F4ABB713E99DDA");
static_assert(sizeof(GA_Card_Suppress_C_OnShutdown_BB5B99B94EF8674922F4ABB713E99DDA) == 0x000088, "Wrong size on GA_Card_Suppress_C_OnShutdown_BB5B99B94EF8674922F4ABB713E99DDA");
static_assert(offsetof(GA_Card_Suppress_C_OnShutdown_BB5B99B94EF8674922F4ABB713E99DDA, HitResult) == 0x000000, "Member 'GA_Card_Suppress_C_OnShutdown_BB5B99B94EF8674922F4ABB713E99DDA::HitResult' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.PreSpawned_FE3477E7495935720CD435AC6B212872
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Suppress_C_PreSpawned_FE3477E7495935720CD435AC6B212872 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Suppress_C_PreSpawned_FE3477E7495935720CD435AC6B212872) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_PreSpawned_FE3477E7495935720CD435AC6B212872");
static_assert(sizeof(GA_Card_Suppress_C_PreSpawned_FE3477E7495935720CD435AC6B212872) == 0x000008, "Wrong size on GA_Card_Suppress_C_PreSpawned_FE3477E7495935720CD435AC6B212872");
static_assert(offsetof(GA_Card_Suppress_C_PreSpawned_FE3477E7495935720CD435AC6B212872, SpawnedProjectile) == 0x000000, "Member 'GA_Card_Suppress_C_PreSpawned_FE3477E7495935720CD435AC6B212872::SpawnedProjectile' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.Success_216B6EAF4EA61B256984D380A44CA105
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Suppress_C_Success_216B6EAF4EA61B256984D380A44CA105 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Suppress_C_Success_216B6EAF4EA61B256984D380A44CA105) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_Success_216B6EAF4EA61B256984D380A44CA105");
static_assert(sizeof(GA_Card_Suppress_C_Success_216B6EAF4EA61B256984D380A44CA105) == 0x000008, "Wrong size on GA_Card_Suppress_C_Success_216B6EAF4EA61B256984D380A44CA105");
static_assert(offsetof(GA_Card_Suppress_C_Success_216B6EAF4EA61B256984D380A44CA105, SpawnedActor) == 0x000000, "Member 'GA_Card_Suppress_C_Success_216B6EAF4EA61B256984D380A44CA105::SpawnedActor' has a wrong offset!");

// Function GA_Card_Suppress.GA_Card_Suppress_C.Success_FE3477E7495935720CD435AC6B212872
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Suppress_C_Success_FE3477E7495935720CD435AC6B212872 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Suppress_C_Success_FE3477E7495935720CD435AC6B212872) == 0x000008, "Wrong alignment on GA_Card_Suppress_C_Success_FE3477E7495935720CD435AC6B212872");
static_assert(sizeof(GA_Card_Suppress_C_Success_FE3477E7495935720CD435AC6B212872) == 0x000008, "Wrong size on GA_Card_Suppress_C_Success_FE3477E7495935720CD435AC6B212872");
static_assert(offsetof(GA_Card_Suppress_C_Success_FE3477E7495935720CD435AC6B212872, SpawnedProjectile) == 0x000000, "Member 'GA_Card_Suppress_C_Success_FE3477E7495935720CD435AC6B212872::SpawnedProjectile' has a wrong offset!");

}

