#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Minions_Grant_Vision

#include "Basic.hpp"

#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Minions_Grant_Vision.GA_Card_Minions_Grant_Vision_C.ExecuteUbergraph_GA_Card_Minions_Grant_Vision
// 0x000C (0x000C - 0x0000)
struct GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionAuraHandle                       CallFunc_BeginAura_ReturnValue;                    // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FOrionAuraHandle                       CallFunc_BeginAura_ReturnValue2;                   // 0x0008(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision) == 0x000004, "Wrong alignment on GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision");
static_assert(sizeof(GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision) == 0x00000C, "Wrong size on GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision");
static_assert(offsetof(GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision, EntryPoint) == 0x000000, "Member 'GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision, CallFunc_BeginAura_ReturnValue) == 0x000004, "Member 'GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision::CallFunc_BeginAura_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision, CallFunc_BeginAura_ReturnValue2) == 0x000008, "Member 'GA_Card_Minions_Grant_Vision_C_ExecuteUbergraph_GA_Card_Minions_Grant_Vision::CallFunc_BeginAura_ReturnValue2' has a wrong offset!");

}

