#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_SacrificialMagic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_SacrificialMagic.GA_Card_SacrificialMagic_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_SacrificialMagic_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_ToApply;                                        // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEApplied;                                         // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_SacrificialMagic(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnStateEnded_E47158C1423AC58462DF3F94C5AD74BC();
	void OnStateInterrupted_E47158C1423AC58462DF3F94C5AD74BC();
	void OnChange_57ADE99A46B9BFB44FE0B9996C284FBE(bool bMatchesComparison, float CurrentRatio);
	void OnChange_E67AF51C4C28737D261066A7FEC25163(bool bMatchesComparison, float CurrentRatio);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_SacrificialMagic_C">();
	}
	static class UGA_Card_SacrificialMagic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_SacrificialMagic_C>();
	}
};
static_assert(alignof(UGA_Card_SacrificialMagic_C) == 0x000010, "Wrong alignment on UGA_Card_SacrificialMagic_C");
static_assert(sizeof(UGA_Card_SacrificialMagic_C) == 0x000B90, "Wrong size on UGA_Card_SacrificialMagic_C");
static_assert(offsetof(UGA_Card_SacrificialMagic_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_SacrificialMagic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_SacrificialMagic_C, GE_ToApply) == 0x000B78, "Member 'UGA_Card_SacrificialMagic_C::GE_ToApply' has a wrong offset!");
static_assert(offsetof(UGA_Card_SacrificialMagic_C, GEApplied) == 0x000B80, "Member 'UGA_Card_SacrificialMagic_C::GEApplied' has a wrong offset!");

}

