#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Suppress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Suppress.GA_Card_Suppress_C
// 0x0040 (0x0BB0 - 0x0B70)
class UGA_Card_Suppress_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 TargetingCamera;                                   // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SuppressSelf;                                      // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToRise;                                        // 0x0B88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x0B8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SuppressDuration;                                  // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B94[0x4];                                      // 0x0B94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 HealSelfGE;                                        // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Rise;                                              // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SuppressCamera;                                    // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Suppress(int32 EntryPoint);
	void Cancelled_D94145F04956AC8573349697B24CA766(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_D94145F04956AC8573349697B24CA766(const struct FGameplayAbilityTargetDataHandle& Targets);
	void FailedToSpawn_216B6EAF4EA61B256984D380A44CA105(class AActor* SpawnedActor);
	void FailedToSpawn_FE3477E7495935720CD435AC6B212872(class AOrionProjectile* SpawnedProjectile);
	void K2_ActivateAbility();
	void NotAuthority_216B6EAF4EA61B256984D380A44CA105(class AActor* SpawnedActor);
	void NotAuthority_FE3477E7495935720CD435AC6B212872(class AOrionProjectile* SpawnedProjectile);
	void OnHitActor_BB5B99B94EF8674922F4ABB713E99DDA(const struct FHitResult& HitResult);
	void OnShutdown_83A0C6534B3958509D25C2AAC09C7603();
	void OnShutdown_BB5B99B94EF8674922F4ABB713E99DDA(const struct FHitResult& HitResult);
	void PreSpawned_FE3477E7495935720CD435AC6B212872(class AOrionProjectile* SpawnedProjectile);
	void Success_216B6EAF4EA61B256984D380A44CA105(class AActor* SpawnedActor);
	void Success_FE3477E7495935720CD435AC6B212872(class AOrionProjectile* SpawnedProjectile);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Suppress_C">();
	}
	static class UGA_Card_Suppress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Suppress_C>();
	}
};
static_assert(alignof(UGA_Card_Suppress_C) == 0x000010, "Wrong alignment on UGA_Card_Suppress_C");
static_assert(sizeof(UGA_Card_Suppress_C) == 0x000BB0, "Wrong size on UGA_Card_Suppress_C");
static_assert(offsetof(UGA_Card_Suppress_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Suppress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Suppress_C, TargetingCamera) == 0x000B78, "Member 'UGA_Card_Suppress_C::TargetingCamera' has a wrong offset!");
static_assert(offsetof(UGA_Card_Suppress_C, SuppressSelf) == 0x000B80, "Member 'UGA_Card_Suppress_C::SuppressSelf' has a wrong offset!");
static_assert(offsetof(UGA_Card_Suppress_C, TimeToRise) == 0x000B88, "Member 'UGA_Card_Suppress_C::TimeToRise' has a wrong offset!");
static_assert(offsetof(UGA_Card_Suppress_C, Height) == 0x000B8C, "Member 'UGA_Card_Suppress_C::Height' has a wrong offset!");
static_assert(offsetof(UGA_Card_Suppress_C, SuppressDuration) == 0x000B90, "Member 'UGA_Card_Suppress_C::SuppressDuration' has a wrong offset!");
static_assert(offsetof(UGA_Card_Suppress_C, HealSelfGE) == 0x000B98, "Member 'UGA_Card_Suppress_C::HealSelfGE' has a wrong offset!");
static_assert(offsetof(UGA_Card_Suppress_C, Rise) == 0x000BA0, "Member 'UGA_Card_Suppress_C::Rise' has a wrong offset!");
static_assert(offsetof(UGA_Card_Suppress_C, SuppressCamera) == 0x000BA8, "Member 'UGA_Card_Suppress_C::SuppressCamera' has a wrong offset!");

}

