#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Spellslinger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Spellslinger.GA_Card_Spellslinger_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_Spellslinger_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            CostReduction;                                     // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GEToApply;                                         // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Spellslinger(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnCommit_7DB6562E4C593DFDCE6D3084A8ADA247(class UGameplayAbility* ActivatedAbility);
	void OnStateEnded_057EB3564A19A7120E288785FD7A6F3C();
	void OnStateInterrupted_057EB3564A19A7120E288785FD7A6F3C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Spellslinger_C">();
	}
	static class UGA_Card_Spellslinger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Spellslinger_C>();
	}
};
static_assert(alignof(UGA_Card_Spellslinger_C) == 0x000010, "Wrong alignment on UGA_Card_Spellslinger_C");
static_assert(sizeof(UGA_Card_Spellslinger_C) == 0x000B90, "Wrong size on UGA_Card_Spellslinger_C");
static_assert(offsetof(UGA_Card_Spellslinger_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Spellslinger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Spellslinger_C, CostReduction) == 0x000B78, "Member 'UGA_Card_Spellslinger_C::CostReduction' has a wrong offset!");
static_assert(offsetof(UGA_Card_Spellslinger_C, GEToApply) == 0x000B80, "Member 'UGA_Card_Spellslinger_C::GEToApply' has a wrong offset!");

}

