#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Metamorphosis_Target

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Metamorphosis_Target.GA_Card_Metamorphosis_Target_C
// 0x0030 (0x0BA0 - 0x0B70)
class UGA_Card_Metamorphosis_Target_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 OriginalAnimInstance;                              // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 IllusionAnimInstance;                              // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 IllusionBP;                                        // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VisualDelay;                                       // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultGravityScale;                               // 0x0B94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BugGravityScale;                                   // 0x0B98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Metamorphosis_Target(int32 EntryPoint);
	void K2_ActivateAbility();
	void Removed_B353AE03499D7BBEA8396F8F8E6799EA();
	void Added_490568ED49A7056A9E95DEA14EE2095C();
	void Removed_7873B7944785CE839F9214AC7B7D603E();
	void Added_C2C116DC4045151F4D8F8497C0063F1D();
	void OnStateEnded_795D206F435D4A4A5D699B9A483F6861();
	void OnStateInterrupted_795D206F435D4A4A5D699B9A483F6861();
	void Success_5578B286496AE0E55E901A8B4327D2CF(class AActor* SpawnedActor);
	void NotAuthority_5578B286496AE0E55E901A8B4327D2CF(class AActor* SpawnedActor);
	void FailedToSpawn_5578B286496AE0E55E901A8B4327D2CF(class AActor* SpawnedActor);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Metamorphosis_Target_C">();
	}
	static class UGA_Card_Metamorphosis_Target_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Metamorphosis_Target_C>();
	}
};
static_assert(alignof(UGA_Card_Metamorphosis_Target_C) == 0x000010, "Wrong alignment on UGA_Card_Metamorphosis_Target_C");
static_assert(sizeof(UGA_Card_Metamorphosis_Target_C) == 0x000BA0, "Wrong size on UGA_Card_Metamorphosis_Target_C");
static_assert(offsetof(UGA_Card_Metamorphosis_Target_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Metamorphosis_Target_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_Target_C, OriginalAnimInstance) == 0x000B78, "Member 'UGA_Card_Metamorphosis_Target_C::OriginalAnimInstance' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_Target_C, IllusionAnimInstance) == 0x000B80, "Member 'UGA_Card_Metamorphosis_Target_C::IllusionAnimInstance' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_Target_C, IllusionBP) == 0x000B88, "Member 'UGA_Card_Metamorphosis_Target_C::IllusionBP' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_Target_C, VisualDelay) == 0x000B90, "Member 'UGA_Card_Metamorphosis_Target_C::VisualDelay' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_Target_C, DefaultGravityScale) == 0x000B94, "Member 'UGA_Card_Metamorphosis_Target_C::DefaultGravityScale' has a wrong offset!");
static_assert(offsetof(UGA_Card_Metamorphosis_Target_C, BugGravityScale) == 0x000B98, "Member 'UGA_Card_Metamorphosis_Target_C::BugGravityScale' has a wrong offset!");

}

