#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Isolate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Isolate.GA_Card_Isolate_C
// 0x0030 (0x0BA0 - 0x0B70)
class UGA_Card_Isolate_C : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 IsolatedBonusDamage;                               // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SpawnedActor;                                      // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            DamageGE;                                          // 0x0B90(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Isolate(int32 EntryPoint);
	void FailedToSpawn_B0DC49B642A6BDBB9CCBBFBAF49B571B(class AActor* SpawnedActor_0);
	void K2_ActivateAbility();
	void NotAuthority_B0DC49B642A6BDBB9CCBBFBAF49B571B(class AActor* SpawnedActor_0);
	void OnStateEnded_4C5A9AA945BA5444A1FA0E9A740A5A90();
	void OnStateInterrupted_4C5A9AA945BA5444A1FA0E9A740A5A90();
	void Success_B0DC49B642A6BDBB9CCBBFBAF49B571B(class AActor* SpawnedActor_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Isolate_C">();
	}
	static class UGA_Card_Isolate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Isolate_C>();
	}
};
static_assert(alignof(UGA_Card_Isolate_C) == 0x000010, "Wrong alignment on UGA_Card_Isolate_C");
static_assert(sizeof(UGA_Card_Isolate_C) == 0x000BA0, "Wrong size on UGA_Card_Isolate_C");
static_assert(offsetof(UGA_Card_Isolate_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Isolate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Isolate_C, IsolatedBonusDamage) == 0x000B78, "Member 'UGA_Card_Isolate_C::IsolatedBonusDamage' has a wrong offset!");
static_assert(offsetof(UGA_Card_Isolate_C, SpawnedActor) == 0x000B80, "Member 'UGA_Card_Isolate_C::SpawnedActor' has a wrong offset!");
static_assert(offsetof(UGA_Card_Isolate_C, Actor) == 0x000B88, "Member 'UGA_Card_Isolate_C::Actor' has a wrong offset!");
static_assert(offsetof(UGA_Card_Isolate_C, DamageGE) == 0x000B90, "Member 'UGA_Card_Isolate_C::DamageGE' has a wrong offset!");

}

