#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_OOC_HPRegMaxHP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_OOC_HPRegMaxHP.GA_Card_OOC_HPRegMaxHP_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_OOC_HPRegMaxHP_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            OOCRegen;                                          // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Regen;                                             // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_OOC_HPRegMaxHP(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnStateEnded_8DA9797C4C37BC7CDD9D12BFC568B9B6();
	void OnStateInterrupted_8DA9797C4C37BC7CDD9D12BFC568B9B6();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_OOC_HPRegMaxHP_C">();
	}
	static class UGA_Card_OOC_HPRegMaxHP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_OOC_HPRegMaxHP_C>();
	}
};
static_assert(alignof(UGA_Card_OOC_HPRegMaxHP_C) == 0x000010, "Wrong alignment on UGA_Card_OOC_HPRegMaxHP_C");
static_assert(sizeof(UGA_Card_OOC_HPRegMaxHP_C) == 0x000B90, "Wrong size on UGA_Card_OOC_HPRegMaxHP_C");
static_assert(offsetof(UGA_Card_OOC_HPRegMaxHP_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_OOC_HPRegMaxHP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_OOC_HPRegMaxHP_C, OOCRegen) == 0x000B78, "Member 'UGA_Card_OOC_HPRegMaxHP_C::OOCRegen' has a wrong offset!");
static_assert(offsetof(UGA_Card_OOC_HPRegMaxHP_C, Regen) == 0x000B80, "Member 'UGA_Card_OOC_HPRegMaxHP_C::Regen' has a wrong offset!");

}

