#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_HealAura

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_HealAura.GA_Card_HealAura_C.ExecuteUbergraph_GA_Card_HealAura
// 0x0168 (0x0168 - 0x0000)
struct GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue2;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0090(0x0018)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_SphereAroundActor_ReturnValue;            // 0x00B8(0x0020)()
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue3; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0140(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue2;             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura) == 0x000008, "Wrong alignment on GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura");
static_assert(sizeof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura) == 0x000168, "Wrong size on GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, EntryPoint) == 0x000000, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, Temp_int_Variable) == 0x000004, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_StartAbilityState_ReturnValue) == 0x000020, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000040, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, Temp_bool_Variable) == 0x000048, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_IsValid_ReturnValue2) == 0x000049, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, K2Node_CreateDelegate_OutputDelegate3) == 0x000050, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_WaitNetSync_ReturnValue) == 0x000060, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, K2Node_CreateDelegate_OutputDelegate4) == 0x000068, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_IsValid_ReturnValue3) == 0x000078, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_WaitNetSync_ReturnValue2) == 0x000080, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_WaitNetSync_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_IsValid_ReturnValue4) == 0x000088, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_GetAbilityLevel_ReturnValue) == 0x00008C, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000090, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000A8, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0000B0, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_SphereAroundActor_ReturnValue) == 0x0000B8, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_SphereAroundActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0000D8, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_GetFloatAttribute_ReturnValue) == 0x0000DC, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000E0, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_FTrunc_ReturnValue) == 0x0000F0, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F4, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F8, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000FC, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_GetAvatarActorFromActorInfo_ReturnValue3) == 0x000100, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_GetAvatarActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000108, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, K2Node_CreateDelegate_OutputDelegate5) == 0x000120, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000130, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_GetAbilityLevel_ReturnValue2) == 0x000134, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000138, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_GetValueAtLevel_ReturnValue) == 0x00013C, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000140, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000158, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura, CallFunc_GetValueAtLevel_ReturnValue2) == 0x000160, "Member 'GA_Card_HealAura_C_ExecuteUbergraph_GA_Card_HealAura::CallFunc_GetValueAtLevel_ReturnValue2' has a wrong offset!");

}

