#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_RestorationLink

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_RestorationLink.GA_Card_RestorationLink_C.ExecuteUbergraph_GA_Card_RestorationLink
// 0x01D8 (0x01D8 - 0x0000)
struct GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0008(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue2;           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0088(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x00B8(0x0020)(ConstParm)
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetEnergy_ReturnValue;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0118(0x0018)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue2;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue3;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2; // 0x0148(0x0018)()
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0168(0x0018)()
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0188(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x019C(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue2; // 0x01A8(0x0018)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2; // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue2; // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink) == 0x000008, "Wrong alignment on GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink");
static_assert(sizeof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink) == 0x0001D8, "Wrong size on GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, EntryPoint) == 0x000000, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, Temp_struct_Variable) == 0x000008, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_StartTargeting_ReturnValue) == 0x000028, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, K2Node_CreateDelegate_OutputDelegate2) == 0x000048, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_StartAbilityState_ReturnValue) == 0x000058, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_IsValid_ReturnValue2) == 0x000060, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000068, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000070, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetFloatAttribute_ReturnValue) == 0x000074, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000078, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_K2_CommitAbility_ReturnValue) == 0x000080, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2) == 0x000081, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetFloatAttribute_ReturnValue2) == 0x000084, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetFloatAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, K2Node_CustomEvent_Targets) == 0x000088, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A8, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, K2Node_CustomEvent_Targets2) == 0x0000B8, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue) == 0x0000D8, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, K2Node_CreateDelegate_OutputDelegate4) == 0x0000E0, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetEnergy_ReturnValue) == 0x0000F0, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetEnergy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000F4, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F8, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000FC, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetAbilityLevel_ReturnValue) == 0x000100, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetAbilityLevel_ReturnValue2) == 0x000104, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000108, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x00010C, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetValueAtLevel_ReturnValue) == 0x000110, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000118, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetValueAtLevel_ReturnValue2) == 0x000130, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetValueAtLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetAbilityLevel_ReturnValue3) == 0x000134, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetAbilityLevel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x000138, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2) == 0x000140, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2) == 0x000148, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_GetHealth_ReturnValue) == 0x000160, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000168, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000180, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000188, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000198, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x00019C, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x0001A4, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue2) == 0x0001A8, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2) == 0x0001C0, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue2) == 0x0001D0, "Member 'GA_Card_RestorationLink_C_ExecuteUbergraph_GA_Card_RestorationLink::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue2' has a wrong offset!");

// Function GA_Card_RestorationLink.GA_Card_RestorationLink_C.Cancelled_B855B6584A6B2CD978FFDE90EE2009D5
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_RestorationLink_C_Cancelled_B855B6584A6B2CD978FFDE90EE2009D5 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_RestorationLink_C_Cancelled_B855B6584A6B2CD978FFDE90EE2009D5) == 0x000008, "Wrong alignment on GA_Card_RestorationLink_C_Cancelled_B855B6584A6B2CD978FFDE90EE2009D5");
static_assert(sizeof(GA_Card_RestorationLink_C_Cancelled_B855B6584A6B2CD978FFDE90EE2009D5) == 0x000020, "Wrong size on GA_Card_RestorationLink_C_Cancelled_B855B6584A6B2CD978FFDE90EE2009D5");
static_assert(offsetof(GA_Card_RestorationLink_C_Cancelled_B855B6584A6B2CD978FFDE90EE2009D5, Targets) == 0x000000, "Member 'GA_Card_RestorationLink_C_Cancelled_B855B6584A6B2CD978FFDE90EE2009D5::Targets' has a wrong offset!");

// Function GA_Card_RestorationLink.GA_Card_RestorationLink_C.Confirmed_B855B6584A6B2CD978FFDE90EE2009D5
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_RestorationLink_C_Confirmed_B855B6584A6B2CD978FFDE90EE2009D5 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_RestorationLink_C_Confirmed_B855B6584A6B2CD978FFDE90EE2009D5) == 0x000008, "Wrong alignment on GA_Card_RestorationLink_C_Confirmed_B855B6584A6B2CD978FFDE90EE2009D5");
static_assert(sizeof(GA_Card_RestorationLink_C_Confirmed_B855B6584A6B2CD978FFDE90EE2009D5) == 0x000020, "Wrong size on GA_Card_RestorationLink_C_Confirmed_B855B6584A6B2CD978FFDE90EE2009D5");
static_assert(offsetof(GA_Card_RestorationLink_C_Confirmed_B855B6584A6B2CD978FFDE90EE2009D5, Targets) == 0x000000, "Member 'GA_Card_RestorationLink_C_Confirmed_B855B6584A6B2CD978FFDE90EE2009D5::Targets' has a wrong offset!");

}

