#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_EnchantedStrikes

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_EnchantedStrikes.GA_Card_EnchantedStrikes_C.ExecuteUbergraph_GA_Card_EnchantedStrikes
// 0x02B0 (0x02B0 - 0x0000)
struct GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Source;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle3;                    // 0x0040(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0058(0x0018)()
	class AActor*                                 Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_WaitKilled*           CallFunc_WaitOwnerKilled_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       Temp_object_Variable2;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAbilityCommit*         CallFunc_WaitForAbilityCommit_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC2;                  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo2;                    // 0x00D0(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle2;                    // 0x00F8(0x0018)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0110(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable3;                             // 0x0128(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable3;                             // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x0178(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x01A0(0x0018)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x01B8(0x0020)()
	struct FGameplayEffectSpecHandle              Temp_struct_Variable4;                             // 0x01D8(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable5;                             // 0x01F0(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable4;                             // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue2;  // 0x0230(0x0020)()
	bool                                          CallFunc_K2_CommitAbilityCost_ReturnValue;         // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2; // 0x0278(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageDealt_ReturnValue;              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbilityCost_ReturnValue2;        // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageDealt_ReturnValue2;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes) == 0x000008, "Wrong alignment on GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes");
static_assert(sizeof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes) == 0x0002B0, "Wrong size on GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, EntryPoint) == 0x000000, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_StartAbilityState_ReturnValue) == 0x000008, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CustomEvent_Source) == 0x000038, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CustomEvent_SpecHandle3) == 0x000040, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CustomEvent_SpecHandle3' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_struct_Variable) == 0x000058, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_object_Variable) == 0x000070, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_WaitOwnerKilled_ReturnValue) == 0x000078, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_WaitOwnerKilled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CreateDelegate_OutputDelegate3) == 0x000080, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_IsValid_ReturnValue2) == 0x000090, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CustomEvent_ActivatedAbility) == 0x000098, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_object_Variable2) == 0x0000A0, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_WaitForAbilityCommit_ReturnValue) == 0x0000A8, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_WaitForAbilityCommit_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_IsValid_ReturnValue3) == 0x0000B0, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CreateDelegate_OutputDelegate4) == 0x0000B8, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CustomEvent_AuxillaryASC2) == 0x0000C8, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CustomEvent_AuxillaryASC2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CustomEvent_DamageInfo2) == 0x0000D0, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CustomEvent_DamageInfo2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CustomEvent_SpecHandle2) == 0x0000F8, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CustomEvent_SpecHandle2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_struct_Variable2) == 0x000110, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_struct_Variable3) == 0x000128, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_object_Variable3) == 0x000150, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CreateDelegate_OutputDelegate5) == 0x000158, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_GetOwner_ReturnValue) == 0x000168, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CustomEvent_AuxillaryASC) == 0x000170, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CustomEvent_DamageInfo) == 0x000178, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CustomEvent_SpecHandle) == 0x0001A0, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0001B8, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_struct_Variable4) == 0x0001D8, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_struct_Variable5) == 0x0001F0, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_object_Variable4) == 0x000218, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_bool_IsClosed_Variable) == 0x000220, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_GetOwner_ReturnValue2) == 0x000228, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_AbilityTargetDataFromActor_ReturnValue2) == 0x000230, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_AbilityTargetDataFromActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_K2_CommitAbilityCost_ReturnValue) == 0x000250, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_K2_CommitAbilityCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x000251, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_GetAbilityLevel_ReturnValue) == 0x000254, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000258, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, K2Node_CreateDelegate_OutputDelegate6) == 0x000268, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2) == 0x000278, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, Temp_bool_Has_Been_Initd_Variable) == 0x000288, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_WaitDamageDealt_ReturnValue) == 0x000290, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_WaitDamageDealt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_IsValid_ReturnValue4) == 0x000298, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_K2_CommitAbilityCost_ReturnValue2) == 0x000299, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_K2_CommitAbilityCost_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_WaitDamageDealt_ReturnValue2) == 0x0002A0, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_WaitDamageDealt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes, CallFunc_IsValid_ReturnValue5) == 0x0002A8, "Member 'GA_Card_EnchantedStrikes_C_ExecuteUbergraph_GA_Card_EnchantedStrikes::CallFunc_IsValid_ReturnValue5' has a wrong offset!");

// Function GA_Card_EnchantedStrikes.GA_Card_EnchantedStrikes_C.OnCommit_AD19364743F0D68C82AE08842F25A922
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_EnchantedStrikes_C_OnCommit_AD19364743F0D68C82AE08842F25A922 final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_EnchantedStrikes_C_OnCommit_AD19364743F0D68C82AE08842F25A922) == 0x000008, "Wrong alignment on GA_Card_EnchantedStrikes_C_OnCommit_AD19364743F0D68C82AE08842F25A922");
static_assert(sizeof(GA_Card_EnchantedStrikes_C_OnCommit_AD19364743F0D68C82AE08842F25A922) == 0x000008, "Wrong size on GA_Card_EnchantedStrikes_C_OnCommit_AD19364743F0D68C82AE08842F25A922");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_OnCommit_AD19364743F0D68C82AE08842F25A922, ActivatedAbility) == 0x000000, "Member 'GA_Card_EnchantedStrikes_C_OnCommit_AD19364743F0D68C82AE08842F25A922::ActivatedAbility' has a wrong offset!");

// Function GA_Card_EnchantedStrikes.GA_Card_EnchantedStrikes_C.OnDamage_3213B6BF4C812A3322994FA9C8A0F95D
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D) == 0x000008, "Wrong alignment on GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D");
static_assert(sizeof(GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D) == 0x000048, "Wrong size on GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D, AuxillaryASC) == 0x000000, "Member 'GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D, DamageInfo) == 0x000008, "Member 'GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D, SpecHandle) == 0x000030, "Member 'GA_Card_EnchantedStrikes_C_OnDamage_3213B6BF4C812A3322994FA9C8A0F95D::SpecHandle' has a wrong offset!");

// Function GA_Card_EnchantedStrikes.GA_Card_EnchantedStrikes_C.OnDamage_AEA1C3B545F0D67898DAE58D8732357B
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B) == 0x000008, "Wrong alignment on GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B");
static_assert(sizeof(GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B) == 0x000048, "Wrong size on GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B, AuxillaryASC) == 0x000000, "Member 'GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B, DamageInfo) == 0x000008, "Member 'GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B, SpecHandle) == 0x000030, "Member 'GA_Card_EnchantedStrikes_C_OnDamage_AEA1C3B545F0D67898DAE58D8732357B::SpecHandle' has a wrong offset!");

// Function GA_Card_EnchantedStrikes.GA_Card_EnchantedStrikes_C.OnKilled_082454D04389E55110582BB973ABFEC8
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_EnchantedStrikes_C_OnKilled_082454D04389E55110582BB973ABFEC8 final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_EnchantedStrikes_C_OnKilled_082454D04389E55110582BB973ABFEC8) == 0x000008, "Wrong alignment on GA_Card_EnchantedStrikes_C_OnKilled_082454D04389E55110582BB973ABFEC8");
static_assert(sizeof(GA_Card_EnchantedStrikes_C_OnKilled_082454D04389E55110582BB973ABFEC8) == 0x000020, "Wrong size on GA_Card_EnchantedStrikes_C_OnKilled_082454D04389E55110582BB973ABFEC8");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_OnKilled_082454D04389E55110582BB973ABFEC8, Source) == 0x000000, "Member 'GA_Card_EnchantedStrikes_C_OnKilled_082454D04389E55110582BB973ABFEC8::Source' has a wrong offset!");
static_assert(offsetof(GA_Card_EnchantedStrikes_C_OnKilled_082454D04389E55110582BB973ABFEC8, SpecHandle) == 0x000008, "Member 'GA_Card_EnchantedStrikes_C_OnKilled_082454D04389E55110582BB973ABFEC8::SpecHandle' has a wrong offset!");

}

