#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ToxicHorde

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_ToxicHorde.GA_Card_ToxicHorde_C.ExecuteUbergraph_GA_Card_ToxicHorde
// 0x0130 (0x0130 - 0x0000)
struct GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0008(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionCharAI_Minion*                    K2Node_DynamicCast_AsOrion_Char_AI_Minion;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0068(0x0020)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x00A0(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2; // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue3; // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde) == 0x000008, "Wrong alignment on GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde");
static_assert(sizeof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde) == 0x000130, "Wrong size on GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, EntryPoint) == 0x000000, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, Temp_struct_Variable) == 0x000008, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_StartTargeting_ReturnValue) == 0x000028, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000030, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, Temp_int_Array_Index_Variable) == 0x000048, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_Array_Get_Item) == 0x000050, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, K2Node_DynamicCast_AsOrion_Char_AI_Minion) == 0x000058, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::K2Node_DynamicCast_AsOrion_Char_AI_Minion' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, K2Node_CustomEvent_Targets) == 0x000068, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_K2_CommitAbility_ReturnValue) == 0x000088, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000090, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_OnSameTeam_ReturnValue) == 0x000098, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, K2Node_CustomEvent_Targets2) == 0x0000A0, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0000D0, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_GetAbilityLevel_ReturnValue) == 0x0000D8, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_GetActorTeam_ReturnValue) == 0x0000DC, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000E0, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2) == 0x0000F0, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue3) == 0x000100, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, Temp_int_Loop_Counter_Variable) == 0x000110, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, K2Node_CreateDelegate_OutputDelegate2) == 0x000118, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'GA_Card_ToxicHorde_C_ExecuteUbergraph_GA_Card_ToxicHorde::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Card_ToxicHorde.GA_Card_ToxicHorde_C.Cancelled_8DA46C7247BB2064C7CC06AB4074FD36
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ToxicHorde_C_Cancelled_8DA46C7247BB2064C7CC06AB4074FD36 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ToxicHorde_C_Cancelled_8DA46C7247BB2064C7CC06AB4074FD36) == 0x000008, "Wrong alignment on GA_Card_ToxicHorde_C_Cancelled_8DA46C7247BB2064C7CC06AB4074FD36");
static_assert(sizeof(GA_Card_ToxicHorde_C_Cancelled_8DA46C7247BB2064C7CC06AB4074FD36) == 0x000020, "Wrong size on GA_Card_ToxicHorde_C_Cancelled_8DA46C7247BB2064C7CC06AB4074FD36");
static_assert(offsetof(GA_Card_ToxicHorde_C_Cancelled_8DA46C7247BB2064C7CC06AB4074FD36, Targets) == 0x000000, "Member 'GA_Card_ToxicHorde_C_Cancelled_8DA46C7247BB2064C7CC06AB4074FD36::Targets' has a wrong offset!");

// Function GA_Card_ToxicHorde.GA_Card_ToxicHorde_C.Confirmed_8DA46C7247BB2064C7CC06AB4074FD36
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ToxicHorde_C_Confirmed_8DA46C7247BB2064C7CC06AB4074FD36 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ToxicHorde_C_Confirmed_8DA46C7247BB2064C7CC06AB4074FD36) == 0x000008, "Wrong alignment on GA_Card_ToxicHorde_C_Confirmed_8DA46C7247BB2064C7CC06AB4074FD36");
static_assert(sizeof(GA_Card_ToxicHorde_C_Confirmed_8DA46C7247BB2064C7CC06AB4074FD36) == 0x000020, "Wrong size on GA_Card_ToxicHorde_C_Confirmed_8DA46C7247BB2064C7CC06AB4074FD36");
static_assert(offsetof(GA_Card_ToxicHorde_C_Confirmed_8DA46C7247BB2064C7CC06AB4074FD36, Targets) == 0x000000, "Member 'GA_Card_ToxicHorde_C_Confirmed_8DA46C7247BB2064C7CC06AB4074FD36::Targets' has a wrong offset!");

}

