#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Test_VFX

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Test_VFX.GA_Card_Test_VFX_C.ExecuteUbergraph_GA_Card_Test_VFX
// 0x0060 (0x0060 - 0x0000)
struct GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionAbilityTask_WaitAnyAbilityInput*  CallFunc_WaitAnyAbilityInput_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_WaitAnyAbilityInput*  CallFunc_WaitAnyAbilityInput_ReturnValue2;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX) == 0x000008, "Wrong alignment on GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX");
static_assert(sizeof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX) == 0x000060, "Wrong size on GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, EntryPoint) == 0x000000, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_WaitAnyAbilityInput_ReturnValue) == 0x000028, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_WaitAnyAbilityInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_WaitAnyAbilityInput_ReturnValue2) == 0x000038, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_WaitAnyAbilityInput_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_IsValid_ReturnValue2) == 0x000048, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_Array_Get_Item) == 0x000050, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'GA_Card_Test_VFX_C_ExecuteUbergraph_GA_Card_Test_VFX::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

