#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_RedirectDmgToAllies_Ally

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_RedirectDmgToAllies_Ally.GA_Card_RedirectDmgToAllies_Ally_C
// 0x0100 (0x0C70 - 0x0B70)
class UGA_Card_RedirectDmgToAllies_Ally_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FDamageQualifierKeywordsWithContext    AbilityDamageQualifiers;                           // 0x0B78(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDamageQualifierKeywordsWithContext    BasicDamageQualifiers;                             // 0x0BF0(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DamageReduction;                                   // 0x0C68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_RedirectDmgToAllies_Ally(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnDamage_51B5CB5944EC30701EC112A359C82022(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle);
	void OnDamage_D247022442BD1BCB44627191EEDEA3BF(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle);
	void OnSync_0F8F8D5945368895FD52A08C229A58AC();
	void Removed_8295AB4E4172627B8B6A0CAC0B135F6D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_RedirectDmgToAllies_Ally_C">();
	}
	static class UGA_Card_RedirectDmgToAllies_Ally_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_RedirectDmgToAllies_Ally_C>();
	}
};
static_assert(alignof(UGA_Card_RedirectDmgToAllies_Ally_C) == 0x000010, "Wrong alignment on UGA_Card_RedirectDmgToAllies_Ally_C");
static_assert(sizeof(UGA_Card_RedirectDmgToAllies_Ally_C) == 0x000C70, "Wrong size on UGA_Card_RedirectDmgToAllies_Ally_C");
static_assert(offsetof(UGA_Card_RedirectDmgToAllies_Ally_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_RedirectDmgToAllies_Ally_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_RedirectDmgToAllies_Ally_C, AbilityDamageQualifiers) == 0x000B78, "Member 'UGA_Card_RedirectDmgToAllies_Ally_C::AbilityDamageQualifiers' has a wrong offset!");
static_assert(offsetof(UGA_Card_RedirectDmgToAllies_Ally_C, BasicDamageQualifiers) == 0x000BF0, "Member 'UGA_Card_RedirectDmgToAllies_Ally_C::BasicDamageQualifiers' has a wrong offset!");
static_assert(offsetof(UGA_Card_RedirectDmgToAllies_Ally_C, DamageReduction) == 0x000C68, "Member 'UGA_Card_RedirectDmgToAllies_Ally_C::DamageReduction' has a wrong offset!");

}

