#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Enemy_Death_Ward

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Enemy_Death_Ward.GA_Card_Enemy_Death_Ward_C.ExecuteUbergraph_GA_Card_Enemy_Death_Ward
// 0x0330 (0x0330 - 0x0000)
struct GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         K2Node_CustomEvent_NewValue4;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor4;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext4;          // 0x0078(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewValue3;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor3;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext3;          // 0x00B0(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewValue2;                      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor2;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext2;          // 0x00E8(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_KilledActor;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_CustomEvent_KillingEffectContext;           // 0x0120(0x0018)()
	TDelegate<void(int32 NewValue, class AActor* KilledActor, const struct FGameplayEffectContextHandle& KillingEffectContext)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectContextHandle           Temp_struct_Variable;                              // 0x0148(0x0018)()
	class AActor*                                 Temp_object_Variable3;                             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0168(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_AddPlayerScoreListener* CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionPlayerState_Game*                 K2Node_DynamicCast_AsOrion_Player_State_Game;      // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x1];                                      // 0x022B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0234(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0240(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x024C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0258(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0290(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x029C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetActorTeam_ReturnValue;                 // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02D0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward) == 0x000010, "Wrong alignment on GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward");
static_assert(sizeof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward) == 0x000330, "Wrong size on GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, EntryPoint) == 0x000000, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_SpawnedActor3) == 0x000008, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_SpawnedActor2) == 0x000020, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_SpawnedActor) == 0x000038, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, Temp_object_Variable) == 0x000050, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, Temp_object_Variable2) == 0x000058, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_NewValue4) == 0x000068, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_NewValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_KilledActor4) == 0x000070, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_KilledActor4' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_KillingEffectContext4) == 0x000078, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_KillingEffectContext4' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CreateDelegate_OutputDelegate4) == 0x000090, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_NewValue3) == 0x0000A0, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_NewValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_KilledActor3) == 0x0000A8, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_KilledActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_KillingEffectContext3) == 0x0000B0, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_KillingEffectContext3' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CreateDelegate_OutputDelegate5) == 0x0000C8, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_NewValue2) == 0x0000D8, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_NewValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_KilledActor2) == 0x0000E0, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_KilledActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_KillingEffectContext2) == 0x0000E8, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_KillingEffectContext2' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CreateDelegate_OutputDelegate6) == 0x000100, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_NewValue) == 0x000110, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_KilledActor) == 0x000118, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CustomEvent_KillingEffectContext) == 0x000120, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CustomEvent_KillingEffectContext' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_CreateDelegate_OutputDelegate7) == 0x000138, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, Temp_struct_Variable) == 0x000148, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, Temp_object_Variable3) == 0x000160, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000168, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, Temp_int_Variable) == 0x000174, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue) == 0x000178, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_CreateAddPlayerScoreListenerTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000188, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000190, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000218, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_DynamicCast_AsOrion_Player_State_Game) == 0x000220, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_DynamicCast_AsOrion_Player_State_Game' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_bBlockingHit) == 0x000229, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_bInitialOverlap) == 0x00022A, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_Time) == 0x00022C, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_Distance) == 0x000230, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_Location) == 0x000234, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_ImpactPoint) == 0x000240, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_Normal) == 0x00024C, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_ImpactNormal) == 0x000258, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_PhysMat) == 0x000268, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_HitActor) == 0x000270, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_HitComponent) == 0x000278, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_HitBoneName) == 0x000280, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_HitItem) == 0x000288, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_FaceIndex) == 0x00028C, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_TraceStart) == 0x000290, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakHitResult_TraceEnd) == 0x00029C, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_GetActorTeam_ReturnValue) == 0x0002A8, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakVector_X) == 0x0002AC, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakVector_Y) == 0x0002B0, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BreakVector_Z) == 0x0002B4, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002B8, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_MakeVector_ReturnValue) == 0x0002BC, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_MakeTransform_ReturnValue) == 0x0002D0, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_GetAbilityLevel_ReturnValue) == 0x000300, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x000308, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000310, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000318, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_BeginSpawningActor_ReturnValue) == 0x000320, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_GetValueAtLevel_ReturnValue) == 0x000324, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward, CallFunc_IsValid_ReturnValue2) == 0x000328, "Member 'GA_Card_Enemy_Death_Ward_C_ExecuteUbergraph_GA_Card_Enemy_Death_Ward::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function GA_Card_Enemy_Death_Ward.GA_Card_Enemy_Death_Ward_C.FailedToSpawn_2903EC8546D2D550F11F1D850C10B09E
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Enemy_Death_Ward_C_FailedToSpawn_2903EC8546D2D550F11F1D850C10B09E final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Enemy_Death_Ward_C_FailedToSpawn_2903EC8546D2D550F11F1D850C10B09E) == 0x000008, "Wrong alignment on GA_Card_Enemy_Death_Ward_C_FailedToSpawn_2903EC8546D2D550F11F1D850C10B09E");
static_assert(sizeof(GA_Card_Enemy_Death_Ward_C_FailedToSpawn_2903EC8546D2D550F11F1D850C10B09E) == 0x000008, "Wrong size on GA_Card_Enemy_Death_Ward_C_FailedToSpawn_2903EC8546D2D550F11F1D850C10B09E");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_FailedToSpawn_2903EC8546D2D550F11F1D850C10B09E, SpawnedActor) == 0x000000, "Member 'GA_Card_Enemy_Death_Ward_C_FailedToSpawn_2903EC8546D2D550F11F1D850C10B09E::SpawnedActor' has a wrong offset!");

// Function GA_Card_Enemy_Death_Ward.GA_Card_Enemy_Death_Ward_C.NotAuthority_2903EC8546D2D550F11F1D850C10B09E
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Enemy_Death_Ward_C_NotAuthority_2903EC8546D2D550F11F1D850C10B09E final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Enemy_Death_Ward_C_NotAuthority_2903EC8546D2D550F11F1D850C10B09E) == 0x000008, "Wrong alignment on GA_Card_Enemy_Death_Ward_C_NotAuthority_2903EC8546D2D550F11F1D850C10B09E");
static_assert(sizeof(GA_Card_Enemy_Death_Ward_C_NotAuthority_2903EC8546D2D550F11F1D850C10B09E) == 0x000008, "Wrong size on GA_Card_Enemy_Death_Ward_C_NotAuthority_2903EC8546D2D550F11F1D850C10B09E");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_NotAuthority_2903EC8546D2D550F11F1D850C10B09E, SpawnedActor) == 0x000000, "Member 'GA_Card_Enemy_Death_Ward_C_NotAuthority_2903EC8546D2D550F11F1D850C10B09E::SpawnedActor' has a wrong offset!");

// Function GA_Card_Enemy_Death_Ward.GA_Card_Enemy_Death_Ward_C.OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE) == 0x000008, "Wrong alignment on GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE");
static_assert(sizeof(GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE) == 0x000028, "Wrong size on GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE, NewValue) == 0x000000, "Member 'GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE, KilledActor) == 0x000008, "Member 'GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE, KillingEffectContext) == 0x000010, "Member 'GA_Card_Enemy_Death_Ward_C_OnMinionAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE::KillingEffectContext' has a wrong offset!");

// Function GA_Card_Enemy_Death_Ward.GA_Card_Enemy_Death_Ward_C.OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE) == 0x000008, "Wrong alignment on GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE");
static_assert(sizeof(GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE) == 0x000028, "Wrong size on GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE, NewValue) == 0x000000, "Member 'GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE, KilledActor) == 0x000008, "Member 'GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE, KillingEffectContext) == 0x000010, "Member 'GA_Card_Enemy_Death_Ward_C_OnMinionKill_5B6A02074C1ADFCF0B64F2B79AA22BAE::KillingEffectContext' has a wrong offset!");

// Function GA_Card_Enemy_Death_Ward.GA_Card_Enemy_Death_Ward_C.OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE) == 0x000008, "Wrong alignment on GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE");
static_assert(sizeof(GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE) == 0x000028, "Wrong size on GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE, NewValue) == 0x000000, "Member 'GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE, KilledActor) == 0x000008, "Member 'GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE, KillingEffectContext) == 0x000010, "Member 'GA_Card_Enemy_Death_Ward_C_OnPlayerAssist_5B6A02074C1ADFCF0B64F2B79AA22BAE::KillingEffectContext' has a wrong offset!");

// Function GA_Card_Enemy_Death_Ward.GA_Card_Enemy_Death_Ward_C.OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 KilledActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           KillingEffectContext;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE) == 0x000008, "Wrong alignment on GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE");
static_assert(sizeof(GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE) == 0x000028, "Wrong size on GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE, NewValue) == 0x000000, "Member 'GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE, KilledActor) == 0x000008, "Member 'GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE::KilledActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE, KillingEffectContext) == 0x000010, "Member 'GA_Card_Enemy_Death_Ward_C_OnPlayerKill_5B6A02074C1ADFCF0B64F2B79AA22BAE::KillingEffectContext' has a wrong offset!");

// Function GA_Card_Enemy_Death_Ward.GA_Card_Enemy_Death_Ward_C.Success_2903EC8546D2D550F11F1D850C10B09E
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Enemy_Death_Ward_C_Success_2903EC8546D2D550F11F1D850C10B09E final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Enemy_Death_Ward_C_Success_2903EC8546D2D550F11F1D850C10B09E) == 0x000008, "Wrong alignment on GA_Card_Enemy_Death_Ward_C_Success_2903EC8546D2D550F11F1D850C10B09E");
static_assert(sizeof(GA_Card_Enemy_Death_Ward_C_Success_2903EC8546D2D550F11F1D850C10B09E) == 0x000008, "Wrong size on GA_Card_Enemy_Death_Ward_C_Success_2903EC8546D2D550F11F1D850C10B09E");
static_assert(offsetof(GA_Card_Enemy_Death_Ward_C_Success_2903EC8546D2D550F11F1D850C10B09E, SpawnedActor) == 0x000000, "Member 'GA_Card_Enemy_Death_Ward_C_Success_2903EC8546D2D550F11F1D850C10B09E::SpawnedActor' has a wrong offset!");

}

