#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_OneShotBuff_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_OneShotBuff_Parent.GA_Card_OneShotBuff_Parent_C.ExecuteUbergraph_GA_Card_OneShotBuff_Parent
// 0x0010 (0x0010 - 0x0000)
struct GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent) == 0x000004, "Wrong alignment on GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent");
static_assert(sizeof(GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent) == 0x000010, "Wrong size on GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent");
static_assert(offsetof(GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent, EntryPoint) == 0x000000, "Member 'GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000008, "Member 'GA_Card_OneShotBuff_Parent_C_ExecuteUbergraph_GA_Card_OneShotBuff_Parent::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Card_OneShotBuff_Parent.GA_Card_OneShotBuff_Parent_C.GetPlayerLevel
// 0x0018 (0x0018 - 0x0000)
struct GA_Card_OneShotBuff_Parent_C_GetPlayerLevel final
{
public:
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_OneShotBuff_Parent_C_GetPlayerLevel) == 0x000008, "Wrong alignment on GA_Card_OneShotBuff_Parent_C_GetPlayerLevel");
static_assert(sizeof(GA_Card_OneShotBuff_Parent_C_GetPlayerLevel) == 0x000018, "Wrong size on GA_Card_OneShotBuff_Parent_C_GetPlayerLevel");
static_assert(offsetof(GA_Card_OneShotBuff_Parent_C_GetPlayerLevel, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Card_OneShotBuff_Parent_C_GetPlayerLevel::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OneShotBuff_Parent_C_GetPlayerLevel, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000008, "Member 'GA_Card_OneShotBuff_Parent_C_GetPlayerLevel::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Card_OneShotBuff_Parent_C_GetPlayerLevel, CallFunc_GetFloatAttribute_ReturnValue) == 0x00000C, "Member 'GA_Card_OneShotBuff_Parent_C_GetPlayerLevel::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_OneShotBuff_Parent_C_GetPlayerLevel, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'GA_Card_OneShotBuff_Parent_C_GetPlayerLevel::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

}

