#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_LinkAllyToRedirectDmg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_LinkAllyToRedirectDmg.GA_Card_LinkAllyToRedirectDmg_C
// 0x0030 (0x0BA0 - 0x0B70)
class UGA_Card_LinkAllyToRedirectDmg_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 TargetingCamera;                                   // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LinkRange;                                         // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnedLink;                                       // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LinkToAlly;                                        // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LinkTag;                                           // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_LinkAllyToRedirectDmg(int32 EntryPoint);
	void TetherBroken(class AActor* Actor, EEndPlayReason EndPlayReason);
	void Cancelled_AF58027E464E216E8E3457BE420E256A(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_AF58027E464E216E8E3457BE420E256A(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Event_9B61E1174EF786F1755A13B7AB7E19CA(class AOrionCharHero* Hero, const struct FGameplayTag& HeroTag);
	void FailedToSpawn_C9194E774E01AED9F2380AB772B92E74(class AActor* SpawnedActor);
	void K2_ActivateAbility();
	void NotAuthority_C9194E774E01AED9F2380AB772B92E74(class AActor* SpawnedActor);
	void OnStateEnded_0F6C2D3041943B0D666D8484ED210CB8();
	void OnStateInterrupted_0F6C2D3041943B0D666D8484ED210CB8();
	void Success_C9194E774E01AED9F2380AB772B92E74(class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_LinkAllyToRedirectDmg_C">();
	}
	static class UGA_Card_LinkAllyToRedirectDmg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_LinkAllyToRedirectDmg_C>();
	}
};
static_assert(alignof(UGA_Card_LinkAllyToRedirectDmg_C) == 0x000010, "Wrong alignment on UGA_Card_LinkAllyToRedirectDmg_C");
static_assert(sizeof(UGA_Card_LinkAllyToRedirectDmg_C) == 0x000BA0, "Wrong size on UGA_Card_LinkAllyToRedirectDmg_C");
static_assert(offsetof(UGA_Card_LinkAllyToRedirectDmg_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_LinkAllyToRedirectDmg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_LinkAllyToRedirectDmg_C, TargetingCamera) == 0x000B78, "Member 'UGA_Card_LinkAllyToRedirectDmg_C::TargetingCamera' has a wrong offset!");
static_assert(offsetof(UGA_Card_LinkAllyToRedirectDmg_C, LinkRange) == 0x000B80, "Member 'UGA_Card_LinkAllyToRedirectDmg_C::LinkRange' has a wrong offset!");
static_assert(offsetof(UGA_Card_LinkAllyToRedirectDmg_C, SpawnedLink) == 0x000B88, "Member 'UGA_Card_LinkAllyToRedirectDmg_C::SpawnedLink' has a wrong offset!");
static_assert(offsetof(UGA_Card_LinkAllyToRedirectDmg_C, LinkToAlly) == 0x000B90, "Member 'UGA_Card_LinkAllyToRedirectDmg_C::LinkToAlly' has a wrong offset!");
static_assert(offsetof(UGA_Card_LinkAllyToRedirectDmg_C, LinkTag) == 0x000B98, "Member 'UGA_Card_LinkAllyToRedirectDmg_C::LinkTag' has a wrong offset!");

}

