#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_HealAura

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_HealAura.GA_Card_HealAura_C
// 0x00D0 (0x0C40 - 0x0B70)
class UGA_Card_HealAura_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	float                                         PercentPerPipToReducePeriod;                       // 0x0B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultPeriod;                                     // 0x0B7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentPeriod;                                     // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PeriodValue;                                       // 0x0B88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Radius;                                            // 0x0BB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB4[0x4];                                      // 0x0BB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PeriodPercentValue;                                // 0x0BB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOrionActorFilter                      AlliedUnits;                                       // 0x0BE0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_HealAura(int32 EntryPoint);
	void HealInAOE();
	void K2_ActivateAbility();
	void OnStateEnded_761ADA134F79EAAB1C525CB2F789120B();
	void OnStateInterrupted_761ADA134F79EAAB1C525CB2F789120B();
	void OnSync_278043F1471C6437F36F40B3C706D8A6();
	void OnSync_A67F99AF4352E0A6AD18899D93078BC9();
	void Removed_DE19D37148080EEDC66B3792E92E0ECE();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_HealAura_C">();
	}
	static class UGA_Card_HealAura_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_HealAura_C>();
	}
};
static_assert(alignof(UGA_Card_HealAura_C) == 0x000010, "Wrong alignment on UGA_Card_HealAura_C");
static_assert(sizeof(UGA_Card_HealAura_C) == 0x000C40, "Wrong size on UGA_Card_HealAura_C");
static_assert(offsetof(UGA_Card_HealAura_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_HealAura_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_HealAura_C, PercentPerPipToReducePeriod) == 0x000B78, "Member 'UGA_Card_HealAura_C::PercentPerPipToReducePeriod' has a wrong offset!");
static_assert(offsetof(UGA_Card_HealAura_C, DefaultPeriod) == 0x000B7C, "Member 'UGA_Card_HealAura_C::DefaultPeriod' has a wrong offset!");
static_assert(offsetof(UGA_Card_HealAura_C, CurrentPeriod) == 0x000B80, "Member 'UGA_Card_HealAura_C::CurrentPeriod' has a wrong offset!");
static_assert(offsetof(UGA_Card_HealAura_C, PeriodValue) == 0x000B88, "Member 'UGA_Card_HealAura_C::PeriodValue' has a wrong offset!");
static_assert(offsetof(UGA_Card_HealAura_C, Radius) == 0x000BB0, "Member 'UGA_Card_HealAura_C::Radius' has a wrong offset!");
static_assert(offsetof(UGA_Card_HealAura_C, PeriodPercentValue) == 0x000BB8, "Member 'UGA_Card_HealAura_C::PeriodPercentValue' has a wrong offset!");
static_assert(offsetof(UGA_Card_HealAura_C, AlliedUnits) == 0x000BE0, "Member 'UGA_Card_HealAura_C::AlliedUnits' has a wrong offset!");

}

