#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Fireball

#include "Basic.hpp"

#include "GA_ItemTemplate_FireProjectile_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Fireball.GA_Card_Fireball_C
// 0x0020 (0x0C20 - 0x0C00)
class UGA_Card_Fireball_C final : public UGA_ItemTemplate_FireProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Card_Fireball_C;                 // 0x0C00(0x0008)(Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Hero;                                              // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Cached_Item_Slot;                                  // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Fireball(int32 EntryPoint);
	void OnBlendOut_E33D529644AA44AC9F19F5894EE80969(class FName NotifyName);
	void OnCompleted_E33D529644AA44AC9F19F5894EE80969(class FName NotifyName);
	void OnInterrupted_E33D529644AA44AC9F19F5894EE80969(class FName NotifyName);
	void OnNotifyBegin_E33D529644AA44AC9F19F5894EE80969(class FName NotifyName);
	void OnNotifyEnd_E33D529644AA44AC9F19F5894EE80969(class FName NotifyName);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Fireball_C">();
	}
	static class UGA_Card_Fireball_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Fireball_C>();
	}
};
static_assert(alignof(UGA_Card_Fireball_C) == 0x000010, "Wrong alignment on UGA_Card_Fireball_C");
static_assert(sizeof(UGA_Card_Fireball_C) == 0x000C20, "Wrong size on UGA_Card_Fireball_C");
static_assert(offsetof(UGA_Card_Fireball_C, UberGraphFrame_GA_Card_Fireball_C) == 0x000C00, "Member 'UGA_Card_Fireball_C::UberGraphFrame_GA_Card_Fireball_C' has a wrong offset!");
static_assert(offsetof(UGA_Card_Fireball_C, Hero) == 0x000C08, "Member 'UGA_Card_Fireball_C::Hero' has a wrong offset!");
static_assert(offsetof(UGA_Card_Fireball_C, Cached_Item_Slot) == 0x000C10, "Member 'UGA_Card_Fireball_C::Cached_Item_Slot' has a wrong offset!");

}

