#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_WhenFullHPSpellVampMana

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_WhenFullHPSpellVampMana.GA_Card_WhenFullHPSpellVampMana_C.ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana
// 0x0168 (0x0168 - 0x0000)
struct GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bMatchesComparison, float CurrentRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bMatchesComparison;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_CurrentRatio;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAttributeChangeRatioThreshold* CallFunc_WaitForAttributeChangeRatioThreshold_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0058(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0080(0x0018)()
	float                                         CallFunc_GetModifiedAttributeMagnitude_ReturnValue; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionAbilityTargetDataFilter          K2Node_MakeStruct_OrionAbilityTargetDataFilter;    // 0x00B0(0x0030)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IOrionTeamActorInterface> K2Node_DynamicCast_AsOrion_Team_Actor_Interface;   // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    Temp_byte_Variable;                                // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeOrionFilterHandle_ReturnValue;        // 0x0100(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0110(0x0018)()
	class UAbilityTask_WaitGameplayEffectApplied_Target* CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x013C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0148(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana) == 0x000008, "Wrong alignment on GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana");
static_assert(sizeof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana) == 0x000168, "Wrong size on GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, EntryPoint) == 0x000000, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_GetAbilityLevel_ReturnValue) == 0x000004, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000008, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_CustomEvent_bMatchesComparison) == 0x000020, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_CustomEvent_bMatchesComparison' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_CustomEvent_CurrentRatio) == 0x000024, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_CustomEvent_CurrentRatio' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, Temp_float_Variable) == 0x000028, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, Temp_bool_Variable) == 0x00002C, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_WaitForAttributeChangeRatioThreshold_ReturnValue) == 0x000030, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_WaitForAttributeChangeRatioThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_CustomEvent_Target) == 0x000050, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_CustomEvent_SpecHandle) == 0x000058, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_CustomEvent_ActiveHandle) == 0x000070, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, Temp_struct_Variable) == 0x000078, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, Temp_struct_Variable2) == 0x000080, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_GetModifiedAttributeMagnitude_ReturnValue) == 0x000098, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_GetModifiedAttributeMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, Temp_object_Variable) == 0x0000A0, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_Abs_ReturnValue) == 0x0000A8, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_MakeStruct_OrionAbilityTargetDataFilter) == 0x0000B0, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_MakeStruct_OrionAbilityTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000E0, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_DynamicCast_AsOrion_Team_Actor_Interface) == 0x0000E8, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_DynamicCast_AsOrion_Team_Actor_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_GetTeamNum_ReturnValue) == 0x0000F9, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, Temp_byte_Variable) == 0x0000FA, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_MakeOrionFilterHandle_ReturnValue) == 0x000100, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_MakeOrionFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000110, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue) == 0x000128, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_IsValid_ReturnValue2) == 0x000130, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_GetAbilityLevel_ReturnValue2) == 0x000134, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000138, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x00013C, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000148, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000160, "Member 'GA_Card_WhenFullHPSpellVampMana_C_ExecuteUbergraph_GA_Card_WhenFullHPSpellVampMana::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function GA_Card_WhenFullHPSpellVampMana.GA_Card_WhenFullHPSpellVampMana_C.OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08 final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08) == 0x000008, "Wrong alignment on GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08");
static_assert(sizeof(GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08) == 0x000028, "Wrong size on GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08, Target) == 0x000000, "Member 'GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08::Target' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08, SpecHandle) == 0x000008, "Member 'GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08, ActiveHandle) == 0x000020, "Member 'GA_Card_WhenFullHPSpellVampMana_C_OnApplied_5F201BB444A9EF5EBB8B4D8D05AFAF08::ActiveHandle' has a wrong offset!");

// Function GA_Card_WhenFullHPSpellVampMana.GA_Card_WhenFullHPSpellVampMana_C.OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_WhenFullHPSpellVampMana_C_OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B final
{
public:
	bool                                          bMatchesComparison;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentRatio;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_WhenFullHPSpellVampMana_C_OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B) == 0x000004, "Wrong alignment on GA_Card_WhenFullHPSpellVampMana_C_OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B");
static_assert(sizeof(GA_Card_WhenFullHPSpellVampMana_C_OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B) == 0x000008, "Wrong size on GA_Card_WhenFullHPSpellVampMana_C_OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B, bMatchesComparison) == 0x000000, "Member 'GA_Card_WhenFullHPSpellVampMana_C_OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B::bMatchesComparison' has a wrong offset!");
static_assert(offsetof(GA_Card_WhenFullHPSpellVampMana_C_OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B, CurrentRatio) == 0x000004, "Member 'GA_Card_WhenFullHPSpellVampMana_C_OnChange_727EC9AC48835C8C0CE4C8A60E9B6D3B::CurrentRatio' has a wrong offset!");

}

