#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Fireball

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Card_Fireball.GA_Card_Fireball_C.ExecuteUbergraph_GA_Card_Fireball
// 0x00C8 (0x00C8 - 0x0000)
struct GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_Hero_C*                             K2Node_DynamicCast_AsBP_Hero;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             CallFunc_GetOrionCharFromActorInfo_ReturnValue;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball) == 0x000008, "Wrong alignment on GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball");
static_assert(sizeof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball) == 0x0000C8, "Wrong size on GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, EntryPoint) == 0x000000, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CustomEvent_NotifyName4) == 0x000008, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CustomEvent_NotifyName3) == 0x000020, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CustomEvent_NotifyName2) == 0x000038, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CustomEvent_NotifyName) == 0x000050, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, Temp_name_Variable) == 0x000068, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CustomEvent_NotifyName5) == 0x000070, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_CreateDelegate_OutputDelegate5) == 0x000088, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_DynamicCast_AsBP_Hero) == 0x000098, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_DynamicCast_AsBP_Hero' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, CallFunc_GetOrionCharFromActorInfo_ReturnValue) == 0x0000A8, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::CallFunc_GetOrionCharFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, CallFunc_IsValid_ReturnValue2) == 0x0000B0, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000B8, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball, CallFunc_IsValid_ReturnValue3) == 0x0000C0, "Member 'GA_Card_Fireball_C_ExecuteUbergraph_GA_Card_Fireball::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function GA_Card_Fireball.GA_Card_Fireball_C.OnBlendOut_E33D529644AA44AC9F19F5894EE80969
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Card_Fireball_C_OnBlendOut_E33D529644AA44AC9F19F5894EE80969 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Fireball_C_OnBlendOut_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong alignment on GA_Card_Fireball_C_OnBlendOut_E33D529644AA44AC9F19F5894EE80969");
static_assert(sizeof(GA_Card_Fireball_C_OnBlendOut_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong size on GA_Card_Fireball_C_OnBlendOut_E33D529644AA44AC9F19F5894EE80969");
static_assert(offsetof(GA_Card_Fireball_C_OnBlendOut_E33D529644AA44AC9F19F5894EE80969, NotifyName) == 0x000000, "Member 'GA_Card_Fireball_C_OnBlendOut_E33D529644AA44AC9F19F5894EE80969::NotifyName' has a wrong offset!");

// Function GA_Card_Fireball.GA_Card_Fireball_C.OnCompleted_E33D529644AA44AC9F19F5894EE80969
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Card_Fireball_C_OnCompleted_E33D529644AA44AC9F19F5894EE80969 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Fireball_C_OnCompleted_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong alignment on GA_Card_Fireball_C_OnCompleted_E33D529644AA44AC9F19F5894EE80969");
static_assert(sizeof(GA_Card_Fireball_C_OnCompleted_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong size on GA_Card_Fireball_C_OnCompleted_E33D529644AA44AC9F19F5894EE80969");
static_assert(offsetof(GA_Card_Fireball_C_OnCompleted_E33D529644AA44AC9F19F5894EE80969, NotifyName) == 0x000000, "Member 'GA_Card_Fireball_C_OnCompleted_E33D529644AA44AC9F19F5894EE80969::NotifyName' has a wrong offset!");

// Function GA_Card_Fireball.GA_Card_Fireball_C.OnInterrupted_E33D529644AA44AC9F19F5894EE80969
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Card_Fireball_C_OnInterrupted_E33D529644AA44AC9F19F5894EE80969 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Fireball_C_OnInterrupted_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong alignment on GA_Card_Fireball_C_OnInterrupted_E33D529644AA44AC9F19F5894EE80969");
static_assert(sizeof(GA_Card_Fireball_C_OnInterrupted_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong size on GA_Card_Fireball_C_OnInterrupted_E33D529644AA44AC9F19F5894EE80969");
static_assert(offsetof(GA_Card_Fireball_C_OnInterrupted_E33D529644AA44AC9F19F5894EE80969, NotifyName) == 0x000000, "Member 'GA_Card_Fireball_C_OnInterrupted_E33D529644AA44AC9F19F5894EE80969::NotifyName' has a wrong offset!");

// Function GA_Card_Fireball.GA_Card_Fireball_C.OnNotifyBegin_E33D529644AA44AC9F19F5894EE80969
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Card_Fireball_C_OnNotifyBegin_E33D529644AA44AC9F19F5894EE80969 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Fireball_C_OnNotifyBegin_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong alignment on GA_Card_Fireball_C_OnNotifyBegin_E33D529644AA44AC9F19F5894EE80969");
static_assert(sizeof(GA_Card_Fireball_C_OnNotifyBegin_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong size on GA_Card_Fireball_C_OnNotifyBegin_E33D529644AA44AC9F19F5894EE80969");
static_assert(offsetof(GA_Card_Fireball_C_OnNotifyBegin_E33D529644AA44AC9F19F5894EE80969, NotifyName) == 0x000000, "Member 'GA_Card_Fireball_C_OnNotifyBegin_E33D529644AA44AC9F19F5894EE80969::NotifyName' has a wrong offset!");

// Function GA_Card_Fireball.GA_Card_Fireball_C.OnNotifyEnd_E33D529644AA44AC9F19F5894EE80969
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Card_Fireball_C_OnNotifyEnd_E33D529644AA44AC9F19F5894EE80969 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Fireball_C_OnNotifyEnd_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong alignment on GA_Card_Fireball_C_OnNotifyEnd_E33D529644AA44AC9F19F5894EE80969");
static_assert(sizeof(GA_Card_Fireball_C_OnNotifyEnd_E33D529644AA44AC9F19F5894EE80969) == 0x000008, "Wrong size on GA_Card_Fireball_C_OnNotifyEnd_E33D529644AA44AC9F19F5894EE80969");
static_assert(offsetof(GA_Card_Fireball_C_OnNotifyEnd_E33D529644AA44AC9F19F5894EE80969, NotifyName) == 0x000000, "Member 'GA_Card_Fireball_C_OnNotifyEnd_E33D529644AA44AC9F19F5894EE80969::NotifyName' has a wrong offset!");

}

