#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ManaRegFromEnemyMana_Enemy

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_ManaRegFromEnemyMana_Enemy.GA_Card_ManaRegFromEnemyMana_Enemy_C.ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy
// 0x00D8 (0x00D8 - 0x0000)
struct GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAttributeChange*       CallFunc_WaitForAttributeChange_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0028(0x0018)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue2;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0068(0x0018)()
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0088(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00A8(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy) == 0x000008, "Wrong alignment on GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy");
static_assert(sizeof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy) == 0x0000D8, "Wrong size on GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, EntryPoint) == 0x000000, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_WaitForAttributeChange_ReturnValue) == 0x000008, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_WaitForAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000028, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000040, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000048, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000050, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_GetFloatAttribute_ReturnValue) == 0x000054, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2) == 0x000058, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute2' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_GetFloatAttribute_ReturnValue2) == 0x00005C, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_GetFloatAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000060, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_Abs_ReturnValue) == 0x000064, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000068, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000080, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000088, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_EffectContextGetEffectCauser_ReturnValue) == 0x0000A0, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_EffectContextGetEffectCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000A8, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x0000C8, "Member 'GA_Card_ManaRegFromEnemyMana_Enemy_C_ExecuteUbergraph_GA_Card_ManaRegFromEnemyMana_Enemy::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

}

