#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_Damage_Energy

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Aura_Damage_Energy.GA_Card_Aura_Damage_Energy_C
// 0x0090 (0x0C00 - 0x0B70)
class UGA_Card_Aura_Damage_Energy_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FOrionFilterAndEffectsContainer        FilterAndEffects;                                  // 0x0B78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         AuraRadius;                                        // 0x0B98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Shadowplane;                                       // 0x0BC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DamageTickRate;                                    // 0x0BC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOrionAuraHandle                       Aura;                                              // 0x0BF0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Aura_Damage_Energy(int32 EntryPoint);
	void Added_D4B95CBB4DB6B7B786BF05840FCCB58D();
	void K2_ActivateAbility();
	void OnStateEnded_9BE6473A407D15B96DBD79837E345E2D();
	void OnStateInterrupted_9BE6473A407D15B96DBD79837E345E2D();
	void Removed_BC94577A4C7628D8FB38E48D0AA570D2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Aura_Damage_Energy_C">();
	}
	static class UGA_Card_Aura_Damage_Energy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Aura_Damage_Energy_C>();
	}
};
static_assert(alignof(UGA_Card_Aura_Damage_Energy_C) == 0x000010, "Wrong alignment on UGA_Card_Aura_Damage_Energy_C");
static_assert(sizeof(UGA_Card_Aura_Damage_Energy_C) == 0x000C00, "Wrong size on UGA_Card_Aura_Damage_Energy_C");
static_assert(offsetof(UGA_Card_Aura_Damage_Energy_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Aura_Damage_Energy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Damage_Energy_C, FilterAndEffects) == 0x000B78, "Member 'UGA_Card_Aura_Damage_Energy_C::FilterAndEffects' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Damage_Energy_C, AuraRadius) == 0x000B98, "Member 'UGA_Card_Aura_Damage_Energy_C::AuraRadius' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Damage_Energy_C, Shadowplane) == 0x000BC0, "Member 'UGA_Card_Aura_Damage_Energy_C::Shadowplane' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Damage_Energy_C, DamageTickRate) == 0x000BC8, "Member 'UGA_Card_Aura_Damage_Energy_C::DamageTickRate' has a wrong offset!");
static_assert(offsetof(UGA_Card_Aura_Damage_Energy_C, Aura) == 0x000BF0, "Member 'UGA_Card_Aura_Damage_Energy_C::Aura' has a wrong offset!");

}

