#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_AbilityMimic

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_AbilityMimic.GA_Card_AbilityMimic_C.ExecuteUbergraph_GA_Card_AbilityMimic
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActiveGameplayEffectTotalDuration_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0010(0x0018)()
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0030(0x0018)()
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffects_ReturnValue;             // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActiveGameplayEffectStartTime_ReturnValue; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic) == 0x000008, "Wrong alignment on GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic");
static_assert(sizeof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic) == 0x0000D0, "Wrong size on GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, EntryPoint) == 0x000000, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetActiveGameplayEffectTotalDuration_ReturnValue) == 0x000004, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetActiveGameplayEffectTotalDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue) == 0x00000C, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000010, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_K2_CommitAbility_ReturnValue) == 0x000028, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000030, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetAbilityLevel_ReturnValue) == 0x000048, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x00004C, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000054, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x00005C, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, Temp_int_Array_Index_Variable) == 0x000064, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetAbilityLevel_ReturnValue2) == 0x000068, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00006C, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetValueAtLevel_ReturnValue) == 0x000070, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000074, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000080, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000088, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x000090, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000098, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetActiveEffects_ReturnValue) == 0x0000A0, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetActiveEffects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_GetActiveGameplayEffectStartTime_ReturnValue) == 0x0000BC, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_GetActiveGameplayEffectStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x0000CC, "Member 'GA_Card_AbilityMimic_C_ExecuteUbergraph_GA_Card_AbilityMimic::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");

}

