#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Minions_Grant_Vision

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Minions_Grant_Vision.GA_Card_Minions_Grant_Vision_C
// 0x0050 (0x0BC0 - 0x0B70)
class UGA_Card_Minions_Grant_Vision_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FOrionFilterAndEffectsContainer        MinionFilter;                                      // 0x0B78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FOrionFilterAndEffectsContainer        TagFilter;                                         // 0x0B98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_Minions_Grant_Vision(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Minions_Grant_Vision_C">();
	}
	static class UGA_Card_Minions_Grant_Vision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Minions_Grant_Vision_C>();
	}
};
static_assert(alignof(UGA_Card_Minions_Grant_Vision_C) == 0x000010, "Wrong alignment on UGA_Card_Minions_Grant_Vision_C");
static_assert(sizeof(UGA_Card_Minions_Grant_Vision_C) == 0x000BC0, "Wrong size on UGA_Card_Minions_Grant_Vision_C");
static_assert(offsetof(UGA_Card_Minions_Grant_Vision_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Minions_Grant_Vision_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Minions_Grant_Vision_C, MinionFilter) == 0x000B78, "Member 'UGA_Card_Minions_Grant_Vision_C::MinionFilter' has a wrong offset!");
static_assert(offsetof(UGA_Card_Minions_Grant_Vision_C, TagFilter) == 0x000B98, "Member 'UGA_Card_Minions_Grant_Vision_C::TagFilter' has a wrong offset!");

}

