#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_HomingVisionProj

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_HomingVisionProj.GA_Card_HomingVisionProj_C
// 0x0070 (0x0BE0 - 0x0B70)
class UGA_Card_HomingVisionProj_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FOrionFilterAndEffectsContainer        HeroesOnly;                                        // 0x0B78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 VisionProj;                                        // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0BA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayAbilityTargetDataHandle       NewVar_0;                                          // 0x0BC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_HomingVisionProj(int32 EntryPoint);
	void Cancelled_3499AA5F495257B68143FDA0EF60157B(const struct FGameplayAbilityTargetDataHandle& Targets_0);
	void Confirmed_3499AA5F495257B68143FDA0EF60157B(const struct FGameplayAbilityTargetDataHandle& Targets_0);
	void FailedToSpawn_BA17DBC34386F8D7917894B5E668A18B(class AOrionProjectile* SpawnedProjectile);
	void K2_ActivateAbility();
	void NotAuthority_BA17DBC34386F8D7917894B5E668A18B(class AOrionProjectile* SpawnedProjectile);
	void PreSpawned_BA17DBC34386F8D7917894B5E668A18B(class AOrionProjectile* SpawnedProjectile);
	void Success_BA17DBC34386F8D7917894B5E668A18B(class AOrionProjectile* SpawnedProjectile);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_HomingVisionProj_C">();
	}
	static class UGA_Card_HomingVisionProj_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_HomingVisionProj_C>();
	}
};
static_assert(alignof(UGA_Card_HomingVisionProj_C) == 0x000010, "Wrong alignment on UGA_Card_HomingVisionProj_C");
static_assert(sizeof(UGA_Card_HomingVisionProj_C) == 0x000BE0, "Wrong size on UGA_Card_HomingVisionProj_C");
static_assert(offsetof(UGA_Card_HomingVisionProj_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_HomingVisionProj_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_HomingVisionProj_C, HeroesOnly) == 0x000B78, "Member 'UGA_Card_HomingVisionProj_C::HeroesOnly' has a wrong offset!");
static_assert(offsetof(UGA_Card_HomingVisionProj_C, VisionProj) == 0x000B98, "Member 'UGA_Card_HomingVisionProj_C::VisionProj' has a wrong offset!");
static_assert(offsetof(UGA_Card_HomingVisionProj_C, Targets) == 0x000BA0, "Member 'UGA_Card_HomingVisionProj_C::Targets' has a wrong offset!");
static_assert(offsetof(UGA_Card_HomingVisionProj_C, NewVar_0) == 0x000BC0, "Member 'UGA_Card_HomingVisionProj_C::NewVar_0' has a wrong offset!");

}

