#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ReactiveRegeneration

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_ReactiveRegeneration.GA_Card_ReactiveRegeneration_C
// 0x0170 (0x0CE0 - 0x0B70)
class UGA_Card_ReactiveRegeneration_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTagRequirements               Stun;                                              // 0x0B78(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagRequirements               Root;                                              // 0x0BB8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagRequirements               Silence;                                           // 0x0BF8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagRequirements               KnockUp;                                           // 0x0C38(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagRequirements               KnockBack;                                         // 0x0C78(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	TScriptInterface<class IGameplayTagAssetInterface> NewVar_0;                                          // 0x0CB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FCurveTableRowHandle                   HealFrequency;                                     // 0x0CC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_ReactiveRegeneration(int32 EntryPoint);
	void GrantRegen();
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_ReactiveRegeneration_C">();
	}
	static class UGA_Card_ReactiveRegeneration_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_ReactiveRegeneration_C>();
	}
};
static_assert(alignof(UGA_Card_ReactiveRegeneration_C) == 0x000010, "Wrong alignment on UGA_Card_ReactiveRegeneration_C");
static_assert(sizeof(UGA_Card_ReactiveRegeneration_C) == 0x000CE0, "Wrong size on UGA_Card_ReactiveRegeneration_C");
static_assert(offsetof(UGA_Card_ReactiveRegeneration_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_ReactiveRegeneration_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_ReactiveRegeneration_C, Stun) == 0x000B78, "Member 'UGA_Card_ReactiveRegeneration_C::Stun' has a wrong offset!");
static_assert(offsetof(UGA_Card_ReactiveRegeneration_C, Root) == 0x000BB8, "Member 'UGA_Card_ReactiveRegeneration_C::Root' has a wrong offset!");
static_assert(offsetof(UGA_Card_ReactiveRegeneration_C, Silence) == 0x000BF8, "Member 'UGA_Card_ReactiveRegeneration_C::Silence' has a wrong offset!");
static_assert(offsetof(UGA_Card_ReactiveRegeneration_C, KnockUp) == 0x000C38, "Member 'UGA_Card_ReactiveRegeneration_C::KnockUp' has a wrong offset!");
static_assert(offsetof(UGA_Card_ReactiveRegeneration_C, KnockBack) == 0x000C78, "Member 'UGA_Card_ReactiveRegeneration_C::KnockBack' has a wrong offset!");
static_assert(offsetof(UGA_Card_ReactiveRegeneration_C, NewVar_0) == 0x000CB8, "Member 'UGA_Card_ReactiveRegeneration_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UGA_Card_ReactiveRegeneration_C, HealFrequency) == 0x000CC8, "Member 'UGA_Card_ReactiveRegeneration_C::HealFrequency' has a wrong offset!");

}

