#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Test_VFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Test_VFX.GA_Card_Test_VFX_C
// 0x00C0 (0x0C30 - 0x0B70)
class UGA_Card_Test_VFX_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   GC_Array;                                          // 0x0B78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FGameplayTagRequirements               PrimaryTag;                                        // 0x0B88(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GC_Tag;                                            // 0x0BD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Toggle;                                            // 0x0BD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD9[0x7];                                      // 0x0BD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               SecondaryTag;                                      // 0x0BE0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Array_Slot;                                        // 0x0C20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_Test_VFX(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnInput_225184C343B05525724A44AC9E473B39();
	void OnInput_F59437704D73E2F7C61D12B5D97527DC();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Test_VFX_C">();
	}
	static class UGA_Card_Test_VFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Test_VFX_C>();
	}
};
static_assert(alignof(UGA_Card_Test_VFX_C) == 0x000010, "Wrong alignment on UGA_Card_Test_VFX_C");
static_assert(sizeof(UGA_Card_Test_VFX_C) == 0x000C30, "Wrong size on UGA_Card_Test_VFX_C");
static_assert(offsetof(UGA_Card_Test_VFX_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Test_VFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Test_VFX_C, GC_Array) == 0x000B78, "Member 'UGA_Card_Test_VFX_C::GC_Array' has a wrong offset!");
static_assert(offsetof(UGA_Card_Test_VFX_C, PrimaryTag) == 0x000B88, "Member 'UGA_Card_Test_VFX_C::PrimaryTag' has a wrong offset!");
static_assert(offsetof(UGA_Card_Test_VFX_C, Index_0) == 0x000BC8, "Member 'UGA_Card_Test_VFX_C::Index_0' has a wrong offset!");
static_assert(offsetof(UGA_Card_Test_VFX_C, GC_Tag) == 0x000BD0, "Member 'UGA_Card_Test_VFX_C::GC_Tag' has a wrong offset!");
static_assert(offsetof(UGA_Card_Test_VFX_C, Toggle) == 0x000BD8, "Member 'UGA_Card_Test_VFX_C::Toggle' has a wrong offset!");
static_assert(offsetof(UGA_Card_Test_VFX_C, SecondaryTag) == 0x000BE0, "Member 'UGA_Card_Test_VFX_C::SecondaryTag' has a wrong offset!");
static_assert(offsetof(UGA_Card_Test_VFX_C, Array_Slot) == 0x000C20, "Member 'UGA_Card_Test_VFX_C::Array_Slot' has a wrong offset!");

}

