#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Metamorphosis_Target

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Metamorphosis_Target.GA_Card_Metamorphosis_Target_C.ExecuteUbergraph_GA_Card_Metamorphosis_Target
// 0x0270 (0x0270 - 0x0000)
struct GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue2;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue2;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate9;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue3; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0128(0x0040)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0168(0x0020)()
	class UCharacterMovementComponent*            K2Node_DynamicCast_AsCharacter_Movement_Component; // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTargetData_ReturnValue;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             K2Node_DynamicCast_AsOrion_Char;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue2;                // 0x01C0(0x0040)(ContainsInstancedReference)
	class UCharacterMovementComponent*            K2Node_DynamicCast_AsCharacter_Movement_Component2; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue3;                // 0x0210(0x0040)(ContainsInstancedReference)
	class UCharacterMovementComponent*            K2Node_DynamicCast_AsCharacter_Movement_Component3; // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Card_Metamorphosis_C*               K2Node_DynamicCast_AsBP_Card_Metamorphosis;        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target");
static_assert(sizeof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target) == 0x000270, "Wrong size on GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, EntryPoint) == 0x000000, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CustomEvent_SpawnedActor3) == 0x000008, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CustomEvent_SpawnedActor2) == 0x000010, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CustomEvent_SpawnedActor) == 0x000028, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, Temp_object_Variable) == 0x000040, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_StartAbilityState_ReturnValue) == 0x000068, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CreateDelegate_OutputDelegate5) == 0x000070, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000088, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CreateDelegate_OutputDelegate6) == 0x000090, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_IsValid_ReturnValue2) == 0x0000A0, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x0000A8, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B0, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_IsValid_ReturnValue3) == 0x0000C0, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_WaitGameplayTagAdd_ReturnValue2) == 0x0000C8, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_WaitGameplayTagAdd_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CreateDelegate_OutputDelegate8) == 0x0000D0, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_IsValid_ReturnValue4) == 0x0000E0, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_WaitGameplayTagRemove_ReturnValue2) == 0x0000E8, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_WaitGameplayTagRemove_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_IsValid_ReturnValue5) == 0x0000F0, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_CreateDelegate_OutputDelegate9) == 0x0000F8, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000108, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_IsValid_ReturnValue6) == 0x000110, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000118, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_GetAvatarActorFromActorInfo_ReturnValue3) == 0x000120, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_GetAvatarActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_GetActorInfo_ReturnValue) == 0x000128, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000168, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_AsCharacter_Movement_Component) == 0x000188, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_AsCharacter_Movement_Component' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_SpawnOrionActorTargetData_ReturnValue) == 0x000198, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_SpawnOrionActorTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0001A0, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_BeginSpawningActor_ReturnValue) == 0x0001A8, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_IsValid_ReturnValue7) == 0x0001A9, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_AsOrion_Char) == 0x0001B0, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_AsOrion_Char' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_bSuccess2) == 0x0001B8, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_GetTeamNum_ReturnValue) == 0x0001B9, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_GetActorInfo_ReturnValue2) == 0x0001C0, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_GetActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_AsCharacter_Movement_Component2) == 0x000200, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_AsCharacter_Movement_Component2' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_bSuccess3) == 0x000208, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, CallFunc_GetActorInfo_ReturnValue3) == 0x000210, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::CallFunc_GetActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_AsCharacter_Movement_Component3) == 0x000250, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_AsCharacter_Movement_Component3' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_bSuccess4) == 0x000258, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_AsBP_Card_Metamorphosis) == 0x000260, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_AsBP_Card_Metamorphosis' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target, K2Node_DynamicCast_bSuccess5) == 0x000268, "Member 'GA_Card_Metamorphosis_Target_C_ExecuteUbergraph_GA_Card_Metamorphosis_Target::K2Node_DynamicCast_bSuccess5' has a wrong offset!");

// Function GA_Card_Metamorphosis_Target.GA_Card_Metamorphosis_Target_C.Success_5578B286496AE0E55E901A8B4327D2CF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Metamorphosis_Target_C_Success_5578B286496AE0E55E901A8B4327D2CF final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Metamorphosis_Target_C_Success_5578B286496AE0E55E901A8B4327D2CF) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_Target_C_Success_5578B286496AE0E55E901A8B4327D2CF");
static_assert(sizeof(GA_Card_Metamorphosis_Target_C_Success_5578B286496AE0E55E901A8B4327D2CF) == 0x000008, "Wrong size on GA_Card_Metamorphosis_Target_C_Success_5578B286496AE0E55E901A8B4327D2CF");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_Success_5578B286496AE0E55E901A8B4327D2CF, SpawnedActor) == 0x000000, "Member 'GA_Card_Metamorphosis_Target_C_Success_5578B286496AE0E55E901A8B4327D2CF::SpawnedActor' has a wrong offset!");

// Function GA_Card_Metamorphosis_Target.GA_Card_Metamorphosis_Target_C.NotAuthority_5578B286496AE0E55E901A8B4327D2CF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Metamorphosis_Target_C_NotAuthority_5578B286496AE0E55E901A8B4327D2CF final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Metamorphosis_Target_C_NotAuthority_5578B286496AE0E55E901A8B4327D2CF) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_Target_C_NotAuthority_5578B286496AE0E55E901A8B4327D2CF");
static_assert(sizeof(GA_Card_Metamorphosis_Target_C_NotAuthority_5578B286496AE0E55E901A8B4327D2CF) == 0x000008, "Wrong size on GA_Card_Metamorphosis_Target_C_NotAuthority_5578B286496AE0E55E901A8B4327D2CF");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_NotAuthority_5578B286496AE0E55E901A8B4327D2CF, SpawnedActor) == 0x000000, "Member 'GA_Card_Metamorphosis_Target_C_NotAuthority_5578B286496AE0E55E901A8B4327D2CF::SpawnedActor' has a wrong offset!");

// Function GA_Card_Metamorphosis_Target.GA_Card_Metamorphosis_Target_C.FailedToSpawn_5578B286496AE0E55E901A8B4327D2CF
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_Metamorphosis_Target_C_FailedToSpawn_5578B286496AE0E55E901A8B4327D2CF final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Metamorphosis_Target_C_FailedToSpawn_5578B286496AE0E55E901A8B4327D2CF) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_Target_C_FailedToSpawn_5578B286496AE0E55E901A8B4327D2CF");
static_assert(sizeof(GA_Card_Metamorphosis_Target_C_FailedToSpawn_5578B286496AE0E55E901A8B4327D2CF) == 0x000008, "Wrong size on GA_Card_Metamorphosis_Target_C_FailedToSpawn_5578B286496AE0E55E901A8B4327D2CF");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_FailedToSpawn_5578B286496AE0E55E901A8B4327D2CF, SpawnedActor) == 0x000000, "Member 'GA_Card_Metamorphosis_Target_C_FailedToSpawn_5578B286496AE0E55E901A8B4327D2CF::SpawnedActor' has a wrong offset!");

// Function GA_Card_Metamorphosis_Target.GA_Card_Metamorphosis_Target_C.K2_CanActivateAbility
// 0x0080 (0x0080 - 0x0000)
struct GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CanActivate_Local;                                 // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEnergy_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility) == 0x000080, "Wrong size on GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Card_Metamorphosis_Target_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
