#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Aura_PrimeBuff

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Aura_PrimeBuff.GA_Card_Aura_PrimeBuff_C.ExecuteUbergraph_GA_Card_Aura_PrimeBuff
// 0x01B8 (0x01B8 - 0x0000)
struct GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0018(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0040(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    Temp_byte_Variable;                                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FOrionAbilityTargetDataFilter          K2Node_MakeStruct_OrionAbilityTargetDataFilter;    // 0x00D0(0x0030)()
	TDelegate<void(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	struct FOrionFilterAndEffectsContainer        CallFunc_InitFilterAndEffectsContainer_ReturnValue; // 0x0110(0x0020)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionAuraHandle                       CallFunc_BeginAura_ReturnValue;                    // 0x0134(0x0004)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Source;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0148(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x016C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeOrionFilterHandle_ReturnValue;        // 0x0180(0x0010)()
	TScriptInterface<class IOrionTeamActorInterface> K2Node_DynamicCast_AsOrion_Team_Actor_Interface;   // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEffectApplied_Self* CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff) == 0x000008, "Wrong alignment on GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff");
static_assert(sizeof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff) == 0x0001B8, "Wrong size on GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, EntryPoint) == 0x000000, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, Temp_struct_Variable) == 0x000004, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000010, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, Temp_struct_Variable2) == 0x000018, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, Temp_object_Variable) == 0x000038, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_MakeStruct_GameplayTagRequirements) == 0x000040, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_CreateDelegate_OutputDelegate2) == 0x000090, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_StartAbilityState_ReturnValue) == 0x0000A0, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A8, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_IsValid_ReturnValue2) == 0x0000B8, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, Temp_byte_Variable) == 0x0000B9, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_CreateDelegate_OutputDelegate4) == 0x0000C0, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_MakeStruct_OrionAbilityTargetDataFilter) == 0x0000D0, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_MakeStruct_OrionAbilityTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_CreateDelegate_OutputDelegate5) == 0x000100, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_InitFilterAndEffectsContainer_ReturnValue) == 0x000110, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_InitFilterAndEffectsContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_GetValueAtLevel_ReturnValue) == 0x000130, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_BeginAura_ReturnValue) == 0x000134, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_BeginAura_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000138, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_CustomEvent_Source) == 0x000140, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_CustomEvent_SpecHandle) == 0x000148, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_CustomEvent_ActiveHandle) == 0x000160, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_IsValid_ReturnValue3) == 0x000168, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00016C, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000178, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_MakeOrionFilterHandle_ReturnValue) == 0x000180, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_MakeOrionFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_DynamicCast_AsOrion_Team_Actor_Interface) == 0x000190, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_DynamicCast_AsOrion_Team_Actor_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue) == 0x0001A8, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_GetTeamNum_ReturnValue) == 0x0001B0, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff, CallFunc_IsValid_ReturnValue4) == 0x0001B1, "Member 'GA_Card_Aura_PrimeBuff_C_ExecuteUbergraph_GA_Card_Aura_PrimeBuff::CallFunc_IsValid_ReturnValue4' has a wrong offset!");

// Function GA_Card_Aura_PrimeBuff.GA_Card_Aura_PrimeBuff_C.OnApplied_D9B60F364036EF76204502B496E301DD
// 0x0028 (0x0028 - 0x0000)
struct GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD) == 0x000008, "Wrong alignment on GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD");
static_assert(sizeof(GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD) == 0x000028, "Wrong size on GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD, Source) == 0x000000, "Member 'GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD::Source' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD, SpecHandle) == 0x000008, "Member 'GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD, ActiveHandle) == 0x000020, "Member 'GA_Card_Aura_PrimeBuff_C_OnApplied_D9B60F364036EF76204502B496E301DD::ActiveHandle' has a wrong offset!");

}

