#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Suppress_Enemy

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_Suppress_Enemy.GA_Card_Suppress_Enemy_C.ExecuteUbergraph_GA_Card_Suppress_Enemy
// 0x0110 (0x0110 - 0x0000)
struct GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue2;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionMoveToForce* CallFunc_ApplyRootMotionMoveToForce_ReturnValue;   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionMoveToForce* CallFunc_ApplyRootMotionMoveToForce_ReturnValue2;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0104(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy) == 0x000008, "Wrong alignment on GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy");
static_assert(sizeof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy) == 0x000110, "Wrong size on GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, EntryPoint) == 0x000000, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_StartAbilityState_ReturnValue) == 0x000018, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, K2Node_CreateDelegate_OutputDelegate3) == 0x000038, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, K2Node_CreateDelegate_OutputDelegate4) == 0x000048, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, K2Node_CreateDelegate_OutputDelegate5) == 0x000058, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, K2Node_CreateDelegate_OutputDelegate6) == 0x000068, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, K2Node_CreateDelegate_OutputDelegate7) == 0x000078, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_StartAbilityState_ReturnValue2) == 0x000088, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_StartAbilityState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_IsValid_ReturnValue2) == 0x000090, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, K2Node_CreateDelegate_OutputDelegate8) == 0x000098, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000A8, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_BreakVector_X) == 0x0000BC, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_BreakVector_Z) == 0x0000C4, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C8, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0000D0, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_MakeVector_ReturnValue) == 0x0000D8, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000E4, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_ApplyRootMotionMoveToForce_ReturnValue) == 0x0000F0, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_ApplyRootMotionMoveToForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_ApplyRootMotionMoveToForce_ReturnValue2) == 0x0000F8, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_ApplyRootMotionMoveToForce_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_IsValid_ReturnValue3) == 0x000100, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_IsValid_ReturnValue4) == 0x000101, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000104, "Member 'GA_Card_Suppress_Enemy_C_ExecuteUbergraph_GA_Card_Suppress_Enemy::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

}

