#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Core_Boss_SpecialAttack2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.ExecuteUbergraph_GA_Core_Boss_SpecialAttack2
// 0x01C0 (0x01C0 - 0x0000)
struct GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate6;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate7;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate8;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue2;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate13;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2) == 0x000010, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2) == 0x0001C0, "Wrong size on GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, EntryPoint) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CustomEvent_NotifyName6) == 0x000008, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CustomEvent_NotifyName5) == 0x000010, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CustomEvent_NotifyName4) == 0x000028, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CustomEvent_NotifyName3) == 0x000040, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CustomEvent_NotifyName2) == 0x000058, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CustomEvent_NotifyName) == 0x000070, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate5) == 0x000078, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, Temp_name_Variable) == 0x000088, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CustomEvent_SpawnedActor3) == 0x000090, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate6) == 0x000098, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CustomEvent_SpawnedActor2) == 0x0000A8, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B0, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CustomEvent_SpawnedActor) == 0x0000C0, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate8) == 0x0000C8, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, Temp_object_Variable) == 0x0000D8, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate9) == 0x0000E0, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate10) == 0x0000F0, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_StartAbilityState_ReturnValue) == 0x000100, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate11) == 0x000108, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate12) == 0x000120, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_StartAbilityState_ReturnValue2) == 0x000130, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_StartAbilityState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_IsValid_ReturnValue2) == 0x000138, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000140, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_GetTransform_ReturnValue) == 0x000150, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, K2Node_CreateDelegate_OutputDelegate13) == 0x000180, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x000190, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000198, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_BeginSpawningActor_ReturnValue) == 0x0001A0, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_IsValid_ReturnValue3) == 0x0001A1, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_IsValid_ReturnValue4) == 0x0001A2, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001A3, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0001A4, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x0001A8, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_IsValid_ReturnValue5) == 0x0001B0, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2, CallFunc_IsValid_ReturnValue6) == 0x0001B1, "Member 'GA_Core_Boss_SpecialAttack2_C_ExecuteUbergraph_GA_Core_Boss_SpecialAttack2::CallFunc_IsValid_ReturnValue6' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.FailedToSpawn_80F4D3FC456BD14E4B765B98DDBB84CD
// 0x0008 (0x0008 - 0x0000)
struct GA_Core_Boss_SpecialAttack2_C_FailedToSpawn_80F4D3FC456BD14E4B765B98DDBB84CD final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_FailedToSpawn_80F4D3FC456BD14E4B765B98DDBB84CD) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_FailedToSpawn_80F4D3FC456BD14E4B765B98DDBB84CD");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_FailedToSpawn_80F4D3FC456BD14E4B765B98DDBB84CD) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack2_C_FailedToSpawn_80F4D3FC456BD14E4B765B98DDBB84CD");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_FailedToSpawn_80F4D3FC456BD14E4B765B98DDBB84CD, SpawnedActor) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_FailedToSpawn_80F4D3FC456BD14E4B765B98DDBB84CD::SpawnedActor' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.NotAuthority_80F4D3FC456BD14E4B765B98DDBB84CD
// 0x0008 (0x0008 - 0x0000)
struct GA_Core_Boss_SpecialAttack2_C_NotAuthority_80F4D3FC456BD14E4B765B98DDBB84CD final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_NotAuthority_80F4D3FC456BD14E4B765B98DDBB84CD) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_NotAuthority_80F4D3FC456BD14E4B765B98DDBB84CD");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_NotAuthority_80F4D3FC456BD14E4B765B98DDBB84CD) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack2_C_NotAuthority_80F4D3FC456BD14E4B765B98DDBB84CD");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_NotAuthority_80F4D3FC456BD14E4B765B98DDBB84CD, SpawnedActor) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_NotAuthority_80F4D3FC456BD14E4B765B98DDBB84CD::SpawnedActor' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.OnBlendOut_70E896154063F19469FCC9956B110CB7
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack2_C_OnBlendOut_70E896154063F19469FCC9956B110CB7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_OnBlendOut_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_OnBlendOut_70E896154063F19469FCC9956B110CB7");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_OnBlendOut_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack2_C_OnBlendOut_70E896154063F19469FCC9956B110CB7");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_OnBlendOut_70E896154063F19469FCC9956B110CB7, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_OnBlendOut_70E896154063F19469FCC9956B110CB7::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.OnCancelled_70E896154063F19469FCC9956B110CB7
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack2_C_OnCancelled_70E896154063F19469FCC9956B110CB7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_OnCancelled_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_OnCancelled_70E896154063F19469FCC9956B110CB7");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_OnCancelled_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack2_C_OnCancelled_70E896154063F19469FCC9956B110CB7");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_OnCancelled_70E896154063F19469FCC9956B110CB7, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_OnCancelled_70E896154063F19469FCC9956B110CB7::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.OnCompleted_70E896154063F19469FCC9956B110CB7
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack2_C_OnCompleted_70E896154063F19469FCC9956B110CB7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_OnCompleted_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_OnCompleted_70E896154063F19469FCC9956B110CB7");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_OnCompleted_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack2_C_OnCompleted_70E896154063F19469FCC9956B110CB7");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_OnCompleted_70E896154063F19469FCC9956B110CB7, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_OnCompleted_70E896154063F19469FCC9956B110CB7::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.OnInterrupted_70E896154063F19469FCC9956B110CB7
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack2_C_OnInterrupted_70E896154063F19469FCC9956B110CB7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_OnInterrupted_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_OnInterrupted_70E896154063F19469FCC9956B110CB7");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_OnInterrupted_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack2_C_OnInterrupted_70E896154063F19469FCC9956B110CB7");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_OnInterrupted_70E896154063F19469FCC9956B110CB7, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_OnInterrupted_70E896154063F19469FCC9956B110CB7::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.OnNotifyBegin_70E896154063F19469FCC9956B110CB7
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack2_C_OnNotifyBegin_70E896154063F19469FCC9956B110CB7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_OnNotifyBegin_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_OnNotifyBegin_70E896154063F19469FCC9956B110CB7");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_OnNotifyBegin_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack2_C_OnNotifyBegin_70E896154063F19469FCC9956B110CB7");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_OnNotifyBegin_70E896154063F19469FCC9956B110CB7, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_OnNotifyBegin_70E896154063F19469FCC9956B110CB7::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.OnNotifyEnd_70E896154063F19469FCC9956B110CB7
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Core_Boss_SpecialAttack2_C_OnNotifyEnd_70E896154063F19469FCC9956B110CB7 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_OnNotifyEnd_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_OnNotifyEnd_70E896154063F19469FCC9956B110CB7");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_OnNotifyEnd_70E896154063F19469FCC9956B110CB7) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack2_C_OnNotifyEnd_70E896154063F19469FCC9956B110CB7");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_OnNotifyEnd_70E896154063F19469FCC9956B110CB7, NotifyName) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_OnNotifyEnd_70E896154063F19469FCC9956B110CB7::NotifyName' has a wrong offset!");

// Function GA_Core_Boss_SpecialAttack2.GA_Core_Boss_SpecialAttack2_C.Success_80F4D3FC456BD14E4B765B98DDBB84CD
// 0x0008 (0x0008 - 0x0000)
struct GA_Core_Boss_SpecialAttack2_C_Success_80F4D3FC456BD14E4B765B98DDBB84CD final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Core_Boss_SpecialAttack2_C_Success_80F4D3FC456BD14E4B765B98DDBB84CD) == 0x000008, "Wrong alignment on GA_Core_Boss_SpecialAttack2_C_Success_80F4D3FC456BD14E4B765B98DDBB84CD");
static_assert(sizeof(GA_Core_Boss_SpecialAttack2_C_Success_80F4D3FC456BD14E4B765B98DDBB84CD) == 0x000008, "Wrong size on GA_Core_Boss_SpecialAttack2_C_Success_80F4D3FC456BD14E4B765B98DDBB84CD");
static_assert(offsetof(GA_Core_Boss_SpecialAttack2_C_Success_80F4D3FC456BD14E4B765B98DDBB84CD, SpawnedActor) == 0x000000, "Member 'GA_Core_Boss_SpecialAttack2_C_Success_80F4D3FC456BD14E4B765B98DDBB84CD::SpawnedActor' has a wrong offset!");

}

