#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ShieldLink

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_ShieldLink.GA_Card_ShieldLink_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_Card_ShieldLink_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_ToSelf;                                         // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GameplayCue_Burst_Target;                          // 0x0B80(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_ToTarget1;                                      // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Card_ShieldLink(int32 EntryPoint);
	void Cancelled_D15FBE804A3A7EF21C7C1292EE0ADC22(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_D15FBE804A3A7EF21C7C1292EE0ADC22(const struct FGameplayAbilityTargetDataHandle& Targets);
	void K2_ActivateAbility();
	void OnStateEnded_77B52BF2470E7A31F99CCA94B1A5496C();
	void OnStateInterrupted_77B52BF2470E7A31F99CCA94B1A5496C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_ShieldLink_C">();
	}
	static class UGA_Card_ShieldLink_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_ShieldLink_C>();
	}
};
static_assert(alignof(UGA_Card_ShieldLink_C) == 0x000010, "Wrong alignment on UGA_Card_ShieldLink_C");
static_assert(sizeof(UGA_Card_ShieldLink_C) == 0x000B90, "Wrong size on UGA_Card_ShieldLink_C");
static_assert(offsetof(UGA_Card_ShieldLink_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_ShieldLink_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_ShieldLink_C, GE_ToSelf) == 0x000B78, "Member 'UGA_Card_ShieldLink_C::GE_ToSelf' has a wrong offset!");
static_assert(offsetof(UGA_Card_ShieldLink_C, GameplayCue_Burst_Target) == 0x000B80, "Member 'UGA_Card_ShieldLink_C::GameplayCue_Burst_Target' has a wrong offset!");
static_assert(offsetof(UGA_Card_ShieldLink_C, GE_ToTarget1) == 0x000B88, "Member 'UGA_Card_ShieldLink_C::GE_ToTarget1' has a wrong offset!");

}

