#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_Current_HP_Damage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_Current_HP_Damage.GA_Card_Current_HP_Damage_C
// 0x0050 (0x0BC0 - 0x0B70)
class UGA_Card_Current_HP_Damage_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_ToApply;                                        // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               CurrentHPDmgTag;                                   // 0x0B80(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_Current_HP_Damage(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnApplied_4F896E9F4F802B755F71D3BF73EA8BCF(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);
	void OnApplied_672B9E1D48B0EB1276C6C9B8A2EFCD7B(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_Current_HP_Damage_C">();
	}
	static class UGA_Card_Current_HP_Damage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_Current_HP_Damage_C>();
	}
};
static_assert(alignof(UGA_Card_Current_HP_Damage_C) == 0x000010, "Wrong alignment on UGA_Card_Current_HP_Damage_C");
static_assert(sizeof(UGA_Card_Current_HP_Damage_C) == 0x000BC0, "Wrong size on UGA_Card_Current_HP_Damage_C");
static_assert(offsetof(UGA_Card_Current_HP_Damage_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_Current_HP_Damage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_Current_HP_Damage_C, GE_ToApply) == 0x000B78, "Member 'UGA_Card_Current_HP_Damage_C::GE_ToApply' has a wrong offset!");
static_assert(offsetof(UGA_Card_Current_HP_Damage_C, CurrentHPDmgTag) == 0x000B80, "Member 'UGA_Card_Current_HP_Damage_C::CurrentHPDmgTag' has a wrong offset!");

}

