#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_EmpoweringStrikes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Card_EmpoweringStrikes.GA_Card_EmpoweringStrikes_C
// 0x0100 (0x0C70 - 0x0B70)
class UGA_Card_EmpoweringStrikes_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_ToApplyOnHit;                                   // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_MaxStackBonus;                                  // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanActivate;                                       // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B89[0x3];                                      // 0x0B89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxStacks;                                         // 0x0B8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cooldown;                                          // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            MaxBonusGE;                                        // 0x0B94(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            StackingDamageGE;                                  // 0x0B9C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA4[0x4];                                      // 0x0BA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ValueStacks;                                       // 0x0BA8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ValueCooldown;                                     // 0x0BD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDamageQualifierKeywordsWithContext    Qualifiers;                                        // 0x0BF8(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Card_EmpoweringStrikes(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnDamage_92B41E044358613FDD094AA321648F51(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle);
	void OnFinish_7B7A49BC4E6F0390DF2C438C2ABE349F();
	void OnStateEnded_9F3803A94C0C7278AD7EFE802859E4DC();
	void OnStateInterrupted_9F3803A94C0C7278AD7EFE802859E4DC();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Card_EmpoweringStrikes_C">();
	}
	static class UGA_Card_EmpoweringStrikes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Card_EmpoweringStrikes_C>();
	}
};
static_assert(alignof(UGA_Card_EmpoweringStrikes_C) == 0x000010, "Wrong alignment on UGA_Card_EmpoweringStrikes_C");
static_assert(sizeof(UGA_Card_EmpoweringStrikes_C) == 0x000C70, "Wrong size on UGA_Card_EmpoweringStrikes_C");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Card_EmpoweringStrikes_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, GE_ToApplyOnHit) == 0x000B78, "Member 'UGA_Card_EmpoweringStrikes_C::GE_ToApplyOnHit' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, GE_MaxStackBonus) == 0x000B80, "Member 'UGA_Card_EmpoweringStrikes_C::GE_MaxStackBonus' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, CanActivate) == 0x000B88, "Member 'UGA_Card_EmpoweringStrikes_C::CanActivate' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, MaxStacks) == 0x000B8C, "Member 'UGA_Card_EmpoweringStrikes_C::MaxStacks' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, Cooldown) == 0x000B90, "Member 'UGA_Card_EmpoweringStrikes_C::Cooldown' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, MaxBonusGE) == 0x000B94, "Member 'UGA_Card_EmpoweringStrikes_C::MaxBonusGE' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, StackingDamageGE) == 0x000B9C, "Member 'UGA_Card_EmpoweringStrikes_C::StackingDamageGE' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, ValueStacks) == 0x000BA8, "Member 'UGA_Card_EmpoweringStrikes_C::ValueStacks' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, ValueCooldown) == 0x000BD0, "Member 'UGA_Card_EmpoweringStrikes_C::ValueCooldown' has a wrong offset!");
static_assert(offsetof(UGA_Card_EmpoweringStrikes_C, Qualifiers) == 0x000BF8, "Member 'UGA_Card_EmpoweringStrikes_C::Qualifiers' has a wrong offset!");

}

