#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_ShadowAmbush

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_ShadowAmbush.GA_Card_ShadowAmbush_C.ExecuteUbergraph_GA_Card_ShadowAmbush
// 0x0408 (0x0408 - 0x0000)
struct GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageDealt_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo4;     // 0x0058(0x0020)(ConstParm)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo3;     // 0x0078(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectRemovalInfo             Temp_struct_Variable;                              // 0x00A8(0x0020)()
	class UAbilityTask_WaitGameplayEffectRemoved* CallFunc_WaitForGameplayEffectRemoved_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo2;     // 0x00E8(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo;      // 0x0118(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectRemovalInfo             Temp_struct_Variable2;                             // 0x0148(0x0020)()
	bool                                          Temp_bool_Variable;                                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x0178(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x01A0(0x0018)()
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate8;             // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable3;                             // 0x01C8(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable4;                             // 0x01E0(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0220(0x0020)()
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0240(0x0040)(ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0284(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue2;                // 0x0290(0x0040)(ContainsInstancedReference)
	class UAbilityTask_WaitAbilityCommit*         CallFunc_WaitForAbilityCommit_ReturnValue;         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       Temp_object_Variable2;                             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility2;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAbilityActivate*       CallFunc_WaitForAbilityActivate_ReturnValue;       // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       Temp_object_Variable3;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue3;                // 0x0318(0x0040)(ContainsInstancedReference)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue2;  // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate9;             // 0x0360(0x0010)(ZeroConstructor, NoDestructor)
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEffectRemoved* CallFunc_WaitForGameplayEffectRemoved_ReturnValue2; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue3;  // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A3[0x5];                                      // 0x03A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3; // 0x03B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             K2Node_DynamicCast_AsOrion_Char;                   // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalTimeToAttack_ReturnValue;         // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate10;            // 0x03D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x03E8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue4; // 0x03FC(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush) == 0x000008, "Wrong alignment on GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush");
static_assert(sizeof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush) == 0x000408, "Wrong size on GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, EntryPoint) == 0x000000, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_WaitDamageDealt_ReturnValue) == 0x000008, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_WaitDamageDealt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_StartAbilityState_ReturnValue) == 0x000038, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_IsValid_ReturnValue2) == 0x000050, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CustomEvent_GameplayEffectRemovalInfo4) == 0x000058, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CustomEvent_GameplayEffectRemovalInfo4' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CustomEvent_GameplayEffectRemovalInfo3) == 0x000078, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CustomEvent_GameplayEffectRemovalInfo3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate4) == 0x000098, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_struct_Variable) == 0x0000A8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_WaitForGameplayEffectRemoved_ReturnValue) == 0x0000C8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_WaitForGameplayEffectRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_IsValid_ReturnValue3) == 0x0000D0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate5) == 0x0000D8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CustomEvent_GameplayEffectRemovalInfo2) == 0x0000E8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CustomEvent_GameplayEffectRemovalInfo2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate6) == 0x000108, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CustomEvent_GameplayEffectRemovalInfo) == 0x000118, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CustomEvent_GameplayEffectRemovalInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate7) == 0x000138, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_struct_Variable2) == 0x000148, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_bool_Variable) == 0x000168, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CustomEvent_AuxillaryASC) == 0x000170, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CustomEvent_DamageInfo) == 0x000178, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CustomEvent_SpecHandle) == 0x0001A0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate8) == 0x0001B8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_struct_Variable3) == 0x0001C8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_struct_Variable4) == 0x0001E0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_object_Variable) == 0x000208, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_GetOwner_ReturnValue) == 0x000210, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_bool_IsClosed_Variable) == 0x000218, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000220, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_GetActorInfo_ReturnValue) == 0x000240, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_bool_Has_Been_Initd_Variable) == 0x000280, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000284, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_GetActorInfo_ReturnValue2) == 0x000290, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_GetActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_WaitForAbilityCommit_ReturnValue) == 0x0002D0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_WaitForAbilityCommit_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_K2_CommitAbility_ReturnValue) == 0x0002D8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_IsValid_ReturnValue4) == 0x0002D9, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_object_Variable2) == 0x0002E0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CustomEvent_ActivatedAbility2) == 0x0002E8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CustomEvent_ActivatedAbility2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x0002F0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0002F8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_WaitForAbilityActivate_ReturnValue) == 0x000300, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_WaitForAbilityActivate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, Temp_object_Variable3) == 0x000308, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_IsValid_ReturnValue5) == 0x000310, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_GetActorInfo_ReturnValue3) == 0x000318, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_GetActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_RemoveActiveGameplayEffect_ReturnValue2) == 0x000358, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_RemoveActiveGameplayEffect_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate9) == 0x000360, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CustomEvent_ActivatedAbility) == 0x000370, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_WaitForGameplayEffectRemoved_ReturnValue2) == 0x000378, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_WaitForGameplayEffectRemoved_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_IsValid_ReturnValue6) == 0x000380, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000388, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000390, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_DynamicCast_bSuccess) == 0x0003A0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0003A1, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_RemoveActiveGameplayEffect_ReturnValue3) == 0x0003A2, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_RemoveActiveGameplayEffect_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0003A8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3) == 0x0003B0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_DynamicCast_AsOrion_Char) == 0x0003B8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_DynamicCast_AsOrion_Char' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_DynamicCast_bSuccess2) == 0x0003C0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_GetTotalTimeToAttack_ReturnValue) == 0x0003C4, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_GetTotalTimeToAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_WaitDelay_ReturnValue) == 0x0003C8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, K2Node_CreateDelegate_OutputDelegate10) == 0x0003D0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_IsValid_ReturnValue7) == 0x0003E0, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_GetAbilityLevel_ReturnValue) == 0x0003E4, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0003E8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_GetAbilityLevel_ReturnValue2) == 0x0003F8, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue4) == 0x0003FC, "Member 'GA_Card_ShadowAmbush_C_ExecuteUbergraph_GA_Card_ShadowAmbush::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue4' has a wrong offset!");

// Function GA_Card_ShadowAmbush.GA_Card_ShadowAmbush_C.InvalidHandle_3F171787454CFA16EDF19F97991A957E
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ShadowAmbush_C_InvalidHandle_3F171787454CFA16EDF19F97991A957E final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ShadowAmbush_C_InvalidHandle_3F171787454CFA16EDF19F97991A957E) == 0x000008, "Wrong alignment on GA_Card_ShadowAmbush_C_InvalidHandle_3F171787454CFA16EDF19F97991A957E");
static_assert(sizeof(GA_Card_ShadowAmbush_C_InvalidHandle_3F171787454CFA16EDF19F97991A957E) == 0x000020, "Wrong size on GA_Card_ShadowAmbush_C_InvalidHandle_3F171787454CFA16EDF19F97991A957E");
static_assert(offsetof(GA_Card_ShadowAmbush_C_InvalidHandle_3F171787454CFA16EDF19F97991A957E, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA_Card_ShadowAmbush_C_InvalidHandle_3F171787454CFA16EDF19F97991A957E::GameplayEffectRemovalInfo' has a wrong offset!");

// Function GA_Card_ShadowAmbush.GA_Card_ShadowAmbush_C.InvalidHandle_9B91BC51455B4E5F9BBB09A7A1E5E405
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ShadowAmbush_C_InvalidHandle_9B91BC51455B4E5F9BBB09A7A1E5E405 final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ShadowAmbush_C_InvalidHandle_9B91BC51455B4E5F9BBB09A7A1E5E405) == 0x000008, "Wrong alignment on GA_Card_ShadowAmbush_C_InvalidHandle_9B91BC51455B4E5F9BBB09A7A1E5E405");
static_assert(sizeof(GA_Card_ShadowAmbush_C_InvalidHandle_9B91BC51455B4E5F9BBB09A7A1E5E405) == 0x000020, "Wrong size on GA_Card_ShadowAmbush_C_InvalidHandle_9B91BC51455B4E5F9BBB09A7A1E5E405");
static_assert(offsetof(GA_Card_ShadowAmbush_C_InvalidHandle_9B91BC51455B4E5F9BBB09A7A1E5E405, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA_Card_ShadowAmbush_C_InvalidHandle_9B91BC51455B4E5F9BBB09A7A1E5E405::GameplayEffectRemovalInfo' has a wrong offset!");

// Function GA_Card_ShadowAmbush.GA_Card_ShadowAmbush_C.OnActivate_B8AC73DB489A14A69C1D12B262225E69
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ShadowAmbush_C_OnActivate_B8AC73DB489A14A69C1D12B262225E69 final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ShadowAmbush_C_OnActivate_B8AC73DB489A14A69C1D12B262225E69) == 0x000008, "Wrong alignment on GA_Card_ShadowAmbush_C_OnActivate_B8AC73DB489A14A69C1D12B262225E69");
static_assert(sizeof(GA_Card_ShadowAmbush_C_OnActivate_B8AC73DB489A14A69C1D12B262225E69) == 0x000008, "Wrong size on GA_Card_ShadowAmbush_C_OnActivate_B8AC73DB489A14A69C1D12B262225E69");
static_assert(offsetof(GA_Card_ShadowAmbush_C_OnActivate_B8AC73DB489A14A69C1D12B262225E69, ActivatedAbility) == 0x000000, "Member 'GA_Card_ShadowAmbush_C_OnActivate_B8AC73DB489A14A69C1D12B262225E69::ActivatedAbility' has a wrong offset!");

// Function GA_Card_ShadowAmbush.GA_Card_ShadowAmbush_C.OnCommit_938EB7EA4A9E0183D4A5709B35F2A9B8
// 0x0008 (0x0008 - 0x0000)
struct GA_Card_ShadowAmbush_C_OnCommit_938EB7EA4A9E0183D4A5709B35F2A9B8 final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Card_ShadowAmbush_C_OnCommit_938EB7EA4A9E0183D4A5709B35F2A9B8) == 0x000008, "Wrong alignment on GA_Card_ShadowAmbush_C_OnCommit_938EB7EA4A9E0183D4A5709B35F2A9B8");
static_assert(sizeof(GA_Card_ShadowAmbush_C_OnCommit_938EB7EA4A9E0183D4A5709B35F2A9B8) == 0x000008, "Wrong size on GA_Card_ShadowAmbush_C_OnCommit_938EB7EA4A9E0183D4A5709B35F2A9B8");
static_assert(offsetof(GA_Card_ShadowAmbush_C_OnCommit_938EB7EA4A9E0183D4A5709B35F2A9B8, ActivatedAbility) == 0x000000, "Member 'GA_Card_ShadowAmbush_C_OnCommit_938EB7EA4A9E0183D4A5709B35F2A9B8::ActivatedAbility' has a wrong offset!");

// Function GA_Card_ShadowAmbush.GA_Card_ShadowAmbush_C.OnDamage_54F841C14DCC756D3AB1218E45006FCD
// 0x0048 (0x0048 - 0x0000)
struct GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD) == 0x000008, "Wrong alignment on GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD");
static_assert(sizeof(GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD) == 0x000048, "Wrong size on GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD");
static_assert(offsetof(GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD, AuxillaryASC) == 0x000000, "Member 'GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD, DamageInfo) == 0x000008, "Member 'GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD, SpecHandle) == 0x000030, "Member 'GA_Card_ShadowAmbush_C_OnDamage_54F841C14DCC756D3AB1218E45006FCD::SpecHandle' has a wrong offset!");

// Function GA_Card_ShadowAmbush.GA_Card_ShadowAmbush_C.OnRemoved_3F171787454CFA16EDF19F97991A957E
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ShadowAmbush_C_OnRemoved_3F171787454CFA16EDF19F97991A957E final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ShadowAmbush_C_OnRemoved_3F171787454CFA16EDF19F97991A957E) == 0x000008, "Wrong alignment on GA_Card_ShadowAmbush_C_OnRemoved_3F171787454CFA16EDF19F97991A957E");
static_assert(sizeof(GA_Card_ShadowAmbush_C_OnRemoved_3F171787454CFA16EDF19F97991A957E) == 0x000020, "Wrong size on GA_Card_ShadowAmbush_C_OnRemoved_3F171787454CFA16EDF19F97991A957E");
static_assert(offsetof(GA_Card_ShadowAmbush_C_OnRemoved_3F171787454CFA16EDF19F97991A957E, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA_Card_ShadowAmbush_C_OnRemoved_3F171787454CFA16EDF19F97991A957E::GameplayEffectRemovalInfo' has a wrong offset!");

// Function GA_Card_ShadowAmbush.GA_Card_ShadowAmbush_C.OnRemoved_9B91BC51455B4E5F9BBB09A7A1E5E405
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_ShadowAmbush_C_OnRemoved_9B91BC51455B4E5F9BBB09A7A1E5E405 final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_ShadowAmbush_C_OnRemoved_9B91BC51455B4E5F9BBB09A7A1E5E405) == 0x000008, "Wrong alignment on GA_Card_ShadowAmbush_C_OnRemoved_9B91BC51455B4E5F9BBB09A7A1E5E405");
static_assert(sizeof(GA_Card_ShadowAmbush_C_OnRemoved_9B91BC51455B4E5F9BBB09A7A1E5E405) == 0x000020, "Wrong size on GA_Card_ShadowAmbush_C_OnRemoved_9B91BC51455B4E5F9BBB09A7A1E5E405");
static_assert(offsetof(GA_Card_ShadowAmbush_C_OnRemoved_9B91BC51455B4E5F9BBB09A7A1E5E405, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA_Card_ShadowAmbush_C_OnRemoved_9B91BC51455B4E5F9BBB09A7A1E5E405::GameplayEffectRemovalInfo' has a wrong offset!");

}

