#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_CarriedBuff_MoveSpeedOnHit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_CarriedBuff_MoveSpeedOnHit.GA_CarriedBuff_MoveSpeedOnHit_C
// 0x0090 (0x0C00 - 0x0B70)
class UGA_CarriedBuff_MoveSpeedOnHit_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTagRequirements               Source_Tags;                                       // 0x0B78(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagRequirements               Target_Tags;                                       // 0x0BB8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_RunSpeedOnHit;                                  // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_CarriedBuff_MoveSpeedOnHit(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnApplied_06FF9A3D4ECEBF76962748A14DD149EB(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_CarriedBuff_MoveSpeedOnHit_C">();
	}
	static class UGA_CarriedBuff_MoveSpeedOnHit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_CarriedBuff_MoveSpeedOnHit_C>();
	}
};
static_assert(alignof(UGA_CarriedBuff_MoveSpeedOnHit_C) == 0x000010, "Wrong alignment on UGA_CarriedBuff_MoveSpeedOnHit_C");
static_assert(sizeof(UGA_CarriedBuff_MoveSpeedOnHit_C) == 0x000C00, "Wrong size on UGA_CarriedBuff_MoveSpeedOnHit_C");
static_assert(offsetof(UGA_CarriedBuff_MoveSpeedOnHit_C, UberGraphFrame) == 0x000B70, "Member 'UGA_CarriedBuff_MoveSpeedOnHit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_CarriedBuff_MoveSpeedOnHit_C, Source_Tags) == 0x000B78, "Member 'UGA_CarriedBuff_MoveSpeedOnHit_C::Source_Tags' has a wrong offset!");
static_assert(offsetof(UGA_CarriedBuff_MoveSpeedOnHit_C, Target_Tags) == 0x000BB8, "Member 'UGA_CarriedBuff_MoveSpeedOnHit_C::Target_Tags' has a wrong offset!");
static_assert(offsetof(UGA_CarriedBuff_MoveSpeedOnHit_C, GE_RunSpeedOnHit) == 0x000BF8, "Member 'UGA_CarriedBuff_MoveSpeedOnHit_C::GE_RunSpeedOnHit' has a wrong offset!");

}

