#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Card_FlameOfZechin

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Card_FlameOfZechin.GA_Card_FlameOfZechin_C.ExecuteUbergraph_GA_Card_FlameOfZechin
// 0x01B8 (0x01B8 - 0x0000)
struct GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0018(0x0020)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0038(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0098(0x0020)(ConstParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x00E0(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x00F8(0x0018)()
	int32                                         CallFunc_GetAbilityLevel_ReturnValue3;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue4;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue2;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x013C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0148(0x0040)(ContainsInstancedReference)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3; // 0x019C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue4; // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin) == 0x000008, "Wrong alignment on GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin");
static_assert(sizeof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin) == 0x0001B8, "Wrong size on GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, EntryPoint) == 0x000000, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, K2Node_CustomEvent_Targets) == 0x000018, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, Temp_struct_Variable) == 0x000038, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_StartTargeting_ReturnValue) == 0x000058, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_WaitNetSync_ReturnValue) == 0x000078, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_IsValid_ReturnValue2) == 0x000080, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, K2Node_CreateDelegate_OutputDelegate3) == 0x000088, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, K2Node_CustomEvent_Targets2) == 0x000098, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000B8, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000C0, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetAbilityLevel_ReturnValue) == 0x0000C8, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x0000CC, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetAbilityLevel_ReturnValue2) == 0x0000D0, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000D4, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000D8, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000DC, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x0000E0, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0000F8, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetAbilityLevel_ReturnValue3) == 0x000110, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetAbilityLevel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000118, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000128, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetAbilityLevel_ReturnValue4) == 0x00012C, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetAbilityLevel_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetValueAtLevel_ReturnValue) == 0x000130, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x000134, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetValueAtLevel_ReturnValue2) == 0x000138, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetValueAtLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00013C, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_GetActorInfo_ReturnValue) == 0x000148, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x000188, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000190, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000194, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000198, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3) == 0x00019C, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_FTrunc_ReturnValue) == 0x0001A4, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue4) == 0x0001A8, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin, CallFunc_K2_CommitAbility_ReturnValue) == 0x0001B0, "Member 'GA_Card_FlameOfZechin_C_ExecuteUbergraph_GA_Card_FlameOfZechin::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_Card_FlameOfZechin.GA_Card_FlameOfZechin_C.Cancelled_0497C8C7432A92365D98BE90F662A3DD
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_FlameOfZechin_C_Cancelled_0497C8C7432A92365D98BE90F662A3DD final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_FlameOfZechin_C_Cancelled_0497C8C7432A92365D98BE90F662A3DD) == 0x000008, "Wrong alignment on GA_Card_FlameOfZechin_C_Cancelled_0497C8C7432A92365D98BE90F662A3DD");
static_assert(sizeof(GA_Card_FlameOfZechin_C_Cancelled_0497C8C7432A92365D98BE90F662A3DD) == 0x000020, "Wrong size on GA_Card_FlameOfZechin_C_Cancelled_0497C8C7432A92365D98BE90F662A3DD");
static_assert(offsetof(GA_Card_FlameOfZechin_C_Cancelled_0497C8C7432A92365D98BE90F662A3DD, Targets) == 0x000000, "Member 'GA_Card_FlameOfZechin_C_Cancelled_0497C8C7432A92365D98BE90F662A3DD::Targets' has a wrong offset!");

// Function GA_Card_FlameOfZechin.GA_Card_FlameOfZechin_C.Confirmed_0497C8C7432A92365D98BE90F662A3DD
// 0x0020 (0x0020 - 0x0000)
struct GA_Card_FlameOfZechin_C_Confirmed_0497C8C7432A92365D98BE90F662A3DD final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Card_FlameOfZechin_C_Confirmed_0497C8C7432A92365D98BE90F662A3DD) == 0x000008, "Wrong alignment on GA_Card_FlameOfZechin_C_Confirmed_0497C8C7432A92365D98BE90F662A3DD");
static_assert(sizeof(GA_Card_FlameOfZechin_C_Confirmed_0497C8C7432A92365D98BE90F662A3DD) == 0x000020, "Wrong size on GA_Card_FlameOfZechin_C_Confirmed_0497C8C7432A92365D98BE90F662A3DD");
static_assert(offsetof(GA_Card_FlameOfZechin_C_Confirmed_0497C8C7432A92365D98BE90F662A3DD, Targets) == 0x000000, "Member 'GA_Card_FlameOfZechin_C_Confirmed_0497C8C7432A92365D98BE90F662A3DD::Targets' has a wrong offset!");

}

