#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Dragon_MeleeAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C
// 0x0030 (0x0BA0 - 0x0B70)
class UGA_Dragon_MeleeAttack_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           MeleeAttack1;                                      // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MeleeAttack3;                                      // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MeleeAttack2;                                      // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DoDamage;                                          // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Dragon_MeleeAttack(int32 EntryPoint);
	void Cancelled_6097B6A64D2690BAD88421811F88F028(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_6097B6A64D2690BAD88421811F88F028(const struct FGameplayAbilityTargetDataHandle& Targets);
	void K2_ActivateAbility();
	void OnBlendOut_75FEA4C04EAF9D2D479A37AE9B796247(class FName NotifyName);
	void OnBlendOut_7E7CA59C4642F2157BF4DDBDDFAF767C(class FName NotifyName);
	void OnBlendOut_90F9B1F045F76D5076A5C38EF46714A1(class FName NotifyName);
	void OnCancelled_75FEA4C04EAF9D2D479A37AE9B796247(class FName NotifyName);
	void OnCancelled_7E7CA59C4642F2157BF4DDBDDFAF767C(class FName NotifyName);
	void OnCancelled_90F9B1F045F76D5076A5C38EF46714A1(class FName NotifyName);
	void OnCompleted_75FEA4C04EAF9D2D479A37AE9B796247(class FName NotifyName);
	void OnCompleted_7E7CA59C4642F2157BF4DDBDDFAF767C(class FName NotifyName);
	void OnCompleted_90F9B1F045F76D5076A5C38EF46714A1(class FName NotifyName);
	void OnInterrupted_75FEA4C04EAF9D2D479A37AE9B796247(class FName NotifyName);
	void OnInterrupted_7E7CA59C4642F2157BF4DDBDDFAF767C(class FName NotifyName);
	void OnInterrupted_90F9B1F045F76D5076A5C38EF46714A1(class FName NotifyName);
	void OnNotifyBegin_75FEA4C04EAF9D2D479A37AE9B796247(class FName NotifyName);
	void OnNotifyBegin_7E7CA59C4642F2157BF4DDBDDFAF767C(class FName NotifyName);
	void OnNotifyBegin_90F9B1F045F76D5076A5C38EF46714A1(class FName NotifyName);
	void OnNotifyEnd_75FEA4C04EAF9D2D479A37AE9B796247(class FName NotifyName);
	void OnNotifyEnd_7E7CA59C4642F2157BF4DDBDDFAF767C(class FName NotifyName);
	void OnNotifyEnd_90F9B1F045F76D5076A5C38EF46714A1(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Dragon_MeleeAttack_C">();
	}
	static class UGA_Dragon_MeleeAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Dragon_MeleeAttack_C>();
	}
};
static_assert(alignof(UGA_Dragon_MeleeAttack_C) == 0x000010, "Wrong alignment on UGA_Dragon_MeleeAttack_C");
static_assert(sizeof(UGA_Dragon_MeleeAttack_C) == 0x000BA0, "Wrong size on UGA_Dragon_MeleeAttack_C");
static_assert(offsetof(UGA_Dragon_MeleeAttack_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Dragon_MeleeAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Dragon_MeleeAttack_C, MeleeAttack1) == 0x000B78, "Member 'UGA_Dragon_MeleeAttack_C::MeleeAttack1' has a wrong offset!");
static_assert(offsetof(UGA_Dragon_MeleeAttack_C, MeleeAttack3) == 0x000B80, "Member 'UGA_Dragon_MeleeAttack_C::MeleeAttack3' has a wrong offset!");
static_assert(offsetof(UGA_Dragon_MeleeAttack_C, MeleeAttack2) == 0x000B88, "Member 'UGA_Dragon_MeleeAttack_C::MeleeAttack2' has a wrong offset!");
static_assert(offsetof(UGA_Dragon_MeleeAttack_C, DoDamage) == 0x000B90, "Member 'UGA_Dragon_MeleeAttack_C::DoDamage' has a wrong offset!");

}

