#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Dragon_RangedAttack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.ExecuteUbergraph_GA_Dragon_RangedAttack
// 0x03F0 (0x03F0 - 0x0000)
struct GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName23;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName22;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName21;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName20;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName19;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile4;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile3;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate7;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile2;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate8;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate9;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       Temp_object_Variable;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate10;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName18;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName17;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName16;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate12;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName15;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate13;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName14;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate14;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName13;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate15;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable2;                               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate16;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName12;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName11;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate17;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName10;                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate18;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate19;            // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate20;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate21;            // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable3;                               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate22;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate23;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate24;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate25;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate26;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate27;            // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable4;                               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName24;                   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharAI_JungleBoss*                K2Node_DynamicCast_AsOrion_Char_AI_Jungle_Boss;    // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             CallFunc_GetCurrentTarget_ReturnValue;             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate28;            // 0x02F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0xF];                                      // 0x0301(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue2; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue3; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x0370(0x0030)(IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeOrionTargetData_ReturnValue;          // 0x03A0(0x0020)()
	class UOrionAbilityTask_SpawnProjectile*      CallFunc_SpawnProjectile_ReturnValue;              // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       CallFunc_BeginSpawningActor_SpawnedActor;          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D3[0x5];                                      // 0x03D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue4; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x03E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack) == 0x000010, "Wrong alignment on GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack");
static_assert(sizeof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack) == 0x0003F0, "Wrong size on GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, EntryPoint) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName23) == 0x000008, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName23' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName22) == 0x000020, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName22' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName21) == 0x000038, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName21' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName20) == 0x000050, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName20' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName19) == 0x000068, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName19' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate5) == 0x000070, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, Temp_name_Variable) == 0x000080, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate6) == 0x000088, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_SpawnedProjectile4) == 0x000098, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_SpawnedProjectile4' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_SpawnedProjectile3) == 0x0000A0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_SpawnedProjectile3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate7) == 0x0000A8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_SpawnedProjectile2) == 0x0000B8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_SpawnedProjectile2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate8) == 0x0000C0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_SpawnedProjectile) == 0x0000D0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate9) == 0x0000D8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, Temp_object_Variable) == 0x0000E8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate10) == 0x0000F0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName18) == 0x000100, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName18' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName17) == 0x000108, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName17' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate11) == 0x000110, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName16) == 0x000120, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName16' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate12) == 0x000128, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName15) == 0x000138, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName15' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate13) == 0x000140, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName14) == 0x000150, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName14' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate14) == 0x000158, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName13) == 0x000168, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName13' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate15) == 0x000170, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, Temp_name_Variable2) == 0x000180, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate16) == 0x000188, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName12) == 0x000198, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName12' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName11) == 0x0001A0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName11' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate17) == 0x0001A8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName10) == 0x0001B8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName10' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate18) == 0x0001C0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate18' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName9) == 0x0001D0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate19) == 0x0001D8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate19' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName8) == 0x0001E8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate20) == 0x0001F0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate20' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName7) == 0x000200, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate21) == 0x000208, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate21' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, Temp_name_Variable3) == 0x000218, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate22) == 0x000220, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate22' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName6) == 0x000230, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName5) == 0x000238, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate23) == 0x000240, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate23' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName4) == 0x000250, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate24) == 0x000258, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate24' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName3) == 0x000268, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate25) == 0x000270, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate25' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName2) == 0x000280, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate26) == 0x000288, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate26' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName) == 0x000298, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate27) == 0x0002A0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate27' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, Temp_name_Variable4) == 0x0002B0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CustomEvent_NotifyName24) == 0x0002B8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CustomEvent_NotifyName24' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0002C0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0002C8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_DynamicCast_AsOrion_Char_AI_Jungle_Boss) == 0x0002D0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_DynamicCast_AsOrion_Char_AI_Jungle_Boss' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_DynamicCast_bSuccess) == 0x0002D8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_SwitchInteger_CmpSuccess) == 0x0002D9, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_GetCurrentTarget_ReturnValue) == 0x0002E0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_GetCurrentTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_IsValid_ReturnValue) == 0x0002E8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, K2Node_CreateDelegate_OutputDelegate28) == 0x0002F0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::K2Node_CreateDelegate_OutputDelegate28' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_IsValid_ReturnValue2) == 0x000300, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_GetTransform_ReturnValue) == 0x000310, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000340, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue2) == 0x000348, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_IsValid_ReturnValue3) == 0x000350, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_IsValid_ReturnValue4) == 0x000351, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue3) == 0x000358, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x000360, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_GetTransform_ReturnValue2) == 0x000370, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_MakeOrionTargetData_ReturnValue) == 0x0003A0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_MakeOrionTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_SpawnProjectile_ReturnValue) == 0x0003C0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0003C8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_BeginSpawningActor_ReturnValue) == 0x0003D0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_IsValid_ReturnValue5) == 0x0003D1, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_IsValid_ReturnValue6) == 0x0003D2, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue4) == 0x0003D8, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0003E0, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_IsValid_ReturnValue7) == 0x0003E1, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0003E2, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x0003E3, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x0003E4, "Member 'GA_Dragon_RangedAttack_C_ExecuteUbergraph_GA_Dragon_RangedAttack::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025
// 0x0008 (0x0008 - 0x0000)
struct GA_Dragon_RangedAttack_C_FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025");
static_assert(sizeof(GA_Dragon_RangedAttack_C_FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025");
static_assert(offsetof(GA_Dragon_RangedAttack_C_FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025, SpawnedProjectile) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025::SpawnedProjectile' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.NotAuthority_6044C4CC4A54A0269E20AC836A2E0025
// 0x0008 (0x0008 - 0x0000)
struct GA_Dragon_RangedAttack_C_NotAuthority_6044C4CC4A54A0269E20AC836A2E0025 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_NotAuthority_6044C4CC4A54A0269E20AC836A2E0025) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_NotAuthority_6044C4CC4A54A0269E20AC836A2E0025");
static_assert(sizeof(GA_Dragon_RangedAttack_C_NotAuthority_6044C4CC4A54A0269E20AC836A2E0025) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_NotAuthority_6044C4CC4A54A0269E20AC836A2E0025");
static_assert(offsetof(GA_Dragon_RangedAttack_C_NotAuthority_6044C4CC4A54A0269E20AC836A2E0025, SpawnedProjectile) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_NotAuthority_6044C4CC4A54A0269E20AC836A2E0025::SpawnedProjectile' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnBlendOut_CF989AF248CC6899420915B31A7FD9E6
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnBlendOut_CF989AF248CC6899420915B31A7FD9E6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnBlendOut_CF989AF248CC6899420915B31A7FD9E6) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnBlendOut_CF989AF248CC6899420915B31A7FD9E6");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnBlendOut_CF989AF248CC6899420915B31A7FD9E6) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnBlendOut_CF989AF248CC6899420915B31A7FD9E6");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnBlendOut_CF989AF248CC6899420915B31A7FD9E6, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnBlendOut_CF989AF248CC6899420915B31A7FD9E6::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnCancelled_CF989AF248CC6899420915B31A7FD9E6
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnCancelled_CF989AF248CC6899420915B31A7FD9E6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnCancelled_CF989AF248CC6899420915B31A7FD9E6) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnCancelled_CF989AF248CC6899420915B31A7FD9E6");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnCancelled_CF989AF248CC6899420915B31A7FD9E6) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnCancelled_CF989AF248CC6899420915B31A7FD9E6");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnCancelled_CF989AF248CC6899420915B31A7FD9E6, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnCancelled_CF989AF248CC6899420915B31A7FD9E6::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnCompleted_CF989AF248CC6899420915B31A7FD9E6
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnCompleted_CF989AF248CC6899420915B31A7FD9E6 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnCompleted_CF989AF248CC6899420915B31A7FD9E6) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnCompleted_CF989AF248CC6899420915B31A7FD9E6");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnCompleted_CF989AF248CC6899420915B31A7FD9E6) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnCompleted_CF989AF248CC6899420915B31A7FD9E6");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnCompleted_CF989AF248CC6899420915B31A7FD9E6, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnCompleted_CF989AF248CC6899420915B31A7FD9E6::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_RangedAttack_C_OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154) == 0x000008, "Wrong alignment on GA_Dragon_RangedAttack_C_OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154");
static_assert(sizeof(GA_Dragon_RangedAttack_C_OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154) == 0x000008, "Wrong size on GA_Dragon_RangedAttack_C_OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154");
static_assert(offsetof(GA_Dragon_RangedAttack_C_OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154, NotifyName) == 0x000000, "Member 'GA_Dragon_RangedAttack_C_OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154::NotifyName' has a wrong offset!");

// Function GA_Dragon_RangedAttack.GA_Dragon_RangedAttack_C.OnInterrupted_CE0FEF3F424A7D58DEEDFF8C88DBAB45
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_RangedAttack_C_OnInterrupted_CE0FEF3F424A7D58DEEDFF8C88DBAB45 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
