#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Dragon_MeleeAttack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.ExecuteUbergraph_GA_Dragon_MeleeAttack
// 0x02B8 (0x02B8 - 0x0000)
struct GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName18;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName17;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName16;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName15;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName14;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName13;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x00A8(0x0020)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x00C8(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate7;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x00F8(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_NotifyName12;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName11;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName10;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate10;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate12;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate13;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable2;                               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate14;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate15;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate16;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate17;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate18;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate19;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable3;                               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate20;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue2; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue3; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack) == 0x0002B8, "Wrong size on GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, EntryPoint) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName18) == 0x000008, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName18' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName17) == 0x000010, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName17' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName16) == 0x000028, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName16' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName15) == 0x000040, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName15' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName14) == 0x000058, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName14' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName13) == 0x000070, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName13' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate5) == 0x000078, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, Temp_name_Variable) == 0x000088, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate6) == 0x000090, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A0, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_Targets2) == 0x0000A8, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_Targets) == 0x0000C8, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate7) == 0x0000E8, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, Temp_struct_Variable) == 0x0000F8, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_StartTargeting_ReturnValue) == 0x000118, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000128, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName12) == 0x000138, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName12' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate8) == 0x000140, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName11) == 0x000150, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName11' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate9) == 0x000158, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName10) == 0x000168, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName10' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate10) == 0x000170, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName9) == 0x000180, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate11) == 0x000188, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName8) == 0x000198, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate12) == 0x0001A0, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName7) == 0x0001B0, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate13) == 0x0001B8, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, Temp_name_Variable2) == 0x0001C8, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate14) == 0x0001D0, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0001E0, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName6) == 0x0001E8, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName5) == 0x0001F0, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate15) == 0x0001F8, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName4) == 0x000208, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate16) == 0x000210, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName3) == 0x000220, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate17) == 0x000228, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName2) == 0x000238, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate18) == 0x000240, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate18' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CustomEvent_NotifyName) == 0x000250, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate19) == 0x000258, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate19' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, Temp_name_Variable3) == 0x000268, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x000270, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_CreateDelegate_OutputDelegate20) == 0x000278, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_CreateDelegate_OutputDelegate20' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000288, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, K2Node_SwitchInteger_CmpSuccess) == 0x00028C, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000290, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue2) == 0x000298, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_IsValid_ReturnValue2) == 0x0002A0, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_IsValid_ReturnValue3) == 0x0002A1, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue3) == 0x0002A8, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack, CallFunc_IsValid_ReturnValue4) == 0x0002B0, "Member 'GA_Dragon_MeleeAttack_C_ExecuteUbergraph_GA_Dragon_MeleeAttack::CallFunc_IsValid_ReturnValue4' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.Cancelled_6097B6A64D2690BAD88421811F88F028
// 0x0020 (0x0020 - 0x0000)
struct GA_Dragon_MeleeAttack_C_Cancelled_6097B6A64D2690BAD88421811F88F028 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_Cancelled_6097B6A64D2690BAD88421811F88F028) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_Cancelled_6097B6A64D2690BAD88421811F88F028");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_Cancelled_6097B6A64D2690BAD88421811F88F028) == 0x000020, "Wrong size on GA_Dragon_MeleeAttack_C_Cancelled_6097B6A64D2690BAD88421811F88F028");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_Cancelled_6097B6A64D2690BAD88421811F88F028, Targets) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_Cancelled_6097B6A64D2690BAD88421811F88F028::Targets' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.Confirmed_6097B6A64D2690BAD88421811F88F028
// 0x0020 (0x0020 - 0x0000)
struct GA_Dragon_MeleeAttack_C_Confirmed_6097B6A64D2690BAD88421811F88F028 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_Confirmed_6097B6A64D2690BAD88421811F88F028) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_Confirmed_6097B6A64D2690BAD88421811F88F028");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_Confirmed_6097B6A64D2690BAD88421811F88F028) == 0x000020, "Wrong size on GA_Dragon_MeleeAttack_C_Confirmed_6097B6A64D2690BAD88421811F88F028");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_Confirmed_6097B6A64D2690BAD88421811F88F028, Targets) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_Confirmed_6097B6A64D2690BAD88421811F88F028::Targets' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnBlendOut_75FEA4C04EAF9D2D479A37AE9B796247
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnBlendOut_75FEA4C04EAF9D2D479A37AE9B796247 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnBlendOut_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnBlendOut_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnBlendOut_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnBlendOut_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnBlendOut_75FEA4C04EAF9D2D479A37AE9B796247, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnBlendOut_75FEA4C04EAF9D2D479A37AE9B796247::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnBlendOut_7E7CA59C4642F2157BF4DDBDDFAF767C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnBlendOut_7E7CA59C4642F2157BF4DDBDDFAF767C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnBlendOut_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnBlendOut_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnBlendOut_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnBlendOut_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnBlendOut_7E7CA59C4642F2157BF4DDBDDFAF767C, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnBlendOut_7E7CA59C4642F2157BF4DDBDDFAF767C::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnBlendOut_90F9B1F045F76D5076A5C38EF46714A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnBlendOut_90F9B1F045F76D5076A5C38EF46714A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnBlendOut_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnBlendOut_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnBlendOut_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnBlendOut_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnBlendOut_90F9B1F045F76D5076A5C38EF46714A1, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnBlendOut_90F9B1F045F76D5076A5C38EF46714A1::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnCancelled_75FEA4C04EAF9D2D479A37AE9B796247
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnCancelled_75FEA4C04EAF9D2D479A37AE9B796247 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnCancelled_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnCancelled_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnCancelled_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnCancelled_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnCancelled_75FEA4C04EAF9D2D479A37AE9B796247, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnCancelled_75FEA4C04EAF9D2D479A37AE9B796247::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnCancelled_7E7CA59C4642F2157BF4DDBDDFAF767C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnCancelled_7E7CA59C4642F2157BF4DDBDDFAF767C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnCancelled_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnCancelled_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnCancelled_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnCancelled_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnCancelled_7E7CA59C4642F2157BF4DDBDDFAF767C, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnCancelled_7E7CA59C4642F2157BF4DDBDDFAF767C::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnCancelled_90F9B1F045F76D5076A5C38EF46714A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnCancelled_90F9B1F045F76D5076A5C38EF46714A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnCancelled_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnCancelled_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnCancelled_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnCancelled_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnCancelled_90F9B1F045F76D5076A5C38EF46714A1, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnCancelled_90F9B1F045F76D5076A5C38EF46714A1::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnCompleted_75FEA4C04EAF9D2D479A37AE9B796247
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnCompleted_75FEA4C04EAF9D2D479A37AE9B796247 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnCompleted_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnCompleted_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnCompleted_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnCompleted_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnCompleted_75FEA4C04EAF9D2D479A37AE9B796247, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnCompleted_75FEA4C04EAF9D2D479A37AE9B796247::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnCompleted_7E7CA59C4642F2157BF4DDBDDFAF767C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnCompleted_7E7CA59C4642F2157BF4DDBDDFAF767C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnCompleted_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnCompleted_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnCompleted_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnCompleted_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnCompleted_7E7CA59C4642F2157BF4DDBDDFAF767C, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnCompleted_7E7CA59C4642F2157BF4DDBDDFAF767C::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnCompleted_90F9B1F045F76D5076A5C38EF46714A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnCompleted_90F9B1F045F76D5076A5C38EF46714A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnCompleted_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnCompleted_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnCompleted_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnCompleted_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnCompleted_90F9B1F045F76D5076A5C38EF46714A1, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnCompleted_90F9B1F045F76D5076A5C38EF46714A1::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnInterrupted_75FEA4C04EAF9D2D479A37AE9B796247
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnInterrupted_75FEA4C04EAF9D2D479A37AE9B796247 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnInterrupted_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnInterrupted_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnInterrupted_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnInterrupted_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnInterrupted_75FEA4C04EAF9D2D479A37AE9B796247, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnInterrupted_75FEA4C04EAF9D2D479A37AE9B796247::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnInterrupted_7E7CA59C4642F2157BF4DDBDDFAF767C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnInterrupted_7E7CA59C4642F2157BF4DDBDDFAF767C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnInterrupted_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnInterrupted_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnInterrupted_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnInterrupted_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnInterrupted_7E7CA59C4642F2157BF4DDBDDFAF767C, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnInterrupted_7E7CA59C4642F2157BF4DDBDDFAF767C::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnInterrupted_90F9B1F045F76D5076A5C38EF46714A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnInterrupted_90F9B1F045F76D5076A5C38EF46714A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnInterrupted_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnInterrupted_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnInterrupted_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnInterrupted_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnInterrupted_90F9B1F045F76D5076A5C38EF46714A1, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnInterrupted_90F9B1F045F76D5076A5C38EF46714A1::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnNotifyBegin_75FEA4C04EAF9D2D479A37AE9B796247
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnNotifyBegin_75FEA4C04EAF9D2D479A37AE9B796247 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnNotifyBegin_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnNotifyBegin_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnNotifyBegin_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnNotifyBegin_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnNotifyBegin_75FEA4C04EAF9D2D479A37AE9B796247, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnNotifyBegin_75FEA4C04EAF9D2D479A37AE9B796247::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnNotifyBegin_7E7CA59C4642F2157BF4DDBDDFAF767C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnNotifyBegin_7E7CA59C4642F2157BF4DDBDDFAF767C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnNotifyBegin_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnNotifyBegin_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnNotifyBegin_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnNotifyBegin_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnNotifyBegin_7E7CA59C4642F2157BF4DDBDDFAF767C, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnNotifyBegin_7E7CA59C4642F2157BF4DDBDDFAF767C::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnNotifyBegin_90F9B1F045F76D5076A5C38EF46714A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnNotifyBegin_90F9B1F045F76D5076A5C38EF46714A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnNotifyBegin_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnNotifyBegin_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnNotifyBegin_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnNotifyBegin_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnNotifyBegin_90F9B1F045F76D5076A5C38EF46714A1, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnNotifyBegin_90F9B1F045F76D5076A5C38EF46714A1::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnNotifyEnd_75FEA4C04EAF9D2D479A37AE9B796247
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnNotifyEnd_75FEA4C04EAF9D2D479A37AE9B796247 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnNotifyEnd_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnNotifyEnd_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnNotifyEnd_75FEA4C04EAF9D2D479A37AE9B796247) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnNotifyEnd_75FEA4C04EAF9D2D479A37AE9B796247");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnNotifyEnd_75FEA4C04EAF9D2D479A37AE9B796247, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnNotifyEnd_75FEA4C04EAF9D2D479A37AE9B796247::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnNotifyEnd_7E7CA59C4642F2157BF4DDBDDFAF767C
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnNotifyEnd_7E7CA59C4642F2157BF4DDBDDFAF767C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnNotifyEnd_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnNotifyEnd_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnNotifyEnd_7E7CA59C4642F2157BF4DDBDDFAF767C) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnNotifyEnd_7E7CA59C4642F2157BF4DDBDDFAF767C");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnNotifyEnd_7E7CA59C4642F2157BF4DDBDDFAF767C, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnNotifyEnd_7E7CA59C4642F2157BF4DDBDDFAF767C::NotifyName' has a wrong offset!");

// Function GA_Dragon_MeleeAttack.GA_Dragon_MeleeAttack_C.OnNotifyEnd_90F9B1F045F76D5076A5C38EF46714A1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Dragon_MeleeAttack_C_OnNotifyEnd_90F9B1F045F76D5076A5C38EF46714A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Dragon_MeleeAttack_C_OnNotifyEnd_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong alignment on GA_Dragon_MeleeAttack_C_OnNotifyEnd_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(sizeof(GA_Dragon_MeleeAttack_C_OnNotifyEnd_90F9B1F045F76D5076A5C38EF46714A1) == 0x000008, "Wrong size on GA_Dragon_MeleeAttack_C_OnNotifyEnd_90F9B1F045F76D5076A5C38EF46714A1");
static_assert(offsetof(GA_Dragon_MeleeAttack_C_OnNotifyEnd_90F9B1F045F76D5076A5C38EF46714A1, NotifyName) == 0x000000, "Member 'GA_Dragon_MeleeAttack_C_OnNotifyEnd_90F9B1F045F76D5076A5C38EF46714A1::NotifyName' has a wrong offset!");

}

