#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_OverpoweredSpells

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Gem_OverpoweredSpells.GA_Gem_OverpoweredSpells_C
// 0x0080 (0x0BF0 - 0x0B70)
class UGA_Gem_OverpoweredSpells_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 BonusDamageGE;                                     // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PercentCostIncrease;                               // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               TagReqs;                                           // 0x0B88(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ValuePercentCostIncrease;                          // 0x0BC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Gem_OverpoweredSpells(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Gem_OverpoweredSpells_C">();
	}
	static class UGA_Gem_OverpoweredSpells_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Gem_OverpoweredSpells_C>();
	}
};
static_assert(alignof(UGA_Gem_OverpoweredSpells_C) == 0x000010, "Wrong alignment on UGA_Gem_OverpoweredSpells_C");
static_assert(sizeof(UGA_Gem_OverpoweredSpells_C) == 0x000BF0, "Wrong size on UGA_Gem_OverpoweredSpells_C");
static_assert(offsetof(UGA_Gem_OverpoweredSpells_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Gem_OverpoweredSpells_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Gem_OverpoweredSpells_C, BonusDamageGE) == 0x000B78, "Member 'UGA_Gem_OverpoweredSpells_C::BonusDamageGE' has a wrong offset!");
static_assert(offsetof(UGA_Gem_OverpoweredSpells_C, PercentCostIncrease) == 0x000B80, "Member 'UGA_Gem_OverpoweredSpells_C::PercentCostIncrease' has a wrong offset!");
static_assert(offsetof(UGA_Gem_OverpoweredSpells_C, TagReqs) == 0x000B88, "Member 'UGA_Gem_OverpoweredSpells_C::TagReqs' has a wrong offset!");
static_assert(offsetof(UGA_Gem_OverpoweredSpells_C, ValuePercentCostIncrease) == 0x000BC8, "Member 'UGA_Gem_OverpoweredSpells_C::ValuePercentCostIncrease' has a wrong offset!");

}

