#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_ManaReactor

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Gem_ManaReactor.GA_Gem_ManaReactor_C.ExecuteUbergraph_GA_Gem_ManaReactor
// 0x0120 (0x0120 - 0x0000)
struct GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x0010(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0038(0x0018)()
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0060(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable2;                             // 0x0078(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageTaken_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue3;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x00D8(0x0018)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue2;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0100(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor) == 0x000008, "Wrong alignment on GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor");
static_assert(sizeof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor) == 0x000120, "Wrong size on GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, EntryPoint) == 0x000000, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, K2Node_CustomEvent_AuxillaryASC) == 0x000008, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, K2Node_CustomEvent_DamageInfo) == 0x000010, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, K2Node_CustomEvent_SpecHandle) == 0x000038, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, Temp_struct_Variable) == 0x000060, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, Temp_struct_Variable2) == 0x000078, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, Temp_object_Variable) == 0x0000A0, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_GetAbilityLevel_ReturnValue) == 0x0000A8, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_WaitDamageTaken_ReturnValue) == 0x0000B0, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_WaitDamageTaken_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000B8, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_IsValid_ReturnValue) == 0x0000BC, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000C0, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_GetAbilityLevel_ReturnValue2) == 0x0000C4, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_GetAbilityLevel_ReturnValue3) == 0x0000C8, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_GetAbilityLevel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x0000CC, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x0000D0, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x0000D8, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_GetValueAtLevel_ReturnValue2) == 0x0000F0, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_GetValueAtLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000F4, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F8, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_Abs_ReturnValue) == 0x0000FC, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000100, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000118, "Member 'GA_Gem_ManaReactor_C_ExecuteUbergraph_GA_Gem_ManaReactor::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function GA_Gem_ManaReactor.GA_Gem_ManaReactor_C.OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39
// 0x0048 (0x0048 - 0x0000)
struct GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39 final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39) == 0x000008, "Wrong alignment on GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39");
static_assert(sizeof(GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39) == 0x000048, "Wrong size on GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39");
static_assert(offsetof(GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39, AuxillaryASC) == 0x000000, "Member 'GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39, DamageInfo) == 0x000008, "Member 'GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39, SpecHandle) == 0x000030, "Member 'GA_Gem_ManaReactor_C_OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39::SpecHandle' has a wrong offset!");

}

