#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_OverpoweredSpells

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Gem_OverpoweredSpells.GA_Gem_OverpoweredSpells_C.ExecuteUbergraph_GA_Gem_OverpoweredSpells
// 0x00D8 (0x00D8 - 0x0000)
struct GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Source;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0010(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable2;                             // 0x0048(0x0018)()
	float                                         CallFunc_GetModifiedAttributeMagnitude_ReturnValue; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0070(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEffectApplied_Self* CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x00A0(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue2;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells) == 0x000008, "Wrong alignment on GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells");
static_assert(sizeof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells) == 0x0000D8, "Wrong size on GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, EntryPoint) == 0x000000, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_GetAbilityLevel_ReturnValue) == 0x000004, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, K2Node_CustomEvent_Source) == 0x000008, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, K2Node_CustomEvent_SpecHandle) == 0x000010, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, K2Node_CustomEvent_ActiveHandle) == 0x000028, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, Temp_struct_Variable) == 0x000040, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, Temp_struct_Variable2) == 0x000048, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_GetModifiedAttributeMagnitude_ReturnValue) == 0x000060, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_GetModifiedAttributeMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, Temp_object_Variable) == 0x000068, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000070, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000088, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000090, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue) == 0x000098, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_WaitGameplayEffectAppliedToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0000A0, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x0000B8, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_GetAbilityLevel_ReturnValue2) == 0x0000C4, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_GetAbilityLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000C8, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000CC, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D0, "Member 'GA_Gem_OverpoweredSpells_C_ExecuteUbergraph_GA_Gem_OverpoweredSpells::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function GA_Gem_OverpoweredSpells.GA_Gem_OverpoweredSpells_C.OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7
// 0x0028 (0x0028 - 0x0000)
struct GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7 final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7) == 0x000008, "Wrong alignment on GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7");
static_assert(sizeof(GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7) == 0x000028, "Wrong size on GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7, Source) == 0x000000, "Member 'GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7::Source' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7, SpecHandle) == 0x000008, "Member 'GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7, ActiveHandle) == 0x000020, "Member 'GA_Gem_OverpoweredSpells_C_OnApplied_BA7A8E6A4D0D8C46293A68B68F0AA7D7::ActiveHandle' has a wrong offset!");

}

