#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_Multishot

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"


namespace SDK::Params
{

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.ExecuteUbergraph_GA_Gem_Multishot
// 0x0360 (0x0360 - 0x0000)
struct GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile8;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile7;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile6;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile5;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       Temp_object_Variable2;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAbilityCommit*         CallFunc_WaitForAbilityCommit_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate7;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile4;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile3;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate8;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile2;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate9;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate10;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       Temp_object_Variable3;                             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate11;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x0138(0x0020)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0158(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate12;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0188(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_SpawnProjectile*      CallFunc_SpawnProjectile_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       CallFunc_BeginSpawningActor_SpawnedActor;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Target, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate14;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0200(0x0018)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable2;                             // 0x0220(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable3;                             // 0x0228(0x0018)()
	class AActor*                                 Temp_object_Variable4;                             // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionAbilityTargetDataFilter          K2Node_MakeStruct_OrionAbilityTargetDataFilter;    // 0x0248(0x0030)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0278(0x0020)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IOrionTeamActorInterface> K2Node_DynamicCast_AsOrion_Team_Actor_Interface;   // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOrionTeam                                    CallFunc_GetTeamNum_ReturnValue;                   // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x02B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	EOrionTeam                                    Temp_byte_Variable;                                // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeOrionFilterHandle_ReturnValue;        // 0x02C0(0x0010)()
	class UAbilityTask_WaitGameplayEffectApplied_Target* CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x02D8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x02F0(0x0040)(ContainsInstancedReference)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnProjectile*      CallFunc_SpawnProjectile_ReturnValue2;             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       CallFunc_BeginSpawningActor_SpawnedActor2;         // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue2;          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate15;            // 0x0350(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot");
static_assert(sizeof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot) == 0x000360, "Wrong size on GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, EntryPoint) == 0x000000, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_SpawnedProjectile8) == 0x000008, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_SpawnedProjectile8' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_SpawnedProjectile7) == 0x000010, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_SpawnedProjectile7' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_SpawnedProjectile6) == 0x000028, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_SpawnedProjectile6' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_SpawnedProjectile5) == 0x000040, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_SpawnedProjectile5' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, Temp_object_Variable) == 0x000058, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_ActivatedAbility) == 0x000070, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, Temp_object_Variable2) == 0x000078, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_WaitForAbilityCommit_ReturnValue) == 0x000080, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_WaitForAbilityCommit_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate5) == 0x000090, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate6) == 0x0000A0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_StartAbilityState_ReturnValue) == 0x0000B0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_IsValid_ReturnValue2) == 0x0000C8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_SpawnedProjectile4) == 0x0000D0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_SpawnedProjectile4' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_SpawnedProjectile3) == 0x0000D8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_SpawnedProjectile3' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate8) == 0x0000E0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_SpawnedProjectile2) == 0x0000F0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_SpawnedProjectile2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate9) == 0x0000F8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_SpawnedProjectile) == 0x000108, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate10) == 0x000110, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, Temp_object_Variable3) == 0x000120, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate11) == 0x000128, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_Targets2) == 0x000138, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_Targets) == 0x000158, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate12) == 0x000178, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, Temp_struct_Variable) == 0x000188, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_StartTargeting_ReturnValue) == 0x0001A8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_SpawnProjectile_ReturnValue) == 0x0001B0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0001B8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_BeginSpawningActor_ReturnValue) == 0x0001C0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_IsValid_ReturnValue3) == 0x0001C1, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_IsValid_ReturnValue4) == 0x0001C2, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate13) == 0x0001C8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_WaitDelay_ReturnValue) == 0x0001D8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate14) == 0x0001E0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_IsValid_ReturnValue5) == 0x0001F0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_Target) == 0x0001F8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_SpecHandle) == 0x000200, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CustomEvent_ActiveHandle) == 0x000218, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, Temp_struct_Variable2) == 0x000220, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, Temp_struct_Variable3) == 0x000228, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, Temp_object_Variable4) == 0x000240, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_MakeStruct_OrionAbilityTargetDataFilter) == 0x000248, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_MakeStruct_OrionAbilityTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000278, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000298, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_DynamicCast_AsOrion_Team_Actor_Interface) == 0x0002A0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_DynamicCast_AsOrion_Team_Actor_Interface' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_DynamicCast_bSuccess) == 0x0002B0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_GetTeamNum_ReturnValue) == 0x0002B1, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0002B4, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, Temp_byte_Variable) == 0x0002BC, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_MakeOrionFilterHandle_ReturnValue) == 0x0002C0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_MakeOrionFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue) == 0x0002D0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_WaitGameplayEffectAppliedToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0002D8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_IsValid_ReturnValue6) == 0x0002E8, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_GetActorInfo_ReturnValue) == 0x0002F0, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000330, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_SpawnProjectile_ReturnValue2) == 0x000338, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_SpawnProjectile_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_BeginSpawningActor_SpawnedActor2) == 0x000340, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_BeginSpawningActor_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_BeginSpawningActor_ReturnValue2) == 0x000348, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_BeginSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, CallFunc_IsValid_ReturnValue7) == 0x000349, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot, K2Node_CreateDelegate_OutputDelegate15) == 0x000350, "Member 'GA_Gem_Multishot_C_ExecuteUbergraph_GA_Gem_Multishot::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.Cancelled_D6793ECB4467D062B26970A8A398E783
// 0x0020 (0x0020 - 0x0000)
struct GA_Gem_Multishot_C_Cancelled_D6793ECB4467D062B26970A8A398E783 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Gem_Multishot_C_Cancelled_D6793ECB4467D062B26970A8A398E783) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_Cancelled_D6793ECB4467D062B26970A8A398E783");
static_assert(sizeof(GA_Gem_Multishot_C_Cancelled_D6793ECB4467D062B26970A8A398E783) == 0x000020, "Wrong size on GA_Gem_Multishot_C_Cancelled_D6793ECB4467D062B26970A8A398E783");
static_assert(offsetof(GA_Gem_Multishot_C_Cancelled_D6793ECB4467D062B26970A8A398E783, Targets) == 0x000000, "Member 'GA_Gem_Multishot_C_Cancelled_D6793ECB4467D062B26970A8A398E783::Targets' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.Confirmed_D6793ECB4467D062B26970A8A398E783
// 0x0020 (0x0020 - 0x0000)
struct GA_Gem_Multishot_C_Confirmed_D6793ECB4467D062B26970A8A398E783 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Gem_Multishot_C_Confirmed_D6793ECB4467D062B26970A8A398E783) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_Confirmed_D6793ECB4467D062B26970A8A398E783");
static_assert(sizeof(GA_Gem_Multishot_C_Confirmed_D6793ECB4467D062B26970A8A398E783) == 0x000020, "Wrong size on GA_Gem_Multishot_C_Confirmed_D6793ECB4467D062B26970A8A398E783");
static_assert(offsetof(GA_Gem_Multishot_C_Confirmed_D6793ECB4467D062B26970A8A398E783, Targets) == 0x000000, "Member 'GA_Gem_Multishot_C_Confirmed_D6793ECB4467D062B26970A8A398E783::Targets' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.FailedToSpawn_11A6B006442BEC7D9B52CE8B15EB2589
// 0x0008 (0x0008 - 0x0000)
struct GA_Gem_Multishot_C_FailedToSpawn_11A6B006442BEC7D9B52CE8B15EB2589 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_FailedToSpawn_11A6B006442BEC7D9B52CE8B15EB2589) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_FailedToSpawn_11A6B006442BEC7D9B52CE8B15EB2589");
static_assert(sizeof(GA_Gem_Multishot_C_FailedToSpawn_11A6B006442BEC7D9B52CE8B15EB2589) == 0x000008, "Wrong size on GA_Gem_Multishot_C_FailedToSpawn_11A6B006442BEC7D9B52CE8B15EB2589");
static_assert(offsetof(GA_Gem_Multishot_C_FailedToSpawn_11A6B006442BEC7D9B52CE8B15EB2589, SpawnedProjectile) == 0x000000, "Member 'GA_Gem_Multishot_C_FailedToSpawn_11A6B006442BEC7D9B52CE8B15EB2589::SpawnedProjectile' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.FailedToSpawn_DCE7B60940582C24480875BF898DD4FF
// 0x0008 (0x0008 - 0x0000)
struct GA_Gem_Multishot_C_FailedToSpawn_DCE7B60940582C24480875BF898DD4FF final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_FailedToSpawn_DCE7B60940582C24480875BF898DD4FF) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_FailedToSpawn_DCE7B60940582C24480875BF898DD4FF");
static_assert(sizeof(GA_Gem_Multishot_C_FailedToSpawn_DCE7B60940582C24480875BF898DD4FF) == 0x000008, "Wrong size on GA_Gem_Multishot_C_FailedToSpawn_DCE7B60940582C24480875BF898DD4FF");
static_assert(offsetof(GA_Gem_Multishot_C_FailedToSpawn_DCE7B60940582C24480875BF898DD4FF, SpawnedProjectile) == 0x000000, "Member 'GA_Gem_Multishot_C_FailedToSpawn_DCE7B60940582C24480875BF898DD4FF::SpawnedProjectile' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.NotAuthority_11A6B006442BEC7D9B52CE8B15EB2589
// 0x0008 (0x0008 - 0x0000)
struct GA_Gem_Multishot_C_NotAuthority_11A6B006442BEC7D9B52CE8B15EB2589 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_NotAuthority_11A6B006442BEC7D9B52CE8B15EB2589) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_NotAuthority_11A6B006442BEC7D9B52CE8B15EB2589");
static_assert(sizeof(GA_Gem_Multishot_C_NotAuthority_11A6B006442BEC7D9B52CE8B15EB2589) == 0x000008, "Wrong size on GA_Gem_Multishot_C_NotAuthority_11A6B006442BEC7D9B52CE8B15EB2589");
static_assert(offsetof(GA_Gem_Multishot_C_NotAuthority_11A6B006442BEC7D9B52CE8B15EB2589, SpawnedProjectile) == 0x000000, "Member 'GA_Gem_Multishot_C_NotAuthority_11A6B006442BEC7D9B52CE8B15EB2589::SpawnedProjectile' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.NotAuthority_DCE7B60940582C24480875BF898DD4FF
// 0x0008 (0x0008 - 0x0000)
struct GA_Gem_Multishot_C_NotAuthority_DCE7B60940582C24480875BF898DD4FF final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_NotAuthority_DCE7B60940582C24480875BF898DD4FF) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_NotAuthority_DCE7B60940582C24480875BF898DD4FF");
static_assert(sizeof(GA_Gem_Multishot_C_NotAuthority_DCE7B60940582C24480875BF898DD4FF) == 0x000008, "Wrong size on GA_Gem_Multishot_C_NotAuthority_DCE7B60940582C24480875BF898DD4FF");
static_assert(offsetof(GA_Gem_Multishot_C_NotAuthority_DCE7B60940582C24480875BF898DD4FF, SpawnedProjectile) == 0x000000, "Member 'GA_Gem_Multishot_C_NotAuthority_DCE7B60940582C24480875BF898DD4FF::SpawnedProjectile' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0
// 0x0028 (0x0028 - 0x0000)
struct GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0 final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0");
static_assert(sizeof(GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0) == 0x000028, "Wrong size on GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0");
static_assert(offsetof(GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0, Target) == 0x000000, "Member 'GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0::Target' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0, SpecHandle) == 0x000008, "Member 'GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0, ActiveHandle) == 0x000020, "Member 'GA_Gem_Multishot_C_OnApplied_E84C8E9C4A7E8EE6FBCB5F8D547474F0::ActiveHandle' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.OnCommit_9115CBA0403119C43D334FA4874F7ABF
// 0x0008 (0x0008 - 0x0000)
struct GA_Gem_Multishot_C_OnCommit_9115CBA0403119C43D334FA4874F7ABF final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_OnCommit_9115CBA0403119C43D334FA4874F7ABF) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_OnCommit_9115CBA0403119C43D334FA4874F7ABF");
static_assert(sizeof(GA_Gem_Multishot_C_OnCommit_9115CBA0403119C43D334FA4874F7ABF) == 0x000008, "Wrong size on GA_Gem_Multishot_C_OnCommit_9115CBA0403119C43D334FA4874F7ABF");
static_assert(offsetof(GA_Gem_Multishot_C_OnCommit_9115CBA0403119C43D334FA4874F7ABF, ActivatedAbility) == 0x000000, "Member 'GA_Gem_Multishot_C_OnCommit_9115CBA0403119C43D334FA4874F7ABF::ActivatedAbility' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.PreSpawned_11A6B006442BEC7D9B52CE8B15EB2589
// 0x0008 (0x0008 - 0x0000)
struct GA_Gem_Multishot_C_PreSpawned_11A6B006442BEC7D9B52CE8B15EB2589 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_PreSpawned_11A6B006442BEC7D9B52CE8B15EB2589) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_PreSpawned_11A6B006442BEC7D9B52CE8B15EB2589");
static_assert(sizeof(GA_Gem_Multishot_C_PreSpawned_11A6B006442BEC7D9B52CE8B15EB2589) == 0x000008, "Wrong size on GA_Gem_Multishot_C_PreSpawned_11A6B006442BEC7D9B52CE8B15EB2589");
static_assert(offsetof(GA_Gem_Multishot_C_PreSpawned_11A6B006442BEC7D9B52CE8B15EB2589, SpawnedProjectile) == 0x000000, "Member 'GA_Gem_Multishot_C_PreSpawned_11A6B006442BEC7D9B52CE8B15EB2589::SpawnedProjectile' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.PreSpawned_DCE7B60940582C24480875BF898DD4FF
// 0x0008 (0x0008 - 0x0000)
struct GA_Gem_Multishot_C_PreSpawned_DCE7B60940582C24480875BF898DD4FF final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_PreSpawned_DCE7B60940582C24480875BF898DD4FF) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_PreSpawned_DCE7B60940582C24480875BF898DD4FF");
static_assert(sizeof(GA_Gem_Multishot_C_PreSpawned_DCE7B60940582C24480875BF898DD4FF) == 0x000008, "Wrong size on GA_Gem_Multishot_C_PreSpawned_DCE7B60940582C24480875BF898DD4FF");
static_assert(offsetof(GA_Gem_Multishot_C_PreSpawned_DCE7B60940582C24480875BF898DD4FF, SpawnedProjectile) == 0x000000, "Member 'GA_Gem_Multishot_C_PreSpawned_DCE7B60940582C24480875BF898DD4FF::SpawnedProjectile' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.Success_11A6B006442BEC7D9B52CE8B15EB2589
// 0x0008 (0x0008 - 0x0000)
struct GA_Gem_Multishot_C_Success_11A6B006442BEC7D9B52CE8B15EB2589 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_Success_11A6B006442BEC7D9B52CE8B15EB2589) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_Success_11A6B006442BEC7D9B52CE8B15EB2589");
static_assert(sizeof(GA_Gem_Multishot_C_Success_11A6B006442BEC7D9B52CE8B15EB2589) == 0x000008, "Wrong size on GA_Gem_Multishot_C_Success_11A6B006442BEC7D9B52CE8B15EB2589");
static_assert(offsetof(GA_Gem_Multishot_C_Success_11A6B006442BEC7D9B52CE8B15EB2589, SpawnedProjectile) == 0x000000, "Member 'GA_Gem_Multishot_C_Success_11A6B006442BEC7D9B52CE8B15EB2589::SpawnedProjectile' has a wrong offset!");

// Function GA_Gem_Multishot.GA_Gem_Multishot_C.Success_DCE7B60940582C24480875BF898DD4FF
// 0x0008 (0x0008 - 0x0000)
struct GA_Gem_Multishot_C_Success_DCE7B60940582C24480875BF898DD4FF final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Multishot_C_Success_DCE7B60940582C24480875BF898DD4FF) == 0x000008, "Wrong alignment on GA_Gem_Multishot_C_Success_DCE7B60940582C24480875BF898DD4FF");
static_assert(sizeof(GA_Gem_Multishot_C_Success_DCE7B60940582C24480875BF898DD4FF) == 0x000008, "Wrong size on GA_Gem_Multishot_C_Success_DCE7B60940582C24480875BF898DD4FF");
static_assert(offsetof(GA_Gem_Multishot_C_Success_DCE7B60940582C24480875BF898DD4FF, SpawnedProjectile) == 0x000000, "Member 'GA_Gem_Multishot_C_Success_DCE7B60940582C24480875BF898DD4FF::SpawnedProjectile' has a wrong offset!");

}

