#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_ManaReactor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Gem_ManaReactor.GA_Gem_ManaReactor_C
// 0x00F0 (0x0C60 - 0x0B70)
class UGA_Gem_ManaReactor_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 GE_ToApply;                                        // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ManaToRestore;                                     // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageQualifierKeywordsWithContext    DamageQualifier;                                   // 0x0B88(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ManaToRestoreValue;                                // 0x0C00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DamageToTake;                                      // 0x0C28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2C[0x4];                                      // 0x0C2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DamageToTakeValue;                                 // 0x0C30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Gem_ManaReactor(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnDamage_6EF19C2A464A2B7F6F56B4ACFA6C9B39(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Gem_ManaReactor_C">();
	}
	static class UGA_Gem_ManaReactor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Gem_ManaReactor_C>();
	}
};
static_assert(alignof(UGA_Gem_ManaReactor_C) == 0x000010, "Wrong alignment on UGA_Gem_ManaReactor_C");
static_assert(sizeof(UGA_Gem_ManaReactor_C) == 0x000C60, "Wrong size on UGA_Gem_ManaReactor_C");
static_assert(offsetof(UGA_Gem_ManaReactor_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Gem_ManaReactor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Gem_ManaReactor_C, GE_ToApply) == 0x000B78, "Member 'UGA_Gem_ManaReactor_C::GE_ToApply' has a wrong offset!");
static_assert(offsetof(UGA_Gem_ManaReactor_C, ManaToRestore) == 0x000B80, "Member 'UGA_Gem_ManaReactor_C::ManaToRestore' has a wrong offset!");
static_assert(offsetof(UGA_Gem_ManaReactor_C, DamageQualifier) == 0x000B88, "Member 'UGA_Gem_ManaReactor_C::DamageQualifier' has a wrong offset!");
static_assert(offsetof(UGA_Gem_ManaReactor_C, ManaToRestoreValue) == 0x000C00, "Member 'UGA_Gem_ManaReactor_C::ManaToRestoreValue' has a wrong offset!");
static_assert(offsetof(UGA_Gem_ManaReactor_C, DamageToTake) == 0x000C28, "Member 'UGA_Gem_ManaReactor_C::DamageToTake' has a wrong offset!");
static_assert(offsetof(UGA_Gem_ManaReactor_C, DamageToTakeValue) == 0x000C30, "Member 'UGA_Gem_ManaReactor_C::DamageToTakeValue' has a wrong offset!");

}

