#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Gem_Ruthless

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Gem_Ruthless.GA_Gem_Ruthless_C.ExecuteUbergraph_GA_Gem_Ruthless
// 0x0148 (0x0148 - 0x0000)
struct GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_AuxillaryASC;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                K2Node_CustomEvent_DamageInfo;                     // 0x0010(0x0028)(NoDestructor)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0038(0x0018)()
	TDelegate<void(class UAbilitySystemComponent* AuxillaryASC, const struct FQualifierContextDamage& DamageInfo, const struct FGameplayEffectSpecHandle& SpecHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable;                              // 0x0060(0x0018)()
	struct FQualifierContextDamage                Temp_struct_Variable2;                             // 0x0078(0x0028)(NoDestructor)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00B8(0x0020)()
	class UOrionAbilityTask_WaitDamage*           CallFunc_WaitDamageDealt_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x00F8(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0110(0x0018)()
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless) == 0x000008, "Wrong alignment on GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless");
static_assert(sizeof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless) == 0x000148, "Wrong size on GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, EntryPoint) == 0x000000, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, K2Node_CustomEvent_AuxillaryASC) == 0x000008, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::K2Node_CustomEvent_AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, K2Node_CustomEvent_DamageInfo) == 0x000010, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, K2Node_CustomEvent_SpecHandle) == 0x000038, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, Temp_struct_Variable) == 0x000060, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, Temp_struct_Variable2) == 0x000078, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, Temp_object_Variable) == 0x0000A0, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A8, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_GetOwner_ReturnValue) == 0x0000B0, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000B8, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_WaitDamageDealt_ReturnValue) == 0x0000D8, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_WaitDamageDealt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000E0, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000E4, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000E8, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_IsValid_ReturnValue) == 0x0000EC, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0000F0, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x0000F8, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000110, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_GetAbilityLevel_ReturnValue) == 0x000128, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000130, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000140, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless, CallFunc_GetValueAtLevel_ReturnValue) == 0x000144, "Member 'GA_Gem_Ruthless_C_ExecuteUbergraph_GA_Gem_Ruthless::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");

// Function GA_Gem_Ruthless.GA_Gem_Ruthless_C.OnDamage_CCE153A94F0038E71B0AE4A15D224519
// 0x0048 (0x0048 - 0x0000)
struct GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519 final
{
public:
	class UAbilitySystemComponent*                AuxillaryASC;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifierContextDamage                DamageInfo;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519) == 0x000008, "Wrong alignment on GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519");
static_assert(sizeof(GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519) == 0x000048, "Wrong size on GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519");
static_assert(offsetof(GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519, AuxillaryASC) == 0x000000, "Member 'GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519::AuxillaryASC' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519, DamageInfo) == 0x000008, "Member 'GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519::DamageInfo' has a wrong offset!");
static_assert(offsetof(GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519, SpecHandle) == 0x000030, "Member 'GA_Gem_Ruthless_C_OnDamage_CCE153A94F0038E71B0AE4A15D224519::SpecHandle' has a wrong offset!");

}

