#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ItemTemplate_FireProjectile

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ItemTemplate_FireProjectile.GA_ItemTemplate_FireProjectile_C
// 0x0090 (0x0C00 - 0x0B70)
class UGA_ItemTemplate_FireProjectile_C : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 TargetingCamera;                                   // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Projectile;                                        // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionFilterAndEffectsContainer        PassThroughFilterContainer;                        // 0x0B88(0x0020)(Edit, BlueprintVisible)
	struct FOrionFilterAndEffectsContainer        OnHitFilterContainer;                              // 0x0BA8(0x0020)(Edit, BlueprintVisible)
	float                                         PitchOffset;                                       // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawOffset;                                         // 0x0BCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOrionFilterAndEffectsContainer        OnExplosionFilterContainer;                        // 0x0BD0(0x0020)(Edit, BlueprintVisible)
	EOrionMuzzleSocket                            MuzzleSocket;                                      // 0x0BF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrionProjectileSpeed                         LaunchSpeed;                                       // 0x0BF1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF2[0x2];                                      // 0x0BF2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LaunchSpeedCoeffecient;                            // 0x0BF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayTargetingConfirmation                ConfirmationType;                                  // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_ItemTemplate_FireProjectile(int32 EntryPoint);
	void Cancelled_C8E50A814B8FF579612738835FE6D1E0(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Confirmed_C8E50A814B8FF579612738835FE6D1E0(const struct FGameplayAbilityTargetDataHandle& Targets);
	void FailedToSpawn_47C8A86E4AA8223A7110FFBC491E1302(class AOrionProjectile* SpawnedProjectile);
	void K2_ActivateAbility();
	void NotAuthority_47C8A86E4AA8223A7110FFBC491E1302(class AOrionProjectile* SpawnedProjectile);
	void PreSpawned_47C8A86E4AA8223A7110FFBC491E1302(class AOrionProjectile* SpawnedProjectile);
	void Success_47C8A86E4AA8223A7110FFBC491E1302(class AOrionProjectile* SpawnedProjectile);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_ItemTemplate_FireProjectile_C">();
	}
	static class UGA_ItemTemplate_FireProjectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ItemTemplate_FireProjectile_C>();
	}
};
static_assert(alignof(UGA_ItemTemplate_FireProjectile_C) == 0x000010, "Wrong alignment on UGA_ItemTemplate_FireProjectile_C");
static_assert(sizeof(UGA_ItemTemplate_FireProjectile_C) == 0x000C00, "Wrong size on UGA_ItemTemplate_FireProjectile_C");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, UberGraphFrame) == 0x000B70, "Member 'UGA_ItemTemplate_FireProjectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, TargetingCamera) == 0x000B78, "Member 'UGA_ItemTemplate_FireProjectile_C::TargetingCamera' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, Projectile) == 0x000B80, "Member 'UGA_ItemTemplate_FireProjectile_C::Projectile' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, PassThroughFilterContainer) == 0x000B88, "Member 'UGA_ItemTemplate_FireProjectile_C::PassThroughFilterContainer' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, OnHitFilterContainer) == 0x000BA8, "Member 'UGA_ItemTemplate_FireProjectile_C::OnHitFilterContainer' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, PitchOffset) == 0x000BC8, "Member 'UGA_ItemTemplate_FireProjectile_C::PitchOffset' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, YawOffset) == 0x000BCC, "Member 'UGA_ItemTemplate_FireProjectile_C::YawOffset' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, OnExplosionFilterContainer) == 0x000BD0, "Member 'UGA_ItemTemplate_FireProjectile_C::OnExplosionFilterContainer' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, MuzzleSocket) == 0x000BF0, "Member 'UGA_ItemTemplate_FireProjectile_C::MuzzleSocket' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, LaunchSpeed) == 0x000BF1, "Member 'UGA_ItemTemplate_FireProjectile_C::LaunchSpeed' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, LaunchSpeedCoeffecient) == 0x000BF4, "Member 'UGA_ItemTemplate_FireProjectile_C::LaunchSpeedCoeffecient' has a wrong offset!");
static_assert(offsetof(UGA_ItemTemplate_FireProjectile_C, ConfirmationType) == 0x000BF8, "Member 'UGA_ItemTemplate_FireProjectile_C::ConfirmationType' has a wrong offset!");

}

