#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_JumpPadMove

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_TargetBeingMoved_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_JumpPadMove.GA_JumpPadMove_C
// 0x0020 (0x0B90 - 0x0B70)
class UGA_JumpPadMove_C final : public UGA_TargetBeingMoved_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	float                                         MinimumFallingTime;                                // 0x0B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7C[0x4];                                      // 0x0B7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Cached_JumpPad_Anim;                               // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hero;                                              // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_JumpPadMove(int32 EntryPoint);
	void K2_OnEndAbility();
	void K2_ActivateAbility();
	void OnCompleted_E748BE7842606FB887B68E9A87534A64(class FName NotifyName);
	void OnBlendOut_E748BE7842606FB887B68E9A87534A64(class FName NotifyName);
	void OnInterrupted_E748BE7842606FB887B68E9A87534A64(class FName NotifyName);
	void OnNotifyBegin_E748BE7842606FB887B68E9A87534A64(class FName NotifyName);
	void OnNotifyEnd_E748BE7842606FB887B68E9A87534A64(class FName NotifyName);
	void OnFinish_F3A3C2B948EDFE535FC46CBCBA2BB6E6();
	void OnStateEnded_1C7D2111473B6A19AB2087BD11EE86A9();
	void OnStateInterrupted_1C7D2111473B6A19AB2087BD11EE86A9();
	void Removed_5997F1304DC6BD01D2DD55A6A40002A7();
	void OnFinish_2572337545AA95A867716CA7F3030DDA();
	void OnFinished_7E3AC3644F0676FD9CE53EBDF757A6DB(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_JumpPadMove_C">();
	}
	static class UGA_JumpPadMove_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_JumpPadMove_C>();
	}
};
static_assert(alignof(UGA_JumpPadMove_C) == 0x000010, "Wrong alignment on UGA_JumpPadMove_C");
static_assert(sizeof(UGA_JumpPadMove_C) == 0x000B90, "Wrong size on UGA_JumpPadMove_C");
static_assert(offsetof(UGA_JumpPadMove_C, UberGraphFrame) == 0x000B70, "Member 'UGA_JumpPadMove_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_JumpPadMove_C, MinimumFallingTime) == 0x000B78, "Member 'UGA_JumpPadMove_C::MinimumFallingTime' has a wrong offset!");
static_assert(offsetof(UGA_JumpPadMove_C, Cached_JumpPad_Anim) == 0x000B80, "Member 'UGA_JumpPadMove_C::Cached_JumpPad_Anim' has a wrong offset!");
static_assert(offsetof(UGA_JumpPadMove_C, Hero) == 0x000B88, "Member 'UGA_JumpPadMove_C::Hero' has a wrong offset!");

}

