#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_JumpPadMove_Abilities

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_JumpPadMove_Abilities.GA_JumpPadMove_Abilities_C.ExecuteUbergraph_GA_JumpPadMove_Abilities
// 0x0178 (0x0178 - 0x0000)
struct GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             CallFunc_GetOrionCharFromActorInfo_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0098(0x0040)(ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_DestinationReached;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_TimedOut;                       // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_FinalTargetLocation;            // 0x00DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x00E8(0x0018)()
	class UObject*                                CallFunc_EffectContextGetSourceObject_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EffectContextIsValid_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_JumpPad_RootMotion_Master_C*        K2Node_DynamicCast_AsBP_Jump_Pad_Root_Motion_Master; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyRootMotionMoveToActorForce* CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue2;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities) == 0x000008, "Wrong alignment on GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities");
static_assert(sizeof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities) == 0x000178, "Wrong size on GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, EntryPoint) == 0x000000, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, Temp_bool_Variable) == 0x000004, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_WaitDelay_ReturnValue) == 0x000008, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000028, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_IsValid_ReturnValue2) == 0x000040, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_StartAbilityState_ReturnValue) == 0x000058, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_IsValid_ReturnValue3) == 0x000070, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, Temp_struct_Variable) == 0x000074, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, Temp_bool_IsClosed_Variable) == 0x000080, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_GetOrionCharFromActorInfo_ReturnValue) == 0x000088, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_GetOrionCharFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_IsValid_ReturnValue4) == 0x000090, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, Temp_bool_Has_Been_Initd_Variable) == 0x000091, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_GetActorInfo_ReturnValue) == 0x000098, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_CustomEvent_DestinationReached) == 0x0000D8, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_CustomEvent_DestinationReached' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_CustomEvent_TimedOut) == 0x0000D9, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_CustomEvent_TimedOut' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_CustomEvent_FinalTargetLocation) == 0x0000DC, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_CustomEvent_FinalTargetLocation' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x0000E8, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_EffectContextGetSourceObject_ReturnValue) == 0x000100, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_EffectContextGetSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_EffectContextIsValid_ReturnValue) == 0x000108, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_EffectContextIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_DynamicCast_AsBP_Jump_Pad_Root_Motion_Master) == 0x000110, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_DynamicCast_AsBP_Jump_Pad_Root_Motion_Master' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue) == 0x000120, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_IsValid_ReturnValue5) == 0x000128, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_IsValid_ReturnValue6) == 0x000129, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_CreateDelegate_OutputDelegate5) == 0x000130, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, Temp_bool_Variable2) == 0x000140, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, K2Node_CreateDelegate_OutputDelegate6) == 0x000148, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000158, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000160, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_WaitDelay_ReturnValue2) == 0x000168, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_WaitDelay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities, CallFunc_IsValid_ReturnValue7) == 0x000170, "Member 'GA_JumpPadMove_Abilities_C_ExecuteUbergraph_GA_JumpPadMove_Abilities::CallFunc_IsValid_ReturnValue7' has a wrong offset!");

// Function GA_JumpPadMove_Abilities.GA_JumpPadMove_Abilities_C.OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771
// 0x0010 (0x0010 - 0x0000)
struct GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771 final
{
public:
	bool                                          DestinationReached;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TimedOut;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FinalTargetLocation;                               // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771) == 0x000004, "Wrong alignment on GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771");
static_assert(sizeof(GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771) == 0x000010, "Wrong size on GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771, DestinationReached) == 0x000000, "Member 'GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771::DestinationReached' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771, TimedOut) == 0x000001, "Member 'GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771::TimedOut' has a wrong offset!");
static_assert(offsetof(GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771, FinalTargetLocation) == 0x000004, "Member 'GA_JumpPadMove_Abilities_C_OnFinished_DAB0541B47988D6A2B4B6C8FBBF2C771::FinalTargetLocation' has a wrong offset!");

}

