#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_OnSpawn

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_OnSpawn.GA_OnSpawn_C.ExecuteUbergraph_GA_OnSpawn
// 0x0220 (0x0220 - 0x0000)
struct GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName11;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName10;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName9;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName8;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName7;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate10;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable2;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0144(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0150(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_SetDuration_ReturnValue;                  // 0x0170(0x0018)()
	class FName                                   K2Node_CustomEvent_NotifyName12;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2; // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue2; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D3[0x1];                                      // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue2;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GSM_BaseMOBA_C*                     K2Node_DynamicCast_AsBP_GSM_Base_MOBA;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate13;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn) == 0x000008, "Wrong alignment on GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn");
static_assert(sizeof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn) == 0x000220, "Wrong size on GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, EntryPoint) == 0x000000, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName11) == 0x000008, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName11' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName10) == 0x000020, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName10' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName9) == 0x000038, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName9' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName8) == 0x000050, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName8' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName7) == 0x000068, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName7' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate5) == 0x000070, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, Temp_name_Variable) == 0x000080, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate6) == 0x000088, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName6) == 0x000098, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName5) == 0x0000A0, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate7) == 0x0000A8, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName4) == 0x0000B8, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate8) == 0x0000C0, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName3) == 0x0000D0, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate9) == 0x0000D8, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName2) == 0x0000E8, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate10) == 0x0000F0, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName) == 0x000100, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate11) == 0x000108, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, Temp_name_Variable2) == 0x000118, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000120, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue) == 0x000128, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_K2_CommitAbility_ReturnValue) == 0x000130, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_WaitDelay_ReturnValue) == 0x000138, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_IsValid_ReturnValue2) == 0x000140, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000144, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000150, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000168, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_SetDuration_ReturnValue) == 0x000170, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_SetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CustomEvent_NotifyName12) == 0x000188, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CustomEvent_NotifyName12' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000190, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2) == 0x000198, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2) == 0x0001A0, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate12) == 0x0001A8, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_IsValid_ReturnValue3) == 0x0001B8, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0001C0, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue2) == 0x0001C8, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_IsValid_ReturnValue4) == 0x0001D0, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_IsValid_ReturnValue5) == 0x0001D1, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_IsValid_ReturnValue6) == 0x0001D2, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_GetPlayLength_ReturnValue) == 0x0001D4, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_IsValid_ReturnValue7) == 0x0001D8, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_GetPlayLength_ReturnValue2) == 0x0001DC, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_GetPlayLength_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0001E0, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0001F0, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, CallFunc_GetGameState_ReturnValue) == 0x0001F8, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_DynamicCast_AsBP_GSM_Base_MOBA) == 0x000200, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_DynamicCast_AsBP_GSM_Base_MOBA' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn, K2Node_CreateDelegate_OutputDelegate13) == 0x000210, "Member 'GA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnCompleted_759325FE48659E7299F1899E3C4738AF
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnCompleted_759325FE48659E7299F1899E3C4738AF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnCompleted_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnCompleted_759325FE48659E7299F1899E3C4738AF");
static_assert(sizeof(GA_OnSpawn_C_OnCompleted_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong size on GA_OnSpawn_C_OnCompleted_759325FE48659E7299F1899E3C4738AF");
static_assert(offsetof(GA_OnSpawn_C_OnCompleted_759325FE48659E7299F1899E3C4738AF, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnCompleted_759325FE48659E7299F1899E3C4738AF::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnBlendOut_759325FE48659E7299F1899E3C4738AF
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnBlendOut_759325FE48659E7299F1899E3C4738AF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnBlendOut_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnBlendOut_759325FE48659E7299F1899E3C4738AF");
static_assert(sizeof(GA_OnSpawn_C_OnBlendOut_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong size on GA_OnSpawn_C_OnBlendOut_759325FE48659E7299F1899E3C4738AF");
static_assert(offsetof(GA_OnSpawn_C_OnBlendOut_759325FE48659E7299F1899E3C4738AF, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnBlendOut_759325FE48659E7299F1899E3C4738AF::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnInterrupted_759325FE48659E7299F1899E3C4738AF
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnInterrupted_759325FE48659E7299F1899E3C4738AF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnInterrupted_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnInterrupted_759325FE48659E7299F1899E3C4738AF");
static_assert(sizeof(GA_OnSpawn_C_OnInterrupted_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong size on GA_OnSpawn_C_OnInterrupted_759325FE48659E7299F1899E3C4738AF");
static_assert(offsetof(GA_OnSpawn_C_OnInterrupted_759325FE48659E7299F1899E3C4738AF, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnInterrupted_759325FE48659E7299F1899E3C4738AF::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnCancelled_759325FE48659E7299F1899E3C4738AF
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnCancelled_759325FE48659E7299F1899E3C4738AF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnCancelled_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnCancelled_759325FE48659E7299F1899E3C4738AF");
static_assert(sizeof(GA_OnSpawn_C_OnCancelled_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong size on GA_OnSpawn_C_OnCancelled_759325FE48659E7299F1899E3C4738AF");
static_assert(offsetof(GA_OnSpawn_C_OnCancelled_759325FE48659E7299F1899E3C4738AF, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnCancelled_759325FE48659E7299F1899E3C4738AF::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnNotifyBegin_759325FE48659E7299F1899E3C4738AF
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnNotifyBegin_759325FE48659E7299F1899E3C4738AF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnNotifyBegin_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnNotifyBegin_759325FE48659E7299F1899E3C4738AF");
static_assert(sizeof(GA_OnSpawn_C_OnNotifyBegin_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong size on GA_OnSpawn_C_OnNotifyBegin_759325FE48659E7299F1899E3C4738AF");
static_assert(offsetof(GA_OnSpawn_C_OnNotifyBegin_759325FE48659E7299F1899E3C4738AF, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnNotifyBegin_759325FE48659E7299F1899E3C4738AF::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnNotifyEnd_759325FE48659E7299F1899E3C4738AF
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnNotifyEnd_759325FE48659E7299F1899E3C4738AF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnNotifyEnd_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnNotifyEnd_759325FE48659E7299F1899E3C4738AF");
static_assert(sizeof(GA_OnSpawn_C_OnNotifyEnd_759325FE48659E7299F1899E3C4738AF) == 0x000008, "Wrong size on GA_OnSpawn_C_OnNotifyEnd_759325FE48659E7299F1899E3C4738AF");
static_assert(offsetof(GA_OnSpawn_C_OnNotifyEnd_759325FE48659E7299F1899E3C4738AF, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnNotifyEnd_759325FE48659E7299F1899E3C4738AF::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnCompleted_F95C91B146B2CB6F25417A93AB4A967F
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnCompleted_F95C91B146B2CB6F25417A93AB4A967F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnCompleted_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnCompleted_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(sizeof(GA_OnSpawn_C_OnCompleted_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong size on GA_OnSpawn_C_OnCompleted_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(offsetof(GA_OnSpawn_C_OnCompleted_F95C91B146B2CB6F25417A93AB4A967F, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnCompleted_F95C91B146B2CB6F25417A93AB4A967F::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(sizeof(GA_OnSpawn_C_OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong size on GA_OnSpawn_C_OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(offsetof(GA_OnSpawn_C_OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(sizeof(GA_OnSpawn_C_OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong size on GA_OnSpawn_C_OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(offsetof(GA_OnSpawn_C_OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnCancelled_F95C91B146B2CB6F25417A93AB4A967F
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnCancelled_F95C91B146B2CB6F25417A93AB4A967F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnCancelled_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnCancelled_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(sizeof(GA_OnSpawn_C_OnCancelled_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong size on GA_OnSpawn_C_OnCancelled_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(offsetof(GA_OnSpawn_C_OnCancelled_F95C91B146B2CB6F25417A93AB4A967F, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnCancelled_F95C91B146B2CB6F25417A93AB4A967F::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(sizeof(GA_OnSpawn_C_OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong size on GA_OnSpawn_C_OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(offsetof(GA_OnSpawn_C_OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_OnSpawn_C_OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong alignment on GA_OnSpawn_C_OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(sizeof(GA_OnSpawn_C_OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F) == 0x000008, "Wrong size on GA_OnSpawn_C_OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F");
static_assert(offsetof(GA_OnSpawn_C_OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F, NotifyName) == 0x000000, "Member 'GA_OnSpawn_C_OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F::NotifyName' has a wrong offset!");

// Function GA_OnSpawn.GA_OnSpawn_C.CheckSpawnPad
// 0x0048 (0x0048 - 0x0000)
struct GA_OnSpawn_C_CheckSpawnPad final
{
public:
	class ABP_Hero_C*                             Hero;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpawnPad_Agent_C*                      K2Node_DynamicCast_AsSpawn_Pad_Agent;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_OnSpawn_C_CheckSpawnPad) == 0x000008, "Wrong alignment on GA_OnSpawn_C_CheckSpawnPad");
static_assert(sizeof(GA_OnSpawn_C_CheckSpawnPad) == 0x000048, "Wrong size on GA_OnSpawn_C_CheckSpawnPad");
static_assert(offsetof(GA_OnSpawn_C_CheckSpawnPad, Hero) == 0x000000, "Member 'GA_OnSpawn_C_CheckSpawnPad::Hero' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_CheckSpawnPad, Temp_int_Array_Index_Variable) == 0x000008, "Member 'GA_OnSpawn_C_CheckSpawnPad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_OnSpawn_C_CheckSpawnPad, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000010, "Member 'GA_OnSpawn_C_CheckSpawnPad::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
