#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Passive_CombatSlowAfterFall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Passive_CombatSlowAfterFall.GA_Passive_CombatSlowAfterFall_C
// 0x0050 (0x0BC0 - 0x0B70)
class UGA_Passive_CombatSlowAfterFall_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           AbilityType_Basic_Primary;                         // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Falling_Tag_Container;                             // 0x0B80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Status_Falling;                                    // 0x0BA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AbilityRange_Melee;                                // 0x0BA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CachedIsMeleeAbility;                              // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CachedWasFalling;                                  // 0x0BB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Passive_CombatSlowAfterFall(int32 EntryPoint);
	void EventReceived_8D53894041C05B08AD9D1EACF3119F53(const struct FGameplayEventData& Payload);
	void K2_ActivateAbility();
	void OnCommit_B228181744E6C8DCBBB2DEAB6266A383(class UGameplayAbility* ActivatedAbility_0);
	void Removed_0675F0E74A92822E06C88B9151B1B77A();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Passive_CombatSlowAfterFall_C">();
	}
	static class UGA_Passive_CombatSlowAfterFall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Passive_CombatSlowAfterFall_C>();
	}
};
static_assert(alignof(UGA_Passive_CombatSlowAfterFall_C) == 0x000010, "Wrong alignment on UGA_Passive_CombatSlowAfterFall_C");
static_assert(sizeof(UGA_Passive_CombatSlowAfterFall_C) == 0x000BC0, "Wrong size on UGA_Passive_CombatSlowAfterFall_C");
static_assert(offsetof(UGA_Passive_CombatSlowAfterFall_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Passive_CombatSlowAfterFall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Passive_CombatSlowAfterFall_C, AbilityType_Basic_Primary) == 0x000B78, "Member 'UGA_Passive_CombatSlowAfterFall_C::AbilityType_Basic_Primary' has a wrong offset!");
static_assert(offsetof(UGA_Passive_CombatSlowAfterFall_C, Falling_Tag_Container) == 0x000B80, "Member 'UGA_Passive_CombatSlowAfterFall_C::Falling_Tag_Container' has a wrong offset!");
static_assert(offsetof(UGA_Passive_CombatSlowAfterFall_C, Status_Falling) == 0x000BA0, "Member 'UGA_Passive_CombatSlowAfterFall_C::Status_Falling' has a wrong offset!");
static_assert(offsetof(UGA_Passive_CombatSlowAfterFall_C, AbilityRange_Melee) == 0x000BA8, "Member 'UGA_Passive_CombatSlowAfterFall_C::AbilityRange_Melee' has a wrong offset!");
static_assert(offsetof(UGA_Passive_CombatSlowAfterFall_C, ActivatedAbility) == 0x000BB0, "Member 'UGA_Passive_CombatSlowAfterFall_C::ActivatedAbility' has a wrong offset!");
static_assert(offsetof(UGA_Passive_CombatSlowAfterFall_C, CachedIsMeleeAbility) == 0x000BB8, "Member 'UGA_Passive_CombatSlowAfterFall_C::CachedIsMeleeAbility' has a wrong offset!");
static_assert(offsetof(UGA_Passive_CombatSlowAfterFall_C, CachedWasFalling) == 0x000BB9, "Member 'UGA_Passive_CombatSlowAfterFall_C::CachedWasFalling' has a wrong offset!");

}

