#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Prime_Helix_V2_SpecialAttack3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3
// 0x03F0 (0x03F0 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate3;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class UOrionAbilityTask_WaitForSpecialAttackRotation* CallFunc_WaitForSpecialAttackRotation_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue2;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate13;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate14;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01D8(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_TotalSpawnedSegments_Variable;            // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_X;                       // 0x01F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Y;                       // 0x0200(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Z;                       // 0x020C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0240(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x024C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0260(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0270(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0280(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B[0x1];                                      // 0x030B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0314(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0320(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x032C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0338(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0370(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x037C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0388(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_394[0xC];                                      // 0x0394(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03A0(0x0030)(IsPlainOldData, NoDestructor)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3) == 0x000010, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3) == 0x0003F0, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, EntryPoint) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CustomEvent_SpawnedActor) == 0x000008, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, Temp_object_Variable) == 0x000020, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, Temp_object_Variable2) == 0x000028, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CustomEvent_NotifyName6) == 0x000038, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate2) == 0x000040, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CustomEvent_NotifyName5) == 0x000050, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate3) == 0x000058, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CustomEvent_NotifyName4) == 0x000068, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate4) == 0x000070, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CustomEvent_NotifyName3) == 0x000080, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate5) == 0x000088, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CustomEvent_NotifyName2) == 0x000098, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate6) == 0x0000A0, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CustomEvent_NotifyName) == 0x0000B0, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate7) == 0x0000B8, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, Temp_name_Variable) == 0x0000C8, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate8) == 0x0000D0, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_WaitForSpecialAttackRotation_ReturnValue) == 0x0000E0, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_WaitForSpecialAttackRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate9) == 0x0000E8, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate10) == 0x000100, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_StartAbilityState_ReturnValue) == 0x000110, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate11) == 0x000118, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_IsValid_ReturnValue2) == 0x000128, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate12) == 0x000130, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_StartAbilityState_ReturnValue2) == 0x000140, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_StartAbilityState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CustomEvent_SpawnedActor2) == 0x000148, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_IsValid_ReturnValue3) == 0x000150, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate13) == 0x000158, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CustomEvent_SpawnedActor3) == 0x000168, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, K2Node_CreateDelegate_OutputDelegate14) == 0x000170, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000180, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_GetTransform_ReturnValue) == 0x000190, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_GetActorForwardVector_ReturnValue) == 0x0001C0, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakTransform_Location) == 0x0001CC, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakTransform_Rotation) == 0x0001D8, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakTransform_Scale) == 0x0001E4, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, Temp_int_TotalSpawnedSegments_Variable) == 0x0001F0, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::Temp_int_TotalSpawnedSegments_Variable' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakRotIntoAxes_X) == 0x0001F4, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakRotIntoAxes_X' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakRotIntoAxes_Y) == 0x000200, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakRotIntoAxes_Y' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakRotIntoAxes_Z) == 0x00020C, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakRotIntoAxes_Z' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Add_IntInt_ReturnValue) == 0x000218, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Array_Get_Item) == 0x000220, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Less_IntInt_ReturnValue) == 0x000228, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00022C, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000230, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Add_FloatFloat_ReturnValue) == 0x000234, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000238, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x00023C, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000240, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00024C, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000258, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Add_VectorVector_ReturnValue) == 0x000260, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_IsValid_ReturnValue4) == 0x00026C, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_Add_VectorVector_ReturnValue2) == 0x000270, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_LineTraceSingle_OutHit) == 0x000280, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_LineTraceSingle_ReturnValue) == 0x000308, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_bBlockingHit) == 0x000309, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_bInitialOverlap) == 0x00030A, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_Time) == 0x00030C, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_Distance) == 0x000310, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_Location) == 0x000314, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_ImpactPoint) == 0x000320, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_Normal) == 0x00032C, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_ImpactNormal) == 0x000338, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_PhysMat) == 0x000348, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_HitActor) == 0x000350, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_HitComponent) == 0x000358, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_HitBoneName) == 0x000360, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_HitItem) == 0x000368, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_FaceIndex) == 0x00036C, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_TraceStart) == 0x000370, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BreakHitResult_TraceEnd) == 0x00037C, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000388, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_MakeTransform_ReturnValue) == 0x0003A0, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x0003D0, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_IsValid_ReturnValue5) == 0x0003D8, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BeginSpawningActor_SpawnedActor) == 0x0003E0, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3, CallFunc_BeginSpawningActor_ReturnValue) == 0x0003E8, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack3::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.FailedToSpawn_12ADA30B4F7418D8007BC0813D01399D
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack3_C_FailedToSpawn_12ADA30B4F7418D8007BC0813D01399D final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_FailedToSpawn_12ADA30B4F7418D8007BC0813D01399D) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_FailedToSpawn_12ADA30B4F7418D8007BC0813D01399D");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_FailedToSpawn_12ADA30B4F7418D8007BC0813D01399D) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_FailedToSpawn_12ADA30B4F7418D8007BC0813D01399D");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_FailedToSpawn_12ADA30B4F7418D8007BC0813D01399D, SpawnedActor) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_FailedToSpawn_12ADA30B4F7418D8007BC0813D01399D::SpawnedActor' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.NotAuthority_12ADA30B4F7418D8007BC0813D01399D
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack3_C_NotAuthority_12ADA30B4F7418D8007BC0813D01399D final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_NotAuthority_12ADA30B4F7418D8007BC0813D01399D) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_NotAuthority_12ADA30B4F7418D8007BC0813D01399D");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_NotAuthority_12ADA30B4F7418D8007BC0813D01399D) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_NotAuthority_12ADA30B4F7418D8007BC0813D01399D");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_NotAuthority_12ADA30B4F7418D8007BC0813D01399D, SpawnedActor) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_NotAuthority_12ADA30B4F7418D8007BC0813D01399D::SpawnedActor' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.OnBlendOut_5B8A33B54104B5F4C30E57B678944BC1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack3_C_OnBlendOut_5B8A33B54104B5F4C30E57B678944BC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_OnBlendOut_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_OnBlendOut_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_OnBlendOut_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_OnBlendOut_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_OnBlendOut_5B8A33B54104B5F4C30E57B678944BC1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_OnBlendOut_5B8A33B54104B5F4C30E57B678944BC1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.OnCancelled_5B8A33B54104B5F4C30E57B678944BC1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack3_C_OnCancelled_5B8A33B54104B5F4C30E57B678944BC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_OnCancelled_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_OnCancelled_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_OnCancelled_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_OnCancelled_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_OnCancelled_5B8A33B54104B5F4C30E57B678944BC1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_OnCancelled_5B8A33B54104B5F4C30E57B678944BC1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.OnCompleted_5B8A33B54104B5F4C30E57B678944BC1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack3_C_OnCompleted_5B8A33B54104B5F4C30E57B678944BC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_OnCompleted_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_OnCompleted_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_OnCompleted_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_OnCompleted_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_OnCompleted_5B8A33B54104B5F4C30E57B678944BC1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_OnCompleted_5B8A33B54104B5F4C30E57B678944BC1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.OnInterrupted_5B8A33B54104B5F4C30E57B678944BC1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack3_C_OnInterrupted_5B8A33B54104B5F4C30E57B678944BC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_OnInterrupted_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_OnInterrupted_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_OnInterrupted_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_OnInterrupted_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_OnInterrupted_5B8A33B54104B5F4C30E57B678944BC1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_OnInterrupted_5B8A33B54104B5F4C30E57B678944BC1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.OnNotifyBegin_5B8A33B54104B5F4C30E57B678944BC1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyBegin_5B8A33B54104B5F4C30E57B678944BC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyBegin_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyBegin_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyBegin_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyBegin_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyBegin_5B8A33B54104B5F4C30E57B678944BC1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyBegin_5B8A33B54104B5F4C30E57B678944BC1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.OnNotifyEnd_5B8A33B54104B5F4C30E57B678944BC1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyEnd_5B8A33B54104B5F4C30E57B678944BC1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyEnd_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyEnd_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyEnd_5B8A33B54104B5F4C30E57B678944BC1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyEnd_5B8A33B54104B5F4C30E57B678944BC1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyEnd_5B8A33B54104B5F4C30E57B678944BC1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_OnNotifyEnd_5B8A33B54104B5F4C30E57B678944BC1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack3.GA_Prime_Helix_V2_SpecialAttack3_C.Success_12ADA30B4F7418D8007BC0813D01399D
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack3_C_Success_12ADA30B4F7418D8007BC0813D01399D final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack3_C_Success_12ADA30B4F7418D8007BC0813D01399D) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack3_C_Success_12ADA30B4F7418D8007BC0813D01399D");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack3_C_Success_12ADA30B4F7418D8007BC0813D01399D) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack3_C_Success_12ADA30B4F7418D8007BC0813D01399D");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack3_C_Success_12ADA30B4F7418D8007BC0813D01399D, SpawnedActor) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack3_C_Success_12ADA30B4F7418D8007BC0813D01399D::SpawnedActor' has a wrong offset!");

}

