#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Prime_Helix_V2_SpecialAttack1_V2

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C
// 0x00A0 (0x0C10 - 0x0B70)
class UGA_Prime_Helix_V2_SpecialAttack1_V2_C final : public UOrionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           Anim_CastMontage;                                  // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Notify_FireProj;                                   // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         AttackTargets;                                     // 0x0B88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         Count_CurrentProjectile;                           // 0x0B98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_TargetActor;                                 // 0x0B9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Count_MaxProjectile;                               // 0x0BA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0BC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Debug;                                             // 0x0BE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE9[0x7];                                      // 0x0BE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LockOnActor;                                       // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CastMontagePlayrate;                               // 0x0BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFC[0x4];                                      // 0x0BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PrecastName;                                       // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PostcastName;                                      // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2(int32 EntryPoint);
	void K2_ActivateAbility();
	void FireProjectile();
	void OnStateEnded_8CCB9C2045373A2E5F21EC9C3451FF80();
	void OnStateInterrupted_8CCB9C2045373A2E5F21EC9C3451FF80();
	void OnCompleted_2F46A694403EB099A55443A73A326DF1(class FName NotifyName);
	void OnBlendOut_2F46A694403EB099A55443A73A326DF1(class FName NotifyName);
	void OnInterrupted_2F46A694403EB099A55443A73A326DF1(class FName NotifyName);
	void OnCancelled_2F46A694403EB099A55443A73A326DF1(class FName NotifyName);
	void OnNotifyBegin_2F46A694403EB099A55443A73A326DF1(class FName NotifyName);
	void OnNotifyEnd_2F46A694403EB099A55443A73A326DF1(class FName NotifyName);
	void OnStateEnded_84BCFAC9406564A5595CB89DFAD7BC8A();
	void OnStateInterrupted_84BCFAC9406564A5595CB89DFAD7BC8A();
	void Success_82B8AEA94C9E5DD5BA6E319374389879(class AOrionProjectile* SpawnedProjectile);
	void PreSpawned_82B8AEA94C9E5DD5BA6E319374389879(class AOrionProjectile* SpawnedProjectile);
	void NotAuthority_82B8AEA94C9E5DD5BA6E319374389879(class AOrionProjectile* SpawnedProjectile);
	void FailedToSpawn_82B8AEA94C9E5DD5BA6E319374389879(class AOrionProjectile* SpawnedProjectile);
	void Confirmed_1BF55C5A4A29CCB7C5FF38A6FAAA363E(const struct FGameplayAbilityTargetDataHandle& Targets);
	void Cancelled_1BF55C5A4A29CCB7C5FF38A6FAAA363E(const struct FGameplayAbilityTargetDataHandle& Targets);
	void GetCurrentIndex(int32 CurrentCount, TArray<class AActor*>& ActorArray, int32* TargetIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Prime_Helix_V2_SpecialAttack1_V2_C">();
	}
	static class UGA_Prime_Helix_V2_SpecialAttack1_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Prime_Helix_V2_SpecialAttack1_V2_C>();
	}
};
static_assert(alignof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C) == 0x000010, "Wrong alignment on UGA_Prime_Helix_V2_SpecialAttack1_V2_C");
static_assert(sizeof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C) == 0x000C10, "Wrong size on UGA_Prime_Helix_V2_SpecialAttack1_V2_C");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, Anim_CastMontage) == 0x000B78, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::Anim_CastMontage' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, Notify_FireProj) == 0x000B80, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::Notify_FireProj' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, AttackTargets) == 0x000B88, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::AttackTargets' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, Count_CurrentProjectile) == 0x000B98, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::Count_CurrentProjectile' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, Index_TargetActor) == 0x000B9C, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::Index_TargetActor' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, Count_MaxProjectile) == 0x000BA0, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::Count_MaxProjectile' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, TargetData) == 0x000BC8, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::TargetData' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, Debug) == 0x000BE8, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::Debug' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, LockOnActor) == 0x000BF0, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::LockOnActor' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, CastMontagePlayrate) == 0x000BF8, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::CastMontagePlayrate' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, PrecastName) == 0x000C00, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::PrecastName' has a wrong offset!");
static_assert(offsetof(UGA_Prime_Helix_V2_SpecialAttack1_V2_C, PostcastName) == 0x000C08, "Member 'UGA_Prime_Helix_V2_SpecialAttack1_V2_C::PostcastName' has a wrong offset!");

}

