#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Passive_CombatSlowAfterFall

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Passive_CombatSlowAfterFall.GA_Passive_CombatSlowAfterFall_C.ExecuteUbergraph_GA_Passive_CombatSlowAfterFall
// 0x0328 (0x0328 - 0x0000)
struct GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbility*                          K2Node_DynamicCast_AsOrion_Ability;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0040(0x00A8)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00E8(0x00A8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TargetDataHasActor_ReturnValue;           // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_AbilityHasTag_ReturnValue;                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate3;             // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAbilityCommit*         CallFunc_WaitForAbilityCommit_ReturnValue;         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult2;         // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY2;             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_BP_GetCachedGameplayEffeectSpec_ReturnValue; // 0x0220(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_BP_GetCachedGameplayEffeectSpec_ReturnValue2; // 0x0238(0x0018)()
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult3;         // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY3;             // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult4;         // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY4;             // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0270(0x0018)()
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult5;         // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY5;             // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0290(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult6;         // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY6;             // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult7;         // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY7;             // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue2; // 0x02B0(0x0018)()
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue2; // 0x02CC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult8;         // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D6[0x2];                                      // 0x02D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY8;             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult9;         // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY9;             // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue3;                      // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_BP_GetCachedGameplayEffeectSpec_ReturnValue3; // 0x02F0(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue3; // 0x0308(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue3; // 0x0320(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall) == 0x000008, "Wrong alignment on GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall");
static_assert(sizeof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall) == 0x000328, "Wrong size on GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, EntryPoint) == 0x000000, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_CustomEvent_ActivatedAbility) == 0x000008, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000010, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, Temp_object_Variable) == 0x000018, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_DynamicCast_AsOrion_Ability) == 0x000020, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_DynamicCast_AsOrion_Ability' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_CustomEvent_Payload) == 0x000040, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, Temp_struct_Variable) == 0x0000E8, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000190, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_IsValid_ReturnValue2) == 0x000198, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_TargetDataHasActor_ReturnValue) == 0x000199, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_TargetDataHasActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_CreateDelegate_OutputDelegate2) == 0x0001A0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_AbilityHasTag_ReturnValue) == 0x0001B0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_AbilityHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue) == 0x0001B8, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_GetOrionCharHeroFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_CreateDelegate_OutputDelegate3) == 0x0001C0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0001D0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_IsValid_ReturnValue3) == 0x0001D8, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0001E0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0001F0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_WaitForAbilityCommit_ReturnValue) == 0x0001F8, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_WaitForAbilityCommit_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_IsValid_ReturnValue4) == 0x000200, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000201, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000204, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000208, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_SwitchEnum_CmpSuccess) == 0x00020C, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutResult2) == 0x00020D, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutResult2' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutXY2) == 0x000210, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutXY2' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000214, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_SwitchEnum2_CmpSuccess) == 0x000218, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_BP_GetCachedGameplayEffeectSpec_ReturnValue) == 0x000220, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_BP_GetCachedGameplayEffeectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_BP_GetCachedGameplayEffeectSpec_ReturnValue2) == 0x000238, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_BP_GetCachedGameplayEffeectSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutResult3) == 0x000250, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutResult3' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutXY3) == 0x000254, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutXY3' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutResult4) == 0x000258, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutResult4' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutXY4) == 0x00025C, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutXY4' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_SwitchEnum3_CmpSuccess) == 0x000260, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_FClamp_ReturnValue) == 0x000264, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_SwitchEnum4_CmpSuccess) == 0x000268, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000270, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutResult5) == 0x000288, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutResult5' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutXY5) == 0x00028C, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutXY5' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000290, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_SwitchEnum5_CmpSuccess) == 0x000298, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutResult6) == 0x000299, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutResult6' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutXY6) == 0x00029C, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutXY6' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutResult7) == 0x0002A0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutResult7' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutXY7) == 0x0002A4, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutXY7' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_FClamp_ReturnValue2) == 0x0002A8, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0002AC, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue2) == 0x0002B0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_SwitchEnum6_CmpSuccess) == 0x0002C8, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue2) == 0x0002CC, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_SwitchEnum7_CmpSuccess) == 0x0002D4, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutResult8) == 0x0002D5, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutResult8' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutXY8) == 0x0002D8, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutXY8' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutResult9) == 0x0002DC, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutResult9' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_EvaluateCurveTableRow_OutXY9) == 0x0002E0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_EvaluateCurveTableRow_OutXY9' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_SwitchEnum8_CmpSuccess) == 0x0002E4, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_SwitchEnum8_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_FClamp_ReturnValue3) == 0x0002E8, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_FClamp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, K2Node_SwitchEnum9_CmpSuccess) == 0x0002EC, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::K2Node_SwitchEnum9_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_BP_GetCachedGameplayEffeectSpec_ReturnValue3) == 0x0002F0, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_BP_GetCachedGameplayEffeectSpec_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue3) == 0x000308, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue3) == 0x000320, "Member 'GA_Passive_CombatSlowAfterFall_C_ExecuteUbergraph_GA_Passive_CombatSlowAfterFall::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue3' has a wrong offset!");

// Function GA_Passive_CombatSlowAfterFall.GA_Passive_CombatSlowAfterFall_C.EventReceived_8D53894041C05B08AD9D1EACF3119F53
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Passive_CombatSlowAfterFall_C_EventReceived_8D53894041C05B08AD9D1EACF3119F53 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Passive_CombatSlowAfterFall_C_EventReceived_8D53894041C05B08AD9D1EACF3119F53) == 0x000008, "Wrong alignment on GA_Passive_CombatSlowAfterFall_C_EventReceived_8D53894041C05B08AD9D1EACF3119F53");
static_assert(sizeof(GA_Passive_CombatSlowAfterFall_C_EventReceived_8D53894041C05B08AD9D1EACF3119F53) == 0x0000A8, "Wrong size on GA_Passive_CombatSlowAfterFall_C_EventReceived_8D53894041C05B08AD9D1EACF3119F53");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_EventReceived_8D53894041C05B08AD9D1EACF3119F53, Payload) == 0x000000, "Member 'GA_Passive_CombatSlowAfterFall_C_EventReceived_8D53894041C05B08AD9D1EACF3119F53::Payload' has a wrong offset!");

// Function GA_Passive_CombatSlowAfterFall.GA_Passive_CombatSlowAfterFall_C.OnCommit_B228181744E6C8DCBBB2DEAB6266A383
// 0x0008 (0x0008 - 0x0000)
struct GA_Passive_CombatSlowAfterFall_C_OnCommit_B228181744E6C8DCBBB2DEAB6266A383 final
{
public:
	class UGameplayAbility*                       ActivatedAbility_0;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Passive_CombatSlowAfterFall_C_OnCommit_B228181744E6C8DCBBB2DEAB6266A383) == 0x000008, "Wrong alignment on GA_Passive_CombatSlowAfterFall_C_OnCommit_B228181744E6C8DCBBB2DEAB6266A383");
static_assert(sizeof(GA_Passive_CombatSlowAfterFall_C_OnCommit_B228181744E6C8DCBBB2DEAB6266A383) == 0x000008, "Wrong size on GA_Passive_CombatSlowAfterFall_C_OnCommit_B228181744E6C8DCBBB2DEAB6266A383");
static_assert(offsetof(GA_Passive_CombatSlowAfterFall_C_OnCommit_B228181744E6C8DCBBB2DEAB6266A383, ActivatedAbility_0) == 0x000000, "Member 'GA_Passive_CombatSlowAfterFall_C_OnCommit_B228181744E6C8DCBBB2DEAB6266A383::ActivatedAbility_0' has a wrong offset!");

}

