#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Prime_Helix_V2_SpecialAttack1_V2

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2
// 0x0290 (0x0290 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets;                        // 0x0008(0x0020)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0028(0x0020)()
	class UOrionAbilityTask_StartTargeting*       CallFunc_StartTargeting_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile4;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile3;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile2;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       K2Node_CustomEvent_SpawnedProjectile;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOrionProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class AOrionProjectile*                       Temp_object_Variable;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_TargetDataHasActor_ReturnValue;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate10;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate11;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate12;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate14;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Targets2;                       // 0x01B0(0x0020)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01E8(0x0008)(NoDestructor)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate16;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& Targets)> K2Node_CreateDelegate_OutputDelegate17;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue3;          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionAbilityTask_SpawnProjectile*      CallFunc_SpawnProjectile_ReturnValue;              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionProjectile*                       CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24B[0x1];                                      // 0x024B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentIndex_TargetIndex;              // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue2;           // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             CallFunc_GetOrionCharFromActorInfo_ReturnValue;    // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue2;                      // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2) == 0x000290, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, EntryPoint) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_Targets) == 0x000008, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_Targets' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, Temp_struct_Variable) == 0x000028, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_StartTargeting_ReturnValue) == 0x000048, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_StartTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_SpawnedProjectile4) == 0x000058, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_SpawnedProjectile4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_SpawnedProjectile3) == 0x000070, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_SpawnedProjectile3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate2) == 0x000078, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_SpawnedProjectile2) == 0x000088, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_SpawnedProjectile2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate3) == 0x000090, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_SpawnedProjectile) == 0x0000A0, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate4) == 0x0000A8, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, Temp_object_Variable) == 0x0000B8, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x0000C0, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_TargetDataHasActor_ReturnValue) == 0x0000D0, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_TargetDataHasActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate5) == 0x0000D8, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate6) == 0x0000E8, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_NotifyName6) == 0x0000F8, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate7) == 0x000100, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_NotifyName5) == 0x000110, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate8) == 0x000118, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_NotifyName4) == 0x000128, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate9) == 0x000130, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_NotifyName3) == 0x000140, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate10) == 0x000148, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_NotifyName2) == 0x000158, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate11) == 0x000160, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_NotifyName) == 0x000170, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate12) == 0x000178, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, Temp_name_Variable) == 0x000188, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate13) == 0x000190, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate14) == 0x0001A0, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CustomEvent_Targets2) == 0x0001B0, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CustomEvent_Targets2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate15) == 0x0001D0, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001E8, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate16) == 0x0001F0, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_GetValueAtLevel_ReturnValue) == 0x000200, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_FTrunc_ReturnValue) == 0x000204, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_Less_IntInt_ReturnValue) == 0x000208, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, K2Node_CreateDelegate_OutputDelegate17) == 0x000210, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000220, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_Array_Get_Item) == 0x000228, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_RandomFloatInRange_ReturnValue3) == 0x000230, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_RandomFloatInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_IsValid_ReturnValue2) == 0x000234, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_SpawnProjectile_ReturnValue) == 0x000238, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000240, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_BeginSpawningActor_ReturnValue) == 0x000248, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_Array_RemoveItem_ReturnValue) == 0x000249, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_IsValid_ReturnValue3) == 0x00024A, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_GetCurrentIndex_TargetIndex) == 0x00024C, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_GetCurrentIndex_TargetIndex' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000250, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_StartAbilityState_ReturnValue) == 0x000258, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_IsValid_ReturnValue4) == 0x000260, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_IsValid_ReturnValue5) == 0x000261, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_StartAbilityState_ReturnValue2) == 0x000268, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_StartAbilityState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_IsValid_ReturnValue6) == 0x000270, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000271, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_GetOrionCharFromActorInfo_ReturnValue) == 0x000278, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_GetOrionCharFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000280, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_GetFloatAttribute_ReturnValue) == 0x000284, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_FTrunc_ReturnValue2) == 0x000288, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_FTrunc_ReturnValue2' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.OnCompleted_2F46A694403EB099A55443A73A326DF1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCompleted_2F46A694403EB099A55443A73A326DF1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCompleted_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCompleted_2F46A694403EB099A55443A73A326DF1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCompleted_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCompleted_2F46A694403EB099A55443A73A326DF1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCompleted_2F46A694403EB099A55443A73A326DF1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCompleted_2F46A694403EB099A55443A73A326DF1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.OnBlendOut_2F46A694403EB099A55443A73A326DF1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnBlendOut_2F46A694403EB099A55443A73A326DF1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnBlendOut_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnBlendOut_2F46A694403EB099A55443A73A326DF1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnBlendOut_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnBlendOut_2F46A694403EB099A55443A73A326DF1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnBlendOut_2F46A694403EB099A55443A73A326DF1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnBlendOut_2F46A694403EB099A55443A73A326DF1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.OnInterrupted_2F46A694403EB099A55443A73A326DF1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnInterrupted_2F46A694403EB099A55443A73A326DF1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnInterrupted_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnInterrupted_2F46A694403EB099A55443A73A326DF1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnInterrupted_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnInterrupted_2F46A694403EB099A55443A73A326DF1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnInterrupted_2F46A694403EB099A55443A73A326DF1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnInterrupted_2F46A694403EB099A55443A73A326DF1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.OnCancelled_2F46A694403EB099A55443A73A326DF1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCancelled_2F46A694403EB099A55443A73A326DF1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCancelled_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCancelled_2F46A694403EB099A55443A73A326DF1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCancelled_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCancelled_2F46A694403EB099A55443A73A326DF1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCancelled_2F46A694403EB099A55443A73A326DF1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnCancelled_2F46A694403EB099A55443A73A326DF1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.OnNotifyBegin_2F46A694403EB099A55443A73A326DF1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyBegin_2F46A694403EB099A55443A73A326DF1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyBegin_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyBegin_2F46A694403EB099A55443A73A326DF1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyBegin_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyBegin_2F46A694403EB099A55443A73A326DF1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyBegin_2F46A694403EB099A55443A73A326DF1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyBegin_2F46A694403EB099A55443A73A326DF1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.OnNotifyEnd_2F46A694403EB099A55443A73A326DF1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyEnd_2F46A694403EB099A55443A73A326DF1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyEnd_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyEnd_2F46A694403EB099A55443A73A326DF1");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyEnd_2F46A694403EB099A55443A73A326DF1) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyEnd_2F46A694403EB099A55443A73A326DF1");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyEnd_2F46A694403EB099A55443A73A326DF1, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_OnNotifyEnd_2F46A694403EB099A55443A73A326DF1::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.Success_82B8AEA94C9E5DD5BA6E319374389879
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack1_V2_C_Success_82B8AEA94C9E5DD5BA6E319374389879 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_Success_82B8AEA94C9E5DD5BA6E319374389879) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_Success_82B8AEA94C9E5DD5BA6E319374389879");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_Success_82B8AEA94C9E5DD5BA6E319374389879) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_Success_82B8AEA94C9E5DD5BA6E319374389879");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_Success_82B8AEA94C9E5DD5BA6E319374389879, SpawnedProjectile) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_Success_82B8AEA94C9E5DD5BA6E319374389879::SpawnedProjectile' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.PreSpawned_82B8AEA94C9E5DD5BA6E319374389879
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack1_V2_C_PreSpawned_82B8AEA94C9E5DD5BA6E319374389879 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_PreSpawned_82B8AEA94C9E5DD5BA6E319374389879) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_PreSpawned_82B8AEA94C9E5DD5BA6E319374389879");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_PreSpawned_82B8AEA94C9E5DD5BA6E319374389879) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_PreSpawned_82B8AEA94C9E5DD5BA6E319374389879");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_PreSpawned_82B8AEA94C9E5DD5BA6E319374389879, SpawnedProjectile) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_PreSpawned_82B8AEA94C9E5DD5BA6E319374389879::SpawnedProjectile' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.NotAuthority_82B8AEA94C9E5DD5BA6E319374389879
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack1_V2_C_NotAuthority_82B8AEA94C9E5DD5BA6E319374389879 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_NotAuthority_82B8AEA94C9E5DD5BA6E319374389879) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_NotAuthority_82B8AEA94C9E5DD5BA6E319374389879");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_NotAuthority_82B8AEA94C9E5DD5BA6E319374389879) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_NotAuthority_82B8AEA94C9E5DD5BA6E319374389879");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_NotAuthority_82B8AEA94C9E5DD5BA6E319374389879, SpawnedProjectile) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_NotAuthority_82B8AEA94C9E5DD5BA6E319374389879::SpawnedProjectile' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.FailedToSpawn_82B8AEA94C9E5DD5BA6E319374389879
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack1_V2_C_FailedToSpawn_82B8AEA94C9E5DD5BA6E319374389879 final
{
public:
	class AOrionProjectile*                       SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_FailedToSpawn_82B8AEA94C9E5DD5BA6E319374389879) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_FailedToSpawn_82B8AEA94C9E5DD5BA6E319374389879");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_FailedToSpawn_82B8AEA94C9E5DD5BA6E319374389879) == 0x000008, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_FailedToSpawn_82B8AEA94C9E5DD5BA6E319374389879");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_FailedToSpawn_82B8AEA94C9E5DD5BA6E319374389879, SpawnedProjectile) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_FailedToSpawn_82B8AEA94C9E5DD5BA6E319374389879::SpawnedProjectile' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.Confirmed_1BF55C5A4A29CCB7C5FF38A6FAAA363E
// 0x0020 (0x0020 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack1_V2_C_Confirmed_1BF55C5A4A29CCB7C5FF38A6FAAA363E final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_Confirmed_1BF55C5A4A29CCB7C5FF38A6FAAA363E) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_Confirmed_1BF55C5A4A29CCB7C5FF38A6FAAA363E");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_Confirmed_1BF55C5A4A29CCB7C5FF38A6FAAA363E) == 0x000020, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_Confirmed_1BF55C5A4A29CCB7C5FF38A6FAAA363E");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_Confirmed_1BF55C5A4A29CCB7C5FF38A6FAAA363E, Targets) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_Confirmed_1BF55C5A4A29CCB7C5FF38A6FAAA363E::Targets' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.Cancelled_1BF55C5A4A29CCB7C5FF38A6FAAA363E
// 0x0020 (0x0020 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack1_V2_C_Cancelled_1BF55C5A4A29CCB7C5FF38A6FAAA363E final
{
public:
	struct FGameplayAbilityTargetDataHandle       Targets;                                           // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_Cancelled_1BF55C5A4A29CCB7C5FF38A6FAAA363E) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_Cancelled_1BF55C5A4A29CCB7C5FF38A6FAAA363E");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_Cancelled_1BF55C5A4A29CCB7C5FF38A6FAAA363E) == 0x000020, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_Cancelled_1BF55C5A4A29CCB7C5FF38A6FAAA363E");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_Cancelled_1BF55C5A4A29CCB7C5FF38A6FAAA363E, Targets) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_Cancelled_1BF55C5A4A29CCB7C5FF38A6FAAA363E::Targets' has a wrong offset!");

// Function GA_Prime_Helix_V2_SpecialAttack1_V2.GA_Prime_Helix_V2_SpecialAttack1_V2_C.GetCurrentIndex
// 0x0040 (0x0040 - 0x0000)
struct GA_Prime_Helix_V2_SpecialAttack1_V2_C_GetCurrentIndex final
{
public:
	int32                                         CurrentCount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorArray;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         TargetIndex;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CalcIndex;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMod_Remainder;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_GetCurrentIndex) == 0x000008, "Wrong alignment on GA_Prime_Helix_V2_SpecialAttack1_V2_C_GetCurrentIndex");
static_assert(sizeof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_GetCurrentIndex) == 0x000040, "Wrong size on GA_Prime_Helix_V2_SpecialAttack1_V2_C_GetCurrentIndex");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_GetCurrentIndex, CurrentCount) == 0x000000, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_GetCurrentIndex::CurrentCount' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_V2_SpecialAttack1_V2_C_GetCurrentIndex, ActorArray) == 0x000008, "Member 'GA_Prime_Helix_V2_SpecialAttack1_V2_C_GetCurrentIndex::ActorArray' has a wrong offset!");
