#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Prime_Helix_PrimaryAttack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack
// 0x0310 (0x0310 - 0x0000)
struct GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor3;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName6;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName5;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate5;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName4;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName3;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate7;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName2;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate8;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate9;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_MakeStruct_GameplayCueParameters;           // 0x00F0(0x00B8)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C* K2Node_DynamicCast_AsBP_Orion_Char_AI_Jungle_Creep_Prime_Helix_V2; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue2; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             CallFunc_GetCurrentTarget_ReturnValue;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x01E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName* CallFunc_PlayMontageAndWaitNotifyName_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0208(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_214[0xC];                                      // 0x0214(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	class UOrionAbilityTask_SpawnOrionActor*      CallFunc_SpawnOrionActorTransform_ReturnValue;     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue3; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue4; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue5; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0280(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x028C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0298(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_OrionCharAI_JungleCreep_PrimeHelix_V2_C* K2Node_DynamicCast_AsBP_Orion_Char_AI_Jungle_Creep_Prime_Helix_V22; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x02B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionChar*                             CallFunc_GetCurrentTarget_ReturnValue2;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x02C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x02D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue3;       // 0x02E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x02F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack) == 0x000010, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack) == 0x000310, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, EntryPoint) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CustomEvent_SpawnedActor3) == 0x000018, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CustomEvent_SpawnedActor3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CustomEvent_SpawnedActor2) == 0x000020, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CustomEvent_SpawnedActor2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CustomEvent_SpawnedActor) == 0x000038, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, Temp_object_Variable) == 0x000050, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CustomEvent_NotifyName6) == 0x000068, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CustomEvent_NotifyName6' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CustomEvent_NotifyName5) == 0x000070, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CustomEvent_NotifyName5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate5) == 0x000078, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CustomEvent_NotifyName4) == 0x000088, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CustomEvent_NotifyName4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate6) == 0x000090, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CustomEvent_NotifyName3) == 0x0000A0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CustomEvent_NotifyName3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate7) == 0x0000A8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CustomEvent_NotifyName2) == 0x0000B8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CustomEvent_NotifyName2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate8) == 0x0000C0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CustomEvent_NotifyName) == 0x0000D0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_CreateDelegate_OutputDelegate9) == 0x0000D8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, Temp_name_Variable) == 0x0000E8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_MakeStruct_GameplayCueParameters) == 0x0000F0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_MakeStruct_GameplayCueParameters' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001A8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_DynamicCast_AsBP_Orion_Char_AI_Jungle_Creep_Prime_Helix_V2) == 0x0001B0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_DynamicCast_AsBP_Orion_Char_AI_Jungle_Creep_Prime_Helix_V2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue2) == 0x0001C0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_GetCurrentTarget_ReturnValue) == 0x0001C8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_GetCurrentTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001D0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_Add_VectorVector_ReturnValue) == 0x0001DC, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0001E8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001F4, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_PlayMontageAndWaitNotifyName_ReturnValue) == 0x000200, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_PlayMontageAndWaitNotifyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_MakeRotFromX_ReturnValue) == 0x000208, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_MakeTransform_ReturnValue) == 0x000220, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_SpawnOrionActorTransform_ReturnValue) == 0x000250, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_SpawnOrionActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000258, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_BeginSpawningActor_ReturnValue) == 0x000260, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_IsValid_ReturnValue2) == 0x000261, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_IsValid_ReturnValue3) == 0x000262, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000263, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue3) == 0x000268, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue4) == 0x000270, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue5) == 0x000278, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000280, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x00028C, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_GetForwardVector_ReturnValue) == 0x000298, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_DynamicCast_AsBP_Orion_Char_AI_Jungle_Creep_Prime_Helix_V22) == 0x0002A8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_DynamicCast_AsBP_Orion_Char_AI_Jungle_Creep_Prime_Helix_V22' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, K2Node_DynamicCast_bSuccess2) == 0x0002B0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0002B4, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_GetCurrentTarget_ReturnValue2) == 0x0002C0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_GetCurrentTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x0002C8, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x0002D4, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_Subtract_VectorVector_ReturnValue3) == 0x0002E0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_Subtract_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_VSize_ReturnValue) == 0x0002EC, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_Normal_ReturnValue) == 0x0002F0, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_Dot_VectorVector_ReturnValue) == 0x0002FC, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_Less_FloatFloat_ReturnValue) == 0x000300, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000301, "Member 'GA_Prime_Helix_PrimaryAttack_C_ExecuteUbergraph_GA_Prime_Helix_PrimaryAttack::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.FailedToSpawn_872DC5B445DB407423B939A03225AC56
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_PrimaryAttack_C_FailedToSpawn_872DC5B445DB407423B939A03225AC56 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_FailedToSpawn_872DC5B445DB407423B939A03225AC56) == 0x000008, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_FailedToSpawn_872DC5B445DB407423B939A03225AC56");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_FailedToSpawn_872DC5B445DB407423B939A03225AC56) == 0x000008, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_FailedToSpawn_872DC5B445DB407423B939A03225AC56");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_FailedToSpawn_872DC5B445DB407423B939A03225AC56, SpawnedActor) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_FailedToSpawn_872DC5B445DB407423B939A03225AC56::SpawnedActor' has a wrong offset!");

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.NotAuthority_872DC5B445DB407423B939A03225AC56
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_PrimaryAttack_C_NotAuthority_872DC5B445DB407423B939A03225AC56 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_NotAuthority_872DC5B445DB407423B939A03225AC56) == 0x000008, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_NotAuthority_872DC5B445DB407423B939A03225AC56");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_NotAuthority_872DC5B445DB407423B939A03225AC56) == 0x000008, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_NotAuthority_872DC5B445DB407423B939A03225AC56");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_NotAuthority_872DC5B445DB407423B939A03225AC56, SpawnedActor) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_NotAuthority_872DC5B445DB407423B939A03225AC56::SpawnedActor' has a wrong offset!");

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnBlendOut_D9C1AA114193BD9693342FB0EFB53450
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_PrimaryAttack_C_OnBlendOut_D9C1AA114193BD9693342FB0EFB53450 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_OnBlendOut_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_OnBlendOut_D9C1AA114193BD9693342FB0EFB53450");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_OnBlendOut_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_OnBlendOut_D9C1AA114193BD9693342FB0EFB53450");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_OnBlendOut_D9C1AA114193BD9693342FB0EFB53450, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_OnBlendOut_D9C1AA114193BD9693342FB0EFB53450::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnCancelled_D9C1AA114193BD9693342FB0EFB53450
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_PrimaryAttack_C_OnCancelled_D9C1AA114193BD9693342FB0EFB53450 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_OnCancelled_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_OnCancelled_D9C1AA114193BD9693342FB0EFB53450");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_OnCancelled_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_OnCancelled_D9C1AA114193BD9693342FB0EFB53450");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_OnCancelled_D9C1AA114193BD9693342FB0EFB53450, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_OnCancelled_D9C1AA114193BD9693342FB0EFB53450::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnCompleted_D9C1AA114193BD9693342FB0EFB53450
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_PrimaryAttack_C_OnCompleted_D9C1AA114193BD9693342FB0EFB53450 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_OnCompleted_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_OnCompleted_D9C1AA114193BD9693342FB0EFB53450");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_OnCompleted_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_OnCompleted_D9C1AA114193BD9693342FB0EFB53450");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_OnCompleted_D9C1AA114193BD9693342FB0EFB53450, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_OnCompleted_D9C1AA114193BD9693342FB0EFB53450::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnInterrupted_D9C1AA114193BD9693342FB0EFB53450
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_PrimaryAttack_C_OnInterrupted_D9C1AA114193BD9693342FB0EFB53450 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_OnInterrupted_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_OnInterrupted_D9C1AA114193BD9693342FB0EFB53450");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_OnInterrupted_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_OnInterrupted_D9C1AA114193BD9693342FB0EFB53450");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_OnInterrupted_D9C1AA114193BD9693342FB0EFB53450, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_OnInterrupted_D9C1AA114193BD9693342FB0EFB53450::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_PrimaryAttack_C_OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_OnNotifyBegin_D9C1AA114193BD9693342FB0EFB53450::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) GA_Prime_Helix_PrimaryAttack_C_OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450) == 0x000008, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450, NotifyName) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_OnNotifyEnd_D9C1AA114193BD9693342FB0EFB53450::NotifyName' has a wrong offset!");

// Function GA_Prime_Helix_PrimaryAttack.GA_Prime_Helix_PrimaryAttack_C.Success_872DC5B445DB407423B939A03225AC56
// 0x0008 (0x0008 - 0x0000)
struct GA_Prime_Helix_PrimaryAttack_C_Success_872DC5B445DB407423B939A03225AC56 final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Prime_Helix_PrimaryAttack_C_Success_872DC5B445DB407423B939A03225AC56) == 0x000008, "Wrong alignment on GA_Prime_Helix_PrimaryAttack_C_Success_872DC5B445DB407423B939A03225AC56");
static_assert(sizeof(GA_Prime_Helix_PrimaryAttack_C_Success_872DC5B445DB407423B939A03225AC56) == 0x000008, "Wrong size on GA_Prime_Helix_PrimaryAttack_C_Success_872DC5B445DB407423B939A03225AC56");
static_assert(offsetof(GA_Prime_Helix_PrimaryAttack_C_Success_872DC5B445DB407423B939A03225AC56, SpawnedActor) == 0x000000, "Member 'GA_Prime_Helix_PrimaryAttack_C_Success_872DC5B445DB407423B939A03225AC56::SpawnedActor' has a wrong offset!");

}

