#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PrimeHelix_Passive

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_PrimeHelix_Passive.GA_PrimeHelix_Passive_C.ExecuteUbergraph_GA_PrimeHelix_Passive
// 0x0078 (0x0078 - 0x0000)
struct GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionPlayerState_Game*                 K2Node_DynamicCast_AsOrion_Player_State_Game;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AOrionCarriedObjective*>         CallFunc_GetAttachedBuffs_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionCarriedObjective*                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PrimeHelix_v2_C*                    K2Node_DynamicCast_AsBP_Prime_Helix_V_2;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive) == 0x000008, "Wrong alignment on GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive");
static_assert(sizeof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive) == 0x000078, "Wrong size on GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, EntryPoint) == 0x000000, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, K2Node_DynamicCast_AsOrion_Player_State_Game) == 0x000010, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::K2Node_DynamicCast_AsOrion_Player_State_Game' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, CallFunc_GetAttachedBuffs_ReturnValue) == 0x000030, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::CallFunc_GetAttachedBuffs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000048, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, Temp_int_Array_Index_Variable) == 0x000054, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, CallFunc_Array_Get_Item) == 0x000058, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, K2Node_DynamicCast_AsBP_Prime_Helix_V_2) == 0x000060, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::K2Node_DynamicCast_AsBP_Prime_Helix_V_2' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, K2Node_DynamicCast_bSuccess2) == 0x000068, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'GA_PrimeHelix_Passive_C_ExecuteUbergraph_GA_PrimeHelix_Passive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

