#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Sprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Sprint.GA_Sprint_C
// 0x0090 (0x0C00 - 0x0B70)
class UGA_Sprint_C final : public UOrionAbility_Sprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTagRequirements               WaitAbilityTagRequirements;                        // 0x0B78(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagRequirements               WaitGameplayEffectTagRequirements;                 // 0x0BB8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Sprint(int32 EntryPoint);
	void InvalidHandle_711037F745707DCAFF2A8C86C95CC031(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
	void K2_ActivateAbility();
	void K2_OnEndAbility();
	void OnActivate_4EC91BF54B2EA9FAB7A88D9A21C9F04A(class UGameplayAbility* ActivatedAbility);
	void OnApplied_A72AD8D04F3B3C97A2458FBE112A4790(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);
	void OnCancel_8AE9FEA047AA7A870564CC93C44E1E24();
	void OnCancel_BD1837F2479F6C09633F78AD2862BAD2();
	void OnFinish_CE0FB0E74408B744FA5A7BB47046CB10();
	void OnRemoved_711037F745707DCAFF2A8C86C95CC031(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
	void OnStateEnded_CE0609CC454AB8343CE0618523CDB11A();
	void OnStateEnded_D70BFB76427505AF993D609AC9934F2C();
	void OnStateInterrupted_CE0609CC454AB8343CE0618523CDB11A();
	void OnStateInterrupted_D70BFB76427505AF993D609AC9934F2C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Sprint_C">();
	}
	static class UGA_Sprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Sprint_C>();
	}
};
static_assert(alignof(UGA_Sprint_C) == 0x000010, "Wrong alignment on UGA_Sprint_C");
static_assert(sizeof(UGA_Sprint_C) == 0x000C00, "Wrong size on UGA_Sprint_C");
static_assert(offsetof(UGA_Sprint_C, UberGraphFrame) == 0x000B70, "Member 'UGA_Sprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Sprint_C, WaitAbilityTagRequirements) == 0x000B78, "Member 'UGA_Sprint_C::WaitAbilityTagRequirements' has a wrong offset!");
static_assert(offsetof(UGA_Sprint_C, WaitGameplayEffectTagRequirements) == 0x000BB8, "Member 'UGA_Sprint_C::WaitGameplayEffectTagRequirements' has a wrong offset!");

}

