#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Announcer_Dialog_FirstBlood

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Announcer_Dialog_FirstBlood.GC_Announcer_Dialog_FirstBlood_C
// 0x0020 (0x0730 - 0x0710)
class AGC_Announcer_Dialog_FirstBlood_C final : public AOrionGameplayCueNotify_Burst_Latent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(Transient, DuplicateTransient)
	float                                         FirstBloodDelay;                                   // 0x0718(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DialogDelay;                                       // 0x071C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FirstBloodDialog;                                  // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Announcer_Dialog_FirstBlood(int32 EntryPoint);
	void K2_OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* BurstParticleSystems, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* BurstNiagaraParticleSystems, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Announcer_Dialog_FirstBlood_C">();
	}
	static class AGC_Announcer_Dialog_FirstBlood_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Announcer_Dialog_FirstBlood_C>();
	}
};
static_assert(alignof(AGC_Announcer_Dialog_FirstBlood_C) == 0x000010, "Wrong alignment on AGC_Announcer_Dialog_FirstBlood_C");
static_assert(sizeof(AGC_Announcer_Dialog_FirstBlood_C) == 0x000730, "Wrong size on AGC_Announcer_Dialog_FirstBlood_C");
static_assert(offsetof(AGC_Announcer_Dialog_FirstBlood_C, UberGraphFrame) == 0x000710, "Member 'AGC_Announcer_Dialog_FirstBlood_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_FirstBlood_C, FirstBloodDelay) == 0x000718, "Member 'AGC_Announcer_Dialog_FirstBlood_C::FirstBloodDelay' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_FirstBlood_C, DialogDelay) == 0x00071C, "Member 'AGC_Announcer_Dialog_FirstBlood_C::DialogDelay' has a wrong offset!");
static_assert(offsetof(AGC_Announcer_Dialog_FirstBlood_C, FirstBloodDialog) == 0x000720, "Member 'AGC_Announcer_Dialog_FirstBlood_C::FirstBloodDialog' has a wrong offset!");

}

