#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Banner_Spawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Banner_Spawn.GC_Banner_Spawn_C.ExecuteUbergraph_GC_Banner_Spawn
// 0x0120 (0x0120 - 0x0000)
struct GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_LoopingParticleSystem;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystem;             // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_LoopingNiagaraParticleSystem;         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class AOrionBanner*                           K2Node_DynamicCast_AsOrion_Banner;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetTeamColorFromMPC_ReturnValue;          // 0x0104(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0114(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn) == 0x000008, "Wrong alignment on GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn");
static_assert(sizeof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn) == 0x000120, "Wrong size on GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, EntryPoint) == 0x000000, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, K2Node_Event_LoopingParticleSystem) == 0x0000C8, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::K2Node_Event_LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, K2Node_Event_AdditionalParticleSystem) == 0x0000D0, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::K2Node_Event_AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, K2Node_Event_LoopingNiagaraParticleSystem) == 0x0000E0, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::K2Node_Event_LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, K2Node_DynamicCast_AsOrion_Banner) == 0x0000F8, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::K2Node_DynamicCast_AsOrion_Banner' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, CallFunc_GetTeamColorFromMPC_ReturnValue) == 0x000104, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::CallFunc_GetTeamColorFromMPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000114, "Member 'GC_Banner_Spawn_C_ExecuteUbergraph_GC_Banner_Spawn::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

// Function GC_Banner_Spawn.GC_Banner_Spawn_C.K2_WhileActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_Banner_Spawn_C_K2_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               LoopingParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystem;                          // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      LoopingNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Banner_Spawn_C_K2_WhileActive) == 0x000008, "Wrong alignment on GC_Banner_Spawn_C_K2_WhileActive");
static_assert(sizeof(GC_Banner_Spawn_C_K2_WhileActive) == 0x0000F0, "Wrong size on GC_Banner_Spawn_C_K2_WhileActive");
static_assert(offsetof(GC_Banner_Spawn_C_K2_WhileActive, MyTarget) == 0x000000, "Member 'GC_Banner_Spawn_C_K2_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_K2_WhileActive, Parameters) == 0x000008, "Member 'GC_Banner_Spawn_C_K2_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_K2_WhileActive, LoopingParticleSystem) == 0x0000C0, "Member 'GC_Banner_Spawn_C_K2_WhileActive::LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_K2_WhileActive, AdditionalParticleSystem) == 0x0000C8, "Member 'GC_Banner_Spawn_C_K2_WhileActive::AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_K2_WhileActive, LoopingNiagaraParticleSystem) == 0x0000D8, "Member 'GC_Banner_Spawn_C_K2_WhileActive::LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Banner_Spawn_C_K2_WhileActive, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_Banner_Spawn_C_K2_WhileActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

}

