#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Card_PrimeCard_MvS

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Card_PrimeCard_MvS.GC_Card_PrimeCard_MvS_C.ExecuteUbergraph_GC_Card_PrimeCard_MvS
// 0x01F0 (0x01F0 - 0x0000)
struct GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_RemovalParticleSystem;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_RemovalNiagaraParticleSystem;         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget2;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters2;                          // 0x0100(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_ApplicationParticleSystem;            // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems2;           // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_ApplicationCameraShakeInstance;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_Event_ApplicationNiagaraParticleSystem;     // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems2;    // 0x01E0(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS) == 0x000008, "Wrong alignment on GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS");
static_assert(sizeof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS) == 0x0001F0, "Wrong size on GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, EntryPoint) == 0x000000, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_RemovalParticleSystem) == 0x0000C8, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_AdditionalParticleSystems) == 0x0000D0, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_RemovalNiagaraParticleSystem) == 0x0000E0, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_MyTarget2) == 0x0000F8, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_MyTarget2' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_Parameters2) == 0x000100, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_Parameters2' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_ApplicationParticleSystem) == 0x0001B8, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_AdditionalParticleSystems2) == 0x0001C0, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_AdditionalParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_ApplicationCameraShakeInstance) == 0x0001D0, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_ApplicationNiagaraParticleSystem) == 0x0001D8, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS, K2Node_Event_AdditionalNiagaraParticleSystems2) == 0x0001E0, "Member 'GC_Card_PrimeCard_MvS_C_ExecuteUbergraph_GC_Card_PrimeCard_MvS::K2Node_Event_AdditionalNiagaraParticleSystems2' has a wrong offset!");

// Function GC_Card_PrimeCard_MvS.GC_Card_PrimeCard_MvS_C.K2_OnRemove
// 0x00F0 (0x00F0 - 0x0000)
struct GC_Card_PrimeCard_MvS_C_K2_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               RemovalParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      RemovalNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Card_PrimeCard_MvS_C_K2_OnRemove) == 0x000008, "Wrong alignment on GC_Card_PrimeCard_MvS_C_K2_OnRemove");
static_assert(sizeof(GC_Card_PrimeCard_MvS_C_K2_OnRemove) == 0x0000F0, "Wrong size on GC_Card_PrimeCard_MvS_C_K2_OnRemove");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnRemove, MyTarget) == 0x000000, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnRemove, Parameters) == 0x000008, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnRemove, RemovalParticleSystem) == 0x0000C0, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnRemove::RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnRemove, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnRemove::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnRemove, RemovalNiagaraParticleSystem) == 0x0000D8, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnRemove::RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnRemove, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnRemove::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_Card_PrimeCard_MvS.GC_Card_PrimeCard_MvS_C.K2_OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Card_PrimeCard_MvS_C_K2_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               ApplicationParticleSystem;                         // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           ApplicationCameraShakeInstance;                    // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ApplicationNiagaraParticleSystem;                  // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Card_PrimeCard_MvS_C_K2_OnActive) == 0x000008, "Wrong alignment on GC_Card_PrimeCard_MvS_C_K2_OnActive");
static_assert(sizeof(GC_Card_PrimeCard_MvS_C_K2_OnActive) == 0x0000F8, "Wrong size on GC_Card_PrimeCard_MvS_C_K2_OnActive");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnActive, MyTarget) == 0x000000, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnActive, Parameters) == 0x000008, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnActive, ApplicationParticleSystem) == 0x0000C0, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnActive::ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnActive, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnActive::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnActive, ApplicationCameraShakeInstance) == 0x0000D8, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnActive::ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnActive, ApplicationNiagaraParticleSystem) == 0x0000E0, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnActive::ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Card_PrimeCard_MvS_C_K2_OnActive, AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_Card_PrimeCard_MvS_C_K2_OnActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

}

