#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Core_Proj_Spawn

#include "Basic.hpp"

#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Core_Proj_Spawn.GC_Core_Proj_Spawn_C
// 0x0020 (0x0660 - 0x0640)
class UGC_Core_Proj_Spawn_C final : public UOrionGameplayCueNotify_Burst
{
public:
	class FName                                   ListenerStyle_Name;                                // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FiringAtNonHeroCue;                                // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RecoilAnim;                                        // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBurst(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* BurstParticleSystem, TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance, class UNiagaraComponent* BurstNiagaraParticleSystem, TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Core_Proj_Spawn_C">();
	}
	static class UGC_Core_Proj_Spawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_Core_Proj_Spawn_C>();
	}
};
static_assert(alignof(UGC_Core_Proj_Spawn_C) == 0x000010, "Wrong alignment on UGC_Core_Proj_Spawn_C");
static_assert(sizeof(UGC_Core_Proj_Spawn_C) == 0x000660, "Wrong size on UGC_Core_Proj_Spawn_C");
static_assert(offsetof(UGC_Core_Proj_Spawn_C, ListenerStyle_Name) == 0x000640, "Member 'UGC_Core_Proj_Spawn_C::ListenerStyle_Name' has a wrong offset!");
static_assert(offsetof(UGC_Core_Proj_Spawn_C, FiringAtNonHeroCue) == 0x000648, "Member 'UGC_Core_Proj_Spawn_C::FiringAtNonHeroCue' has a wrong offset!");
static_assert(offsetof(UGC_Core_Proj_Spawn_C, RecoilAnim) == 0x000650, "Member 'UGC_Core_Proj_Spawn_C::RecoilAnim' has a wrong offset!");

}

