#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Core_TakeDamage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Core_TakeDamage.GC_Core_TakeDamage_C.OnBurst
// 0x0128 (0x0128 - 0x0000)
struct GC_Core_TakeDamage_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               BurstParticleSystem;                               // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BurstNiagaraParticleSystem;                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class ACore_v4_AOE_C*                         K2Node_DynamicCast_AsCore_V_4_AOE;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetTeamColorFromMPC_ReturnValue;          // 0x010C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Core_TakeDamage_C_OnBurst) == 0x000008, "Wrong alignment on GC_Core_TakeDamage_C_OnBurst");
static_assert(sizeof(GC_Core_TakeDamage_C_OnBurst) == 0x000128, "Wrong size on GC_Core_TakeDamage_C_OnBurst");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, MyTarget) == 0x000000, "Member 'GC_Core_TakeDamage_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Core_TakeDamage_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, BurstParticleSystem) == 0x0000C0, "Member 'GC_Core_TakeDamage_C_OnBurst::BurstParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Core_TakeDamage_C_OnBurst::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, BurstCameraShakeInstance) == 0x0000D8, "Member 'GC_Core_TakeDamage_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, BurstDecalInstance) == 0x0000E0, "Member 'GC_Core_TakeDamage_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, BurstNiagaraParticleSystem) == 0x0000E8, "Member 'GC_Core_TakeDamage_C_OnBurst::BurstNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, AdditionalNiagaraParticleSystems) == 0x0000F0, "Member 'GC_Core_TakeDamage_C_OnBurst::AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, K2Node_DynamicCast_AsCore_V_4_AOE) == 0x000100, "Member 'GC_Core_TakeDamage_C_OnBurst::K2Node_DynamicCast_AsCore_V_4_AOE' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GC_Core_TakeDamage_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, CallFunc_GetTeamColorFromMPC_ReturnValue) == 0x00010C, "Member 'GC_Core_TakeDamage_C_OnBurst::CallFunc_GetTeamColorFromMPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Core_TakeDamage_C_OnBurst, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000120, "Member 'GC_Core_TakeDamage_C_OnBurst::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

}

