#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Core_TakeDamage

#include "Basic.hpp"

#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Core_TakeDamage.GC_Core_TakeDamage_C
// 0x0020 (0x0660 - 0x0640)
class UGC_Core_TakeDamage_C final : public UOrionGameplayCueNotify_Burst
{
public:
	class FName                                   TeamColor;                                         // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        PS_Damage;                                         // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FX_Center;                                         // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBurst(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* BurstParticleSystem, TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance, class UNiagaraComponent* BurstNiagaraParticleSystem, TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Core_TakeDamage_C">();
	}
	static class UGC_Core_TakeDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_Core_TakeDamage_C>();
	}
};
static_assert(alignof(UGC_Core_TakeDamage_C) == 0x000010, "Wrong alignment on UGC_Core_TakeDamage_C");
static_assert(sizeof(UGC_Core_TakeDamage_C) == 0x000660, "Wrong size on UGC_Core_TakeDamage_C");
static_assert(offsetof(UGC_Core_TakeDamage_C, TeamColor) == 0x000640, "Member 'UGC_Core_TakeDamage_C::TeamColor' has a wrong offset!");
static_assert(offsetof(UGC_Core_TakeDamage_C, PS_Damage) == 0x000648, "Member 'UGC_Core_TakeDamage_C::PS_Damage' has a wrong offset!");
static_assert(offsetof(UGC_Core_TakeDamage_C, FX_Center) == 0x000650, "Member 'UGC_Core_TakeDamage_C::FX_Center' has a wrong offset!");

}

