#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Death

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Death.GC_Death_C
// 0x0050 (0x0760 - 0x0710)
class AGC_Death_C final : public AOrionGameplayCueNotify_Burst_Latent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(Transient, DuplicateTransient)
	class UObject*                                CheckForHero;                                      // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        HeroDirectionalDeathFX;                            // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_Death;                                          // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_Death_Light_Rays;                               // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DeathRaySound;                                     // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_Coin_Fountain;                                  // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Coin_Fountain;                                 // 0x0748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPlayerKill;                                      // 0x0749(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74A[0x6];                                      // 0x074A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CoinSound;                                         // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Coin_Delay;                                        // 0x0758(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSameTeam;                                        // 0x075C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GC_Death(int32 EntryPoint);
	void ReceiveBeginPlay();
	void K2_OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* BurstParticleSystems, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* BurstNiagaraParticleSystems, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Death_C">();
	}
	static class AGC_Death_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Death_C>();
	}
};
static_assert(alignof(AGC_Death_C) == 0x000010, "Wrong alignment on AGC_Death_C");
static_assert(sizeof(AGC_Death_C) == 0x000760, "Wrong size on AGC_Death_C");
static_assert(offsetof(AGC_Death_C, UberGraphFrame) == 0x000710, "Member 'AGC_Death_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, CheckForHero) == 0x000718, "Member 'AGC_Death_C::CheckForHero' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, HeroDirectionalDeathFX) == 0x000720, "Member 'AGC_Death_C::HeroDirectionalDeathFX' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, FX_Death) == 0x000728, "Member 'AGC_Death_C::FX_Death' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, FX_Death_Light_Rays) == 0x000730, "Member 'AGC_Death_C::FX_Death_Light_Rays' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, DeathRaySound) == 0x000738, "Member 'AGC_Death_C::DeathRaySound' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, FX_Coin_Fountain) == 0x000740, "Member 'AGC_Death_C::FX_Coin_Fountain' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, Use_Coin_Fountain) == 0x000748, "Member 'AGC_Death_C::Use_Coin_Fountain' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, IsPlayerKill) == 0x000749, "Member 'AGC_Death_C::IsPlayerKill' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, CoinSound) == 0x000750, "Member 'AGC_Death_C::CoinSound' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, Coin_Delay) == 0x000758, "Member 'AGC_Death_C::Coin_Delay' has a wrong offset!");
static_assert(offsetof(AGC_Death_C, IsSameTeam) == 0x00075C, "Member 'AGC_Death_C::IsSameTeam' has a wrong offset!");

}

