#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Death

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_Death.GC_Death_C.ExecuteUbergraph_GC_Death
// 0x01F0 (0x01F0 - 0x0000)
struct GC_Death_C_ExecuteUbergraph_GC_Death final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetActiveRotationalContentTags_ReturnValue; // 0x0018(0x0020)()
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0040(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_BurstParticleSystems;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_BurstNiagaraParticleSystems;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x012C(0x000C)(IsPlainOldData, NoDestructor)
	class AOrionChar*                             K2Node_DynamicCast_AsOrion_Char;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue2;                      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEstimatedCXPBounty_ReturnValue;        // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x014C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue2;           // 0x0158(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundTeamAdjusted_ReturnValue;       // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetTeamColorFromMPC_ReturnValue;          // 0x0190(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue3;           // 0x01A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x01AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue3;      // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue2;    // 0x01C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue4;           // 0x01CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue4;      // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDecoy_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CompareActorTeams_ReturnValue;            // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Death_C_ExecuteUbergraph_GC_Death) == 0x000008, "Wrong alignment on GC_Death_C_ExecuteUbergraph_GC_Death");
static_assert(sizeof(GC_Death_C_ExecuteUbergraph_GC_Death) == 0x0001F0, "Wrong size on GC_Death_C_ExecuteUbergraph_GC_Death");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, EntryPoint) == 0x000000, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_BooleanAND_ReturnValue2) == 0x000011, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_BooleanAND_ReturnValue3) == 0x000013, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_GetActiveRotationalContentTags_ReturnValue) == 0x000018, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_GetActiveRotationalContentTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_Event_MyTarget) == 0x000038, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_Event_Parameters) == 0x000040, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_Event_BurstParticleSystems) == 0x0000F8, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_Event_BurstParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_Event_AdditionalParticleSystems) == 0x000100, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_Event_BurstNiagaraParticleSystems) == 0x000110, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_Event_BurstNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x000118, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_HasTag_ReturnValue) == 0x000128, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000129, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_MakeRotFromX_ReturnValue) == 0x00012C, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_DynamicCast_AsOrion_Char) == 0x000138, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_DynamicCast_AsOrion_Char' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_HasTag_ReturnValue2) == 0x000141, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_HasTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_GetEstimatedCXPBounty_ReturnValue) == 0x000144, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_GetEstimatedCXPBounty_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000148, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_GetSocketLocation_ReturnValue) == 0x00014C, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_GetSocketLocation_ReturnValue2) == 0x000158, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_GetSocketLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000168, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x000170, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000178, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, K2Node_DynamicCast_bSuccess2) == 0x000180, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_IsValid_ReturnValue) == 0x000181, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_SpawnSoundTeamAdjusted_ReturnValue) == 0x000188, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_SpawnSoundTeamAdjusted_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_GetTeamColorFromMPC_ReturnValue) == 0x000190, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_GetTeamColorFromMPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_GetSocketLocation_ReturnValue3) == 0x0001A0, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_GetSocketLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0001AC, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_SpawnEmitterAtLocation_ReturnValue3) == 0x0001B8, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_SpawnEmitterAtLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_Conv_LinearColorToVector_ReturnValue2) == 0x0001C0, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_Conv_LinearColorToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_GetSocketLocation_ReturnValue4) == 0x0001CC, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_GetSocketLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001D8, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_SpawnEmitterAtLocation_ReturnValue4) == 0x0001E0, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_SpawnEmitterAtLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_IsDecoy_ReturnValue) == 0x0001E8, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_IsDecoy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_IsValid_ReturnValue2) == 0x0001E9, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Death_C_ExecuteUbergraph_GC_Death, CallFunc_CompareActorTeams_ReturnValue) == 0x0001EA, "Member 'GC_Death_C_ExecuteUbergraph_GC_Death::CallFunc_CompareActorTeams_ReturnValue' has a wrong offset!");

// Function GC_Death.GC_Death_C.K2_OnExecute
// 0x00F0 (0x00F0 - 0x0000)
struct GC_Death_C_K2_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               BurstParticleSystems;                              // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      BurstNiagaraParticleSystems;                       // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Death_C_K2_OnExecute) == 0x000008, "Wrong alignment on GC_Death_C_K2_OnExecute");
static_assert(sizeof(GC_Death_C_K2_OnExecute) == 0x0000F0, "Wrong size on GC_Death_C_K2_OnExecute");
static_assert(offsetof(GC_Death_C_K2_OnExecute, MyTarget) == 0x000000, "Member 'GC_Death_C_K2_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Death_C_K2_OnExecute, Parameters) == 0x000008, "Member 'GC_Death_C_K2_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Death_C_K2_OnExecute, BurstParticleSystems) == 0x0000C0, "Member 'GC_Death_C_K2_OnExecute::BurstParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Death_C_K2_OnExecute, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Death_C_K2_OnExecute::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Death_C_K2_OnExecute, BurstNiagaraParticleSystems) == 0x0000D8, "Member 'GC_Death_C_K2_OnExecute::BurstNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Death_C_K2_OnExecute, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_Death_C_K2_OnExecute::AdditionalNiagaraParticleSystems' has a wrong offset!");

}

