#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_Holiday_December

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Hero_Holiday_December.GC_Hero_Holiday_December_C
// 0x0020 (0x0860 - 0x0840)
class AGC_Hero_Holiday_December_C final : public AOrionGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_PostFade_14D3AD414386520A92B0558498F8AC4E; // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_14D3AD414386520A92B0558498F8AC4E; // 0x0854(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_855[0x3];                                      // 0x0855(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Hero_Holiday_December(int32 EntryPoint);
	void K2_OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* RemovalParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* RemovalNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* LoopingParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystem, class UNiagaraComponent* LoopingNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Hero_Holiday_December_C">();
	}
	static class AGC_Hero_Holiday_December_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Hero_Holiday_December_C>();
	}
};
static_assert(alignof(AGC_Hero_Holiday_December_C) == 0x000010, "Wrong alignment on AGC_Hero_Holiday_December_C");
static_assert(sizeof(AGC_Hero_Holiday_December_C) == 0x000860, "Wrong size on AGC_Hero_Holiday_December_C");
static_assert(offsetof(AGC_Hero_Holiday_December_C, UberGraphFrame) == 0x000840, "Member 'AGC_Hero_Holiday_December_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Holiday_December_C, PostProcess) == 0x000848, "Member 'AGC_Hero_Holiday_December_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Holiday_December_C, Timeline_0_PostFade_14D3AD414386520A92B0558498F8AC4E) == 0x000850, "Member 'AGC_Hero_Holiday_December_C::Timeline_0_PostFade_14D3AD414386520A92B0558498F8AC4E' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Holiday_December_C, Timeline_0__Direction_14D3AD414386520A92B0558498F8AC4E) == 0x000854, "Member 'AGC_Hero_Holiday_December_C::Timeline_0__Direction_14D3AD414386520A92B0558498F8AC4E' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Holiday_December_C, Timeline_0) == 0x000858, "Member 'AGC_Hero_Holiday_December_C::Timeline_0' has a wrong offset!");

}

