#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Item_Debuff_Major

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Item_Debuff_Major.GC_Item_Debuff_Major_C.OnBurst
// 0x0160 (0x0160 - 0x0000)
struct GC_Item_Debuff_Major_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               BurstParticleSystem;                               // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BurstNiagaraParticleSystem;                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0104(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0114(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionCharHero*                         K2Node_DynamicCast_AsOrion_Char_Hero;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0144(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0154(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Item_Debuff_Major_C_OnBurst) == 0x000008, "Wrong alignment on GC_Item_Debuff_Major_C_OnBurst");
static_assert(sizeof(GC_Item_Debuff_Major_C_OnBurst) == 0x000160, "Wrong size on GC_Item_Debuff_Major_C_OnBurst");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, MyTarget) == 0x000000, "Member 'GC_Item_Debuff_Major_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Item_Debuff_Major_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, BurstParticleSystem) == 0x0000C0, "Member 'GC_Item_Debuff_Major_C_OnBurst::BurstParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_Item_Debuff_Major_C_OnBurst::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, BurstCameraShakeInstance) == 0x0000D8, "Member 'GC_Item_Debuff_Major_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, BurstDecalInstance) == 0x0000E0, "Member 'GC_Item_Debuff_Major_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, BurstNiagaraParticleSystem) == 0x0000E8, "Member 'GC_Item_Debuff_Major_C_OnBurst::BurstNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, AdditionalNiagaraParticleSystems) == 0x0000F0, "Member 'GC_Item_Debuff_Major_C_OnBurst::AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000104, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000114, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_IsValid_ReturnValue2) == 0x000120, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, K2Node_DynamicCast_AsOrion_Char_Hero) == 0x000128, "Member 'GC_Item_Debuff_Major_C_OnBurst::K2Node_DynamicCast_AsOrion_Char_Hero' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'GC_Item_Debuff_Major_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000134, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000138, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_FClamp_ReturnValue) == 0x00013C, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_FClamp_ReturnValue2) == 0x000140, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_MakeVector_ReturnValue) == 0x000144, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_Less_FloatFloat_ReturnValue) == 0x000150, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000151, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Item_Debuff_Major_C_OnBurst, CallFunc_MakeVector_ReturnValue2) == 0x000154, "Member 'GC_Item_Debuff_Major_C_OnBurst::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");

}

