#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Item_Custom_Fortify_Order

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Item_Custom_Fortify_Order.GC_Item_Custom_Fortify_Order_C
// 0x0030 (0x0870 - 0x0840)
class AGC_Item_Custom_Fortify_Order_C final : public AOrionGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(Transient, DuplicateTransient)
	class USoundBase*                             StructureFortifyActivateSound;                     // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StructureFortifyEndSound;                          // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StructureFortifyLoopSound;                         // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NewVar_0;                                          // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FortifyLoopAudio;                                  // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Item_Custom_Fortify_Order(int32 EntryPoint);
	void K2_OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* RemovalParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* RemovalNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* LoopingParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystem, class UNiagaraComponent* LoopingNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* ApplicationParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UCameraShake* ApplicationCameraShakeInstance, class UNiagaraComponent* ApplicationNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Item_Custom_Fortify_Order_C">();
	}
	static class AGC_Item_Custom_Fortify_Order_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Item_Custom_Fortify_Order_C>();
	}
};
static_assert(alignof(AGC_Item_Custom_Fortify_Order_C) == 0x000010, "Wrong alignment on AGC_Item_Custom_Fortify_Order_C");
static_assert(sizeof(AGC_Item_Custom_Fortify_Order_C) == 0x000870, "Wrong size on AGC_Item_Custom_Fortify_Order_C");
static_assert(offsetof(AGC_Item_Custom_Fortify_Order_C, UberGraphFrame) == 0x000840, "Member 'AGC_Item_Custom_Fortify_Order_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Item_Custom_Fortify_Order_C, StructureFortifyActivateSound) == 0x000848, "Member 'AGC_Item_Custom_Fortify_Order_C::StructureFortifyActivateSound' has a wrong offset!");
static_assert(offsetof(AGC_Item_Custom_Fortify_Order_C, StructureFortifyEndSound) == 0x000850, "Member 'AGC_Item_Custom_Fortify_Order_C::StructureFortifyEndSound' has a wrong offset!");
static_assert(offsetof(AGC_Item_Custom_Fortify_Order_C, StructureFortifyLoopSound) == 0x000858, "Member 'AGC_Item_Custom_Fortify_Order_C::StructureFortifyLoopSound' has a wrong offset!");
static_assert(offsetof(AGC_Item_Custom_Fortify_Order_C, NewVar_0) == 0x000860, "Member 'AGC_Item_Custom_Fortify_Order_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AGC_Item_Custom_Fortify_Order_C, FortifyLoopAudio) == 0x000868, "Member 'AGC_Item_Custom_Fortify_Order_C::FortifyLoopAudio' has a wrong offset!");

}

