#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SentryTurret_Dmg_02

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_SentryTurret_Dmg_02.GC_SentryTurret_Dmg_02_C.ExecuteUbergraph_GC_SentryTurret_Dmg_02
// 0x0308 (0x0308 - 0x0000)
struct GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget3;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters3;                          // 0x0018(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_ApplicationParticleSystem;            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems2;           // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_ApplicationCameraShakeInstance;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_Event_ApplicationNiagaraParticleSystem;     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems3;    // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget2;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters2;                          // 0x0110(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_LoopingParticleSystem;                // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystem;             // 0x01D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_LoopingNiagaraParticleSystem;         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems2;    // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0200(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_RemovalParticleSystem;                // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x02C0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_RemovalNiagaraParticleSystem;         // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x02D8(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_SentryTurret_C*                     K2Node_DynamicCast_AsBP_Sentry_Turret;             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0305(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02) == 0x000008, "Wrong alignment on GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02");
static_assert(sizeof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02) == 0x000308, "Wrong size on GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, EntryPoint) == 0x000000, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_MyTarget3) == 0x000010, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_MyTarget3' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_Parameters3) == 0x000018, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_Parameters3' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_ApplicationParticleSystem) == 0x0000D0, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_AdditionalParticleSystems2) == 0x0000D8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_AdditionalParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_ApplicationCameraShakeInstance) == 0x0000E8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_ApplicationNiagaraParticleSystem) == 0x0000F0, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_AdditionalNiagaraParticleSystems3) == 0x0000F8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_AdditionalNiagaraParticleSystems3' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_MyTarget2) == 0x000108, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_MyTarget2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_Parameters2) == 0x000110, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_Parameters2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_LoopingParticleSystem) == 0x0001C8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_AdditionalParticleSystem) == 0x0001D0, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_LoopingNiagaraParticleSystem) == 0x0001E0, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_AdditionalNiagaraParticleSystems2) == 0x0001E8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_AdditionalNiagaraParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_MyTarget) == 0x0001F8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_Parameters) == 0x000200, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_RemovalParticleSystem) == 0x0002B8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_AdditionalParticleSystems) == 0x0002C0, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_RemovalNiagaraParticleSystem) == 0x0002D0, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0002D8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_DynamicCast_AsBP_Sentry_Turret) == 0x0002E8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_DynamicCast_AsBP_Sentry_Turret' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0002F1, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, CallFunc_Array_Get_Item) == 0x0002F8, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, CallFunc_Array_Length_ReturnValue) == 0x000300, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, CallFunc_IsValid_ReturnValue) == 0x000304, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02, CallFunc_Less_IntInt_ReturnValue) == 0x000305, "Member 'GC_SentryTurret_Dmg_02_C_ExecuteUbergraph_GC_SentryTurret_Dmg_02::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GC_SentryTurret_Dmg_02.GC_SentryTurret_Dmg_02_C.K2_OnRemove
// 0x00F0 (0x00F0 - 0x0000)
struct GC_SentryTurret_Dmg_02_C_K2_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               RemovalParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      RemovalNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_SentryTurret_Dmg_02_C_K2_OnRemove) == 0x000008, "Wrong alignment on GC_SentryTurret_Dmg_02_C_K2_OnRemove");
static_assert(sizeof(GC_SentryTurret_Dmg_02_C_K2_OnRemove) == 0x0000F0, "Wrong size on GC_SentryTurret_Dmg_02_C_K2_OnRemove");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnRemove, MyTarget) == 0x000000, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnRemove, Parameters) == 0x000008, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnRemove, RemovalParticleSystem) == 0x0000C0, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnRemove::RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnRemove, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnRemove::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnRemove, RemovalNiagaraParticleSystem) == 0x0000D8, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnRemove::RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnRemove, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnRemove::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_SentryTurret_Dmg_02.GC_SentryTurret_Dmg_02_C.K2_WhileActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_SentryTurret_Dmg_02_C_K2_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               LoopingParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystem;                          // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      LoopingNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_SentryTurret_Dmg_02_C_K2_WhileActive) == 0x000008, "Wrong alignment on GC_SentryTurret_Dmg_02_C_K2_WhileActive");
static_assert(sizeof(GC_SentryTurret_Dmg_02_C_K2_WhileActive) == 0x0000F0, "Wrong size on GC_SentryTurret_Dmg_02_C_K2_WhileActive");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_WhileActive, MyTarget) == 0x000000, "Member 'GC_SentryTurret_Dmg_02_C_K2_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_WhileActive, Parameters) == 0x000008, "Member 'GC_SentryTurret_Dmg_02_C_K2_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_WhileActive, LoopingParticleSystem) == 0x0000C0, "Member 'GC_SentryTurret_Dmg_02_C_K2_WhileActive::LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_WhileActive, AdditionalParticleSystem) == 0x0000C8, "Member 'GC_SentryTurret_Dmg_02_C_K2_WhileActive::AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_WhileActive, LoopingNiagaraParticleSystem) == 0x0000D8, "Member 'GC_SentryTurret_Dmg_02_C_K2_WhileActive::LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_WhileActive, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_SentryTurret_Dmg_02_C_K2_WhileActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_SentryTurret_Dmg_02.GC_SentryTurret_Dmg_02_C.K2_OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_SentryTurret_Dmg_02_C_K2_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               ApplicationParticleSystem;                         // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           ApplicationCameraShakeInstance;                    // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ApplicationNiagaraParticleSystem;                  // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_SentryTurret_Dmg_02_C_K2_OnActive) == 0x000008, "Wrong alignment on GC_SentryTurret_Dmg_02_C_K2_OnActive");
static_assert(sizeof(GC_SentryTurret_Dmg_02_C_K2_OnActive) == 0x0000F8, "Wrong size on GC_SentryTurret_Dmg_02_C_K2_OnActive");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnActive, MyTarget) == 0x000000, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnActive, Parameters) == 0x000008, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnActive, ApplicationParticleSystem) == 0x0000C0, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnActive::ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnActive, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnActive::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnActive, ApplicationCameraShakeInstance) == 0x0000D8, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnActive::ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnActive, ApplicationNiagaraParticleSystem) == 0x0000E0, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnActive::ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_SentryTurret_Dmg_02_C_K2_OnActive, AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_SentryTurret_Dmg_02_C_K2_OnActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

}

