#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_ShadowPlane

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_ShadowPlane.GC_ShadowPlane_C.ExecuteUbergraph_GC_ShadowPlane
// 0x0408 (0x0408 - 0x0000)
struct GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_ApplicationParticleSystem;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_ApplicationCameraShakeInstance;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_Event_ApplicationNiagaraParticleSystem;     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	class AExponentialHeightFog*                  CallFunc_GetGlobalExponentialHeightFog_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget4;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters4;                          // 0x0118(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_LoopingParticleSystem;                // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystem;             // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_LoopingNiagaraParticleSystem;         // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems4;    // 0x01F0(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget3;                            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters3;                          // 0x0208(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_RemovalParticleSystem;                // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems3;           // 0x02C8(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_RemovalNiagaraParticleSystem;         // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems3;    // 0x02E0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsLocallyControlledPlayer_ReturnValue;    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget2;                            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters2;                          // 0x0300(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_RecurringParticleSystem;              // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems2;           // 0x03C0(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_RecurringNiagaraParticleSystem;       // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems2;    // 0x03D8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x03E8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor2;                    // 0x03F8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane) == 0x000008, "Wrong alignment on GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane");
static_assert(sizeof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane) == 0x000408, "Wrong size on GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, EntryPoint) == 0x000000, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_Parameters) == 0x000010, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_ApplicationParticleSystem) == 0x0000C8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_AdditionalParticleSystems) == 0x0000D0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_ApplicationCameraShakeInstance) == 0x0000E0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_ApplicationNiagaraParticleSystem) == 0x0000E8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0000F0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, CallFunc_GetGlobalExponentialHeightFog_ReturnValue) == 0x000100, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::CallFunc_GetGlobalExponentialHeightFog_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_MyTarget4) == 0x000110, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_MyTarget4' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_Parameters4) == 0x000118, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_Parameters4' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_LoopingParticleSystem) == 0x0001D0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_AdditionalParticleSystem) == 0x0001D8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_LoopingNiagaraParticleSystem) == 0x0001E8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_AdditionalNiagaraParticleSystems4) == 0x0001F0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_AdditionalNiagaraParticleSystems4' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_MyTarget3) == 0x000200, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_MyTarget3' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_Parameters3) == 0x000208, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_Parameters3' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_RemovalParticleSystem) == 0x0002C0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_AdditionalParticleSystems3) == 0x0002C8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_AdditionalParticleSystems3' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_RemovalNiagaraParticleSystem) == 0x0002D8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_AdditionalNiagaraParticleSystems3) == 0x0002E0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_AdditionalNiagaraParticleSystems3' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, CallFunc_IsLocallyControlledPlayer_ReturnValue) == 0x0002F0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::CallFunc_IsLocallyControlledPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_MyTarget2) == 0x0002F8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_MyTarget2' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_Parameters2) == 0x000300, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_Parameters2' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_RecurringParticleSystem) == 0x0003B8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_RecurringParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_AdditionalParticleSystems2) == 0x0003C0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_AdditionalParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_RecurringNiagaraParticleSystem) == 0x0003D0, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_RecurringNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_Event_AdditionalNiagaraParticleSystems2) == 0x0003D8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_Event_AdditionalNiagaraParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_MakeStruct_LinearColor) == 0x0003E8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane, K2Node_MakeStruct_LinearColor2) == 0x0003F8, "Member 'GC_ShadowPlane_C_ExecuteUbergraph_GC_ShadowPlane::K2Node_MakeStruct_LinearColor2' has a wrong offset!");

// Function GC_ShadowPlane.GC_ShadowPlane_C.K2_OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_ShadowPlane_C_K2_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               ApplicationParticleSystem;                         // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           ApplicationCameraShakeInstance;                    // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ApplicationNiagaraParticleSystem;                  // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_ShadowPlane_C_K2_OnActive) == 0x000008, "Wrong alignment on GC_ShadowPlane_C_K2_OnActive");
static_assert(sizeof(GC_ShadowPlane_C_K2_OnActive) == 0x0000F8, "Wrong size on GC_ShadowPlane_C_K2_OnActive");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnActive, MyTarget) == 0x000000, "Member 'GC_ShadowPlane_C_K2_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnActive, Parameters) == 0x000008, "Member 'GC_ShadowPlane_C_K2_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnActive, ApplicationParticleSystem) == 0x0000C0, "Member 'GC_ShadowPlane_C_K2_OnActive::ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnActive, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_ShadowPlane_C_K2_OnActive::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnActive, ApplicationCameraShakeInstance) == 0x0000D8, "Member 'GC_ShadowPlane_C_K2_OnActive::ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnActive, ApplicationNiagaraParticleSystem) == 0x0000E0, "Member 'GC_ShadowPlane_C_K2_OnActive::ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnActive, AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_ShadowPlane_C_K2_OnActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_ShadowPlane.GC_ShadowPlane_C.K2_OnExecute
// 0x00F0 (0x00F0 - 0x0000)
struct GC_ShadowPlane_C_K2_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               RecurringParticleSystem;                           // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      RecurringNiagaraParticleSystem;                    // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_ShadowPlane_C_K2_OnExecute) == 0x000008, "Wrong alignment on GC_ShadowPlane_C_K2_OnExecute");
static_assert(sizeof(GC_ShadowPlane_C_K2_OnExecute) == 0x0000F0, "Wrong size on GC_ShadowPlane_C_K2_OnExecute");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnExecute, MyTarget) == 0x000000, "Member 'GC_ShadowPlane_C_K2_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnExecute, Parameters) == 0x000008, "Member 'GC_ShadowPlane_C_K2_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnExecute, RecurringParticleSystem) == 0x0000C0, "Member 'GC_ShadowPlane_C_K2_OnExecute::RecurringParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnExecute, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_ShadowPlane_C_K2_OnExecute::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnExecute, RecurringNiagaraParticleSystem) == 0x0000D8, "Member 'GC_ShadowPlane_C_K2_OnExecute::RecurringNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnExecute, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_ShadowPlane_C_K2_OnExecute::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_ShadowPlane.GC_ShadowPlane_C.K2_OnRemove
// 0x00F0 (0x00F0 - 0x0000)
struct GC_ShadowPlane_C_K2_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               RemovalParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      RemovalNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_ShadowPlane_C_K2_OnRemove) == 0x000008, "Wrong alignment on GC_ShadowPlane_C_K2_OnRemove");
static_assert(sizeof(GC_ShadowPlane_C_K2_OnRemove) == 0x0000F0, "Wrong size on GC_ShadowPlane_C_K2_OnRemove");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnRemove, MyTarget) == 0x000000, "Member 'GC_ShadowPlane_C_K2_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnRemove, Parameters) == 0x000008, "Member 'GC_ShadowPlane_C_K2_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnRemove, RemovalParticleSystem) == 0x0000C0, "Member 'GC_ShadowPlane_C_K2_OnRemove::RemovalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnRemove, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_ShadowPlane_C_K2_OnRemove::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnRemove, RemovalNiagaraParticleSystem) == 0x0000D8, "Member 'GC_ShadowPlane_C_K2_OnRemove::RemovalNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_OnRemove, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_ShadowPlane_C_K2_OnRemove::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_ShadowPlane.GC_ShadowPlane_C.K2_WhileActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_ShadowPlane_C_K2_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               LoopingParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystem;                          // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      LoopingNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_ShadowPlane_C_K2_WhileActive) == 0x000008, "Wrong alignment on GC_ShadowPlane_C_K2_WhileActive");
static_assert(sizeof(GC_ShadowPlane_C_K2_WhileActive) == 0x0000F0, "Wrong size on GC_ShadowPlane_C_K2_WhileActive");
static_assert(offsetof(GC_ShadowPlane_C_K2_WhileActive, MyTarget) == 0x000000, "Member 'GC_ShadowPlane_C_K2_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_WhileActive, Parameters) == 0x000008, "Member 'GC_ShadowPlane_C_K2_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_WhileActive, LoopingParticleSystem) == 0x0000C0, "Member 'GC_ShadowPlane_C_K2_WhileActive::LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_WhileActive, AdditionalParticleSystem) == 0x0000C8, "Member 'GC_ShadowPlane_C_K2_WhileActive::AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_WhileActive, LoopingNiagaraParticleSystem) == 0x0000D8, "Member 'GC_ShadowPlane_C_K2_WhileActive::LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_K2_WhileActive, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_ShadowPlane_C_K2_WhileActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_ShadowPlane.GC_ShadowPlane_C.WhileActive
// 0x00D8 (0x00D8 - 0x0000)
struct GC_ShadowPlane_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AExponentialHeightFog*                  CallFunc_GetGlobalExponentialHeightFog_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhileActive_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlledPlayer_ReturnValue;    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_ShadowPlane_C_WhileActive) == 0x000008, "Wrong alignment on GC_ShadowPlane_C_WhileActive");
static_assert(sizeof(GC_ShadowPlane_C_WhileActive) == 0x0000D8, "Wrong size on GC_ShadowPlane_C_WhileActive");
static_assert(offsetof(GC_ShadowPlane_C_WhileActive, MyTarget) == 0x000000, "Member 'GC_ShadowPlane_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_WhileActive, Parameters) == 0x000008, "Member 'GC_ShadowPlane_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_WhileActive, ReturnValue) == 0x0000C0, "Member 'GC_ShadowPlane_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_WhileActive, CallFunc_GetGlobalExponentialHeightFog_ReturnValue) == 0x0000C8, "Member 'GC_ShadowPlane_C_WhileActive::CallFunc_GetGlobalExponentialHeightFog_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_WhileActive, CallFunc_WhileActive_ReturnValue) == 0x0000D0, "Member 'GC_ShadowPlane_C_WhileActive::CallFunc_WhileActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'GC_ShadowPlane_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ShadowPlane_C_WhileActive, CallFunc_IsLocallyControlledPlayer_ReturnValue) == 0x0000D2, "Member 'GC_ShadowPlane_C_WhileActive::CallFunc_IsLocallyControlledPlayer_ReturnValue' has a wrong offset!");

}

