#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Standard_PhaseShift

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Standard_PhaseShift.GC_Standard_PhaseShift_C
// 0x0040 (0x0880 - 0x0840)
class AGC_Standard_PhaseShift_C final : public AOrionGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(Transient, DuplicateTransient)
	float                                         FadeOut_Opacity_296A3706440704682CD938A26DF7DC5C;  // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeOut__Direction_296A3706440704682CD938A26DF7DC5C; // 0x084C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84D[0x3];                                      // 0x084D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeOut;                                           // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeIn_Brightness_A30552324545AA486481CDB6B576C399; // 0x0858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeIn_Opacity_A30552324545AA486481CDB6B576C399;   // 0x085C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeIn__Direction_A30552324545AA486481CDB6B576C399; // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeIn;                                            // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Hero_C*                             TargetCharacter;                                   // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Standard_PhaseShift(int32 EntryPoint);
	void K2_WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* LoopingParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystem, class UNiagaraComponent* LoopingNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void FadeoutMaterial();
	void FadeinMaterial();
	void K2_OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* RemovalParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* RemovalNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void FadeIn__FinishedFunc();
	void FadeIn__UpdateFunc();
	void Fadeout__FinishedFunc();
	void Fadeout__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Standard_PhaseShift_C">();
	}
	static class AGC_Standard_PhaseShift_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Standard_PhaseShift_C>();
	}
};
static_assert(alignof(AGC_Standard_PhaseShift_C) == 0x000010, "Wrong alignment on AGC_Standard_PhaseShift_C");
static_assert(sizeof(AGC_Standard_PhaseShift_C) == 0x000880, "Wrong size on AGC_Standard_PhaseShift_C");
static_assert(offsetof(AGC_Standard_PhaseShift_C, UberGraphFrame) == 0x000840, "Member 'AGC_Standard_PhaseShift_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Standard_PhaseShift_C, FadeOut_Opacity_296A3706440704682CD938A26DF7DC5C) == 0x000848, "Member 'AGC_Standard_PhaseShift_C::FadeOut_Opacity_296A3706440704682CD938A26DF7DC5C' has a wrong offset!");
static_assert(offsetof(AGC_Standard_PhaseShift_C, FadeOut__Direction_296A3706440704682CD938A26DF7DC5C) == 0x00084C, "Member 'AGC_Standard_PhaseShift_C::FadeOut__Direction_296A3706440704682CD938A26DF7DC5C' has a wrong offset!");
static_assert(offsetof(AGC_Standard_PhaseShift_C, FadeOut) == 0x000850, "Member 'AGC_Standard_PhaseShift_C::FadeOut' has a wrong offset!");
static_assert(offsetof(AGC_Standard_PhaseShift_C, FadeIn_Brightness_A30552324545AA486481CDB6B576C399) == 0x000858, "Member 'AGC_Standard_PhaseShift_C::FadeIn_Brightness_A30552324545AA486481CDB6B576C399' has a wrong offset!");
static_assert(offsetof(AGC_Standard_PhaseShift_C, FadeIn_Opacity_A30552324545AA486481CDB6B576C399) == 0x00085C, "Member 'AGC_Standard_PhaseShift_C::FadeIn_Opacity_A30552324545AA486481CDB6B576C399' has a wrong offset!");
static_assert(offsetof(AGC_Standard_PhaseShift_C, FadeIn__Direction_A30552324545AA486481CDB6B576C399) == 0x000860, "Member 'AGC_Standard_PhaseShift_C::FadeIn__Direction_A30552324545AA486481CDB6B576C399' has a wrong offset!");
static_assert(offsetof(AGC_Standard_PhaseShift_C, FadeIn) == 0x000868, "Member 'AGC_Standard_PhaseShift_C::FadeIn' has a wrong offset!");
static_assert(offsetof(AGC_Standard_PhaseShift_C, TargetCharacter) == 0x000870, "Member 'AGC_Standard_PhaseShift_C::TargetCharacter' has a wrong offset!");

}

