#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StandardRoot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_StandardRoot.GC_StandardRoot_C.ExecuteUbergraph_GC_StandardRoot
// 0x0320 (0x0320 - 0x0000)
struct GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget2;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters2;                          // 0x0010(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_ApplicationParticleSystem;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystems;            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_ApplicationCameraShakeInstance;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_Event_ApplicationNiagaraParticleSystem;     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems2;    // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	class AOrionChar*                             K2Node_DynamicCast_AsOrion_Char;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0118(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               K2Node_Event_LoopingParticleSystem;                // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_Event_AdditionalParticleSystem;             // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      K2Node_Event_LoopingNiagaraParticleSystem;         // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_Event_AdditionalNiagaraParticleSystems;     // 0x01F0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOrionChar*                             K2Node_DynamicCast_AsOrion_Char2;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0xF];                                      // 0x0211(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0250(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x025C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0268(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0278(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0300(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x030C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot) == 0x000010, "Wrong alignment on GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot");
static_assert(sizeof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot) == 0x000320, "Wrong size on GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, EntryPoint) == 0x000000, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_MyTarget2) == 0x000008, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_MyTarget2' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_Parameters2) == 0x000010, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_Parameters2' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_ApplicationParticleSystem) == 0x0000C8, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_AdditionalParticleSystems) == 0x0000D0, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_ApplicationCameraShakeInstance) == 0x0000E0, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_ApplicationNiagaraParticleSystem) == 0x0000E8, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_AdditionalNiagaraParticleSystems2) == 0x0000F0, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_AdditionalNiagaraParticleSystems2' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_DynamicCast_AsOrion_Char) == 0x000100, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_DynamicCast_AsOrion_Char' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_MyTarget) == 0x000110, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_Parameters) == 0x000118, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_LoopingParticleSystem) == 0x0001D0, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_AdditionalParticleSystem) == 0x0001D8, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_LoopingNiagaraParticleSystem) == 0x0001E8, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_Event_AdditionalNiagaraParticleSystems) == 0x0001F0, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_Event_AdditionalNiagaraParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000200, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_DynamicCast_AsOrion_Char2) == 0x000208, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_DynamicCast_AsOrion_Char2' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, K2Node_DynamicCast_bSuccess2) == 0x000210, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, CallFunc_GetSocketTransform_ReturnValue) == 0x000220, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, CallFunc_BreakTransform_Location) == 0x000250, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, CallFunc_BreakTransform_Rotation) == 0x00025C, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, CallFunc_BreakTransform_Scale) == 0x000268, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000274, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000278, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, CallFunc_MakeVector_ReturnValue) == 0x000300, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00030C, "Member 'GC_StandardRoot_C_ExecuteUbergraph_GC_StandardRoot::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function GC_StandardRoot.GC_StandardRoot_C.K2_WhileActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_StandardRoot_C_K2_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               LoopingParticleSystem;                             // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystem;                          // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UNiagaraComponent*                      LoopingNiagaraParticleSystem;                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_StandardRoot_C_K2_WhileActive) == 0x000008, "Wrong alignment on GC_StandardRoot_C_K2_WhileActive");
static_assert(sizeof(GC_StandardRoot_C_K2_WhileActive) == 0x0000F0, "Wrong size on GC_StandardRoot_C_K2_WhileActive");
static_assert(offsetof(GC_StandardRoot_C_K2_WhileActive, MyTarget) == 0x000000, "Member 'GC_StandardRoot_C_K2_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_WhileActive, Parameters) == 0x000008, "Member 'GC_StandardRoot_C_K2_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_WhileActive, LoopingParticleSystem) == 0x0000C0, "Member 'GC_StandardRoot_C_K2_WhileActive::LoopingParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_WhileActive, AdditionalParticleSystem) == 0x0000C8, "Member 'GC_StandardRoot_C_K2_WhileActive::AdditionalParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_WhileActive, LoopingNiagaraParticleSystem) == 0x0000D8, "Member 'GC_StandardRoot_C_K2_WhileActive::LoopingNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_WhileActive, AdditionalNiagaraParticleSystems) == 0x0000E0, "Member 'GC_StandardRoot_C_K2_WhileActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

// Function GC_StandardRoot.GC_StandardRoot_C.K2_OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StandardRoot_C_K2_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UParticleSystemComponent*               ApplicationParticleSystem;                         // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       AdditionalParticleSystems;                         // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           ApplicationCameraShakeInstance;                    // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ApplicationNiagaraParticleSystem;                  // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AdditionalNiagaraParticleSystems;                  // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_StandardRoot_C_K2_OnActive) == 0x000008, "Wrong alignment on GC_StandardRoot_C_K2_OnActive");
static_assert(sizeof(GC_StandardRoot_C_K2_OnActive) == 0x0000F8, "Wrong size on GC_StandardRoot_C_K2_OnActive");
static_assert(offsetof(GC_StandardRoot_C_K2_OnActive, MyTarget) == 0x000000, "Member 'GC_StandardRoot_C_K2_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_OnActive, Parameters) == 0x000008, "Member 'GC_StandardRoot_C_K2_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_OnActive, ApplicationParticleSystem) == 0x0000C0, "Member 'GC_StandardRoot_C_K2_OnActive::ApplicationParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_OnActive, AdditionalParticleSystems) == 0x0000C8, "Member 'GC_StandardRoot_C_K2_OnActive::AdditionalParticleSystems' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_OnActive, ApplicationCameraShakeInstance) == 0x0000D8, "Member 'GC_StandardRoot_C_K2_OnActive::ApplicationCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_OnActive, ApplicationNiagaraParticleSystem) == 0x0000E0, "Member 'GC_StandardRoot_C_K2_OnActive::ApplicationNiagaraParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_StandardRoot_C_K2_OnActive, AdditionalNiagaraParticleSystems) == 0x0000E8, "Member 'GC_StandardRoot_C_K2_OnActive::AdditionalNiagaraParticleSystems' has a wrong offset!");

}

