#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Tutorial_HighlightObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Tutorial_HighlightObject.GC_Tutorial_HighlightObject_C
// 0x0020 (0x0860 - 0x0840)
class AGC_Tutorial_HighlightObject_C final : public AOrionGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         StencilValue;                                      // 0x0850(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Tutorial_HighlightObject(int32 EntryPoint);
	void K2_OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* RemovalParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystems, class UNiagaraComponent* RemovalNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void K2_WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* LoopingParticleSystem, const TArray<class UParticleSystemComponent*>& AdditionalParticleSystem, class UNiagaraComponent* LoopingNiagaraParticleSystem, const TArray<class UNiagaraComponent*>& AdditionalNiagaraParticleSystems);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Tutorial_HighlightObject_C">();
	}
	static class AGC_Tutorial_HighlightObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Tutorial_HighlightObject_C>();
	}
};
static_assert(alignof(AGC_Tutorial_HighlightObject_C) == 0x000010, "Wrong alignment on AGC_Tutorial_HighlightObject_C");
static_assert(sizeof(AGC_Tutorial_HighlightObject_C) == 0x000860, "Wrong size on AGC_Tutorial_HighlightObject_C");
static_assert(offsetof(AGC_Tutorial_HighlightObject_C, UberGraphFrame) == 0x000840, "Member 'AGC_Tutorial_HighlightObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Tutorial_HighlightObject_C, PostProcess) == 0x000848, "Member 'AGC_Tutorial_HighlightObject_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGC_Tutorial_HighlightObject_C, StencilValue) == 0x000850, "Member 'AGC_Tutorial_HighlightObject_C::StencilValue' has a wrong offset!");

}

