#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GreenBuff_AnimBP

#include "Basic.hpp"

#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass GreenBuff_AnimBP.GreenBuff_AnimBP_C
// 0x1590 (0x2750 - 0x11C0)
class UGreenBuff_AnimBP_C final : public UOrionHeroAnimInstance
{
public:
	uint8                                         Pad_11B8[0x8];                                     // 0x11B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11C0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_37D6CBE34D8EE5E1B413B5B49249759C; // 0x11C8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C9AC881D458CE175E2FEC19D5FF771BC; // 0x1210(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_AC16A6394EBB9E30B561E9822F30F92F; // 0x1278(0x0078)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_D6E8C6014B5076050F4A5CA5017CF27E; // 0x12F0(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0306BC29454C12C0CD5E2FB6A4AD75D1; // 0x1350(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116890C24247DC2ECE5A25BAE724CFED; // 0x13D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ED88E0A940ED450628DB388B695097D5; // 0x1450(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8013182345995ECB6DFF42BDFB2DC8BE; // 0x14D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D7901A5E49877D0BCD53178BA6007B06; // 0x1550(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6FC5B2C549890EF1DADC4AAFD73475F9; // 0x15D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5DED3E3B404CBD74DE3AA5ABFD2D7C0D; // 0x1650(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3040462C4AD8925B9D62988893D02A28; // 0x16D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BC9FDC764E9892C5523048ACF777BEF0; // 0x1750(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E710570F4D28B9C4815F5982636D239E; // 0x17D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BFD1B9F84DF89CBC24B423B7E7447CFB; // 0x1850(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F217A0454CE57AAFE1CE61B78224FC03; // 0x18D0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_59D4675041BCDB819A047A810F1F939D; // 0x1950(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_701BC5624E9F21AC7C2A759556F7E27D; // 0x1A20(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_70E0DF6D4F36A0C0111C518F710B9881; // 0x1A90(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_05D4FBFC4747FD83169AF4A0E84F9C17; // 0x1B00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_89785AC344DEBD5779149C81A176E007; // 0x1B48(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_141627BE448F70CCD41DAA85C07248FB; // 0x1BB8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_83BDB06A4D4A59D740FF44AD184969E1; // 0x1C00(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9F405DE44CD9980A7BB8998CE83986C7; // 0x1C70(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_70577A2B4F23E326F38256AA3059FA08; // 0x1CB8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E98A36BA4C58D0C9095335B7BF5A7F08; // 0x1D28(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_C8E5493240BC1750840A83B89E1AD040; // 0x1D70(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_98636AAD4DBA08533EF2EE870B29E37B; // 0x1E98(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_764C44D5425E6BDD91C7718B64C03B30; // 0x1EE0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0825718243B22826E0B54490D7428CF8; // 0x1F50(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_21337E6641C0DF8D2E926390CD285BB2; // 0x1F98(0x00D8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_45F361484CA95B1E5106F7A1FC74AF4F; // 0x2070(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3418B8984D05553C062F6F8A2CF1AE7B; // 0x20D8(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_654A03224DFDB39A50CC5FB59BE902B8; // 0x21B8(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_EA0A2812424647E3AC555EAD0E1DF472; // 0x2288(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_58C818454B200ABF1A35BE88323CB0D0; // 0x22F0(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4E0AE5154D7525A45014E08578415124; // 0x2398(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4281200143F453A2C1A8CF96B84CB196; // 0x23E8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B97F5A2944E50FEE0A895D9B4FE00086; // 0x2438(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_66F193F0494045729F44F0992557C2FF; // 0x2488(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F2A80A9E4F966405F01EB29F6DA2E33E; // 0x2530(0x0050)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_6A4FA3224D3918675836B8B1F28D4696; // 0x2580(0x0158)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_54FC781946DD3B60A71A1D85690F3B5C; // 0x26D8(0x0070)()
	float                                         Pitch;                                             // 0x2748(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GreenBuff_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_ApplyAdditive_AC16A6394EBB9E30B561E9822F30F92F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_BlendListByBool_59D4675041BCDB819A047A810F1F939D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_BlendListByBool_654A03224DFDB39A50CC5FB59BE902B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_BlendSpacePlayer_C8E5493240BC1750840A83B89E1AD040();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_RotateRootBone_D6E8C6014B5076050F4A5CA5017CF27E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_6A4FA3224D3918675836B8B1F28D4696();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_SequenceEvaluator_54FC781946DD3B60A71A1D85690F3B5C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_SequenceEvaluator_70577A2B4F23E326F38256AA3059FA08();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_SequenceEvaluator_83BDB06A4D4A59D740FF44AD184969E1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_0306BC29454C12C0CD5E2FB6A4AD75D1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_116890C24247DC2ECE5A25BAE724CFED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_3040462C4AD8925B9D62988893D02A28();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_5DED3E3B404CBD74DE3AA5ABFD2D7C0D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_6FC5B2C549890EF1DADC4AAFD73475F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_BC9FDC764E9892C5523048ACF777BEF0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_BFD1B9F84DF89CBC24B423B7E7447CFB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_D7901A5E49877D0BCD53178BA6007B06();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_E710570F4D28B9C4815F5982636D239E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_ED88E0A940ED450628DB388B695097D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GreenBuff_AnimBP_AnimGraphNode_TransitionResult_F217A0454CE57AAFE1CE61B78224FC03();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GreenBuff_AnimBP_C">();
	}
	static class UGreenBuff_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGreenBuff_AnimBP_C>();
	}
};
static_assert(alignof(UGreenBuff_AnimBP_C) == 0x000010, "Wrong alignment on UGreenBuff_AnimBP_C");
static_assert(sizeof(UGreenBuff_AnimBP_C) == 0x002750, "Wrong size on UGreenBuff_AnimBP_C");
static_assert(offsetof(UGreenBuff_AnimBP_C, UberGraphFrame) == 0x0011C0, "Member 'UGreenBuff_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_Root_37D6CBE34D8EE5E1B413B5B49249759C) == 0x0011C8, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_Root_37D6CBE34D8EE5E1B413B5B49249759C' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_Slot_C9AC881D458CE175E2FEC19D5FF771BC) == 0x001210, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_Slot_C9AC881D458CE175E2FEC19D5FF771BC' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_ApplyAdditive_AC16A6394EBB9E30B561E9822F30F92F) == 0x001278, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_ApplyAdditive_AC16A6394EBB9E30B561E9822F30F92F' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_RotateRootBone_D6E8C6014B5076050F4A5CA5017CF27E) == 0x0012F0, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_RotateRootBone_D6E8C6014B5076050F4A5CA5017CF27E' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_0306BC29454C12C0CD5E2FB6A4AD75D1) == 0x001350, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_0306BC29454C12C0CD5E2FB6A4AD75D1' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_116890C24247DC2ECE5A25BAE724CFED) == 0x0013D0, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_116890C24247DC2ECE5A25BAE724CFED' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_ED88E0A940ED450628DB388B695097D5) == 0x001450, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_ED88E0A940ED450628DB388B695097D5' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_8013182345995ECB6DFF42BDFB2DC8BE) == 0x0014D0, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_8013182345995ECB6DFF42BDFB2DC8BE' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_D7901A5E49877D0BCD53178BA6007B06) == 0x001550, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_D7901A5E49877D0BCD53178BA6007B06' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_6FC5B2C549890EF1DADC4AAFD73475F9) == 0x0015D0, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_6FC5B2C549890EF1DADC4AAFD73475F9' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_5DED3E3B404CBD74DE3AA5ABFD2D7C0D) == 0x001650, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_5DED3E3B404CBD74DE3AA5ABFD2D7C0D' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_3040462C4AD8925B9D62988893D02A28) == 0x0016D0, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_3040462C4AD8925B9D62988893D02A28' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_BC9FDC764E9892C5523048ACF777BEF0) == 0x001750, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_BC9FDC764E9892C5523048ACF777BEF0' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_E710570F4D28B9C4815F5982636D239E) == 0x0017D0, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_E710570F4D28B9C4815F5982636D239E' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_BFD1B9F84DF89CBC24B423B7E7447CFB) == 0x001850, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_BFD1B9F84DF89CBC24B423B7E7447CFB' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_TransitionResult_F217A0454CE57AAFE1CE61B78224FC03) == 0x0018D0, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_TransitionResult_F217A0454CE57AAFE1CE61B78224FC03' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_BlendListByBool_59D4675041BCDB819A047A810F1F939D) == 0x001950, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_BlendListByBool_59D4675041BCDB819A047A810F1F939D' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_SequencePlayer_701BC5624E9F21AC7C2A759556F7E27D) == 0x001A20, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_SequencePlayer_701BC5624E9F21AC7C2A759556F7E27D' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_SequencePlayer_70E0DF6D4F36A0C0111C518F710B9881) == 0x001A90, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_SequencePlayer_70E0DF6D4F36A0C0111C518F710B9881' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_StateResult_05D4FBFC4747FD83169AF4A0E84F9C17) == 0x001B00, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_StateResult_05D4FBFC4747FD83169AF4A0E84F9C17' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_SequencePlayer_89785AC344DEBD5779149C81A176E007) == 0x001B48, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_SequencePlayer_89785AC344DEBD5779149C81A176E007' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_StateResult_141627BE448F70CCD41DAA85C07248FB) == 0x001BB8, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_StateResult_141627BE448F70CCD41DAA85C07248FB' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_SequenceEvaluator_83BDB06A4D4A59D740FF44AD184969E1) == 0x001C00, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_SequenceEvaluator_83BDB06A4D4A59D740FF44AD184969E1' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_StateResult_9F405DE44CD9980A7BB8998CE83986C7) == 0x001C70, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_StateResult_9F405DE44CD9980A7BB8998CE83986C7' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_SequenceEvaluator_70577A2B4F23E326F38256AA3059FA08) == 0x001CB8, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_SequenceEvaluator_70577A2B4F23E326F38256AA3059FA08' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_StateResult_E98A36BA4C58D0C9095335B7BF5A7F08) == 0x001D28, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_StateResult_E98A36BA4C58D0C9095335B7BF5A7F08' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_BlendSpacePlayer_C8E5493240BC1750840A83B89E1AD040) == 0x001D70, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_BlendSpacePlayer_C8E5493240BC1750840A83B89E1AD040' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_StateResult_98636AAD4DBA08533EF2EE870B29E37B) == 0x001E98, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_StateResult_98636AAD4DBA08533EF2EE870B29E37B' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_SequencePlayer_764C44D5425E6BDD91C7718B64C03B30) == 0x001EE0, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_SequencePlayer_764C44D5425E6BDD91C7718B64C03B30' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_StateResult_0825718243B22826E0B54490D7428CF8) == 0x001F50, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_StateResult_0825718243B22826E0B54490D7428CF8' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_StateMachine_21337E6641C0DF8D2E926390CD285BB2) == 0x001F98, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_StateMachine_21337E6641C0DF8D2E926390CD285BB2' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_Slot_45F361484CA95B1E5106F7A1FC74AF4F) == 0x002070, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_Slot_45F361484CA95B1E5106F7A1FC74AF4F' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_LayeredBoneBlend_3418B8984D05553C062F6F8A2CF1AE7B) == 0x0020D8, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_LayeredBoneBlend_3418B8984D05553C062F6F8A2CF1AE7B' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_BlendListByBool_654A03224DFDB39A50CC5FB59BE902B8) == 0x0021B8, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_BlendListByBool_654A03224DFDB39A50CC5FB59BE902B8' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_Slot_EA0A2812424647E3AC555EAD0E1DF472) == 0x002288, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_Slot_EA0A2812424647E3AC555EAD0E1DF472' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_SaveCachedPose_58C818454B200ABF1A35BE88323CB0D0) == 0x0022F0, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_SaveCachedPose_58C818454B200ABF1A35BE88323CB0D0' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_UseCachedPose_4E0AE5154D7525A45014E08578415124) == 0x002398, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_UseCachedPose_4E0AE5154D7525A45014E08578415124' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_UseCachedPose_4281200143F453A2C1A8CF96B84CB196) == 0x0023E8, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_UseCachedPose_4281200143F453A2C1A8CF96B84CB196' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_UseCachedPose_B97F5A2944E50FEE0A895D9B4FE00086) == 0x002438, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_UseCachedPose_B97F5A2944E50FEE0A895D9B4FE00086' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_SaveCachedPose_66F193F0494045729F44F0992557C2FF) == 0x002488, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_SaveCachedPose_66F193F0494045729F44F0992557C2FF' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_UseCachedPose_F2A80A9E4F966405F01EB29F6DA2E33E) == 0x002530, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_UseCachedPose_F2A80A9E4F966405F01EB29F6DA2E33E' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_6A4FA3224D3918675836B8B1F28D4696) == 0x002580, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_6A4FA3224D3918675836B8B1F28D4696' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, AnimGraphNode_SequenceEvaluator_54FC781946DD3B60A71A1D85690F3B5C) == 0x0026D8, "Member 'UGreenBuff_AnimBP_C::AnimGraphNode_SequenceEvaluator_54FC781946DD3B60A71A1D85690F3B5C' has a wrong offset!");
static_assert(offsetof(UGreenBuff_AnimBP_C, Pitch) == 0x002748, "Member 'UGreenBuff_AnimBP_C::Pitch' has a wrong offset!");

}

