#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoverDotWidgets

#include "Basic.hpp"


namespace SDK::Params
{

// Function HoverDotWidgets.HoverDotWidgets_C.ExecuteUbergraph_HoverDotWidgets
// 0x0004 (0x0004 - 0x0000)
struct HoverDotWidgets_C_ExecuteUbergraph_HoverDotWidgets final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HoverDotWidgets_C_ExecuteUbergraph_HoverDotWidgets) == 0x000004, "Wrong alignment on HoverDotWidgets_C_ExecuteUbergraph_HoverDotWidgets");
static_assert(sizeof(HoverDotWidgets_C_ExecuteUbergraph_HoverDotWidgets) == 0x000004, "Wrong size on HoverDotWidgets_C_ExecuteUbergraph_HoverDotWidgets");
static_assert(offsetof(HoverDotWidgets_C_ExecuteUbergraph_HoverDotWidgets, EntryPoint) == 0x000000, "Member 'HoverDotWidgets_C_ExecuteUbergraph_HoverDotWidgets::EntryPoint' has a wrong offset!");

// Function HoverDotWidgets.HoverDotWidgets_C.SetDotValue
// 0x0010 (0x0010 - 0x0000)
struct HoverDotWidgets_C_SetDotValue final
{
public:
	float                                         New_Val;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HoverDotWidgets_C_SetDotValue) == 0x000008, "Wrong alignment on HoverDotWidgets_C_SetDotValue");
static_assert(sizeof(HoverDotWidgets_C_SetDotValue) == 0x000010, "Wrong size on HoverDotWidgets_C_SetDotValue");
static_assert(offsetof(HoverDotWidgets_C_SetDotValue, New_Val) == 0x000000, "Member 'HoverDotWidgets_C_SetDotValue::New_Val' has a wrong offset!");
static_assert(offsetof(HoverDotWidgets_C_SetDotValue, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'HoverDotWidgets_C_SetDotValue::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

