#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LaneMinions_Melee_Dawn_AnimBP

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass LaneMinions_Melee_Dawn_AnimBP.LaneMinions_Melee_Dawn_AnimBP_C
// 0x1CD0 (0x2900 - 0x0C30)
class ULaneMinions_Melee_Dawn_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_69B2663D4CE4CFD8E85EEAA9FBA31B99; // 0x0C38(0x03C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_422EE03F486013707DA98183CC380B61; // 0x1000(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_BE03B38F44CA47A7128AA6A148FD81F0; // 0x1048(0x0048)()
	struct FOrionAnimNode_SimpleSlopeAndAim       OrionAnimGraphNode_SimpleSlopeAndAim_7D26CAD04EA8EF6A11ED42865AED16AA; // 0x1090(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1EFA9C2D4E39E73CB354B18333A1605B; // 0x1140(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DC0656C7497D77A300B409BD3A927D67; // 0x11C0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5BFE5889438E29EAC4B0FAB52FB77B7C; // 0x1240(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C30D36DD4DD70E8F951130B1A66DC368; // 0x12C0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A5B898F243F52643EC8006BF4DD812DC; // 0x1330(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_78D01D2448C0FECE3C690D81C2DD842A; // 0x1378(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CE6BA8C54CB2F145DB17B8BADC257DDC; // 0x13E8(0x0070)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_93F7AF194CFF97D77FE75D93EE563050; // 0x1458(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24299A8244D24AE4FA481ABB4A5A89BC; // 0x1528(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9356B02E42A96E28D71071962CC19EAB; // 0x1598(0x0070)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_53FA860C483B895D051A8BB1A20ADC02; // 0x1608(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FCBE012D41F79BBF75B9BE8139F7284C; // 0x16D8(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F3CAE22A462D20BA17177B81970C7B59; // 0x1748(0x0070)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_8B7710C24213E8F62E5FBC808A37C683; // 0x17B8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8145FBED42E91346C7035CBCA48F6593; // 0x1888(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16FE84814E07C055C4BEC0B661BEBD2F; // 0x18F8(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_F65FE46440F5F3C0737662B49E96A5F8; // 0x1968(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_31C3632D4538C114A21DE586EE641559; // 0x1A38(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9BDDB57F4AA31ADA5DAAC3A0E1ADFF08; // 0x1B08(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3C294C8D460E7F3B9D9EAD9F76DAB34F; // 0x1B78(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EA089B76440C9FBF56B2B58E232C17D0; // 0x1C48(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AC1D88984A109FC8445CEE9A1D031B60; // 0x1CB8(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BA52ADD94EDA77BAD6BC0195FB2814F3; // 0x1D28(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5389CC67448EEA2AA4436F82A749ABE4; // 0x1D98(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_787F534647A1B3EA3D8CA3A4956A9B19; // 0x1E68(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3509B7414F6E22891E1FB99C25BA302B; // 0x1F38(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8F67D5564BDC46404143528E186B4586; // 0x1FA8(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23262F8045DC86CA0817D6800E861B31; // 0x2018(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_F78C31DC4AE03046ED271DB89EF78C31; // 0x20E8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D96ADA7B41797CDEF550E38B7B2597B4; // 0x21B8(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A6E422D74E6054BEB1975BA796D5F174; // 0x2228(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3BDF123645BEF232B5170D8759224E3E; // 0x22F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7D9180AF420348B644B27D889FAE1F2C; // 0x2340(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_722695344E66276FEDBF09B37B20B3BF; // 0x23B0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6A6250D8431A54FA6C7C39AFE6670B17; // 0x23F8(0x00D8)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_31B106644F38EEDACF905CA33F3FBAEF; // 0x24D0(0x02F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_E53BBF844161C75D8680ECB3F66676FB; // 0x27C0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1240D66C4879BD1CC8FA9794283E295D; // 0x2808(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14E70F684CB1E17B6C8AE98FC9E78DF3; // 0x2880(0x0070)()
	float                                         MoveSpeedThreshold;                                // 0x28F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AuthoredJogNonCombatSpeed;                         // 0x28F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AuthoredJogCombatSpeed;                            // 0x28F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_ApplyAdditive_1240D66C4879BD1CC8FA9794283E295D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByBool_23262F8045DC86CA0817D6800E861B31();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByBool_31C3632D4538C114A21DE586EE641559();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByBool_3C294C8D460E7F3B9D9EAD9F76DAB34F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByBool_5389CC67448EEA2AA4436F82A749ABE4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByBool_787F534647A1B3EA3D8CA3A4956A9B19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByBool_A6E422D74E6054BEB1975BA796D5F174();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByBool_F65FE46440F5F3C0737662B49E96A5F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByBool_F78C31DC4AE03046ED271DB89EF78C31();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByInt_53FA860C483B895D051A8BB1A20ADC02();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByInt_8B7710C24213E8F62E5FBC808A37C683();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_BlendListByInt_93F7AF194CFF97D77FE75D93EE563050();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_RigidBody_69B2663D4CE4CFD8E85EEAA9FBA31B99();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_16FE84814E07C055C4BEC0B661BEBD2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_24299A8244D24AE4FA481ABB4A5A89BC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_3509B7414F6E22891E1FB99C25BA302B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_78D01D2448C0FECE3C690D81C2DD842A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_8145FBED42E91346C7035CBCA48F6593();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_8F67D5564BDC46404143528E186B4586();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_9356B02E42A96E28D71071962CC19EAB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_9BDDB57F4AA31ADA5DAAC3A0E1ADFF08();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_AC1D88984A109FC8445CEE9A1D031B60();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_BA52ADD94EDA77BAD6BC0195FB2814F3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_CE6BA8C54CB2F145DB17B8BADC257DDC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_D96ADA7B41797CDEF550E38B7B2597B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_EA089B76440C9FBF56B2B58E232C17D0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_F3CAE22A462D20BA17177B81970C7B59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_SequencePlayer_FCBE012D41F79BBF75B9BE8139F7284C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_TransitionResult_5BFE5889438E29EAC4B0FAB52FB77B7C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_AnimGraphNode_TransitionResult_DC0656C7497D77A300B409BD3A927D67();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dawn_AnimBP_OrionAnimGraphNode_SimpleSlopeAndAim_7D26CAD04EA8EF6A11ED42865AED16AA();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LaneMinions_Melee_Dawn_AnimBP_C">();
	}
	static class ULaneMinions_Melee_Dawn_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULaneMinions_Melee_Dawn_AnimBP_C>();
	}
};
static_assert(alignof(ULaneMinions_Melee_Dawn_AnimBP_C) == 0x000010, "Wrong alignment on ULaneMinions_Melee_Dawn_AnimBP_C");
static_assert(sizeof(ULaneMinions_Melee_Dawn_AnimBP_C) == 0x002900, "Wrong size on ULaneMinions_Melee_Dawn_AnimBP_C");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_RigidBody_69B2663D4CE4CFD8E85EEAA9FBA31B99) == 0x000C38, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_RigidBody_69B2663D4CE4CFD8E85EEAA9FBA31B99' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_LocalToComponentSpace_422EE03F486013707DA98183CC380B61) == 0x001000, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_LocalToComponentSpace_422EE03F486013707DA98183CC380B61' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_BE03B38F44CA47A7128AA6A148FD81F0) == 0x001048, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_BE03B38F44CA47A7128AA6A148FD81F0' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, OrionAnimGraphNode_SimpleSlopeAndAim_7D26CAD04EA8EF6A11ED42865AED16AA) == 0x001090, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::OrionAnimGraphNode_SimpleSlopeAndAim_7D26CAD04EA8EF6A11ED42865AED16AA' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_TransitionResult_1EFA9C2D4E39E73CB354B18333A1605B) == 0x001140, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_TransitionResult_1EFA9C2D4E39E73CB354B18333A1605B' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_TransitionResult_DC0656C7497D77A300B409BD3A927D67) == 0x0011C0, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_TransitionResult_DC0656C7497D77A300B409BD3A927D67' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_TransitionResult_5BFE5889438E29EAC4B0FAB52FB77B7C) == 0x001240, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_TransitionResult_5BFE5889438E29EAC4B0FAB52FB77B7C' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_C30D36DD4DD70E8F951130B1A66DC368) == 0x0012C0, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_C30D36DD4DD70E8F951130B1A66DC368' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_StateResult_A5B898F243F52643EC8006BF4DD812DC) == 0x001330, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_StateResult_A5B898F243F52643EC8006BF4DD812DC' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_78D01D2448C0FECE3C690D81C2DD842A) == 0x001378, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_78D01D2448C0FECE3C690D81C2DD842A' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_CE6BA8C54CB2F145DB17B8BADC257DDC) == 0x0013E8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_CE6BA8C54CB2F145DB17B8BADC257DDC' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByInt_93F7AF194CFF97D77FE75D93EE563050) == 0x001458, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByInt_93F7AF194CFF97D77FE75D93EE563050' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_24299A8244D24AE4FA481ABB4A5A89BC) == 0x001528, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_24299A8244D24AE4FA481ABB4A5A89BC' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_9356B02E42A96E28D71071962CC19EAB) == 0x001598, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_9356B02E42A96E28D71071962CC19EAB' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByInt_53FA860C483B895D051A8BB1A20ADC02) == 0x001608, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByInt_53FA860C483B895D051A8BB1A20ADC02' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_FCBE012D41F79BBF75B9BE8139F7284C) == 0x0016D8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_FCBE012D41F79BBF75B9BE8139F7284C' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_F3CAE22A462D20BA17177B81970C7B59) == 0x001748, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_F3CAE22A462D20BA17177B81970C7B59' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByInt_8B7710C24213E8F62E5FBC808A37C683) == 0x0017B8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByInt_8B7710C24213E8F62E5FBC808A37C683' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_8145FBED42E91346C7035CBCA48F6593) == 0x001888, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_8145FBED42E91346C7035CBCA48F6593' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_16FE84814E07C055C4BEC0B661BEBD2F) == 0x0018F8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_16FE84814E07C055C4BEC0B661BEBD2F' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByBool_F65FE46440F5F3C0737662B49E96A5F8) == 0x001968, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByBool_F65FE46440F5F3C0737662B49E96A5F8' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByBool_31C3632D4538C114A21DE586EE641559) == 0x001A38, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByBool_31C3632D4538C114A21DE586EE641559' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_9BDDB57F4AA31ADA5DAAC3A0E1ADFF08) == 0x001B08, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_9BDDB57F4AA31ADA5DAAC3A0E1ADFF08' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByBool_3C294C8D460E7F3B9D9EAD9F76DAB34F) == 0x001B78, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByBool_3C294C8D460E7F3B9D9EAD9F76DAB34F' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_EA089B76440C9FBF56B2B58E232C17D0) == 0x001C48, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_EA089B76440C9FBF56B2B58E232C17D0' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_AC1D88984A109FC8445CEE9A1D031B60) == 0x001CB8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_AC1D88984A109FC8445CEE9A1D031B60' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_BA52ADD94EDA77BAD6BC0195FB2814F3) == 0x001D28, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_BA52ADD94EDA77BAD6BC0195FB2814F3' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByBool_5389CC67448EEA2AA4436F82A749ABE4) == 0x001D98, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByBool_5389CC67448EEA2AA4436F82A749ABE4' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByBool_787F534647A1B3EA3D8CA3A4956A9B19) == 0x001E68, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByBool_787F534647A1B3EA3D8CA3A4956A9B19' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_3509B7414F6E22891E1FB99C25BA302B) == 0x001F38, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_3509B7414F6E22891E1FB99C25BA302B' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_8F67D5564BDC46404143528E186B4586) == 0x001FA8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_8F67D5564BDC46404143528E186B4586' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByBool_23262F8045DC86CA0817D6800E861B31) == 0x002018, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByBool_23262F8045DC86CA0817D6800E861B31' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByBool_F78C31DC4AE03046ED271DB89EF78C31) == 0x0020E8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByBool_F78C31DC4AE03046ED271DB89EF78C31' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_D96ADA7B41797CDEF550E38B7B2597B4) == 0x0021B8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_D96ADA7B41797CDEF550E38B7B2597B4' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_BlendListByBool_A6E422D74E6054BEB1975BA796D5F174) == 0x002228, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_BlendListByBool_A6E422D74E6054BEB1975BA796D5F174' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_StateResult_3BDF123645BEF232B5170D8759224E3E) == 0x0022F8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_StateResult_3BDF123645BEF232B5170D8759224E3E' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_7D9180AF420348B644B27D889FAE1F2C) == 0x002340, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_7D9180AF420348B644B27D889FAE1F2C' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_StateResult_722695344E66276FEDBF09B37B20B3BF) == 0x0023B0, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_StateResult_722695344E66276FEDBF09B37B20B3BF' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_StateMachine_6A6250D8431A54FA6C7C39AFE6670B17) == 0x0023F8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_StateMachine_6A6250D8431A54FA6C7C39AFE6670B17' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, OrionAnimGraphNode_MinionBehavior_31B106644F38EEDACF905CA33F3FBAEF) == 0x0024D0, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::OrionAnimGraphNode_MinionBehavior_31B106644F38EEDACF905CA33F3FBAEF' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_Root_E53BBF844161C75D8680ECB3F66676FB) == 0x0027C0, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_Root_E53BBF844161C75D8680ECB3F66676FB' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_ApplyAdditive_1240D66C4879BD1CC8FA9794283E295D) == 0x002808, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_ApplyAdditive_1240D66C4879BD1CC8FA9794283E295D' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AnimGraphNode_SequencePlayer_14E70F684CB1E17B6C8AE98FC9E78DF3) == 0x002880, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AnimGraphNode_SequencePlayer_14E70F684CB1E17B6C8AE98FC9E78DF3' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, MoveSpeedThreshold) == 0x0028F0, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::MoveSpeedThreshold' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AuthoredJogNonCombatSpeed) == 0x0028F4, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AuthoredJogNonCombatSpeed' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dawn_AnimBP_C, AuthoredJogCombatSpeed) == 0x0028F8, "Member 'ULaneMinions_Melee_Dawn_AnimBP_C::AuthoredJogCombatSpeed' has a wrong offset!");

}

