#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LaneMinions_Melee_Dusk_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "ImmediatePhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass LaneMinions_Melee_Dusk_AnimBP.LaneMinions_Melee_Dusk_AnimBP_C
// 0x1CE0 (0x2910 - 0x0C30)
class ULaneMinions_Melee_Dusk_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4F8FA775451D4911F3FFA59697908563; // 0x0C38(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_530FA976493AA981F962728D95D68932; // 0x0C80(0x0048)()
	uint8                                         Pad_CC8[0x8];                                      // 0x0CC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionAnimNode_SimpleSlopeAndAim       OrionAnimGraphNode_SimpleSlopeAndAim_F582F25242F76BECA803D0B0D1FC98F7; // 0x0CD0(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6C2B921D4D2A7BF3C1F1548B95FD67E0; // 0x0D80(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_600D85C3499403D5EEEA16B057211EA5; // 0x0E00(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8C99F51346D72C04910FE6A55E616758; // 0x0E80(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A28CC54C43885EC76323C981EE13F2D4; // 0x0F00(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_165D7B2F4DDAE196F36BCFAE6F8E9F2F; // 0x0F70(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29ECD55548D92C6A8E5C07B888A4AB39; // 0x0FB8(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CE7830B045F66093DF0DB19F13A16DBD; // 0x1028(0x0070)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_581AE08040622017F8D86D9B1F944E9B; // 0x1098(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_843F56C940B68D6CD72391BD022C0F8A; // 0x1168(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0B1669C141B0377EAF6A0C835E349C67; // 0x11D8(0x0070)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_C6F3DBC044D450681062C3BC17FDD529; // 0x1248(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_481928A140EA24EE42C207ABD2DF34B4; // 0x1318(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8267C48F4E845622EF65EF929B011D42; // 0x1388(0x0070)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_45FFCF0B46EB0B8ECC0F16B71972FF18; // 0x13F8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B9C0FD574CA33615744C95B395F01F28; // 0x14C8(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_87BA6635404D17CE31C4129573C5415C; // 0x1538(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_84F8ED6E4AA8171D703FFB941699F540; // 0x15A8(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3C63782F4AE96E0AD1BDA19AF6E7A896; // 0x1678(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_621672CC4EDDA86A3CC05CB2D38EE9D9; // 0x1748(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_277BEB5841646CCDCE6BAFB475EFE8DA; // 0x17B8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C55EFF904B31DEA7BEBC12A80A72AA6E; // 0x1888(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F00FC5704B077E3F416D1AA2E351EAA8; // 0x18F8(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E79C43AC495AE6067E13EB8151719007; // 0x1968(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_DBB7360F4ABC7C49374ED89E6E67DDAE; // 0x19D8(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9F6DF73B44B264BC0E5ED48BCE41478C; // 0x1AA8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68F60310478D810C2E3D45AEB4D5390D; // 0x1B78(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3A6A2DAD449994ACA707FEB80B7D0093; // 0x1BE8(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_95E5ED484CDD36C7A00640AF0FEE896F; // 0x1C58(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_380D8F4F4DA58F3CB60F21A418EF3221; // 0x1D28(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A75F673045E2D506657F38BA0F060A74; // 0x1DF8(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_60CE031F495D7080C6E18F9ACE7E4A6D; // 0x1E68(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_118F69164179F11B8568F3AC510B6FBB; // 0x1F38(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DA7990FD47F038609016D885F92A2071; // 0x1F80(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_73ABF0CF421DB66F6846A78201513E65; // 0x1FF0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6C5ACBA545DE27473F5559B3EF41233B; // 0x2038(0x00D8)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_DB2A4D664C8D7FD5A23DCD8C2A05F5AB; // 0x2110(0x02F0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3279F8D24D7A5330E4FFBDAB88B40932; // 0x2400(0x03C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6D33E0C14678790F631A39AB2C404B15; // 0x27C8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_54763BAD403B63C2126F3AAC641AE79A; // 0x2810(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9B4C9CE041E818ADEF93EF9C126A9129; // 0x2888(0x0070)()
	float                                         MoveSpeedThreshold;                                // 0x28F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AuthoredJogNonCombatSpeed;                         // 0x28FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AuthoredJogCombatSpeed;                            // 0x2900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_ApplyAdditive_54763BAD403B63C2126F3AAC641AE79A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByBool_277BEB5841646CCDCE6BAFB475EFE8DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByBool_380D8F4F4DA58F3CB60F21A418EF3221();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByBool_3C63782F4AE96E0AD1BDA19AF6E7A896();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByBool_60CE031F495D7080C6E18F9ACE7E4A6D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByBool_84F8ED6E4AA8171D703FFB941699F540();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByBool_95E5ED484CDD36C7A00640AF0FEE896F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByBool_9F6DF73B44B264BC0E5ED48BCE41478C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByBool_DBB7360F4ABC7C49374ED89E6E67DDAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByInt_45FFCF0B46EB0B8ECC0F16B71972FF18();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByInt_581AE08040622017F8D86D9B1F944E9B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_BlendListByInt_C6F3DBC044D450681062C3BC17FDD529();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_RigidBody_3279F8D24D7A5330E4FFBDAB88B40932();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_0B1669C141B0377EAF6A0C835E349C67();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_29ECD55548D92C6A8E5C07B888A4AB39();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_3A6A2DAD449994ACA707FEB80B7D0093();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_481928A140EA24EE42C207ABD2DF34B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_621672CC4EDDA86A3CC05CB2D38EE9D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_68F60310478D810C2E3D45AEB4D5390D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_8267C48F4E845622EF65EF929B011D42();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_843F56C940B68D6CD72391BD022C0F8A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_87BA6635404D17CE31C4129573C5415C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_A75F673045E2D506657F38BA0F060A74();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_B9C0FD574CA33615744C95B395F01F28();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_C55EFF904B31DEA7BEBC12A80A72AA6E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_CE7830B045F66093DF0DB19F13A16DBD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_E79C43AC495AE6067E13EB8151719007();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_SequencePlayer_F00FC5704B077E3F416D1AA2E351EAA8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_TransitionResult_600D85C3499403D5EEEA16B057211EA5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_AnimGraphNode_TransitionResult_8C99F51346D72C04910FE6A55E616758();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Melee_Dusk_AnimBP_OrionAnimGraphNode_SimpleSlopeAndAim_F582F25242F76BECA803D0B0D1FC98F7();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LaneMinions_Melee_Dusk_AnimBP_C">();
	}
	static class ULaneMinions_Melee_Dusk_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULaneMinions_Melee_Dusk_AnimBP_C>();
	}
};
static_assert(alignof(ULaneMinions_Melee_Dusk_AnimBP_C) == 0x000010, "Wrong alignment on ULaneMinions_Melee_Dusk_AnimBP_C");
static_assert(sizeof(ULaneMinions_Melee_Dusk_AnimBP_C) == 0x002910, "Wrong size on ULaneMinions_Melee_Dusk_AnimBP_C");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_LocalToComponentSpace_4F8FA775451D4911F3FFA59697908563) == 0x000C38, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_LocalToComponentSpace_4F8FA775451D4911F3FFA59697908563' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_530FA976493AA981F962728D95D68932) == 0x000C80, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_530FA976493AA981F962728D95D68932' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, OrionAnimGraphNode_SimpleSlopeAndAim_F582F25242F76BECA803D0B0D1FC98F7) == 0x000CD0, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::OrionAnimGraphNode_SimpleSlopeAndAim_F582F25242F76BECA803D0B0D1FC98F7' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_TransitionResult_6C2B921D4D2A7BF3C1F1548B95FD67E0) == 0x000D80, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_TransitionResult_6C2B921D4D2A7BF3C1F1548B95FD67E0' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_TransitionResult_600D85C3499403D5EEEA16B057211EA5) == 0x000E00, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_TransitionResult_600D85C3499403D5EEEA16B057211EA5' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_TransitionResult_8C99F51346D72C04910FE6A55E616758) == 0x000E80, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_TransitionResult_8C99F51346D72C04910FE6A55E616758' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_A28CC54C43885EC76323C981EE13F2D4) == 0x000F00, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_A28CC54C43885EC76323C981EE13F2D4' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_StateResult_165D7B2F4DDAE196F36BCFAE6F8E9F2F) == 0x000F70, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_StateResult_165D7B2F4DDAE196F36BCFAE6F8E9F2F' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_29ECD55548D92C6A8E5C07B888A4AB39) == 0x000FB8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_29ECD55548D92C6A8E5C07B888A4AB39' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_CE7830B045F66093DF0DB19F13A16DBD) == 0x001028, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_CE7830B045F66093DF0DB19F13A16DBD' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByInt_581AE08040622017F8D86D9B1F944E9B) == 0x001098, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByInt_581AE08040622017F8D86D9B1F944E9B' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_843F56C940B68D6CD72391BD022C0F8A) == 0x001168, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_843F56C940B68D6CD72391BD022C0F8A' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_0B1669C141B0377EAF6A0C835E349C67) == 0x0011D8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_0B1669C141B0377EAF6A0C835E349C67' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByInt_C6F3DBC044D450681062C3BC17FDD529) == 0x001248, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByInt_C6F3DBC044D450681062C3BC17FDD529' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_481928A140EA24EE42C207ABD2DF34B4) == 0x001318, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_481928A140EA24EE42C207ABD2DF34B4' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_8267C48F4E845622EF65EF929B011D42) == 0x001388, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_8267C48F4E845622EF65EF929B011D42' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByInt_45FFCF0B46EB0B8ECC0F16B71972FF18) == 0x0013F8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByInt_45FFCF0B46EB0B8ECC0F16B71972FF18' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_B9C0FD574CA33615744C95B395F01F28) == 0x0014C8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_B9C0FD574CA33615744C95B395F01F28' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_87BA6635404D17CE31C4129573C5415C) == 0x001538, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_87BA6635404D17CE31C4129573C5415C' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_84F8ED6E4AA8171D703FFB941699F540) == 0x0015A8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_84F8ED6E4AA8171D703FFB941699F540' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_3C63782F4AE96E0AD1BDA19AF6E7A896) == 0x001678, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_3C63782F4AE96E0AD1BDA19AF6E7A896' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_621672CC4EDDA86A3CC05CB2D38EE9D9) == 0x001748, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_621672CC4EDDA86A3CC05CB2D38EE9D9' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_277BEB5841646CCDCE6BAFB475EFE8DA) == 0x0017B8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_277BEB5841646CCDCE6BAFB475EFE8DA' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_C55EFF904B31DEA7BEBC12A80A72AA6E) == 0x001888, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_C55EFF904B31DEA7BEBC12A80A72AA6E' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_F00FC5704B077E3F416D1AA2E351EAA8) == 0x0018F8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_F00FC5704B077E3F416D1AA2E351EAA8' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_E79C43AC495AE6067E13EB8151719007) == 0x001968, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_E79C43AC495AE6067E13EB8151719007' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_DBB7360F4ABC7C49374ED89E6E67DDAE) == 0x0019D8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_DBB7360F4ABC7C49374ED89E6E67DDAE' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_9F6DF73B44B264BC0E5ED48BCE41478C) == 0x001AA8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_9F6DF73B44B264BC0E5ED48BCE41478C' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_68F60310478D810C2E3D45AEB4D5390D) == 0x001B78, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_68F60310478D810C2E3D45AEB4D5390D' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_3A6A2DAD449994ACA707FEB80B7D0093) == 0x001BE8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_3A6A2DAD449994ACA707FEB80B7D0093' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_95E5ED484CDD36C7A00640AF0FEE896F) == 0x001C58, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_95E5ED484CDD36C7A00640AF0FEE896F' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_380D8F4F4DA58F3CB60F21A418EF3221) == 0x001D28, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_380D8F4F4DA58F3CB60F21A418EF3221' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_A75F673045E2D506657F38BA0F060A74) == 0x001DF8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_A75F673045E2D506657F38BA0F060A74' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_60CE031F495D7080C6E18F9ACE7E4A6D) == 0x001E68, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_60CE031F495D7080C6E18F9ACE7E4A6D' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_StateResult_118F69164179F11B8568F3AC510B6FBB) == 0x001F38, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_StateResult_118F69164179F11B8568F3AC510B6FBB' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_DA7990FD47F038609016D885F92A2071) == 0x001F80, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_DA7990FD47F038609016D885F92A2071' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_StateResult_73ABF0CF421DB66F6846A78201513E65) == 0x001FF0, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_StateResult_73ABF0CF421DB66F6846A78201513E65' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_StateMachine_6C5ACBA545DE27473F5559B3EF41233B) == 0x002038, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_StateMachine_6C5ACBA545DE27473F5559B3EF41233B' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, OrionAnimGraphNode_MinionBehavior_DB2A4D664C8D7FD5A23DCD8C2A05F5AB) == 0x002110, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::OrionAnimGraphNode_MinionBehavior_DB2A4D664C8D7FD5A23DCD8C2A05F5AB' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_RigidBody_3279F8D24D7A5330E4FFBDAB88B40932) == 0x002400, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_RigidBody_3279F8D24D7A5330E4FFBDAB88B40932' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_Root_6D33E0C14678790F631A39AB2C404B15) == 0x0027C8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_Root_6D33E0C14678790F631A39AB2C404B15' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_ApplyAdditive_54763BAD403B63C2126F3AAC641AE79A) == 0x002810, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_ApplyAdditive_54763BAD403B63C2126F3AAC641AE79A' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_9B4C9CE041E818ADEF93EF9C126A9129) == 0x002888, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_9B4C9CE041E818ADEF93EF9C126A9129' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, MoveSpeedThreshold) == 0x0028F8, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::MoveSpeedThreshold' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AuthoredJogNonCombatSpeed) == 0x0028FC, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AuthoredJogNonCombatSpeed' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Melee_Dusk_AnimBP_C, AuthoredJogCombatSpeed) == 0x002900, "Member 'ULaneMinions_Melee_Dusk_AnimBP_C::AuthoredJogCombatSpeed' has a wrong offset!");

}

