#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LaneMinions_Ranged_AnimBP

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass LaneMinions_Ranged_AnimBP.LaneMinions_Ranged_AnimBP_C
// 0x1710 (0x2340 - 0x0C30)
class ULaneMinions_Ranged_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6DB8B01A428EEE6C3DFBF8A80D7C7D06; // 0x0C38(0x0048)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_F23137304BD21C249EF411BBDDC49D1B; // 0x0C80(0x02F0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_349A254C47F05485A8A860A41398F9D7; // 0x0F70(0x03C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_AD2EF4284DDA06D51F35C7BABD1A7504; // 0x1338(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_65C94EAF4CEC01C0E75CA69FF938A653; // 0x1380(0x0048)()
	uint8                                         Pad_13C8[0x8];                                     // 0x13C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E04AE3CB43FE0ABD04480FBC3E8C63D1; // 0x13D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E60CF92749277D6FB04F3884D023F265; // 0x1450(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EB79C7F24DD1FEDADFB32A9C6A18AF9F; // 0x14D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_667E9C534CCCD2478179669C56DC58C7; // 0x1550(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_39CB31AC460CEAD90BD3AB8DAE4C56D1; // 0x15D0(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E16B31164FCA324790CB1DA1BFAE66EA; // 0x16A0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7219EE714EA13271638AB19143E03F8B; // 0x1710(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_DA7471324E20BA103122508EA0BA763C; // 0x1780(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1CA0C88847CD9C9CC2F82680895F4BAB; // 0x17C8(0x00D0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_732F3AE54D572233788866B796D96557; // 0x1898(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_39250D1B45D06842B7080EB806F7512C; // 0x1908(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_305A24574661153BC41511A8BDC9198E; // 0x19D8(0x0070)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_76FCA09E47A6BE83C5BA1ABEBA0B501D; // 0x1A48(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_07FD9E5744FCE329E3D2C89830716E34; // 0x1AB8(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_150BE142472A6E56B66258B7ADE8AB09; // 0x1B98(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_29EE1253430A56FAAEA47488E29221D9; // 0x1C08(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1A27E7044676E263FDA2118F1436E7FD; // 0x1C50(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D34009A64A03B61F44BB18B6518D8F0C; // 0x1CC0(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_0E50D47E4F7A3C574DCACB9A2DE97CE2; // 0x1D30(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_762F584B437EE3516B3A6F94C7B5317C; // 0x1E00(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C4E0D048439D85A7D9034988EE004550; // 0x1E70(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_284F28684D83FCC03AEA6A99DB7E13BF; // 0x1EE0(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7DB708CA4FB8A06EE71CB6AC27BDE1DB; // 0x1FB0(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_5F27801141A33A165D1786A40AF0805B; // 0x2080(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7FBD758E41822E850614E2937CB581FA; // 0x20C8(0x00D8)()
	struct FOrionAnimNode_SimpleSlopeAndAim       OrionAnimGraphNode_SimpleSlopeAndAim_F35657554BE29EE8F6BF13B52214BE95; // 0x21A0(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_719887164E3ECA924ADE31B83F430A09; // 0x2250(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2CA17236475BEDB34257E2BEBC0CAA44; // 0x22C8(0x0070)()

public:
	void ExecuteUbergraph_LaneMinions_Ranged_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_ApplyAdditive_719887164E3ECA924ADE31B83F430A09();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_BlendListByBool_0E50D47E4F7A3C574DCACB9A2DE97CE2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_BlendListByBool_1CA0C88847CD9C9CC2F82680895F4BAB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_BlendListByBool_284F28684D83FCC03AEA6A99DB7E13BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_BlendListByBool_39250D1B45D06842B7080EB806F7512C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_BlendListByBool_39CB31AC460CEAD90BD3AB8DAE4C56D1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_BlendListByBool_7DB708CA4FB8A06EE71CB6AC27BDE1DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_RigidBody_349A254C47F05485A8A860A41398F9D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_SequencePlayer_150BE142472A6E56B66258B7ADE8AB09();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_SequencePlayer_1A27E7044676E263FDA2118F1436E7FD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_SequencePlayer_305A24574661153BC41511A8BDC9198E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_SequencePlayer_762F584B437EE3516B3A6F94C7B5317C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_SequencePlayer_C4E0D048439D85A7D9034988EE004550();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_SequencePlayer_D34009A64A03B61F44BB18B6518D8F0C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_SequencePlayer_E16B31164FCA324790CB1DA1BFAE66EA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_TransitionResult_667E9C534CCCD2478179669C56DC58C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_TransitionResult_E04AE3CB43FE0ABD04480FBC3E8C63D1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_TransitionResult_E60CF92749277D6FB04F3884D023F265();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_AnimGraphNode_TransitionResult_EB79C7F24DD1FEDADFB32A9C6A18AF9F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LaneMinions_Ranged_AnimBP_OrionAnimGraphNode_SimpleSlopeAndAim_F35657554BE29EE8F6BF13B52214BE95();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LaneMinions_Ranged_AnimBP_C">();
	}
	static class ULaneMinions_Ranged_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULaneMinions_Ranged_AnimBP_C>();
	}
};
static_assert(alignof(ULaneMinions_Ranged_AnimBP_C) == 0x000010, "Wrong alignment on ULaneMinions_Ranged_AnimBP_C");
static_assert(sizeof(ULaneMinions_Ranged_AnimBP_C) == 0x002340, "Wrong size on ULaneMinions_Ranged_AnimBP_C");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'ULaneMinions_Ranged_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_Root_6DB8B01A428EEE6C3DFBF8A80D7C7D06) == 0x000C38, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_Root_6DB8B01A428EEE6C3DFBF8A80D7C7D06' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, OrionAnimGraphNode_MinionBehavior_F23137304BD21C249EF411BBDDC49D1B) == 0x000C80, "Member 'ULaneMinions_Ranged_AnimBP_C::OrionAnimGraphNode_MinionBehavior_F23137304BD21C249EF411BBDDC49D1B' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_RigidBody_349A254C47F05485A8A860A41398F9D7) == 0x000F70, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_RigidBody_349A254C47F05485A8A860A41398F9D7' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_AD2EF4284DDA06D51F35C7BABD1A7504) == 0x001338, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_AD2EF4284DDA06D51F35C7BABD1A7504' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_LocalToComponentSpace_65C94EAF4CEC01C0E75CA69FF938A653) == 0x001380, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_LocalToComponentSpace_65C94EAF4CEC01C0E75CA69FF938A653' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_TransitionResult_E04AE3CB43FE0ABD04480FBC3E8C63D1) == 0x0013D0, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_TransitionResult_E04AE3CB43FE0ABD04480FBC3E8C63D1' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_TransitionResult_E60CF92749277D6FB04F3884D023F265) == 0x001450, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_TransitionResult_E60CF92749277D6FB04F3884D023F265' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_TransitionResult_EB79C7F24DD1FEDADFB32A9C6A18AF9F) == 0x0014D0, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_TransitionResult_EB79C7F24DD1FEDADFB32A9C6A18AF9F' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_TransitionResult_667E9C534CCCD2478179669C56DC58C7) == 0x001550, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_TransitionResult_667E9C534CCCD2478179669C56DC58C7' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_BlendListByBool_39CB31AC460CEAD90BD3AB8DAE4C56D1) == 0x0015D0, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_BlendListByBool_39CB31AC460CEAD90BD3AB8DAE4C56D1' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequencePlayer_E16B31164FCA324790CB1DA1BFAE66EA) == 0x0016A0, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequencePlayer_E16B31164FCA324790CB1DA1BFAE66EA' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequencePlayer_7219EE714EA13271638AB19143E03F8B) == 0x001710, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequencePlayer_7219EE714EA13271638AB19143E03F8B' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_StateResult_DA7471324E20BA103122508EA0BA763C) == 0x001780, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_StateResult_DA7471324E20BA103122508EA0BA763C' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_BlendListByBool_1CA0C88847CD9C9CC2F82680895F4BAB) == 0x0017C8, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_BlendListByBool_1CA0C88847CD9C9CC2F82680895F4BAB' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequenceEvaluator_732F3AE54D572233788866B796D96557) == 0x001898, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequenceEvaluator_732F3AE54D572233788866B796D96557' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_BlendListByBool_39250D1B45D06842B7080EB806F7512C) == 0x001908, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_BlendListByBool_39250D1B45D06842B7080EB806F7512C' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequencePlayer_305A24574661153BC41511A8BDC9198E) == 0x0019D8, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequencePlayer_305A24574661153BC41511A8BDC9198E' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequenceEvaluator_76FCA09E47A6BE83C5BA1ABEBA0B501D) == 0x001A48, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequenceEvaluator_76FCA09E47A6BE83C5BA1ABEBA0B501D' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_LayeredBoneBlend_07FD9E5744FCE329E3D2C89830716E34) == 0x001AB8, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_LayeredBoneBlend_07FD9E5744FCE329E3D2C89830716E34' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequencePlayer_150BE142472A6E56B66258B7ADE8AB09) == 0x001B98, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequencePlayer_150BE142472A6E56B66258B7ADE8AB09' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_StateResult_29EE1253430A56FAAEA47488E29221D9) == 0x001C08, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_StateResult_29EE1253430A56FAAEA47488E29221D9' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequencePlayer_1A27E7044676E263FDA2118F1436E7FD) == 0x001C50, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequencePlayer_1A27E7044676E263FDA2118F1436E7FD' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequencePlayer_D34009A64A03B61F44BB18B6518D8F0C) == 0x001CC0, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequencePlayer_D34009A64A03B61F44BB18B6518D8F0C' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_BlendListByBool_0E50D47E4F7A3C574DCACB9A2DE97CE2) == 0x001D30, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_BlendListByBool_0E50D47E4F7A3C574DCACB9A2DE97CE2' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequencePlayer_762F584B437EE3516B3A6F94C7B5317C) == 0x001E00, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequencePlayer_762F584B437EE3516B3A6F94C7B5317C' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequencePlayer_C4E0D048439D85A7D9034988EE004550) == 0x001E70, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequencePlayer_C4E0D048439D85A7D9034988EE004550' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_BlendListByBool_284F28684D83FCC03AEA6A99DB7E13BF) == 0x001EE0, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_BlendListByBool_284F28684D83FCC03AEA6A99DB7E13BF' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_BlendListByBool_7DB708CA4FB8A06EE71CB6AC27BDE1DB) == 0x001FB0, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_BlendListByBool_7DB708CA4FB8A06EE71CB6AC27BDE1DB' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_StateResult_5F27801141A33A165D1786A40AF0805B) == 0x002080, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_StateResult_5F27801141A33A165D1786A40AF0805B' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_StateMachine_7FBD758E41822E850614E2937CB581FA) == 0x0020C8, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_StateMachine_7FBD758E41822E850614E2937CB581FA' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, OrionAnimGraphNode_SimpleSlopeAndAim_F35657554BE29EE8F6BF13B52214BE95) == 0x0021A0, "Member 'ULaneMinions_Ranged_AnimBP_C::OrionAnimGraphNode_SimpleSlopeAndAim_F35657554BE29EE8F6BF13B52214BE95' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_ApplyAdditive_719887164E3ECA924ADE31B83F430A09) == 0x002250, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_ApplyAdditive_719887164E3ECA924ADE31B83F430A09' has a wrong offset!");
static_assert(offsetof(ULaneMinions_Ranged_AnimBP_C, AnimGraphNode_SequencePlayer_2CA17236475BEDB34257E2BEBC0CAA44) == 0x0022C8, "Member 'ULaneMinions_Ranged_AnimBP_C::AnimGraphNode_SequencePlayer_2CA17236475BEDB34257E2BEBC0CAA44' has a wrong offset!");

}

