#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LightBox.LightBox_C
// 0x0030 (0x0440 - 0x0410)
class ULightBox_C final : public UOrionLightBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bDestroyContentPostFadeOut;                        // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionActivatableWidget*                CurrentActivatableContent;                         // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             GetMoreCardsOpenSound;                             // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             GetMoreCardsBackSound;                             // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LightBox(int32 EntryPoint);
	void OnContentActivationChanged(bool bActivated);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LightBox_C">();
	}
	static class ULightBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULightBox_C>();
	}
};
static_assert(alignof(ULightBox_C) == 0x000008, "Wrong alignment on ULightBox_C");
static_assert(sizeof(ULightBox_C) == 0x000440, "Wrong size on ULightBox_C");
static_assert(offsetof(ULightBox_C, UberGraphFrame) == 0x000410, "Member 'ULightBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULightBox_C, Intro) == 0x000418, "Member 'ULightBox_C::Intro' has a wrong offset!");
static_assert(offsetof(ULightBox_C, bDestroyContentPostFadeOut) == 0x000420, "Member 'ULightBox_C::bDestroyContentPostFadeOut' has a wrong offset!");
static_assert(offsetof(ULightBox_C, CurrentActivatableContent) == 0x000428, "Member 'ULightBox_C::CurrentActivatableContent' has a wrong offset!");
static_assert(offsetof(ULightBox_C, GetMoreCardsOpenSound) == 0x000430, "Member 'ULightBox_C::GetMoreCardsOpenSound' has a wrong offset!");
static_assert(offsetof(ULightBox_C, GetMoreCardsBackSound) == 0x000438, "Member 'ULightBox_C::GetMoreCardsBackSound' has a wrong offset!");

}

