#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainBanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MainBanner.MainBanner_C
// 0x0018 (0x09C8 - 0x09B0)
class AMainBanner_C final : public AOrionBanner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B0(0x0008)(Transient, DuplicateTransient)
	float                                         Spawn_Animation_AnimTimeline_4A3CD45D4BA064B111C6A88D11E7FBDE; // 0x09B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Spawn_Animation__Direction_4A3CD45D4BA064B111C6A88D11E7FBDE; // 0x09BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BD[0x3];                                      // 0x09BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Spawn_Animation;                                   // 0x09C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainBanner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Spawn_Animation__FinishedFunc();
	void Spawn_Animation__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainBanner_C">();
	}
	static class AMainBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMainBanner_C>();
	}
};
static_assert(alignof(AMainBanner_C) == 0x000008, "Wrong alignment on AMainBanner_C");
static_assert(sizeof(AMainBanner_C) == 0x0009C8, "Wrong size on AMainBanner_C");
static_assert(offsetof(AMainBanner_C, UberGraphFrame) == 0x0009B0, "Member 'AMainBanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMainBanner_C, Spawn_Animation_AnimTimeline_4A3CD45D4BA064B111C6A88D11E7FBDE) == 0x0009B8, "Member 'AMainBanner_C::Spawn_Animation_AnimTimeline_4A3CD45D4BA064B111C6A88D11E7FBDE' has a wrong offset!");
static_assert(offsetof(AMainBanner_C, Spawn_Animation__Direction_4A3CD45D4BA064B111C6A88D11E7FBDE) == 0x0009BC, "Member 'AMainBanner_C::Spawn_Animation__Direction_4A3CD45D4BA064B111C6A88D11E7FBDE' has a wrong offset!");
static_assert(offsetof(AMainBanner_C, Spawn_Animation) == 0x0009C0, "Member 'AMainBanner_C::Spawn_Animation' has a wrong offset!");

}

