#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Match_Info_Text_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Match_Info_Text_Widget.Match_Info_Text_Widget_C
// 0x0028 (0x0470 - 0x0448)
class UMatch_Info_Text_Widget_C final : public UOrionActivatableWidget
{
public:
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Message;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             MatchStartOpenSound;                               // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Match_Info_Text_Widget(int32 EntryPoint);
	void Construct();
	void Destruct();
	void OnActivated();
	void OnMatchCountdownSecondsUpdated_Event_0(int32 SecondsUntilMatchStarts);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Match_Info_Text_Widget_C">();
	}
	static class UMatch_Info_Text_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatch_Info_Text_Widget_C>();
	}
};
static_assert(alignof(UMatch_Info_Text_Widget_C) == 0x000008, "Wrong alignment on UMatch_Info_Text_Widget_C");
static_assert(sizeof(UMatch_Info_Text_Widget_C) == 0x000470, "Wrong size on UMatch_Info_Text_Widget_C");
static_assert(offsetof(UMatch_Info_Text_Widget_C, UberGraphFrame) == 0x000450, "Member 'UMatch_Info_Text_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatch_Info_Text_Widget_C, Intro) == 0x000458, "Member 'UMatch_Info_Text_Widget_C::Intro' has a wrong offset!");
static_assert(offsetof(UMatch_Info_Text_Widget_C, Text_Message) == 0x000460, "Member 'UMatch_Info_Text_Widget_C::Text_Message' has a wrong offset!");
static_assert(offsetof(UMatch_Info_Text_Widget_C, MatchStartOpenSound) == 0x000468, "Member 'UMatch_Info_Text_Widget_C::MatchStartOpenSound' has a wrong offset!");

}

