#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Minion_Melee_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Minion_Melee_AnimBP.Minion_Melee_AnimBP_C
// 0x0660 (0x1290 - 0x0C30)
class UMinion_Melee_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_46390D6A4CF241CB062823B15454E993; // 0x0C38(0x0128)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_555F94974AE9839AAD2A058448B745C8; // 0x0D60(0x02F0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1756166E4EA2AB51609A40953A82C128; // 0x1050(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_FC6004A2441104C869DE6B89D1C479E2; // 0x1120(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_B1B8C7F743B16697732DCA98CC911B83; // 0x1168(0x0128)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Melee_AnimBP_AnimGraphNode_BlendListByInt_1756166E4EA2AB51609A40953A82C128();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Melee_AnimBP_AnimGraphNode_BlendSpacePlayer_46390D6A4CF241CB062823B15454E993();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Melee_AnimBP_AnimGraphNode_BlendSpacePlayer_B1B8C7F743B16697732DCA98CC911B83();
	void ExecuteUbergraph_Minion_Melee_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Minion_Melee_AnimBP_C">();
	}
	static class UMinion_Melee_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinion_Melee_AnimBP_C>();
	}
};
static_assert(alignof(UMinion_Melee_AnimBP_C) == 0x000010, "Wrong alignment on UMinion_Melee_AnimBP_C");
static_assert(sizeof(UMinion_Melee_AnimBP_C) == 0x001290, "Wrong size on UMinion_Melee_AnimBP_C");
static_assert(offsetof(UMinion_Melee_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'UMinion_Melee_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_AnimBP_C, AnimGraphNode_BlendSpacePlayer_46390D6A4CF241CB062823B15454E993) == 0x000C38, "Member 'UMinion_Melee_AnimBP_C::AnimGraphNode_BlendSpacePlayer_46390D6A4CF241CB062823B15454E993' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_AnimBP_C, OrionAnimGraphNode_MinionBehavior_555F94974AE9839AAD2A058448B745C8) == 0x000D60, "Member 'UMinion_Melee_AnimBP_C::OrionAnimGraphNode_MinionBehavior_555F94974AE9839AAD2A058448B745C8' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_AnimBP_C, AnimGraphNode_BlendListByInt_1756166E4EA2AB51609A40953A82C128) == 0x001050, "Member 'UMinion_Melee_AnimBP_C::AnimGraphNode_BlendListByInt_1756166E4EA2AB51609A40953A82C128' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_AnimBP_C, AnimGraphNode_Root_FC6004A2441104C869DE6B89D1C479E2) == 0x001120, "Member 'UMinion_Melee_AnimBP_C::AnimGraphNode_Root_FC6004A2441104C869DE6B89D1C479E2' has a wrong offset!");
static_assert(offsetof(UMinion_Melee_AnimBP_C, AnimGraphNode_BlendSpacePlayer_B1B8C7F743B16697732DCA98CC911B83) == 0x001168, "Member 'UMinion_Melee_AnimBP_C::AnimGraphNode_BlendSpacePlayer_B1B8C7F743B16697732DCA98CC911B83' has a wrong offset!");

}

