#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Minion_Leader_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Minion_Leader_AnimBP.Minion_Leader_AnimBP_C
// 0x0470 (0x10A0 - 0x0C30)
class UMinion_Leader_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_810600424809D40448D1B4BC6A535349; // 0x0C38(0x0128)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_6C09AAAD4BC46D8E047EFBB722AEF2CB; // 0x0D60(0x02F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_0CE0B8464C32B904CBAEE6ABE66C885C; // 0x1050(0x0048)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Minion_Leader_AnimBP_AnimGraphNode_BlendSpacePlayer_810600424809D40448D1B4BC6A535349();
	void ExecuteUbergraph_Minion_Leader_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Minion_Leader_AnimBP_C">();
	}
	static class UMinion_Leader_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinion_Leader_AnimBP_C>();
	}
};
static_assert(alignof(UMinion_Leader_AnimBP_C) == 0x000010, "Wrong alignment on UMinion_Leader_AnimBP_C");
static_assert(sizeof(UMinion_Leader_AnimBP_C) == 0x0010A0, "Wrong size on UMinion_Leader_AnimBP_C");
static_assert(offsetof(UMinion_Leader_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'UMinion_Leader_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinion_Leader_AnimBP_C, AnimGraphNode_BlendSpacePlayer_810600424809D40448D1B4BC6A535349) == 0x000C38, "Member 'UMinion_Leader_AnimBP_C::AnimGraphNode_BlendSpacePlayer_810600424809D40448D1B4BC6A535349' has a wrong offset!");
static_assert(offsetof(UMinion_Leader_AnimBP_C, OrionAnimGraphNode_MinionBehavior_6C09AAAD4BC46D8E047EFBB722AEF2CB) == 0x000D60, "Member 'UMinion_Leader_AnimBP_C::OrionAnimGraphNode_MinionBehavior_6C09AAAD4BC46D8E047EFBB722AEF2CB' has a wrong offset!");
static_assert(offsetof(UMinion_Leader_AnimBP_C, AnimGraphNode_Root_0CE0B8464C32B904CBAEE6ABE66C885C) == 0x001050, "Member 'UMinion_Leader_AnimBP_C::AnimGraphNode_Root_0CE0B8464C32B904CBAEE6ABE66C885C' has a wrong offset!");

}

