#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Notification

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Notification.Notification_C.Exit Animation Finished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Notification_C_Exit_Animation_Finished__DelegateSignature final
{
public:
	class UNotification_C*                        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Notification_C_Exit_Animation_Finished__DelegateSignature) == 0x000008, "Wrong alignment on Notification_C_Exit_Animation_Finished__DelegateSignature");
static_assert(sizeof(Notification_C_Exit_Animation_Finished__DelegateSignature) == 0x000008, "Wrong size on Notification_C_Exit_Animation_Finished__DelegateSignature");
static_assert(offsetof(Notification_C_Exit_Animation_Finished__DelegateSignature, Widget) == 0x000000, "Member 'Notification_C_Exit_Animation_Finished__DelegateSignature::Widget' has a wrong offset!");

// Function Notification.Notification_C.ExecuteUbergraph_Notification
// 0x0080 (0x0080 - 0x0000)
struct Notification_C_ExecuteUbergraph_Notification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0018)()
	class FText                                   CallFunc_Array_Get_Item2;                          // 0x0028(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button2;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionBaseButton*                       K2Node_ComponentBoundEvent_Button;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Notification_C_ExecuteUbergraph_Notification) == 0x000008, "Wrong alignment on Notification_C_ExecuteUbergraph_Notification");
static_assert(sizeof(Notification_C_ExecuteUbergraph_Notification) == 0x000080, "Wrong size on Notification_C_ExecuteUbergraph_Notification");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, EntryPoint) == 0x000000, "Member 'Notification_C_ExecuteUbergraph_Notification::EntryPoint' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, Temp_int_Variable) == 0x000004, "Member 'Notification_C_ExecuteUbergraph_Notification::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, Temp_byte_Variable) == 0x000008, "Member 'Notification_C_ExecuteUbergraph_Notification::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, Temp_byte_Variable2) == 0x000009, "Member 'Notification_C_ExecuteUbergraph_Notification::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, Temp_byte_Variable3) == 0x00000A, "Member 'Notification_C_ExecuteUbergraph_Notification::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, Temp_int_Variable2) == 0x00000C, "Member 'Notification_C_ExecuteUbergraph_Notification::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, CallFunc_Array_Get_Item) == 0x000010, "Member 'Notification_C_ExecuteUbergraph_Notification::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, CallFunc_Array_Get_Item2) == 0x000028, "Member 'Notification_C_ExecuteUbergraph_Notification::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'Notification_C_ExecuteUbergraph_Notification::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, CallFunc_Array_Length_ReturnValue2) == 0x000044, "Member 'Notification_C_ExecuteUbergraph_Notification::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, K2Node_Select_Default) == 0x000048, "Member 'Notification_C_ExecuteUbergraph_Notification::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'Notification_C_ExecuteUbergraph_Notification::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004A, "Member 'Notification_C_ExecuteUbergraph_Notification::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, K2Node_Event_Animation) == 0x000050, "Member 'Notification_C_ExecuteUbergraph_Notification::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'Notification_C_ExecuteUbergraph_Notification::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, Temp_byte_Variable4) == 0x000059, "Member 'Notification_C_ExecuteUbergraph_Notification::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, Temp_byte_Variable5) == 0x00005A, "Member 'Notification_C_ExecuteUbergraph_Notification::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, Temp_byte_Variable6) == 0x00005B, "Member 'Notification_C_ExecuteUbergraph_Notification::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, K2Node_ComponentBoundEvent_Button2) == 0x000060, "Member 'Notification_C_ExecuteUbergraph_Notification::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, K2Node_Select2_Default) == 0x000068, "Member 'Notification_C_ExecuteUbergraph_Notification::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, K2Node_ComponentBoundEvent_Button) == 0x000070, "Member 'Notification_C_ExecuteUbergraph_Notification::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Notification_C_ExecuteUbergraph_Notification, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000078, "Member 'Notification_C_ExecuteUbergraph_Notification::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");

// Function Notification.Notification_C.BndEvt__DefaultButton_C_63_K2Node_ComponentBoundEvent_927_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Notification_C_BndEvt__DefaultButton_C_63_K2Node_ComponentBoundEvent_927_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Notification_C_BndEvt__DefaultButton_C_63_K2Node_ComponentBoundEvent_927_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Notification_C_BndEvt__DefaultButton_C_63_K2Node_ComponentBoundEvent_927_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(Notification_C_BndEvt__DefaultButton_C_63_K2Node_ComponentBoundEvent_927_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Notification_C_BndEvt__DefaultButton_C_63_K2Node_ComponentBoundEvent_927_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(Notification_C_BndEvt__DefaultButton_C_63_K2Node_ComponentBoundEvent_927_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Notification_C_BndEvt__DefaultButton_C_63_K2Node_ComponentBoundEvent_927_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Notification.Notification_C.BndEvt__DefaultButton_K2Node_ComponentBoundEvent_919_OrionBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Notification_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_919_OrionBaseButtonClicked__DelegateSignature final
{
public:
	class UOrionBaseButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Notification_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_919_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Notification_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_919_OrionBaseButtonClicked__DelegateSignature");
static_assert(sizeof(Notification_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_919_OrionBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Notification_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_919_OrionBaseButtonClicked__DelegateSignature");
static_assert(offsetof(Notification_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_919_OrionBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Notification_C_BndEvt__DefaultButton_K2Node_ComponentBoundEvent_919_OrionBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Notification.Notification_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct Notification_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Notification_C_OnAnimationFinished) == 0x000008, "Wrong alignment on Notification_C_OnAnimationFinished");
static_assert(sizeof(Notification_C_OnAnimationFinished) == 0x000008, "Wrong size on Notification_C_OnAnimationFinished");
static_assert(offsetof(Notification_C_OnAnimationFinished, Animation) == 0x000000, "Member 'Notification_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function Notification.Notification_C.GetNotification
// 0x0180 (0x0180 - 0x0000)
struct Notification_C_GetNotification final
{
public:
	struct FOrionNotification                     ReturnValue;                                       // 0x0000(0x0180)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Notification_C_GetNotification) == 0x000010, "Wrong alignment on Notification_C_GetNotification");
static_assert(sizeof(Notification_C_GetNotification) == 0x000180, "Wrong size on Notification_C_GetNotification");
static_assert(offsetof(Notification_C_GetNotification, ReturnValue) == 0x000000, "Member 'Notification_C_GetNotification::ReturnValue' has a wrong offset!");

}

