#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OrionGame

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FunctionalTesting_structs.hpp"
#include "SlateCore_structs.hpp"
#include "BlueprintContext_structs.hpp"
#include "AIModule_structs.hpp"
#include "Slate_structs.hpp"
#include "McpProfileSys_structs.hpp"


namespace SDK::Params
{

// Function OrionGame.FunctionalTestPhase.GetCleanupStatus
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_GetCleanupStatus final
{
public:
	EFunctionalTestResult                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_GetCleanupStatus) == 0x000001, "Wrong alignment on FunctionalTestPhase_GetCleanupStatus");
static_assert(sizeof(FunctionalTestPhase_GetCleanupStatus) == 0x000001, "Wrong size on FunctionalTestPhase_GetCleanupStatus");
static_assert(offsetof(FunctionalTestPhase_GetCleanupStatus, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_GetCleanupStatus::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.GetExecuteStatus
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_GetExecuteStatus final
{
public:
	EFunctionalTestResult                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_GetExecuteStatus) == 0x000001, "Wrong alignment on FunctionalTestPhase_GetExecuteStatus");
static_assert(sizeof(FunctionalTestPhase_GetExecuteStatus) == 0x000001, "Wrong size on FunctionalTestPhase_GetExecuteStatus");
static_assert(offsetof(FunctionalTestPhase_GetExecuteStatus, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_GetExecuteStatus::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.GetSetupStatus
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_GetSetupStatus final
{
public:
	EFunctionalTestResult                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_GetSetupStatus) == 0x000001, "Wrong alignment on FunctionalTestPhase_GetSetupStatus");
static_assert(sizeof(FunctionalTestPhase_GetSetupStatus) == 0x000001, "Wrong size on FunctionalTestPhase_GetSetupStatus");
static_assert(offsetof(FunctionalTestPhase_GetSetupStatus, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_GetSetupStatus::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.GetTest
// 0x0008 (0x0008 - 0x0000)
struct FunctionalTestPhase_GetTest final
{
public:
	class APhasedFunctionalTest*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_GetTest) == 0x000008, "Wrong alignment on FunctionalTestPhase_GetTest");
static_assert(sizeof(FunctionalTestPhase_GetTest) == 0x000008, "Wrong size on FunctionalTestPhase_GetTest");
static_assert(offsetof(FunctionalTestPhase_GetTest, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_GetTest::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.HasEncounteredError
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_HasEncounteredError final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_HasEncounteredError) == 0x000001, "Wrong alignment on FunctionalTestPhase_HasEncounteredError");
static_assert(sizeof(FunctionalTestPhase_HasEncounteredError) == 0x000001, "Wrong size on FunctionalTestPhase_HasEncounteredError");
static_assert(offsetof(FunctionalTestPhase_HasEncounteredError, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_HasEncounteredError::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.HasFailed
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_HasFailed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_HasFailed) == 0x000001, "Wrong alignment on FunctionalTestPhase_HasFailed");
static_assert(sizeof(FunctionalTestPhase_HasFailed) == 0x000001, "Wrong size on FunctionalTestPhase_HasFailed");
static_assert(offsetof(FunctionalTestPhase_HasFailed, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_HasFailed::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.IsCleanupFinished
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_IsCleanupFinished final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_IsCleanupFinished) == 0x000001, "Wrong alignment on FunctionalTestPhase_IsCleanupFinished");
static_assert(sizeof(FunctionalTestPhase_IsCleanupFinished) == 0x000001, "Wrong size on FunctionalTestPhase_IsCleanupFinished");
static_assert(offsetof(FunctionalTestPhase_IsCleanupFinished, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_IsCleanupFinished::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.IsExecuteFinished
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_IsExecuteFinished final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_IsExecuteFinished) == 0x000001, "Wrong alignment on FunctionalTestPhase_IsExecuteFinished");
static_assert(sizeof(FunctionalTestPhase_IsExecuteFinished) == 0x000001, "Wrong size on FunctionalTestPhase_IsExecuteFinished");
static_assert(offsetof(FunctionalTestPhase_IsExecuteFinished, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_IsExecuteFinished::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.IsPhaseRunningInEditor
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_IsPhaseRunningInEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_IsPhaseRunningInEditor) == 0x000001, "Wrong alignment on FunctionalTestPhase_IsPhaseRunningInEditor");
static_assert(sizeof(FunctionalTestPhase_IsPhaseRunningInEditor) == 0x000001, "Wrong size on FunctionalTestPhase_IsPhaseRunningInEditor");
static_assert(offsetof(FunctionalTestPhase_IsPhaseRunningInEditor, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_IsPhaseRunningInEditor::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.IsSetupFinished
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_IsSetupFinished final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_IsSetupFinished) == 0x000001, "Wrong alignment on FunctionalTestPhase_IsSetupFinished");
static_assert(sizeof(FunctionalTestPhase_IsSetupFinished) == 0x000001, "Wrong size on FunctionalTestPhase_IsSetupFinished");
static_assert(offsetof(FunctionalTestPhase_IsSetupFinished, ReturnValue) == 0x000000, "Member 'FunctionalTestPhase_IsSetupFinished::ReturnValue' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.LogError
// 0x0010 (0x0010 - 0x0000)
struct FunctionalTestPhase_LogError final
{
public:
	class FString                                 MESSAGE;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_LogError) == 0x000008, "Wrong alignment on FunctionalTestPhase_LogError");
static_assert(sizeof(FunctionalTestPhase_LogError) == 0x000010, "Wrong size on FunctionalTestPhase_LogError");
static_assert(offsetof(FunctionalTestPhase_LogError, MESSAGE) == 0x000000, "Member 'FunctionalTestPhase_LogError::MESSAGE' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.LogInfo
// 0x0010 (0x0010 - 0x0000)
struct FunctionalTestPhase_LogInfo final
{
public:
	class FString                                 MESSAGE;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_LogInfo) == 0x000008, "Wrong alignment on FunctionalTestPhase_LogInfo");
static_assert(sizeof(FunctionalTestPhase_LogInfo) == 0x000010, "Wrong size on FunctionalTestPhase_LogInfo");
static_assert(offsetof(FunctionalTestPhase_LogInfo, MESSAGE) == 0x000000, "Member 'FunctionalTestPhase_LogInfo::MESSAGE' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.LogVerbose
// 0x0010 (0x0010 - 0x0000)
struct FunctionalTestPhase_LogVerbose final
{
public:
	class FString                                 MESSAGE;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_LogVerbose) == 0x000008, "Wrong alignment on FunctionalTestPhase_LogVerbose");
static_assert(sizeof(FunctionalTestPhase_LogVerbose) == 0x000010, "Wrong size on FunctionalTestPhase_LogVerbose");
static_assert(offsetof(FunctionalTestPhase_LogVerbose, MESSAGE) == 0x000000, "Member 'FunctionalTestPhase_LogVerbose::MESSAGE' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.LogWarning
// 0x0010 (0x0010 - 0x0000)
struct FunctionalTestPhase_LogWarning final
{
public:
	class FString                                 MESSAGE;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_LogWarning) == 0x000008, "Wrong alignment on FunctionalTestPhase_LogWarning");
static_assert(sizeof(FunctionalTestPhase_LogWarning) == 0x000010, "Wrong size on FunctionalTestPhase_LogWarning");
static_assert(offsetof(FunctionalTestPhase_LogWarning, MESSAGE) == 0x000000, "Member 'FunctionalTestPhase_LogWarning::MESSAGE' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.SetCleanupStatus
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_SetCleanupStatus final
{
public:
	EFunctionalTestResult                         Status;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_SetCleanupStatus) == 0x000001, "Wrong alignment on FunctionalTestPhase_SetCleanupStatus");
static_assert(sizeof(FunctionalTestPhase_SetCleanupStatus) == 0x000001, "Wrong size on FunctionalTestPhase_SetCleanupStatus");
static_assert(offsetof(FunctionalTestPhase_SetCleanupStatus, Status) == 0x000000, "Member 'FunctionalTestPhase_SetCleanupStatus::Status' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.SetExecuteStatus
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_SetExecuteStatus final
{
public:
	EFunctionalTestResult                         Status;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_SetExecuteStatus) == 0x000001, "Wrong alignment on FunctionalTestPhase_SetExecuteStatus");
static_assert(sizeof(FunctionalTestPhase_SetExecuteStatus) == 0x000001, "Wrong size on FunctionalTestPhase_SetExecuteStatus");
static_assert(offsetof(FunctionalTestPhase_SetExecuteStatus, Status) == 0x000000, "Member 'FunctionalTestPhase_SetExecuteStatus::Status' has a wrong offset!");

// Function OrionGame.FunctionalTestPhase.SetSetupStatus
// 0x0001 (0x0001 - 0x0000)
struct FunctionalTestPhase_SetSetupStatus final
{
public:
	EFunctionalTestResult                         Status;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestPhase_SetSetupStatus) == 0x000001, "Wrong alignment on FunctionalTestPhase_SetSetupStatus");
static_assert(sizeof(FunctionalTestPhase_SetSetupStatus) == 0x000001, "Wrong size on FunctionalTestPhase_SetSetupStatus");
static_assert(offsetof(FunctionalTestPhase_SetSetupStatus, Status) == 0x000000, "Member 'FunctionalTestPhase_SetSetupStatus::Status' has a wrong offset!");

// Function OrionGame.AITeamComm.RequestAITeamComm
// 0x0010 (0x0010 - 0x0000)
struct AITeamComm_RequestAITeamComm final
{
public:
	const class AOrionAIBot*                      BotController;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAITeamCommEvent                              Event;                                             // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreTimeouts;                                   // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TriggerDelay;                                      // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AITeamComm_RequestAITeamComm) == 0x000008, "Wrong alignment on AITeamComm_RequestAITeamComm");
static_assert(sizeof(AITeamComm_RequestAITeamComm) == 0x000010, "Wrong size on AITeamComm_RequestAITeamComm");
static_assert(offsetof(AITeamComm_RequestAITeamComm, BotController) == 0x000000, "Member 'AITeamComm_RequestAITeamComm::BotController' has a wrong offset!");
static_assert(offsetof(AITeamComm_RequestAITeamComm, Event) == 0x000008, "Member 'AITeamComm_RequestAITeamComm::Event' has a wrong offset!");
static_assert(offsetof(AITeamComm_RequestAITeamComm, bIgnoreTimeouts) == 0x000009, "Member 'AITeamComm_RequestAITeamComm::bIgnoreTimeouts' has a wrong offset!");
static_assert(offsetof(AITeamComm_RequestAITeamComm, TriggerDelay) == 0x00000C, "Member 'AITeamComm_RequestAITeamComm::TriggerDelay' has a wrong offset!");

// Function OrionGame.FunctionalTestCondition.GetTest
// 0x0008 (0x0008 - 0x0000)
struct FunctionalTestCondition_GetTest final
{
public:
	class APhasedFunctionalTest*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FunctionalTestCondition_GetTest) == 0x000008, "Wrong alignment on FunctionalTestCondition_GetTest");
static_assert(sizeof(FunctionalTestCondition_GetTest) == 0x000008, "Wrong size on FunctionalTestCondition_GetTest");
static_assert(offsetof(FunctionalTestCondition_GetTest, ReturnValue) == 0x000000, "Member 'FunctionalTestCondition_GetTest::ReturnValue' has a wrong offset!");

// Function OrionGame.AIInfluenceSourceComponent.K2_SetInfluenceValues
// 0x0008 (0x0008 - 0x0000)
struct AIInfluenceSourceComponent_K2_SetInfluenceValues final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InStrength;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIInfluenceSourceComponent_K2_SetInfluenceValues) == 0x000004, "Wrong alignment on AIInfluenceSourceComponent_K2_SetInfluenceValues");
static_assert(sizeof(AIInfluenceSourceComponent_K2_SetInfluenceValues) == 0x000008, "Wrong size on AIInfluenceSourceComponent_K2_SetInfluenceValues");
static_assert(offsetof(AIInfluenceSourceComponent_K2_SetInfluenceValues, Radius) == 0x000000, "Member 'AIInfluenceSourceComponent_K2_SetInfluenceValues::Radius' has a wrong offset!");
static_assert(offsetof(AIInfluenceSourceComponent_K2_SetInfluenceValues, InStrength) == 0x000004, "Member 'AIInfluenceSourceComponent_K2_SetInfluenceValues::InStrength' has a wrong offset!");

// Function OrionGame.OrionGameMode_Base.ChangeTeam
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Base_ChangeTeam final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrionTeam                                    TeamIndex;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OrionGameMode_Base_ChangeTeam) == 0x000008, "Wrong alignment on OrionGameMode_Base_ChangeTeam");
static_assert(sizeof(OrionGameMode_Base_ChangeTeam) == 0x000010, "Wrong size on OrionGameMode_Base_ChangeTeam");
static_assert(offsetof(OrionGameMode_Base_ChangeTeam, InController) == 0x000000, "Member 'OrionGameMode_Base_ChangeTeam::InController' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Base_ChangeTeam, TeamIndex) == 0x000008, "Member 'OrionGameMode_Base_ChangeTeam::TeamIndex' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Base_ChangeTeam, ReturnValue) == 0x000009, "Member 'OrionGameMode_Base_ChangeTeam::ReturnValue' has a wrong offset!");

// Function OrionGame.OrionGameMode_Base.ExecuteGameplayCue
// 0x00C8 (0x00C8 - 0x0000)
struct OrionGameMode_Base_ExecuteGameplayCue final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x00C0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Base_ExecuteGameplayCue) == 0x000008, "Wrong alignment on OrionGameMode_Base_ExecuteGameplayCue");
static_assert(sizeof(OrionGameMode_Base_ExecuteGameplayCue) == 0x0000C8, "Wrong size on OrionGameMode_Base_ExecuteGameplayCue");
static_assert(offsetof(OrionGameMode_Base_ExecuteGameplayCue, GameplayCueTag) == 0x000000, "Member 'OrionGameMode_Base_ExecuteGameplayCue::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Base_ExecuteGameplayCue, Parameters) == 0x000008, "Member 'OrionGameMode_Base_ExecuteGameplayCue::Parameters' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Base_ExecuteGameplayCue, TargetActor) == 0x0000C0, "Member 'OrionGameMode_Base_ExecuteGameplayCue::TargetActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.ForceMatchWinCondition
// 0x0001 (0x0001 - 0x0000)
struct OrionGameMode_MOBA_ForceMatchWinCondition final
{
public:
	EOrionTeam                                    TeamNum;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_ForceMatchWinCondition) == 0x000001, "Wrong alignment on OrionGameMode_MOBA_ForceMatchWinCondition");
static_assert(sizeof(OrionGameMode_MOBA_ForceMatchWinCondition) == 0x000001, "Wrong size on OrionGameMode_MOBA_ForceMatchWinCondition");
static_assert(offsetof(OrionGameMode_MOBA_ForceMatchWinCondition, TeamNum) == 0x000000, "Member 'OrionGameMode_MOBA_ForceMatchWinCondition::TeamNum' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.GetWinningTeamNum
// 0x0001 (0x0001 - 0x0000)
struct OrionGameMode_MOBA_GetWinningTeamNum final
{
public:
	EOrionTeam                                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_GetWinningTeamNum) == 0x000001, "Wrong alignment on OrionGameMode_MOBA_GetWinningTeamNum");
static_assert(sizeof(OrionGameMode_MOBA_GetWinningTeamNum) == 0x000001, "Wrong size on OrionGameMode_MOBA_GetWinningTeamNum");
static_assert(offsetof(OrionGameMode_MOBA_GetWinningTeamNum, ReturnValue) == 0x000000, "Member 'OrionGameMode_MOBA_GetWinningTeamNum::ReturnValue' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.IsMatchObjectiveCompleted
// 0x0001 (0x0001 - 0x0000)
struct OrionGameMode_MOBA_IsMatchObjectiveCompleted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_IsMatchObjectiveCompleted) == 0x000001, "Wrong alignment on OrionGameMode_MOBA_IsMatchObjectiveCompleted");
static_assert(sizeof(OrionGameMode_MOBA_IsMatchObjectiveCompleted) == 0x000001, "Wrong size on OrionGameMode_MOBA_IsMatchObjectiveCompleted");
static_assert(offsetof(OrionGameMode_MOBA_IsMatchObjectiveCompleted, ReturnValue) == 0x000000, "Member 'OrionGameMode_MOBA_IsMatchObjectiveCompleted::ReturnValue' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.ReceiveCoreKilled
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_MOBA_ReceiveCoreKilled final
{
public:
	class AController*                            Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOrionDamageableActor*                  KilledCore;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_ReceiveCoreKilled) == 0x000008, "Wrong alignment on OrionGameMode_MOBA_ReceiveCoreKilled");
static_assert(sizeof(OrionGameMode_MOBA_ReceiveCoreKilled) == 0x000010, "Wrong size on OrionGameMode_MOBA_ReceiveCoreKilled");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveCoreKilled, Killer) == 0x000000, "Member 'OrionGameMode_MOBA_ReceiveCoreKilled::Killer' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveCoreKilled, KilledCore) == 0x000008, "Member 'OrionGameMode_MOBA_ReceiveCoreKilled::KilledCore' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.ReceiveInhibitorKilled
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_MOBA_ReceiveInhibitorKilled final
{
public:
	class AController*                            Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOrionDamageableActor*                  KilledInhibitor;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_ReceiveInhibitorKilled) == 0x000008, "Wrong alignment on OrionGameMode_MOBA_ReceiveInhibitorKilled");
static_assert(sizeof(OrionGameMode_MOBA_ReceiveInhibitorKilled) == 0x000010, "Wrong size on OrionGameMode_MOBA_ReceiveInhibitorKilled");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveInhibitorKilled, Killer) == 0x000000, "Member 'OrionGameMode_MOBA_ReceiveInhibitorKilled::Killer' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveInhibitorKilled, KilledInhibitor) == 0x000008, "Member 'OrionGameMode_MOBA_ReceiveInhibitorKilled::KilledInhibitor' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.ReceiveMinionKilled
// 0x0018 (0x0018 - 0x0000)
struct OrionGameMode_MOBA_ReceiveMinionKilled final
{
public:
	class AController*                            Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            KilledMinion;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  KilledPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_ReceiveMinionKilled) == 0x000008, "Wrong alignment on OrionGameMode_MOBA_ReceiveMinionKilled");
static_assert(sizeof(OrionGameMode_MOBA_ReceiveMinionKilled) == 0x000018, "Wrong size on OrionGameMode_MOBA_ReceiveMinionKilled");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveMinionKilled, Killer) == 0x000000, "Member 'OrionGameMode_MOBA_ReceiveMinionKilled::Killer' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveMinionKilled, KilledMinion) == 0x000008, "Member 'OrionGameMode_MOBA_ReceiveMinionKilled::KilledMinion' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveMinionKilled, KilledPawn) == 0x000010, "Member 'OrionGameMode_MOBA_ReceiveMinionKilled::KilledPawn' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.ReceiveOtherStructureKilled
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_MOBA_ReceiveOtherStructureKilled final
{
public:
	class AController*                            Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOrionDamageableActor*                  KilledActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_ReceiveOtherStructureKilled) == 0x000008, "Wrong alignment on OrionGameMode_MOBA_ReceiveOtherStructureKilled");
static_assert(sizeof(OrionGameMode_MOBA_ReceiveOtherStructureKilled) == 0x000010, "Wrong size on OrionGameMode_MOBA_ReceiveOtherStructureKilled");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveOtherStructureKilled, Killer) == 0x000000, "Member 'OrionGameMode_MOBA_ReceiveOtherStructureKilled::Killer' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveOtherStructureKilled, KilledActor) == 0x000008, "Member 'OrionGameMode_MOBA_ReceiveOtherStructureKilled::KilledActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.ReceivePlayerKilled
// 0x0020 (0x0020 - 0x0000)
struct OrionGameMode_MOBA_ReceivePlayerKilled final
{
public:
	class AController*                            Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            KilledPlayer;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  KilledPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MultiKillCount;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillStreakCount;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_ReceivePlayerKilled) == 0x000008, "Wrong alignment on OrionGameMode_MOBA_ReceivePlayerKilled");
static_assert(sizeof(OrionGameMode_MOBA_ReceivePlayerKilled) == 0x000020, "Wrong size on OrionGameMode_MOBA_ReceivePlayerKilled");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerKilled, Killer) == 0x000000, "Member 'OrionGameMode_MOBA_ReceivePlayerKilled::Killer' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerKilled, KilledPlayer) == 0x000008, "Member 'OrionGameMode_MOBA_ReceivePlayerKilled::KilledPlayer' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerKilled, KilledPawn) == 0x000010, "Member 'OrionGameMode_MOBA_ReceivePlayerKilled::KilledPawn' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerKilled, MultiKillCount) == 0x000018, "Member 'OrionGameMode_MOBA_ReceivePlayerKilled::MultiKillCount' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerKilled, KillStreakCount) == 0x00001C, "Member 'OrionGameMode_MOBA_ReceivePlayerKilled::KillStreakCount' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.ReceivePlayerKillStreakShutdown
// 0x0018 (0x0018 - 0x0000)
struct OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown final
{
public:
	class AController*                            Victim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            Killer;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillStreakCount;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown) == 0x000008, "Wrong alignment on OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown");
static_assert(sizeof(OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown) == 0x000018, "Wrong size on OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown, Victim) == 0x000000, "Member 'OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown::Victim' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown, Killer) == 0x000008, "Member 'OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown::Killer' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown, KillStreakCount) == 0x000010, "Member 'OrionGameMode_MOBA_ReceivePlayerKillStreakShutdown::KillStreakCount' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.ReceivePlayerSpawned
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_MOBA_ReceivePlayerSpawned final
{
public:
	class AOrionChar*                             SpawnedChar;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrionTeam                                    Team;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OrionGameMode_MOBA_ReceivePlayerSpawned) == 0x000008, "Wrong alignment on OrionGameMode_MOBA_ReceivePlayerSpawned");
static_assert(sizeof(OrionGameMode_MOBA_ReceivePlayerSpawned) == 0x000010, "Wrong size on OrionGameMode_MOBA_ReceivePlayerSpawned");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerSpawned, SpawnedChar) == 0x000000, "Member 'OrionGameMode_MOBA_ReceivePlayerSpawned::SpawnedChar' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceivePlayerSpawned, Team) == 0x000008, "Member 'OrionGameMode_MOBA_ReceivePlayerSpawned::Team' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.ReceiveTowerKilled
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_MOBA_ReceiveTowerKilled final
{
public:
	class AController*                            Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOrionDamageableActor*                  KilledTower;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_ReceiveTowerKilled) == 0x000008, "Wrong alignment on OrionGameMode_MOBA_ReceiveTowerKilled");
static_assert(sizeof(OrionGameMode_MOBA_ReceiveTowerKilled) == 0x000010, "Wrong size on OrionGameMode_MOBA_ReceiveTowerKilled");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveTowerKilled, Killer) == 0x000000, "Member 'OrionGameMode_MOBA_ReceiveTowerKilled::Killer' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_ReceiveTowerKilled, KilledTower) == 0x000008, "Member 'OrionGameMode_MOBA_ReceiveTowerKilled::KilledTower' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.GetBotDifficulty
// 0x0002 (0x0002 - 0x0000)
struct OrionGameMode_MOBA_GetBotDifficulty final
{
public:
	EAIBotDifficulty                              EnemyBotDifficulty;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAIBotDifficulty                              FriendlyBotDifficulty;                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_GetBotDifficulty) == 0x000001, "Wrong alignment on OrionGameMode_MOBA_GetBotDifficulty");
static_assert(sizeof(OrionGameMode_MOBA_GetBotDifficulty) == 0x000002, "Wrong size on OrionGameMode_MOBA_GetBotDifficulty");
static_assert(offsetof(OrionGameMode_MOBA_GetBotDifficulty, EnemyBotDifficulty) == 0x000000, "Member 'OrionGameMode_MOBA_GetBotDifficulty::EnemyBotDifficulty' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_GetBotDifficulty, FriendlyBotDifficulty) == 0x000001, "Member 'OrionGameMode_MOBA_GetBotDifficulty::FriendlyBotDifficulty' has a wrong offset!");

// Function OrionGame.OrionGameMode_MOBA.GetBotTeams
// 0x0020 (0x0020 - 0x0000)
struct OrionGameMode_MOBA_GetBotTeams final
{
public:
	TArray<class AOrionPlayerState_Game*>         OutEnemyTeam;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AOrionPlayerState_Game*>         OutFriendlyTeam;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_MOBA_GetBotTeams) == 0x000008, "Wrong alignment on OrionGameMode_MOBA_GetBotTeams");
static_assert(sizeof(OrionGameMode_MOBA_GetBotTeams) == 0x000020, "Wrong size on OrionGameMode_MOBA_GetBotTeams");
static_assert(offsetof(OrionGameMode_MOBA_GetBotTeams, OutEnemyTeam) == 0x000000, "Member 'OrionGameMode_MOBA_GetBotTeams::OutEnemyTeam' has a wrong offset!");
static_assert(offsetof(OrionGameMode_MOBA_GetBotTeams, OutFriendlyTeam) == 0x000010, "Member 'OrionGameMode_MOBA_GetBotTeams::OutFriendlyTeam' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnEnter_FightPractice
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnEnter_FightPractice final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnEnter_FightPractice) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnEnter_FightPractice");
static_assert(sizeof(OrionGameMode_Sandbox_OnEnter_FightPractice) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnEnter_FightPractice");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_FightPractice, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnEnter_FightPractice::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_FightPractice, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnEnter_FightPractice::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnEnter_FightPractice_LineupSelect
// 0x0018 (0x0018 - 0x0000)
struct OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrionPosition                                Enemy_0;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrionPosition                                Enemy_1;                                           // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrionPosition                                Friendly;                                          // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect");
static_assert(sizeof(OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect) == 0x000018, "Wrong size on OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect::OtherActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect, Enemy_0) == 0x000010, "Member 'OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect::Enemy_0' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect, Enemy_1) == 0x000011, "Member 'OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect::Enemy_1' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect, Friendly) == 0x000012, "Member 'OrionGameMode_Sandbox_OnEnter_FightPractice_LineupSelect::Friendly' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnEnter_LastHitting
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnEnter_LastHitting final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnEnter_LastHitting) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnEnter_LastHitting");
static_assert(sizeof(OrionGameMode_Sandbox_OnEnter_LastHitting) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnEnter_LastHitting");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_LastHitting, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnEnter_LastHitting::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_LastHitting, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnEnter_LastHitting::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnEnter_LevelUp
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnEnter_LevelUp final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnEnter_LevelUp) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnEnter_LevelUp");
static_assert(sizeof(OrionGameMode_Sandbox_OnEnter_LevelUp) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnEnter_LevelUp");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_LevelUp, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnEnter_LevelUp::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_LevelUp, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnEnter_LevelUp::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnEnter_ShootingRange
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnEnter_ShootingRange final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnEnter_ShootingRange) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnEnter_ShootingRange");
static_assert(sizeof(OrionGameMode_Sandbox_OnEnter_ShootingRange) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnEnter_ShootingRange");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_ShootingRange, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnEnter_ShootingRange::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_ShootingRange, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnEnter_ShootingRange::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnEnter_TowerDefense
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnEnter_TowerDefense final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnEnter_TowerDefense) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnEnter_TowerDefense");
static_assert(sizeof(OrionGameMode_Sandbox_OnEnter_TowerDefense) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnEnter_TowerDefense");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_TowerDefense, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnEnter_TowerDefense::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnEnter_TowerDefense, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnEnter_TowerDefense::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnExit_FightPractice
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnExit_FightPractice final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnExit_FightPractice) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnExit_FightPractice");
static_assert(sizeof(OrionGameMode_Sandbox_OnExit_FightPractice) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnExit_FightPractice");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_FightPractice, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnExit_FightPractice::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_FightPractice, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnExit_FightPractice::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnExit_LastHitting
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnExit_LastHitting final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnExit_LastHitting) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnExit_LastHitting");
static_assert(sizeof(OrionGameMode_Sandbox_OnExit_LastHitting) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnExit_LastHitting");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_LastHitting, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnExit_LastHitting::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_LastHitting, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnExit_LastHitting::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnExit_LevelUp
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnExit_LevelUp final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnExit_LevelUp) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnExit_LevelUp");
static_assert(sizeof(OrionGameMode_Sandbox_OnExit_LevelUp) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnExit_LevelUp");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_LevelUp, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnExit_LevelUp::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_LevelUp, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnExit_LevelUp::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnExit_ShootingRange
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnExit_ShootingRange final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnExit_ShootingRange) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnExit_ShootingRange");
static_assert(sizeof(OrionGameMode_Sandbox_OnExit_ShootingRange) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnExit_ShootingRange");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_ShootingRange, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnExit_ShootingRange::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_ShootingRange, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnExit_ShootingRange::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnExit_TowerDefense
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnExit_TowerDefense final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnExit_TowerDefense) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnExit_TowerDefense");
static_assert(sizeof(OrionGameMode_Sandbox_OnExit_TowerDefense) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnExit_TowerDefense");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_TowerDefense, OverlappedActor) == 0x000000, "Member 'OrionGameMode_Sandbox_OnExit_TowerDefense::OverlappedActor' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnExit_TowerDefense, OtherActor) == 0x000008, "Member 'OrionGameMode_Sandbox_OnExit_TowerDefense::OtherActor' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnHeroEnterLevelUp
// 0x0008 (0x0008 - 0x0000)
struct OrionGameMode_Sandbox_OnHeroEnterLevelUp final
{
public:
	class AOrionPlayerState_Game*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnHeroEnterLevelUp) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnHeroEnterLevelUp");
static_assert(sizeof(OrionGameMode_Sandbox_OnHeroEnterLevelUp) == 0x000008, "Wrong size on OrionGameMode_Sandbox_OnHeroEnterLevelUp");
static_assert(offsetof(OrionGameMode_Sandbox_OnHeroEnterLevelUp, PlayerState) == 0x000000, "Member 'OrionGameMode_Sandbox_OnHeroEnterLevelUp::PlayerState' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.OnTowerDeath
// 0x0010 (0x0010 - 0x0000)
struct OrionGameMode_Sandbox_OnTowerDeath final
{
public:
	class AController*                            Killer;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_OnTowerDeath) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_OnTowerDeath");
static_assert(sizeof(OrionGameMode_Sandbox_OnTowerDeath) == 0x000010, "Wrong size on OrionGameMode_Sandbox_OnTowerDeath");
static_assert(offsetof(OrionGameMode_Sandbox_OnTowerDeath, Killer) == 0x000000, "Member 'OrionGameMode_Sandbox_OnTowerDeath::Killer' has a wrong offset!");
static_assert(offsetof(OrionGameMode_Sandbox_OnTowerDeath, DamageCauser) == 0x000008, "Member 'OrionGameMode_Sandbox_OnTowerDeath::DamageCauser' has a wrong offset!");

// Function OrionGame.OrionGameMode_Sandbox.InitOrionSandboxPlayerState
// 0x0008 (0x0008 - 0x0000)
struct OrionGameMode_Sandbox_InitOrionSandboxPlayerState final
{
public:
	class AOrionPlayerState_Game*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionGameMode_Sandbox_InitOrionSandboxPlayerState) == 0x000008, "Wrong alignment on OrionGameMode_Sandbox_InitOrionSandboxPlayerState");
static_assert(sizeof(OrionGameMode_Sandbox_InitOrionSandboxPlayerState) == 0x000008, "Wrong size on OrionGameMode_Sandbox_InitOrionSandboxPlayerState");
static_assert(offsetof(OrionGameMode_Sandbox_InitOrionSandboxPlayerState, PlayerState) == 0x000000, "Member 'OrionGameMode_Sandbox_InitOrionSandboxPlayerState::PlayerState' has a wrong offset!");

// Function OrionGame.OrionBaseActor.ExecuteGameplayCueLocal
// 0x00C0 (0x00C0 - 0x0000)
struct OrionBaseActor_ExecuteGameplayCueLocal final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionBaseActor_ExecuteGameplayCueLocal) == 0x000008, "Wrong alignment on OrionBaseActor_ExecuteGameplayCueLocal");
static_assert(sizeof(OrionBaseActor_ExecuteGameplayCueLocal) == 0x0000C0, "Wrong size on OrionBaseActor_ExecuteGameplayCueLocal");
static_assert(offsetof(OrionBaseActor_ExecuteGameplayCueLocal, GameplayCueTag) == 0x000000, "Member 'OrionBaseActor_ExecuteGameplayCueLocal::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(OrionBaseActor_ExecuteGameplayCueLocal, Parameters) == 0x000008, "Member 'OrionBaseActor_ExecuteGameplayCueLocal::Parameters' has a wrong offset!");

// Function OrionGame.OrionBaseActor.NotifyTeamChanged
// 0x0001 (0x0001 - 0x0000)
struct OrionBaseActor_NotifyTeamChanged final
{
public:
	EOrionTeam                                    NewTeamIdx;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionBaseActor_NotifyTeamChanged) == 0x000001, "Wrong alignment on OrionBaseActor_NotifyTeamChanged");
static_assert(sizeof(OrionBaseActor_NotifyTeamChanged) == 0x000001, "Wrong size on OrionBaseActor_NotifyTeamChanged");
static_assert(offsetof(OrionBaseActor_NotifyTeamChanged, NewTeamIdx) == 0x000000, "Member 'OrionBaseActor_NotifyTeamChanged::NewTeamIdx' has a wrong offset!");

// Function OrionGame.OrionBaseActor.OnCustomHit
// 0x0090 (0x0090 - 0x0000)
struct OrionBaseActor_OnCustomHit final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EProjectileCustomHitResponseType              ProjectileCustomHitResponseType_0;                 // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Magnitude;                                         // 0x008C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionBaseActor_OnCustomHit) == 0x000008, "Wrong alignment on OrionBaseActor_OnCustomHit");
static_assert(sizeof(OrionBaseActor_OnCustomHit) == 0x000090, "Wrong size on OrionBaseActor_OnCustomHit");
static_assert(offsetof(OrionBaseActor_OnCustomHit, Hit) == 0x000000, "Member 'OrionBaseActor_OnCustomHit::Hit' has a wrong offset!");
static_assert(offsetof(OrionBaseActor_OnCustomHit, ProjectileCustomHitResponseType_0) == 0x000088, "Member 'OrionBaseActor_OnCustomHit::ProjectileCustomHitResponseType_0' has a wrong offset!");
static_assert(offsetof(OrionBaseActor_OnCustomHit, Magnitude) == 0x00008C, "Member 'OrionBaseActor_OnCustomHit::Magnitude' has a wrong offset!");

