#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OrionUI

#include "Basic.hpp"

#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OrionUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BlueprintContext_structs.hpp"
#include "Hotfix_structs.hpp"
#include "WidgetCarousel_structs.hpp"


namespace SDK
{

// Class OrionUI.ArcadeLadderDetailsRoot
// 0x0068 (0x04B0 - 0x0448)
class UArcadeLadderDetailsRoot final : public UOrionActivatableWidget
{
public:
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionArcadeLadderSetupData*            LadderData;                                        // 0x0450(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UArcadeStageButton*>             StageButtons;                                      // 0x0458(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                         CurrentStageIndex;                                 // 0x0468(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionDefaultButton*                    Button_Play;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   PlayStageFormat;                                   // 0x0478(0x0018)(Protected, NativeAccessSpecifierProtected)
	class FText                                   DefaultPlayText;                                   // 0x0490(0x0018)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLadder(class UOrionArcadeLadderSetupData* NewLadderData);
	void SetupButtons(const int32 StartingStageIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArcadeLadderDetailsRoot">();
	}
	static class UArcadeLadderDetailsRoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArcadeLadderDetailsRoot>();
	}
};
static_assert(alignof(UArcadeLadderDetailsRoot) == 0x000008, "Wrong alignment on UArcadeLadderDetailsRoot");
static_assert(sizeof(UArcadeLadderDetailsRoot) == 0x0004B0, "Wrong size on UArcadeLadderDetailsRoot");
static_assert(offsetof(UArcadeLadderDetailsRoot, LadderData) == 0x000450, "Member 'UArcadeLadderDetailsRoot::LadderData' has a wrong offset!");
static_assert(offsetof(UArcadeLadderDetailsRoot, StageButtons) == 0x000458, "Member 'UArcadeLadderDetailsRoot::StageButtons' has a wrong offset!");
static_assert(offsetof(UArcadeLadderDetailsRoot, CurrentStageIndex) == 0x000468, "Member 'UArcadeLadderDetailsRoot::CurrentStageIndex' has a wrong offset!");
static_assert(offsetof(UArcadeLadderDetailsRoot, Button_Play) == 0x000470, "Member 'UArcadeLadderDetailsRoot::Button_Play' has a wrong offset!");
static_assert(offsetof(UArcadeLadderDetailsRoot, PlayStageFormat) == 0x000478, "Member 'UArcadeLadderDetailsRoot::PlayStageFormat' has a wrong offset!");
static_assert(offsetof(UArcadeLadderDetailsRoot, DefaultPlayText) == 0x000490, "Member 'UArcadeLadderDetailsRoot::DefaultPlayText' has a wrong offset!");

// Class OrionUI.OrionArcadeScoreboardWidget
// 0x0038 (0x0480 - 0x0448)
class UOrionArcadeScoreboardWidget final : public UOrionActivatableWidget
{
public:
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           FriendlyBox;                                       // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                           EnemyBox;                                          // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UOrionArcadeScoreboardRow>  FriendlyRowClass;                                  // 0x0460(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UOrionArcadeScoreboardRow>  EnemyRowClass;                                     // 0x0468(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UOrionArcadeScoreboardRow*>      AllRows;                                           // 0x0470(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OrionArcadeScoreboardWidget">();
	}
	static class UOrionArcadeScoreboardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOrionArcadeScoreboardWidget>();
	}
};
static_assert(alignof(UOrionArcadeScoreboardWidget) == 0x000008, "Wrong alignment on UOrionArcadeScoreboardWidget");
static_assert(sizeof(UOrionArcadeScoreboardWidget) == 0x000480, "Wrong size on UOrionArcadeScoreboardWidget");
static_assert(offsetof(UOrionArcadeScoreboardWidget, FriendlyBox) == 0x000450, "Member 'UOrionArcadeScoreboardWidget::FriendlyBox' has a wrong offset!");
static_assert(offsetof(UOrionArcadeScoreboardWidget, EnemyBox) == 0x000458, "Member 'UOrionArcadeScoreboardWidget::EnemyBox' has a wrong offset!");
static_assert(offsetof(UOrionArcadeScoreboardWidget, FriendlyRowClass) == 0x000460, "Member 'UOrionArcadeScoreboardWidget::FriendlyRowClass' has a wrong offset!");
static_assert(offsetof(UOrionArcadeScoreboardWidget, EnemyRowClass) == 0x000468, "Member 'UOrionArcadeScoreboardWidget::EnemyRowClass' has a wrong offset!");
static_assert(offsetof(UOrionArcadeScoreboardWidget, AllRows) == 0x000470, "Member 'UOrionArcadeScoreboardWidget::AllRows' has a wrong offset!");

// Class OrionUI.OrionDailyQuestTooltip
// 0x0040 (0x0370 - 0x0330)
class UOrionDailyQuestTooltip : public UOrionTooltipBase
{
public:
	uint8                                         Pad_330[0x30];                                     // 0x0330(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionTextBlock*                        Text_QuestName;                                    // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionDynamicEntryBox*                  EntryBox_Objectives;                               // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OrionDailyQuestTooltip">();
	}
	static class UOrionDailyQuestTooltip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOrionDailyQuestTooltip>();
	}
};
static_assert(alignof(UOrionDailyQuestTooltip) == 0x000008, "Wrong alignment on UOrionDailyQuestTooltip");
static_assert(sizeof(UOrionDailyQuestTooltip) == 0x000370, "Wrong size on UOrionDailyQuestTooltip");
static_assert(offsetof(UOrionDailyQuestTooltip, Text_QuestName) == 0x000360, "Member 'UOrionDailyQuestTooltip::Text_QuestName' has a wrong offset!");
static_assert(offsetof(UOrionDailyQuestTooltip, EntryBox_Objectives) == 0x000368, "Member 'UOrionDailyQuestTooltip::EntryBox_Objectives' has a wrong offset!");

// Class OrionUI.ArcadeLadderButton
// 0x0040 (0x0A20 - 0x09E0)
class UArcadeLadderButton final : public UOrionBaseButton
{
public:
	uint8                                         Pad_9E0[0x8];                                      // 0x09E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionArcadeLadderSetupData*            LadderData;                                        // 0x09E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOrionTextBlock*                        Text_LadderTitle;                                  // 0x09F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOrionTextBlock*                        Text_LadderDescription;                            // 0x09F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LadderIcon;                                        // 0x0A00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A08[0x18];                                     // 0x0A08(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateWithLadderData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArcadeLadderButton">();
	}
	static class UArcadeLadderButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArcadeLadderButton>();
	}
};
static_assert(alignof(UArcadeLadderButton) == 0x000008, "Wrong alignment on UArcadeLadderButton");
static_assert(sizeof(UArcadeLadderButton) == 0x000A20, "Wrong size on UArcadeLadderButton");
static_assert(offsetof(UArcadeLadderButton, LadderData) == 0x0009E8, "Member 'UArcadeLadderButton::LadderData' has a wrong offset!");
static_assert(offsetof(UArcadeLadderButton, Text_LadderTitle) == 0x0009F0, "Member 'UArcadeLadderButton::Text_LadderTitle' has a wrong offset!");
static_assert(offsetof(UArcadeLadderButton, Text_LadderDescription) == 0x0009F8, "Member 'UArcadeLadderButton::Text_LadderDescription' has a wrong offset!");
static_assert(offsetof(UArcadeLadderButton, LadderIcon) == 0x000A00, "Member 'UArcadeLadderButton::LadderIcon' has a wrong offset!");

// Class OrionUI.ArcadeRoot
// 0x0038 (0x0480 - 0x0448)
class UArcadeRoot final : public UOrionActivatableWidget
{
public:
	TSubclassOf<class UArcadeLadderButton>        ArcadeLadderButtonClass;                           // 0x0448(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UOrionArcadeLadderSetupData*>    LoadedLadders;                                     // 0x0450(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UOrionTileView*                         TileView_Ladders;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UOrionArcadeLadderSetupData*>    DebugLadders;                                      // 0x0468(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DynamicHandleItemSelected(class UObject* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArcadeRoot">();
	}
	static class UArcadeRoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArcadeRoot>();
	}
};
static_assert(alignof(UArcadeRoot) == 0x000008, "Wrong alignment on UArcadeRoot");
static_assert(sizeof(UArcadeRoot) == 0x000480, "Wrong size on UArcadeRoot");
static_assert(offsetof(UArcadeRoot, ArcadeLadderButtonClass) == 0x000448, "Member 'UArcadeRoot::ArcadeLadderButtonClass' has a wrong offset!");
static_assert(offsetof(UArcadeRoot, LoadedLadders) == 0x000450, "Member 'UArcadeRoot::LoadedLadders' has a wrong offset!");
static_assert(offsetof(UArcadeRoot, TileView_Ladders) == 0x000460, "Member 'UArcadeRoot::TileView_Ladders' has a wrong offset!");
static_assert(offsetof(UArcadeRoot, DebugLadders) == 0x000468, "Member 'UArcadeRoot::DebugLadders' has a wrong offset!");

// Class OrionUI.ArcadeStageButton
// 0x0090 (0x0A70 - 0x09E0)
class UArcadeStageButton final : public UOrionBaseButton
{
public:
	class UOrionArcadeLadderSetupData*            LadderData;                                        // 0x09E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         StageIndex;                                        // 0x09E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         UIIndex;                                           // 0x09EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOrionTextBlock*                        Text_StageIndex;                                   // 0x09F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOrionTextBlock*                        Text_PlaylistID;                                   // 0x09F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A00[0x70];                                     // 0x0A00(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HideButton();
	void SetStageData(class UOrionArcadeLadderSetupData* InLadderData, int32 InStageIndex);
	void UpdateWithStageData();

	int32 GetPlaylistID() const;
	int32 GetUIIndex() const;
	bool IsValidStage() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArcadeStageButton">();
	}
	static class UArcadeStageButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArcadeStageButton>();
	}
};
static_assert(alignof(UArcadeStageButton) == 0x000008, "Wrong alignment on UArcadeStageButton");
static_assert(sizeof(UArcadeStageButton) == 0x000A70, "Wrong size on UArcadeStageButton");
static_assert(offsetof(UArcadeStageButton, LadderData) == 0x0009E0, "Member 'UArcadeStageButton::LadderData' has a wrong offset!");
static_assert(offsetof(UArcadeStageButton, StageIndex) == 0x0009E8, "Member 'UArcadeStageButton::StageIndex' has a wrong offset!");
static_assert(offsetof(UArcadeStageButton, UIIndex) == 0x0009EC, "Member 'UArcadeStageButton::UIIndex' has a wrong offset!");
static_assert(offsetof(UArcadeStageButton, Text_StageIndex) == 0x0009F0, "Member 'UArcadeStageButton::Text_StageIndex' has a wrong offset!");
static_assert(offsetof(UArcadeStageButton, Text_PlaylistID) == 0x0009F8, "Member 'UArcadeStageButton::Text_PlaylistID' has a wrong offset!");

// Class OrionUI.OrionWidgetCarousel
// 0x0750 (0x0860 - 0x0110)
class UOrionWidgetCarousel final : public UPanelWidget
{
public:
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetCarouselNavigationBarStyle      NavigationStyle;                                   // 0x0120(0x0728)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_848[0x18];                                     // 0x0848(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OrionWidgetCarousel">();
	}
	static class UOrionWidgetCarousel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOrionWidgetCarousel>();
	}
};
static_assert(alignof(UOrionWidgetCarousel) == 0x000008, "Wrong alignment on UOrionWidgetCarousel");
static_assert(sizeof(UOrionWidgetCarousel) == 0x000860, "Wrong size on UOrionWidgetCarousel");
static_assert(offsetof(UOrionWidgetCarousel, NavigationStyle) == 0x000120, "Member 'UOrionWidgetCarousel::NavigationStyle' has a wrong offset!");

// Class OrionUI.Base_Group
// 0x0000 (0x0028 - 0x0028)
class UBase_Group : public UObject
{
public:
	void AddWidget(class UWidget* InWidget);
	void RemoveAll();
	void RemoveWidget(class UWidget* InWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Base_Group">();
	}
	static class UBase_Group* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBase_Group>();
	}
};
static_assert(alignof(UBase_Group) == 0x000008, "Wrong alignment on UBase_Group");
static_assert(sizeof(UBase_Group) == 0x000028, "Wrong size on UBase_Group");

// Class OrionUI.ChatWindow
// 0x0080 (0x0178 - 0x00F8)
class UChatWindow final : public UWidget
{
public:
	TDelegate<void()>                             OnChatMessageCommitted;                            // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   PromptText;                                        // 0x0108(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	TDelegate<void()>                             PromptTextDelegate;                                // 0x0120(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ChatFadeTime;                                      // 0x0130(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HideChrome;                                        // 0x0134(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ThrottleChat;                                      // 0x0135(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThrottleTicketTime;                                // 0x0138(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ThrottleTicketCount;                               // 0x013C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinimizedMessageCount;                             // 0x0140(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxChatCharacters;                                 // 0x0144(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x30];                                     // 0x0148(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText GetChatPromptText__DelegateSignature();
	void OnChatDelegate__DelegateSignature();
	void SetActive(bool bActive);
	void SetFocus(bool bWithSlash);

	bool IsActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatWindow">();
	}
	static class UChatWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatWindow>();
	}
};
static_assert(alignof(UChatWindow) == 0x000008, "Wrong alignment on UChatWindow");
static_assert(sizeof(UChatWindow) == 0x000178, "Wrong size on UChatWindow");
static_assert(offsetof(UChatWindow, OnChatMessageCommitted) == 0x0000F8, "Member 'UChatWindow::OnChatMessageCommitted' has a wrong offset!");
static_assert(offsetof(UChatWindow, PromptText) == 0x000108, "Member 'UChatWindow::PromptText' has a wrong offset!");
static_assert(offsetof(UChatWindow, PromptTextDelegate) == 0x000120, "Member 'UChatWindow::PromptTextDelegate' has a wrong offset!");
static_assert(offsetof(UChatWindow, ChatFadeTime) == 0x000130, "Member 'UChatWindow::ChatFadeTime' has a wrong offset!");
static_assert(offsetof(UChatWindow, HideChrome) == 0x000134, "Member 'UChatWindow::HideChrome' has a wrong offset!");
static_assert(offsetof(UChatWindow, ThrottleChat) == 0x000135, "Member 'UChatWindow::ThrottleChat' has a wrong offset!");
static_assert(offsetof(UChatWindow, ThrottleTicketTime) == 0x000138, "Member 'UChatWindow::ThrottleTicketTime' has a wrong offset!");
static_assert(offsetof(UChatWindow, ThrottleTicketCount) == 0x00013C, "Member 'UChatWindow::ThrottleTicketCount' has a wrong offset!");
static_assert(offsetof(UChatWindow, MinimizedMessageCount) == 0x000140, "Member 'UChatWindow::MinimizedMessageCount' has a wrong offset!");
static_assert(offsetof(UChatWindow, MaxChatCharacters) == 0x000144, "Member 'UChatWindow::MaxChatCharacters' has a wrong offset!");

// Class OrionUI.ChatWindowWidget
// 0x0010 (0x0300 - 0x02F0)
class UChatWindowWidget final : public UOrionHUDWidgetBase
{
public:
	class UChatWindow*                            MyChatWindow;                                      // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOpenChat();
	void HandleOpenChatWithSlash();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatWindowWidget">();
	}
	static class UChatWindowWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatWindowWidget>();
	}
};
static_assert(alignof(UChatWindowWidget) == 0x000008, "Wrong alignment on UChatWindowWidget");
static_assert(sizeof(UChatWindowWidget) == 0x000300, "Wrong size on UChatWindowWidget");
static_assert(offsetof(UChatWindowWidget, MyChatWindow) == 0x0002F0, "Member 'UChatWindowWidget::MyChatWindow' has a wrong offset!");

// Class OrionUI.CircularLayoutPanel
// 0x0040 (0x0150 - 0x0110)
class UCircularLayoutPanel final : public UPanelWidget
{
public:
	float                                         PhaseOffset;                                       // 0x0110(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             PhaseOffsetDelegate;                               // 0x0118(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RadiusMultiplier;                                  // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             RadiusMultiplierDelegate;                          // 0x0130(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCircularLayoutSlot* AddChildToCircularLayout(class UWidget* Content);
	void SetPhaseOffset(float InPhaseOffset);
	void SetRadiusMultiplier(float InRadiusMultiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CircularLayoutPanel">();
	}
	static class UCircularLayoutPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCircularLayoutPanel>();
	}
};
static_assert(alignof(UCircularLayoutPanel) == 0x000008, "Wrong alignment on UCircularLayoutPanel");
static_assert(sizeof(UCircularLayoutPanel) == 0x000150, "Wrong size on UCircularLayoutPanel");
static_assert(offsetof(UCircularLayoutPanel, PhaseOffset) == 0x000110, "Member 'UCircularLayoutPanel::PhaseOffset' has a wrong offset!");
static_assert(offsetof(UCircularLayoutPanel, PhaseOffsetDelegate) == 0x000118, "Member 'UCircularLayoutPanel::PhaseOffsetDelegate' has a wrong offset!");
static_assert(offsetof(UCircularLayoutPanel, RadiusMultiplier) == 0x000128, "Member 'UCircularLayoutPanel::RadiusMultiplier' has a wrong offset!");
static_assert(offsetof(UCircularLayoutPanel, RadiusMultiplierDelegate) == 0x000130, "Member 'UCircularLayoutPanel::RadiusMultiplierDelegate' has a wrong offset!");

// Class OrionUI.OrionMaterialExpressionUIColorParameter
// 0x0070 (0x00F0 - 0x0080)
class UOrionMaterialExpressionUIColorParameter final : public UMaterialExpressionCollectionParameter
{
public:
	struct FOrionUIColor                          UIColor;                                           // 0x0080(0x0070)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OrionMaterialExpressionUIColorParameter">();
	}
	static class UOrionMaterialExpressionUIColorParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOrionMaterialExpressionUIColorParameter>();
	}
};
static_assert(alignof(UOrionMaterialExpressionUIColorParameter) == 0x000010, "Wrong alignment on UOrionMaterialExpressionUIColorParameter");
static_assert(sizeof(UOrionMaterialExpressionUIColorParameter) == 0x0000F0, "Wrong size on UOrionMaterialExpressionUIColorParameter");
static_assert(offsetof(UOrionMaterialExpressionUIColorParameter, UIColor) == 0x000080, "Member 'UOrionMaterialExpressionUIColorParameter::UIColor' has a wrong offset!");

// Class OrionUI.CircularLayoutSlot
// 0x0018 (0x0050 - 0x0038)
class UCircularLayoutSlot final : public UPanelSlot
{
public:
	float                                         Proportion;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0xE];                                       // 0x0042(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetProportion(float InProportion);
	void SetRadius(float InRadius);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CircularLayoutSlot">();
	}
	static class UCircularLayoutSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCircularLayoutSlot>();
	}
};
static_assert(alignof(UCircularLayoutSlot) == 0x000008, "Wrong alignment on UCircularLayoutSlot");
static_assert(sizeof(UCircularLayoutSlot) == 0x000050, "Wrong size on UCircularLayoutSlot");
static_assert(offsetof(UCircularLayoutSlot, Proportion) == 0x000038, "Member 'UCircularLayoutSlot::Proportion' has a wrong offset!");
static_assert(offsetof(UCircularLayoutSlot, Radius) == 0x00003C, "Member 'UCircularLayoutSlot::Radius' has a wrong offset!");
static_assert(offsetof(UCircularLayoutSlot, HorizontalAlignment) == 0x000040, "Member 'UCircularLayoutSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UCircularLayoutSlot, VerticalAlignment) == 0x000041, "Member 'UCircularLayoutSlot::VerticalAlignment' has a wrong offset!");

// Class OrionUI.CountdownTimerBase
// 0x0018 (0x02D0 - 0x02B8)
class UCountdownTimerBase final : public UOrionUserWidgetBase
{
public:
	uint8                                         Pad_2B8[0x10];                                     // 0x02B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionTextBlock*                        CountdownText;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CountdownTimerBase">();
	}
	static class UCountdownTimerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCountdownTimerBase>();
	}
};
static_assert(alignof(UCountdownTimerBase) == 0x000008, "Wrong alignment on UCountdownTimerBase");
static_assert(sizeof(UCountdownTimerBase) == 0x0002D0, "Wrong size on UCountdownTimerBase");
static_assert(offsetof(UCountdownTimerBase, CountdownText) == 0x0002C8, "Member 'UCountdownTimerBase::CountdownText' has a wrong offset!");

// Class OrionUI.EventWidget
// 0x0050 (0x0160 - 0x0110)
class UEventWidget final : public UContentWidget
{
public:
	UMulticastDelegateProperty_                   MouseEnter;                                        // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   MouseLeave;                                        // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   MouseButtonDown;                                   // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   MouseButtonUp;                                     // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventWidget">();
	}
	static class UEventWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventWidget>();
	}
};
static_assert(alignof(UEventWidget) == 0x000008, "Wrong alignment on UEventWidget");
static_assert(sizeof(UEventWidget) == 0x000160, "Wrong size on UEventWidget");
static_assert(offsetof(UEventWidget, MouseEnter) == 0x000110, "Member 'UEventWidget::MouseEnter' has a wrong offset!");
static_assert(offsetof(UEventWidget, MouseLeave) == 0x000120, "Member 'UEventWidget::MouseLeave' has a wrong offset!");
static_assert(offsetof(UEventWidget, MouseButtonDown) == 0x000130, "Member 'UEventWidget::MouseButtonDown' has a wrong offset!");
static_assert(offsetof(UEventWidget, MouseButtonUp) == 0x000140, "Member 'UEventWidget::MouseButtonUp' has a wrong offset!");

// Class OrionUI.EventWidgetSlot
// 0x0028 (0x0060 - 0x0038)
class UEventWidgetSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0049(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x16];                                      // 0x004A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventWidgetSlot">();
	}
	static class UEventWidgetSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventWidgetSlot>();
	}
};
static_assert(alignof(UEventWidgetSlot) == 0x000008, "Wrong alignment on UEventWidgetSlot");
static_assert(sizeof(UEventWidgetSlot) == 0x000060, "Wrong size on UEventWidgetSlot");
static_assert(offsetof(UEventWidgetSlot, Padding) == 0x000038, "Member 'UEventWidgetSlot::Padding' has a wrong offset!");
static_assert(offsetof(UEventWidgetSlot, HorizontalAlignment) == 0x000048, "Member 'UEventWidgetSlot::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UEventWidgetSlot, VerticalAlignment) == 0x000049, "Member 'UEventWidgetSlot::VerticalAlignment' has a wrong offset!");

// Class OrionUI.PlatformSpecificWidget
// 0x0018 (0x0128 - 0x0110)
class UPlatformSpecificWidget final : public UContentWidget
{
public:
	bool                                          bCollapseOnUnsupportedPlatform;                    // 0x0110(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_111[0x17];                                     // 0x0111(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlatformSpecificWidget">();
	}
	static class UPlatformSpecificWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlatformSpecificWidget>();
	}
};
static_assert(alignof(UPlatformSpecificWidget) == 0x000008, "Wrong alignment on UPlatformSpecificWidget");
static_assert(sizeof(UPlatformSpecificWidget) == 0x000128, "Wrong size on UPlatformSpecificWidget");
static_assert(offsetof(UPlatformSpecificWidget, bCollapseOnUnsupportedPlatform) == 0x000110, "Member 'UPlatformSpecificWidget::bCollapseOnUnsupportedPlatform' has a wrong offset!");

// Class OrionUI.ExpandableArea_Group
// 0x0010 (0x0038 - 0x0028)
class UExpandableArea_Group final : public UBase_Group
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnExpansionChanged(class UExpandableArea* Area, bool bIsExpanded);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExpandableArea_Group">();
	}
	static class UExpandableArea_Group* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExpandableArea_Group>();
	}
};
static_assert(alignof(UExpandableArea_Group) == 0x000008, "Wrong alignment on UExpandableArea_Group");
static_assert(sizeof(UExpandableArea_Group) == 0x000038, "Wrong size on UExpandableArea_Group");

// Class OrionUI.FriendsList
// 0x0010 (0x0108 - 0x00F8)
class UFriendsList final : public UWidget
{
public:
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FriendsList">();
	}
	static class UFriendsList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendsList>();
	}
};
static_assert(alignof(UFriendsList) == 0x000008, "Wrong alignment on UFriendsList");
static_assert(sizeof(UFriendsList) == 0x000108, "Wrong size on UFriendsList");

// Class OrionUI.HUDAlertPresenter
// 0x0018 (0x02D0 - 0x02B8)
class UHUDAlertPresenter final : public UOrionUserWidgetBase
{
public:
	class UHUDAlertWidgetBase*                    CurrentAlert;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C0[0x10];                                     // 0x02C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDAlertPresenter">();
	}
	static class UHUDAlertPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDAlertPresenter>();
	}
};
static_assert(alignof(UHUDAlertPresenter) == 0x000008, "Wrong alignment on UHUDAlertPresenter");
static_assert(sizeof(UHUDAlertPresenter) == 0x0002D0, "Wrong size on UHUDAlertPresenter");
static_assert(offsetof(UHUDAlertPresenter, CurrentAlert) == 0x0002B8, "Member 'UHUDAlertPresenter::CurrentAlert' has a wrong offset!");

// Class OrionUI.HUDAlertWidgetBase
// 0x0018 (0x02D0 - 0x02B8)
class UHUDAlertWidgetBase final : public UOrionUserWidgetBase
{
public:
	class UHUDAlertPresenter*                     OwningPresenter;                                   // 0x02B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0[0x10];                                     // 0x02C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NotifyAlertFinished();
	void OnPlay(const class UHUDAlertAsset* InAlertToShow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDAlertWidgetBase">();
	}
	static class UHUDAlertWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDAlertWidgetBase>();
	}
};
static_assert(alignof(UHUDAlertWidgetBase) == 0x000008, "Wrong alignment on UHUDAlertWidgetBase");
static_assert(sizeof(UHUDAlertWidgetBase) == 0x0002D0, "Wrong size on UHUDAlertWidgetBase");
static_assert(offsetof(UHUDAlertWidgetBase, OwningPresenter) == 0x0002B8, "Member 'UHUDAlertWidgetBase::OwningPresenter' has a wrong offset!");

// Class OrionUI.OrionVaultScreen
// 0x0128 (0x0570 - 0x0448)
class UOrionVaultScreen final : public UOrionActivatableWidget
{
public:
	float                                         MajorRewardScale;                                  // 0x0448(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinorRewardScale;                                  // 0x044C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x98];                                     // 0x0450(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrionTextBlock*                        TextBlock_Title;                                   // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionRollingTextWidget*                RollingText_StatusText;                            // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionTextBlock*                        TextBlock_Hint;                                    // 0x04F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionTextBlock*                        TextBlock_KeyPurchaseCountdown;                    // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionDynamicEntryBox*                  EntryBox_MajorRewards;                             // 0x0508(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionDynamicEntryBox*                  EntryBox_MinorRewards;                             // 0x0510(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionDefaultButton*                    Button_Open;                                       // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionFlairPopup*                       FlairPopup_Reward;                                 // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_528[0x48];                                     // 0x0528(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FanfareCompleted();
	void HandleButtonClick();
	void OnActivated();
	void OnDeactivated();
	void OnRequestAllowBackButton();
	void OnRequestDisableBackButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OrionVaultScreen">();
	}
	static class UOrionVaultScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOrionVaultScreen>();
	}
};
static_assert(alignof(UOrionVaultScreen) == 0x000008, "Wrong alignment on UOrionVaultScreen");
static_assert(sizeof(UOrionVaultScreen) == 0x000570, "Wrong size on UOrionVaultScreen");
static_assert(offsetof(UOrionVaultScreen, MajorRewardScale) == 0x000448, "Member 'UOrionVaultScreen::MajorRewardScale' has a wrong offset!");
static_assert(offsetof(UOrionVaultScreen, MinorRewardScale) == 0x00044C, "Member 'UOrionVaultScreen::MinorRewardScale' has a wrong offset!");
static_assert(offsetof(UOrionVaultScreen, TextBlock_Title) == 0x0004E8, "Member 'UOrionVaultScreen::TextBlock_Title' has a wrong offset!");
static_assert(offsetof(UOrionVaultScreen, RollingText_StatusText) == 0x0004F0, "Member 'UOrionVaultScreen::RollingText_StatusText' has a wrong offset!");
static_assert(offsetof(UOrionVaultScreen, TextBlock_Hint) == 0x0004F8, "Member 'UOrionVaultScreen::TextBlock_Hint' has a wrong offset!");
static_assert(offsetof(UOrionVaultScreen, TextBlock_KeyPurchaseCountdown) == 0x000500, "Member 'UOrionVaultScreen::TextBlock_KeyPurchaseCountdown' has a wrong offset!");
static_assert(offsetof(UOrionVaultScreen, EntryBox_MajorRewards) == 0x000508, "Member 'UOrionVaultScreen::EntryBox_MajorRewards' has a wrong offset!");
static_assert(offsetof(UOrionVaultScreen, EntryBox_MinorRewards) == 0x000510, "Member 'UOrionVaultScreen::EntryBox_MinorRewards' has a wrong offset!");
static_assert(offsetof(UOrionVaultScreen, Button_Open) == 0x000518, "Member 'UOrionVaultScreen::Button_Open' has a wrong offset!");
static_assert(offsetof(UOrionVaultScreen, FlairPopup_Reward) == 0x000520, "Member 'UOrionVaultScreen::FlairPopup_Reward' has a wrong offset!");

// Class OrionUI.InputSwitcher
// 0x0028 (0x0120 - 0x00F8)
class UInputSwitcher final : public UWidget
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                MouseContent;                                      // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                GamepadContent;                                    // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputSwitcher">();
	}
	static class UInputSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputSwitcher>();
	}
};
static_assert(alignof(UInputSwitcher) == 0x000008, "Wrong alignment on UInputSwitcher");
static_assert(sizeof(UInputSwitcher) == 0x000120, "Wrong size on UInputSwitcher");
static_assert(offsetof(UInputSwitcher, MouseContent) == 0x000100, "Member 'UInputSwitcher::MouseContent' has a wrong offset!");
static_assert(offsetof(UInputSwitcher, GamepadContent) == 0x000108, "Member 'UInputSwitcher::GamepadContent' has a wrong offset!");

// Class OrionUI.MatchmakingSearchWidgetAnimationRoot
// 0x0020 (0x0220 - 0x0200)
class UMatchmakingSearchWidgetAnimationRoot final : public UUserWidget
{
public:
	UMulticastDelegateProperty_                   OnHoveredChanged;                                  // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_210[0x10];                                     // 0x0210(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchmakingSearchWidgetAnimationRoot">();
	}
	static class UMatchmakingSearchWidgetAnimationRoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchmakingSearchWidgetAnimationRoot>();
	}
};
static_assert(alignof(UMatchmakingSearchWidgetAnimationRoot) == 0x000008, "Wrong alignment on UMatchmakingSearchWidgetAnimationRoot");
static_assert(sizeof(UMatchmakingSearchWidgetAnimationRoot) == 0x000220, "Wrong size on UMatchmakingSearchWidgetAnimationRoot");
static_assert(offsetof(UMatchmakingSearchWidgetAnimationRoot, OnHoveredChanged) == 0x000200, "Member 'UMatchmakingSearchWidgetAnimationRoot::OnHoveredChanged' has a wrong offset!");

// Class OrionUI.OrionListView
// 0x0128 (0x0220 - 0x00F8)
class UOrionListView : public UWidget
{
public:
	uint8                                         Pad_F8[0x30];                                      // 0x00F8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ItemHeight;                                        // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                DesiredItemPadding;                                // 0x012C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                ListItemClass;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESelectionMode                                SelectionMode;                                     // 0x0148(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxItemsSelectedAtOnce;                            // 0x014C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EConsumeMouseWheel                            ConsumeMouseWheel;                                 // 0x0150(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bClearSelectionOnClick;                            // 0x0151(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumPreAllocatedEntries;                            // 0x0154(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseScissorRect;                                   // 0x0158(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_159[0x9F];                                     // 0x0159(0x009F)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        FilteredItems;                                     // 0x01F8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        AllItemsCache;                                     // 0x0208(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_218[0x8];                                      // 0x0218(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DynamicHandleItemClicked(class UUserWidget* Widget);
	void DynamicHandleItemHovered(class UUserWidget* Widget, bool bIsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OrionListView">();
	}
	static class UOrionListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOrionListView>();
	}
};
static_assert(alignof(UOrionListView) == 0x000008, "Wrong alignment on UOrionListView");
static_assert(sizeof(UOrionListView) == 0x000220, "Wrong size on UOrionListView");
static_assert(offsetof(UOrionListView, ItemHeight) == 0x000128, "Member 'UOrionListView::ItemHeight' has a wrong offset!");
static_assert(offsetof(UOrionListView, DesiredItemPadding) == 0x00012C, "Member 'UOrionListView::DesiredItemPadding' has a wrong offset!");
static_assert(offsetof(UOrionListView, ListItemClass) == 0x000140, "Member 'UOrionListView::ListItemClass' has a wrong offset!");
static_assert(offsetof(UOrionListView, SelectionMode) == 0x000148, "Member 'UOrionListView::SelectionMode' has a wrong offset!");
static_assert(offsetof(UOrionListView, MaxItemsSelectedAtOnce) == 0x00014C, "Member 'UOrionListView::MaxItemsSelectedAtOnce' has a wrong offset!");
static_assert(offsetof(UOrionListView, ConsumeMouseWheel) == 0x000150, "Member 'UOrionListView::ConsumeMouseWheel' has a wrong offset!");
static_assert(offsetof(UOrionListView, bClearSelectionOnClick) == 0x000151, "Member 'UOrionListView::bClearSelectionOnClick' has a wrong offset!");
static_assert(offsetof(UOrionListView, NumPreAllocatedEntries) == 0x000154, "Member 'UOrionListView::NumPreAllocatedEntries' has a wrong offset!");
static_assert(offsetof(UOrionListView, bUseScissorRect) == 0x000158, "Member 'UOrionListView::bUseScissorRect' has a wrong offset!");
static_assert(offsetof(UOrionListView, FilteredItems) == 0x0001F8, "Member 'UOrionListView::FilteredItems' has a wrong offset!");
static_assert(offsetof(UOrionListView, AllItemsCache) == 0x000208, "Member 'UOrionListView::AllItemsCache' has a wrong offset!");

// Class OrionUI.OrionTileView
// 0x0020 (0x0240 - 0x0220)
class UOrionTileView final : public UOrionListView
{
public:
	EItemAlignment                                ItemAlignment;                                     // 0x0220(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ItemWidth;                                         // 0x0224(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MouseWheelScrollSpeedMultiplier;                   // 0x0228(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_22C[0x14];                                     // 0x022C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OrionTileView">();
	}
	static class UOrionTileView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOrionTileView>();
	}
};
static_assert(alignof(UOrionTileView) == 0x000008, "Wrong alignment on UOrionTileView");
static_assert(sizeof(UOrionTileView) == 0x000240, "Wrong size on UOrionTileView");
static_assert(offsetof(UOrionTileView, ItemAlignment) == 0x000220, "Member 'UOrionTileView::ItemAlignment' has a wrong offset!");
static_assert(offsetof(UOrionTileView, ItemWidth) == 0x000224, "Member 'UOrionTileView::ItemWidth' has a wrong offset!");
static_assert(offsetof(UOrionTileView, MouseWheelScrollSpeedMultiplier) == 0x000228, "Member 'UOrionTileView::MouseWheelScrollSpeedMultiplier' has a wrong offset!");

// Class OrionUI.MatchmakingSearchWidget
// 0x03B8 (0x0670 - 0x02B8)
class UMatchmakingSearchWidget final : public UOrionUserWidgetBase
{
public:
	EOrionPartyMatchmakingState                   CurrentState;                                      // 0x02B8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EOrionPartyMatchmakingState                   QueuedState;                                       // 0x02B9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ReadyStateBrushes[0x3];                            // 0x02C0(0x0078)(Edit, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            PlayerSlotSearchStateBrushes[0x2];                 // 0x0428(0x0078)(Edit, NativeAccessSpecifierPrivate)
	class UMatchmakingSearchWidgetAnimationRoot*  MatchmakingAnimRoot;                               // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionTextBlock*                        SearchingTitleText;                                // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 BusyThrobber;                                      // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        ContentSwitcher;                                   // 0x0530(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        ButtonSwitcher;                                    // 0x0538(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionDefaultButton*                    CancelMatchmakingButton;                           // 0x0540(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionTextBlock*                        EstimatedTimeText;                                 // 0x0548(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOrionTextBlock*                        SearchingTimeText;                                 // 0x0550(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         PlayersCountBox;                                   // 0x0558(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UImage*>                         PlayerCountImages;                                 // 0x0560(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_570[0x10];                                     // 0x0570(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
