#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OrionUI

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OrionGame_structs.hpp"
#include "BlueprintContext_structs.hpp"
#include "McpProfileSys_structs.hpp"
#include "OrionUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Hotfix_structs.hpp"


namespace SDK::Params
{

// Function OrionUI.ArcadeLadderDetailsRoot.SetLadder
// 0x0008 (0x0008 - 0x0000)
struct ArcadeLadderDetailsRoot_SetLadder final
{
public:
	class UOrionArcadeLadderSetupData*            NewLadderData;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArcadeLadderDetailsRoot_SetLadder) == 0x000008, "Wrong alignment on ArcadeLadderDetailsRoot_SetLadder");
static_assert(sizeof(ArcadeLadderDetailsRoot_SetLadder) == 0x000008, "Wrong size on ArcadeLadderDetailsRoot_SetLadder");
static_assert(offsetof(ArcadeLadderDetailsRoot_SetLadder, NewLadderData) == 0x000000, "Member 'ArcadeLadderDetailsRoot_SetLadder::NewLadderData' has a wrong offset!");

// Function OrionUI.ArcadeLadderDetailsRoot.SetupButtons
// 0x0004 (0x0004 - 0x0000)
struct ArcadeLadderDetailsRoot_SetupButtons final
{
public:
	int32                                         StartingStageIndex;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArcadeLadderDetailsRoot_SetupButtons) == 0x000004, "Wrong alignment on ArcadeLadderDetailsRoot_SetupButtons");
static_assert(sizeof(ArcadeLadderDetailsRoot_SetupButtons) == 0x000004, "Wrong size on ArcadeLadderDetailsRoot_SetupButtons");
static_assert(offsetof(ArcadeLadderDetailsRoot_SetupButtons, StartingStageIndex) == 0x000000, "Member 'ArcadeLadderDetailsRoot_SetupButtons::StartingStageIndex' has a wrong offset!");

// Function OrionUI.ArcadeRoot.DynamicHandleItemSelected
// 0x0008 (0x0008 - 0x0000)
struct ArcadeRoot_DynamicHandleItemSelected final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArcadeRoot_DynamicHandleItemSelected) == 0x000008, "Wrong alignment on ArcadeRoot_DynamicHandleItemSelected");
static_assert(sizeof(ArcadeRoot_DynamicHandleItemSelected) == 0x000008, "Wrong size on ArcadeRoot_DynamicHandleItemSelected");
static_assert(offsetof(ArcadeRoot_DynamicHandleItemSelected, Item) == 0x000000, "Member 'ArcadeRoot_DynamicHandleItemSelected::Item' has a wrong offset!");

// Function OrionUI.ArcadeStageButton.SetStageData
// 0x0010 (0x0010 - 0x0000)
struct ArcadeStageButton_SetStageData final
{
public:
	class UOrionArcadeLadderSetupData*            InLadderData;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStageIndex;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArcadeStageButton_SetStageData) == 0x000008, "Wrong alignment on ArcadeStageButton_SetStageData");
static_assert(sizeof(ArcadeStageButton_SetStageData) == 0x000010, "Wrong size on ArcadeStageButton_SetStageData");
static_assert(offsetof(ArcadeStageButton_SetStageData, InLadderData) == 0x000000, "Member 'ArcadeStageButton_SetStageData::InLadderData' has a wrong offset!");
static_assert(offsetof(ArcadeStageButton_SetStageData, InStageIndex) == 0x000008, "Member 'ArcadeStageButton_SetStageData::InStageIndex' has a wrong offset!");

// Function OrionUI.ArcadeStageButton.GetPlaylistID
// 0x0004 (0x0004 - 0x0000)
struct ArcadeStageButton_GetPlaylistID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArcadeStageButton_GetPlaylistID) == 0x000004, "Wrong alignment on ArcadeStageButton_GetPlaylistID");
static_assert(sizeof(ArcadeStageButton_GetPlaylistID) == 0x000004, "Wrong size on ArcadeStageButton_GetPlaylistID");
static_assert(offsetof(ArcadeStageButton_GetPlaylistID, ReturnValue) == 0x000000, "Member 'ArcadeStageButton_GetPlaylistID::ReturnValue' has a wrong offset!");

// Function OrionUI.ArcadeStageButton.GetUIIndex
// 0x0004 (0x0004 - 0x0000)
struct ArcadeStageButton_GetUIIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArcadeStageButton_GetUIIndex) == 0x000004, "Wrong alignment on ArcadeStageButton_GetUIIndex");
static_assert(sizeof(ArcadeStageButton_GetUIIndex) == 0x000004, "Wrong size on ArcadeStageButton_GetUIIndex");
static_assert(offsetof(ArcadeStageButton_GetUIIndex, ReturnValue) == 0x000000, "Member 'ArcadeStageButton_GetUIIndex::ReturnValue' has a wrong offset!");

// Function OrionUI.ArcadeStageButton.IsValidStage
// 0x0001 (0x0001 - 0x0000)
struct ArcadeStageButton_IsValidStage final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArcadeStageButton_IsValidStage) == 0x000001, "Wrong alignment on ArcadeStageButton_IsValidStage");
static_assert(sizeof(ArcadeStageButton_IsValidStage) == 0x000001, "Wrong size on ArcadeStageButton_IsValidStage");
static_assert(offsetof(ArcadeStageButton_IsValidStage, ReturnValue) == 0x000000, "Member 'ArcadeStageButton_IsValidStage::ReturnValue' has a wrong offset!");

// Function OrionUI.Base_Group.AddWidget
// 0x0008 (0x0008 - 0x0000)
struct Base_Group_AddWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Base_Group_AddWidget) == 0x000008, "Wrong alignment on Base_Group_AddWidget");
static_assert(sizeof(Base_Group_AddWidget) == 0x000008, "Wrong size on Base_Group_AddWidget");
static_assert(offsetof(Base_Group_AddWidget, InWidget) == 0x000000, "Member 'Base_Group_AddWidget::InWidget' has a wrong offset!");

// Function OrionUI.Base_Group.RemoveWidget
// 0x0008 (0x0008 - 0x0000)
struct Base_Group_RemoveWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Base_Group_RemoveWidget) == 0x000008, "Wrong alignment on Base_Group_RemoveWidget");
static_assert(sizeof(Base_Group_RemoveWidget) == 0x000008, "Wrong size on Base_Group_RemoveWidget");
static_assert(offsetof(Base_Group_RemoveWidget, InWidget) == 0x000000, "Member 'Base_Group_RemoveWidget::InWidget' has a wrong offset!");

// DelegateFunction OrionUI.ChatWindow.GetChatPromptText__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct ChatWindow_GetChatPromptText__DelegateSignature final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatWindow_GetChatPromptText__DelegateSignature) == 0x000008, "Wrong alignment on ChatWindow_GetChatPromptText__DelegateSignature");
static_assert(sizeof(ChatWindow_GetChatPromptText__DelegateSignature) == 0x000018, "Wrong size on ChatWindow_GetChatPromptText__DelegateSignature");
static_assert(offsetof(ChatWindow_GetChatPromptText__DelegateSignature, ReturnValue) == 0x000000, "Member 'ChatWindow_GetChatPromptText__DelegateSignature::ReturnValue' has a wrong offset!");

// Function OrionUI.ChatWindow.SetActive
// 0x0001 (0x0001 - 0x0000)
struct ChatWindow_SetActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatWindow_SetActive) == 0x000001, "Wrong alignment on ChatWindow_SetActive");
static_assert(sizeof(ChatWindow_SetActive) == 0x000001, "Wrong size on ChatWindow_SetActive");
static_assert(offsetof(ChatWindow_SetActive, bActive) == 0x000000, "Member 'ChatWindow_SetActive::bActive' has a wrong offset!");

// Function OrionUI.ChatWindow.SetFocus
// 0x0001 (0x0001 - 0x0000)
struct ChatWindow_SetFocus final
{
public:
	bool                                          bWithSlash;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatWindow_SetFocus) == 0x000001, "Wrong alignment on ChatWindow_SetFocus");
static_assert(sizeof(ChatWindow_SetFocus) == 0x000001, "Wrong size on ChatWindow_SetFocus");
static_assert(offsetof(ChatWindow_SetFocus, bWithSlash) == 0x000000, "Member 'ChatWindow_SetFocus::bWithSlash' has a wrong offset!");

// Function OrionUI.ChatWindow.IsActive
// 0x0001 (0x0001 - 0x0000)
struct ChatWindow_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatWindow_IsActive) == 0x000001, "Wrong alignment on ChatWindow_IsActive");
static_assert(sizeof(ChatWindow_IsActive) == 0x000001, "Wrong size on ChatWindow_IsActive");
static_assert(offsetof(ChatWindow_IsActive, ReturnValue) == 0x000000, "Member 'ChatWindow_IsActive::ReturnValue' has a wrong offset!");

// Function OrionUI.CircularLayoutPanel.AddChildToCircularLayout
// 0x0010 (0x0010 - 0x0000)
struct CircularLayoutPanel_AddChildToCircularLayout final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCircularLayoutSlot*                    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CircularLayoutPanel_AddChildToCircularLayout) == 0x000008, "Wrong alignment on CircularLayoutPanel_AddChildToCircularLayout");
static_assert(sizeof(CircularLayoutPanel_AddChildToCircularLayout) == 0x000010, "Wrong size on CircularLayoutPanel_AddChildToCircularLayout");
static_assert(offsetof(CircularLayoutPanel_AddChildToCircularLayout, Content) == 0x000000, "Member 'CircularLayoutPanel_AddChildToCircularLayout::Content' has a wrong offset!");
static_assert(offsetof(CircularLayoutPanel_AddChildToCircularLayout, ReturnValue) == 0x000008, "Member 'CircularLayoutPanel_AddChildToCircularLayout::ReturnValue' has a wrong offset!");

// Function OrionUI.CircularLayoutPanel.SetPhaseOffset
// 0x0004 (0x0004 - 0x0000)
struct CircularLayoutPanel_SetPhaseOffset final
{
public:
	float                                         InPhaseOffset;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CircularLayoutPanel_SetPhaseOffset) == 0x000004, "Wrong alignment on CircularLayoutPanel_SetPhaseOffset");
static_assert(sizeof(CircularLayoutPanel_SetPhaseOffset) == 0x000004, "Wrong size on CircularLayoutPanel_SetPhaseOffset");
static_assert(offsetof(CircularLayoutPanel_SetPhaseOffset, InPhaseOffset) == 0x000000, "Member 'CircularLayoutPanel_SetPhaseOffset::InPhaseOffset' has a wrong offset!");

// Function OrionUI.CircularLayoutPanel.SetRadiusMultiplier
// 0x0004 (0x0004 - 0x0000)
struct CircularLayoutPanel_SetRadiusMultiplier final
{
public:
	float                                         InRadiusMultiplier;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CircularLayoutPanel_SetRadiusMultiplier) == 0x000004, "Wrong alignment on CircularLayoutPanel_SetRadiusMultiplier");
static_assert(sizeof(CircularLayoutPanel_SetRadiusMultiplier) == 0x000004, "Wrong size on CircularLayoutPanel_SetRadiusMultiplier");
static_assert(offsetof(CircularLayoutPanel_SetRadiusMultiplier, InRadiusMultiplier) == 0x000000, "Member 'CircularLayoutPanel_SetRadiusMultiplier::InRadiusMultiplier' has a wrong offset!");

// Function OrionUI.CircularLayoutSlot.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct CircularLayoutSlot_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CircularLayoutSlot_SetHorizontalAlignment) == 0x000001, "Wrong alignment on CircularLayoutSlot_SetHorizontalAlignment");
static_assert(sizeof(CircularLayoutSlot_SetHorizontalAlignment) == 0x000001, "Wrong size on CircularLayoutSlot_SetHorizontalAlignment");
static_assert(offsetof(CircularLayoutSlot_SetHorizontalAlignment, InHorizontalAlignment) == 0x000000, "Member 'CircularLayoutSlot_SetHorizontalAlignment::InHorizontalAlignment' has a wrong offset!");

// Function OrionUI.CircularLayoutSlot.SetProportion
// 0x0004 (0x0004 - 0x0000)
struct CircularLayoutSlot_SetProportion final
{
public:
	float                                         InProportion;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CircularLayoutSlot_SetProportion) == 0x000004, "Wrong alignment on CircularLayoutSlot_SetProportion");
static_assert(sizeof(CircularLayoutSlot_SetProportion) == 0x000004, "Wrong size on CircularLayoutSlot_SetProportion");
static_assert(offsetof(CircularLayoutSlot_SetProportion, InProportion) == 0x000000, "Member 'CircularLayoutSlot_SetProportion::InProportion' has a wrong offset!");

// Function OrionUI.CircularLayoutSlot.SetRadius
// 0x0004 (0x0004 - 0x0000)
struct CircularLayoutSlot_SetRadius final
{
public:
	float                                         InRadius;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CircularLayoutSlot_SetRadius) == 0x000004, "Wrong alignment on CircularLayoutSlot_SetRadius");
static_assert(sizeof(CircularLayoutSlot_SetRadius) == 0x000004, "Wrong size on CircularLayoutSlot_SetRadius");
static_assert(offsetof(CircularLayoutSlot_SetRadius, InRadius) == 0x000000, "Member 'CircularLayoutSlot_SetRadius::InRadius' has a wrong offset!");

// Function OrionUI.CircularLayoutSlot.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct CircularLayoutSlot_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CircularLayoutSlot_SetVerticalAlignment) == 0x000001, "Wrong alignment on CircularLayoutSlot_SetVerticalAlignment");
static_assert(sizeof(CircularLayoutSlot_SetVerticalAlignment) == 0x000001, "Wrong size on CircularLayoutSlot_SetVerticalAlignment");
static_assert(offsetof(CircularLayoutSlot_SetVerticalAlignment, InVerticalAlignment) == 0x000000, "Member 'CircularLayoutSlot_SetVerticalAlignment::InVerticalAlignment' has a wrong offset!");

// Function OrionUI.EventWidgetSlot.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct EventWidgetSlot_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EventWidgetSlot_SetHorizontalAlignment) == 0x000001, "Wrong alignment on EventWidgetSlot_SetHorizontalAlignment");
static_assert(sizeof(EventWidgetSlot_SetHorizontalAlignment) == 0x000001, "Wrong size on EventWidgetSlot_SetHorizontalAlignment");
static_assert(offsetof(EventWidgetSlot_SetHorizontalAlignment, InHorizontalAlignment) == 0x000000, "Member 'EventWidgetSlot_SetHorizontalAlignment::InHorizontalAlignment' has a wrong offset!");

// Function OrionUI.EventWidgetSlot.SetPadding
// 0x0010 (0x0010 - 0x0000)
struct EventWidgetSlot_SetPadding final
{
public:
	struct FMargin                                InPadding;                                         // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EventWidgetSlot_SetPadding) == 0x000004, "Wrong alignment on EventWidgetSlot_SetPadding");
static_assert(sizeof(EventWidgetSlot_SetPadding) == 0x000010, "Wrong size on EventWidgetSlot_SetPadding");
static_assert(offsetof(EventWidgetSlot_SetPadding, InPadding) == 0x000000, "Member 'EventWidgetSlot_SetPadding::InPadding' has a wrong offset!");

// Function OrionUI.EventWidgetSlot.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct EventWidgetSlot_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EventWidgetSlot_SetVerticalAlignment) == 0x000001, "Wrong alignment on EventWidgetSlot_SetVerticalAlignment");
static_assert(sizeof(EventWidgetSlot_SetVerticalAlignment) == 0x000001, "Wrong size on EventWidgetSlot_SetVerticalAlignment");
static_assert(offsetof(EventWidgetSlot_SetVerticalAlignment, InVerticalAlignment) == 0x000000, "Member 'EventWidgetSlot_SetVerticalAlignment::InVerticalAlignment' has a wrong offset!");

// Function OrionUI.ExpandableArea_Group.OnExpansionChanged
// 0x0010 (0x0010 - 0x0000)
struct ExpandableArea_Group_OnExpansionChanged final
{
public:
	class UExpandableArea*                        Area;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExpanded;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ExpandableArea_Group_OnExpansionChanged) == 0x000008, "Wrong alignment on ExpandableArea_Group_OnExpansionChanged");
static_assert(sizeof(ExpandableArea_Group_OnExpansionChanged) == 0x000010, "Wrong size on ExpandableArea_Group_OnExpansionChanged");
static_assert(offsetof(ExpandableArea_Group_OnExpansionChanged, Area) == 0x000000, "Member 'ExpandableArea_Group_OnExpansionChanged::Area' has a wrong offset!");
static_assert(offsetof(ExpandableArea_Group_OnExpansionChanged, bIsExpanded) == 0x000008, "Member 'ExpandableArea_Group_OnExpansionChanged::bIsExpanded' has a wrong offset!");

// Function OrionUI.HUDAlertWidgetBase.OnPlay
// 0x0008 (0x0008 - 0x0000)
struct HUDAlertWidgetBase_OnPlay final
{
public:
	const class UHUDAlertAsset*                   InAlertToShow;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HUDAlertWidgetBase_OnPlay) == 0x000008, "Wrong alignment on HUDAlertWidgetBase_OnPlay");
static_assert(sizeof(HUDAlertWidgetBase_OnPlay) == 0x000008, "Wrong size on HUDAlertWidgetBase_OnPlay");
static_assert(offsetof(HUDAlertWidgetBase_OnPlay, InAlertToShow) == 0x000000, "Member 'HUDAlertWidgetBase_OnPlay::InAlertToShow' has a wrong offset!");

// Function OrionUI.OrionListView.DynamicHandleItemClicked
// 0x0008 (0x0008 - 0x0000)
struct OrionListView_DynamicHandleItemClicked final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionListView_DynamicHandleItemClicked) == 0x000008, "Wrong alignment on OrionListView_DynamicHandleItemClicked");
static_assert(sizeof(OrionListView_DynamicHandleItemClicked) == 0x000008, "Wrong size on OrionListView_DynamicHandleItemClicked");
static_assert(offsetof(OrionListView_DynamicHandleItemClicked, Widget) == 0x000000, "Member 'OrionListView_DynamicHandleItemClicked::Widget' has a wrong offset!");

// Function OrionUI.OrionListView.DynamicHandleItemHovered
// 0x0010 (0x0010 - 0x0000)
struct OrionListView_DynamicHandleItemHovered final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHovered;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OrionListView_DynamicHandleItemHovered) == 0x000008, "Wrong alignment on OrionListView_DynamicHandleItemHovered");
static_assert(sizeof(OrionListView_DynamicHandleItemHovered) == 0x000010, "Wrong size on OrionListView_DynamicHandleItemHovered");
static_assert(offsetof(OrionListView_DynamicHandleItemHovered, Widget) == 0x000000, "Member 'OrionListView_DynamicHandleItemHovered::Widget' has a wrong offset!");
static_assert(offsetof(OrionListView_DynamicHandleItemHovered, bIsHovered) == 0x000008, "Member 'OrionListView_DynamicHandleItemHovered::bIsHovered' has a wrong offset!");

// Function OrionUI.MatchmakingSearchWidget.OnFrontEndTabChanged
// 0x0008 (0x0008 - 0x0000)
struct MatchmakingSearchWidget_OnFrontEndTabChanged final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchmakingSearchWidget_OnFrontEndTabChanged) == 0x000004, "Wrong alignment on MatchmakingSearchWidget_OnFrontEndTabChanged");
static_assert(sizeof(MatchmakingSearchWidget_OnFrontEndTabChanged) == 0x000008, "Wrong size on MatchmakingSearchWidget_OnFrontEndTabChanged");
static_assert(offsetof(MatchmakingSearchWidget_OnFrontEndTabChanged, TabId) == 0x000000, "Member 'MatchmakingSearchWidget_OnFrontEndTabChanged::TabId' has a wrong offset!");

// Function OrionUI.MatchmakingSearchWidget.OnHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct MatchmakingSearchWidget_OnHoveredChanged final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchmakingSearchWidget_OnHoveredChanged) == 0x000001, "Wrong alignment on MatchmakingSearchWidget_OnHoveredChanged");
static_assert(sizeof(MatchmakingSearchWidget_OnHoveredChanged) == 0x000001, "Wrong size on MatchmakingSearchWidget_OnHoveredChanged");
static_assert(offsetof(MatchmakingSearchWidget_OnHoveredChanged, bIsHovered) == 0x000000, "Member 'MatchmakingSearchWidget_OnHoveredChanged::bIsHovered' has a wrong offset!");

// Function OrionUI.OrionTimerWidget.StartTimer
// 0x0004 (0x0004 - 0x0000)
struct OrionTimerWidget_StartTimer final
{
public:
	float                                         Seconds;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionTimerWidget_StartTimer) == 0x000004, "Wrong alignment on OrionTimerWidget_StartTimer");
static_assert(sizeof(OrionTimerWidget_StartTimer) == 0x000004, "Wrong size on OrionTimerWidget_StartTimer");
static_assert(offsetof(OrionTimerWidget_StartTimer, Seconds) == 0x000000, "Member 'OrionTimerWidget_StartTimer::Seconds' has a wrong offset!");

// Function OrionUI.OrionAbilityAmmoTimer.OnTimerEnded
// 0x0008 (0x0008 - 0x0000)
struct OrionAbilityAmmoTimer_OnTimerEnded final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalDuration;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityAmmoTimer_OnTimerEnded) == 0x000004, "Wrong alignment on OrionAbilityAmmoTimer_OnTimerEnded");
static_assert(sizeof(OrionAbilityAmmoTimer_OnTimerEnded) == 0x000008, "Wrong size on OrionAbilityAmmoTimer_OnTimerEnded");
static_assert(offsetof(OrionAbilityAmmoTimer_OnTimerEnded, TimeRemaining) == 0x000000, "Member 'OrionAbilityAmmoTimer_OnTimerEnded::TimeRemaining' has a wrong offset!");
static_assert(offsetof(OrionAbilityAmmoTimer_OnTimerEnded, TotalDuration) == 0x000004, "Member 'OrionAbilityAmmoTimer_OnTimerEnded::TotalDuration' has a wrong offset!");

// Function OrionUI.OrionAbilityAmmoTimer.OnTimerStarted
// 0x0008 (0x0008 - 0x0000)
struct OrionAbilityAmmoTimer_OnTimerStarted final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalDuration;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityAmmoTimer_OnTimerStarted) == 0x000004, "Wrong alignment on OrionAbilityAmmoTimer_OnTimerStarted");
static_assert(sizeof(OrionAbilityAmmoTimer_OnTimerStarted) == 0x000008, "Wrong size on OrionAbilityAmmoTimer_OnTimerStarted");
static_assert(offsetof(OrionAbilityAmmoTimer_OnTimerStarted, TimeRemaining) == 0x000000, "Member 'OrionAbilityAmmoTimer_OnTimerStarted::TimeRemaining' has a wrong offset!");
static_assert(offsetof(OrionAbilityAmmoTimer_OnTimerStarted, TotalDuration) == 0x000004, "Member 'OrionAbilityAmmoTimer_OnTimerStarted::TotalDuration' has a wrong offset!");

// Function OrionUI.OrionAbilityConfirmWidget.HideConfirmWidget
// 0x0001 (0x0001 - 0x0000)
struct OrionAbilityConfirmWidget_HideConfirmWidget final
{
public:
	bool                                          bImmediate;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityConfirmWidget_HideConfirmWidget) == 0x000001, "Wrong alignment on OrionAbilityConfirmWidget_HideConfirmWidget");
static_assert(sizeof(OrionAbilityConfirmWidget_HideConfirmWidget) == 0x000001, "Wrong size on OrionAbilityConfirmWidget_HideConfirmWidget");
static_assert(offsetof(OrionAbilityConfirmWidget_HideConfirmWidget, bImmediate) == 0x000000, "Member 'OrionAbilityConfirmWidget_HideConfirmWidget::bImmediate' has a wrong offset!");

// Function OrionUI.OrionAbilityConfirmWidget.ShowConfirmWidget
// 0x0001 (0x0001 - 0x0000)
struct OrionAbilityConfirmWidget_ShowConfirmWidget final
{
public:
	bool                                          bAllowConfirm;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityConfirmWidget_ShowConfirmWidget) == 0x000001, "Wrong alignment on OrionAbilityConfirmWidget_ShowConfirmWidget");
static_assert(sizeof(OrionAbilityConfirmWidget_ShowConfirmWidget) == 0x000001, "Wrong size on OrionAbilityConfirmWidget_ShowConfirmWidget");
static_assert(offsetof(OrionAbilityConfirmWidget_ShowConfirmWidget, bAllowConfirm) == 0x000000, "Member 'OrionAbilityConfirmWidget_ShowConfirmWidget::bAllowConfirm' has a wrong offset!");

// Function OrionUI.OrionXPWidget.SetPrimaryColor
// 0x0010 (0x0010 - 0x0000)
struct OrionXPWidget_SetPrimaryColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionXPWidget_SetPrimaryColor) == 0x000004, "Wrong alignment on OrionXPWidget_SetPrimaryColor");
static_assert(sizeof(OrionXPWidget_SetPrimaryColor) == 0x000010, "Wrong size on OrionXPWidget_SetPrimaryColor");
static_assert(offsetof(OrionXPWidget_SetPrimaryColor, InColor) == 0x000000, "Member 'OrionXPWidget_SetPrimaryColor::InColor' has a wrong offset!");

// Function OrionUI.OrionAbilityLayoutWidget.OnSpectatorWatchedHeroChange
// 0x0008 (0x0008 - 0x0000)
struct OrionAbilityLayoutWidget_OnSpectatorWatchedHeroChange final
{
public:
	EOrionTeam                                    HeroTeam;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HeroIndex;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityLayoutWidget_OnSpectatorWatchedHeroChange) == 0x000004, "Wrong alignment on OrionAbilityLayoutWidget_OnSpectatorWatchedHeroChange");
static_assert(sizeof(OrionAbilityLayoutWidget_OnSpectatorWatchedHeroChange) == 0x000008, "Wrong size on OrionAbilityLayoutWidget_OnSpectatorWatchedHeroChange");
static_assert(offsetof(OrionAbilityLayoutWidget_OnSpectatorWatchedHeroChange, HeroTeam) == 0x000000, "Member 'OrionAbilityLayoutWidget_OnSpectatorWatchedHeroChange::HeroTeam' has a wrong offset!");
static_assert(offsetof(OrionAbilityLayoutWidget_OnSpectatorWatchedHeroChange, HeroIndex) == 0x000004, "Member 'OrionAbilityLayoutWidget_OnSpectatorWatchedHeroChange::HeroIndex' has a wrong offset!");

// Function OrionUI.OrionAbilityPipsWidget.OnNumFilledPipsChanged
// 0x0004 (0x0004 - 0x0000)
struct OrionAbilityPipsWidget_OnNumFilledPipsChanged final
{
public:
	int32                                         NumFilledPips;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityPipsWidget_OnNumFilledPipsChanged) == 0x000004, "Wrong alignment on OrionAbilityPipsWidget_OnNumFilledPipsChanged");
static_assert(sizeof(OrionAbilityPipsWidget_OnNumFilledPipsChanged) == 0x000004, "Wrong size on OrionAbilityPipsWidget_OnNumFilledPipsChanged");
static_assert(offsetof(OrionAbilityPipsWidget_OnNumFilledPipsChanged, NumFilledPips) == 0x000000, "Member 'OrionAbilityPipsWidget_OnNumFilledPipsChanged::NumFilledPips' has a wrong offset!");

// Function OrionUI.OrionAbilityPipsWidget.OnPipDisplayTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct OrionAbilityPipsWidget_OnPipDisplayTypeChanged final
{
public:
	EAbilityPipDisplayType                        DisplayType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityPipsWidget_OnPipDisplayTypeChanged) == 0x000001, "Wrong alignment on OrionAbilityPipsWidget_OnPipDisplayTypeChanged");
static_assert(sizeof(OrionAbilityPipsWidget_OnPipDisplayTypeChanged) == 0x000001, "Wrong size on OrionAbilityPipsWidget_OnPipDisplayTypeChanged");
static_assert(offsetof(OrionAbilityPipsWidget_OnPipDisplayTypeChanged, DisplayType) == 0x000000, "Member 'OrionAbilityPipsWidget_OnPipDisplayTypeChanged::DisplayType' has a wrong offset!");

// Function OrionUI.OrionAbilityPipsWidget.GetCorrectMIDValue
// 0x0008 (0x0008 - 0x0000)
struct OrionAbilityPipsWidget_GetCorrectMIDValue final
{
public:
	int32                                         InNumOfPips;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityPipsWidget_GetCorrectMIDValue) == 0x000004, "Wrong alignment on OrionAbilityPipsWidget_GetCorrectMIDValue");
static_assert(sizeof(OrionAbilityPipsWidget_GetCorrectMIDValue) == 0x000008, "Wrong size on OrionAbilityPipsWidget_GetCorrectMIDValue");
static_assert(offsetof(OrionAbilityPipsWidget_GetCorrectMIDValue, InNumOfPips) == 0x000000, "Member 'OrionAbilityPipsWidget_GetCorrectMIDValue::InNumOfPips' has a wrong offset!");
static_assert(offsetof(OrionAbilityPipsWidget_GetCorrectMIDValue, ReturnValue) == 0x000004, "Member 'OrionAbilityPipsWidget_GetCorrectMIDValue::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionURLs.GetURLs
// 0x0008 (0x0008 - 0x0000)
struct OrionURLs_GetURLs final
{
public:
	class UOrionURLs*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionURLs_GetURLs) == 0x000008, "Wrong alignment on OrionURLs_GetURLs");
static_assert(sizeof(OrionURLs_GetURLs) == 0x000008, "Wrong size on OrionURLs_GetURLs");
static_assert(offsetof(OrionURLs_GetURLs, ReturnValue) == 0x000000, "Member 'OrionURLs_GetURLs::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionURLs.GetCustomerServiceURLInLanguage
// 0x0030 (0x0030 - 0x0000)
struct OrionURLs_GetCustomerServiceURLInLanguage final
{
public:
	class FString                                 LanguageCode;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CountryCode;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionURLs_GetCustomerServiceURLInLanguage) == 0x000008, "Wrong alignment on OrionURLs_GetCustomerServiceURLInLanguage");
static_assert(sizeof(OrionURLs_GetCustomerServiceURLInLanguage) == 0x000030, "Wrong size on OrionURLs_GetCustomerServiceURLInLanguage");
static_assert(offsetof(OrionURLs_GetCustomerServiceURLInLanguage, LanguageCode) == 0x000000, "Member 'OrionURLs_GetCustomerServiceURLInLanguage::LanguageCode' has a wrong offset!");
static_assert(offsetof(OrionURLs_GetCustomerServiceURLInLanguage, CountryCode) == 0x000010, "Member 'OrionURLs_GetCustomerServiceURLInLanguage::CountryCode' has a wrong offset!");
static_assert(offsetof(OrionURLs_GetCustomerServiceURLInLanguage, ReturnValue) == 0x000020, "Member 'OrionURLs_GetCustomerServiceURLInLanguage::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionVideoPlayerWidget.DynamicHandleOnMediaOpened
// 0x0010 (0x0010 - 0x0000)
struct OrionVideoPlayerWidget_DynamicHandleOnMediaOpened final
{
public:
	class FString                                 OpenedUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionVideoPlayerWidget_DynamicHandleOnMediaOpened) == 0x000008, "Wrong alignment on OrionVideoPlayerWidget_DynamicHandleOnMediaOpened");
static_assert(sizeof(OrionVideoPlayerWidget_DynamicHandleOnMediaOpened) == 0x000010, "Wrong size on OrionVideoPlayerWidget_DynamicHandleOnMediaOpened");
static_assert(offsetof(OrionVideoPlayerWidget_DynamicHandleOnMediaOpened, OpenedUrl) == 0x000000, "Member 'OrionVideoPlayerWidget_DynamicHandleOnMediaOpened::OpenedUrl' has a wrong offset!");

// Function OrionUI.OrionVideoPlayerWidget.DynamicHandleOnOpenMediaFailed
// 0x0010 (0x0010 - 0x0000)
struct OrionVideoPlayerWidget_DynamicHandleOnOpenMediaFailed final
{
public:
	class FString                                 FailedUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionVideoPlayerWidget_DynamicHandleOnOpenMediaFailed) == 0x000008, "Wrong alignment on OrionVideoPlayerWidget_DynamicHandleOnOpenMediaFailed");
static_assert(sizeof(OrionVideoPlayerWidget_DynamicHandleOnOpenMediaFailed) == 0x000010, "Wrong size on OrionVideoPlayerWidget_DynamicHandleOnOpenMediaFailed");
static_assert(offsetof(OrionVideoPlayerWidget_DynamicHandleOnOpenMediaFailed, FailedUrl) == 0x000000, "Member 'OrionVideoPlayerWidget_DynamicHandleOnOpenMediaFailed::FailedUrl' has a wrong offset!");

// Function OrionUI.OrionVideoPlayerWidget.DynamicHandleVideoMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown) == 0x000008, "Wrong alignment on OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown");
static_assert(sizeof(OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown) == 0x000160, "Wrong size on OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown");
static_assert(offsetof(OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown, Geometry) == 0x000000, "Member 'OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown::Geometry' has a wrong offset!");
static_assert(offsetof(OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown, MouseEvent) == 0x000038, "Member 'OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'OrionVideoPlayerWidget_DynamicHandleVideoMouseButtonDown::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionVideoPlayerWidget.LoadFromVideoID
// 0x0010 (0x0010 - 0x0000)
struct OrionVideoPlayerWidget_LoadFromVideoID final
{
public:
	class FName                                   VideoID;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OrionVideoPlayerWidget_LoadFromVideoID) == 0x000004, "Wrong alignment on OrionVideoPlayerWidget_LoadFromVideoID");
static_assert(sizeof(OrionVideoPlayerWidget_LoadFromVideoID) == 0x000010, "Wrong size on OrionVideoPlayerWidget_LoadFromVideoID");
static_assert(offsetof(OrionVideoPlayerWidget_LoadFromVideoID, VideoID) == 0x000000, "Member 'OrionVideoPlayerWidget_LoadFromVideoID::VideoID' has a wrong offset!");
static_assert(offsetof(OrionVideoPlayerWidget_LoadFromVideoID, ReturnValue) == 0x000008, "Member 'OrionVideoPlayerWidget_LoadFromVideoID::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionVideoPlayerWidget.OnVideoTitlesCreated
// 0x0008 (0x0008 - 0x0000)
struct OrionVideoPlayerWidget_OnVideoTitlesCreated final
{
public:
	class UOrionVideoTitles*                      VideoTitlesWidget;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionVideoPlayerWidget_OnVideoTitlesCreated) == 0x000008, "Wrong alignment on OrionVideoPlayerWidget_OnVideoTitlesCreated");
static_assert(sizeof(OrionVideoPlayerWidget_OnVideoTitlesCreated) == 0x000008, "Wrong size on OrionVideoPlayerWidget_OnVideoTitlesCreated");
static_assert(offsetof(OrionVideoPlayerWidget_OnVideoTitlesCreated, VideoTitlesWidget) == 0x000000, "Member 'OrionVideoPlayerWidget_OnVideoTitlesCreated::VideoTitlesWidget' has a wrong offset!");

// Function OrionUI.OrionVideoPlayerWidget.Start
// 0x0001 (0x0001 - 0x0000)
struct OrionVideoPlayerWidget_Start final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionVideoPlayerWidget_Start) == 0x000001, "Wrong alignment on OrionVideoPlayerWidget_Start");
static_assert(sizeof(OrionVideoPlayerWidget_Start) == 0x000001, "Wrong size on OrionVideoPlayerWidget_Start");
static_assert(offsetof(OrionVideoPlayerWidget_Start, ReturnValue) == 0x000000, "Member 'OrionVideoPlayerWidget_Start::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionVideoPlayerWidget.StreamFromVideoURL
// 0x0018 (0x0018 - 0x0000)
struct OrionVideoPlayerWidget_StreamFromVideoURL final
{
public:
	class FString                                 VideoURL;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OrionVideoPlayerWidget_StreamFromVideoURL) == 0x000008, "Wrong alignment on OrionVideoPlayerWidget_StreamFromVideoURL");
static_assert(sizeof(OrionVideoPlayerWidget_StreamFromVideoURL) == 0x000018, "Wrong size on OrionVideoPlayerWidget_StreamFromVideoURL");
static_assert(offsetof(OrionVideoPlayerWidget_StreamFromVideoURL, VideoURL) == 0x000000, "Member 'OrionVideoPlayerWidget_StreamFromVideoURL::VideoURL' has a wrong offset!");
static_assert(offsetof(OrionVideoPlayerWidget_StreamFromVideoURL, ReturnValue) == 0x000010, "Member 'OrionVideoPlayerWidget_StreamFromVideoURL::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionVideoPlayerWidget.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct OrionVideoPlayerWidget_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionVideoPlayerWidget_IsPlaying) == 0x000001, "Wrong alignment on OrionVideoPlayerWidget_IsPlaying");
static_assert(sizeof(OrionVideoPlayerWidget_IsPlaying) == 0x000001, "Wrong size on OrionVideoPlayerWidget_IsPlaying");
static_assert(offsetof(OrionVideoPlayerWidget_IsPlaying, ReturnValue) == 0x000000, "Member 'OrionVideoPlayerWidget_IsPlaying::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionVideoPlayerWidget.IsRunning
// 0x0001 (0x0001 - 0x0000)
struct OrionVideoPlayerWidget_IsRunning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionVideoPlayerWidget_IsRunning) == 0x000001, "Wrong alignment on OrionVideoPlayerWidget_IsRunning");
static_assert(sizeof(OrionVideoPlayerWidget_IsRunning) == 0x000001, "Wrong size on OrionVideoPlayerWidget_IsRunning");
static_assert(offsetof(OrionVideoPlayerWidget_IsRunning, ReturnValue) == 0x000000, "Member 'OrionVideoPlayerWidget_IsRunning::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionAbilityUpgradeRowWidget.GetInputID
// 0x0001 (0x0001 - 0x0000)
struct OrionAbilityUpgradeRowWidget_GetInputID final
{
public:
	EOrionAbilityBinding                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityUpgradeRowWidget_GetInputID) == 0x000001, "Wrong alignment on OrionAbilityUpgradeRowWidget_GetInputID");
static_assert(sizeof(OrionAbilityUpgradeRowWidget_GetInputID) == 0x000001, "Wrong size on OrionAbilityUpgradeRowWidget_GetInputID");
static_assert(offsetof(OrionAbilityUpgradeRowWidget_GetInputID, ReturnValue) == 0x000000, "Member 'OrionAbilityUpgradeRowWidget_GetInputID::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionMiscAbilityWidget.ShowAbilityWidget
// 0x0001 (0x0001 - 0x0000)
struct OrionMiscAbilityWidget_ShowAbilityWidget final
{
public:
	bool                                          bImmediate;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionMiscAbilityWidget_ShowAbilityWidget) == 0x000001, "Wrong alignment on OrionMiscAbilityWidget_ShowAbilityWidget");
static_assert(sizeof(OrionMiscAbilityWidget_ShowAbilityWidget) == 0x000001, "Wrong size on OrionMiscAbilityWidget_ShowAbilityWidget");
static_assert(offsetof(OrionMiscAbilityWidget_ShowAbilityWidget, bImmediate) == 0x000000, "Member 'OrionMiscAbilityWidget_ShowAbilityWidget::bImmediate' has a wrong offset!");

// Function OrionUI.OrionAbilityWidget.OnAbilityLevelUp
// 0x0010 (0x0010 - 0x0000)
struct OrionAbilityWidget_OnAbilityLevelUp final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldLevel;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LevelMax;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanStillUpgrade;                                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OrionAbilityWidget_OnAbilityLevelUp) == 0x000004, "Wrong alignment on OrionAbilityWidget_OnAbilityLevelUp");
static_assert(sizeof(OrionAbilityWidget_OnAbilityLevelUp) == 0x000010, "Wrong size on OrionAbilityWidget_OnAbilityLevelUp");
static_assert(offsetof(OrionAbilityWidget_OnAbilityLevelUp, NewLevel) == 0x000000, "Member 'OrionAbilityWidget_OnAbilityLevelUp::NewLevel' has a wrong offset!");
static_assert(offsetof(OrionAbilityWidget_OnAbilityLevelUp, OldLevel) == 0x000004, "Member 'OrionAbilityWidget_OnAbilityLevelUp::OldLevel' has a wrong offset!");
static_assert(offsetof(OrionAbilityWidget_OnAbilityLevelUp, LevelMax) == 0x000008, "Member 'OrionAbilityWidget_OnAbilityLevelUp::LevelMax' has a wrong offset!");
static_assert(offsetof(OrionAbilityWidget_OnAbilityLevelUp, bCanStillUpgrade) == 0x00000C, "Member 'OrionAbilityWidget_OnAbilityLevelUp::bCanStillUpgrade' has a wrong offset!");

// Function OrionUI.OrionAbilityWidget.ShowUpgrades
// 0x0008 (0x0008 - 0x0000)
struct OrionAbilityWidget_ShowUpgrades final
{
public:
	int32                                         CurrentLevel;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxLevel;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityWidget_ShowUpgrades) == 0x000004, "Wrong alignment on OrionAbilityWidget_ShowUpgrades");
static_assert(sizeof(OrionAbilityWidget_ShowUpgrades) == 0x000008, "Wrong size on OrionAbilityWidget_ShowUpgrades");
static_assert(offsetof(OrionAbilityWidget_ShowUpgrades, CurrentLevel) == 0x000000, "Member 'OrionAbilityWidget_ShowUpgrades::CurrentLevel' has a wrong offset!");
static_assert(offsetof(OrionAbilityWidget_ShowUpgrades, MaxLevel) == 0x000004, "Member 'OrionAbilityWidget_ShowUpgrades::MaxLevel' has a wrong offset!");

// Function OrionUI.OrionAbilityWidget.StartCooldown
// 0x0001 (0x0001 - 0x0000)
struct OrionAbilityWidget_StartCooldown final
{
public:
	bool                                          bIsSpecial;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionAbilityWidget_StartCooldown) == 0x000001, "Wrong alignment on OrionAbilityWidget_StartCooldown");
static_assert(sizeof(OrionAbilityWidget_StartCooldown) == 0x000001, "Wrong size on OrionAbilityWidget_StartCooldown");
static_assert(offsetof(OrionAbilityWidget_StartCooldown, bIsSpecial) == 0x000000, "Member 'OrionAbilityWidget_StartCooldown::bIsSpecial' has a wrong offset!");

// Function OrionUI.OrionArcadeHeroBuff.ShowWidget
// 0x0008 (0x0008 - 0x0000)
struct OrionArcadeHeroBuff_ShowWidget final
{
public:
	TSubclassOf<class UGameplayEffect>            InGameplayEffect;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionArcadeHeroBuff_ShowWidget) == 0x000008, "Wrong alignment on OrionArcadeHeroBuff_ShowWidget");
static_assert(sizeof(OrionArcadeHeroBuff_ShowWidget) == 0x000008, "Wrong size on OrionArcadeHeroBuff_ShowWidget");
static_assert(offsetof(OrionArcadeHeroBuff_ShowWidget, InGameplayEffect) == 0x000000, "Member 'OrionArcadeHeroBuff_ShowWidget::InGameplayEffect' has a wrong offset!");

// Function OrionUI.ArcadeHandCard.GetHandIndex
// 0x0004 (0x0004 - 0x0000)
struct ArcadeHandCard_GetHandIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArcadeHandCard_GetHandIndex) == 0x000004, "Wrong alignment on ArcadeHandCard_GetHandIndex");
static_assert(sizeof(ArcadeHandCard_GetHandIndex) == 0x000004, "Wrong size on ArcadeHandCard_GetHandIndex");
static_assert(offsetof(ArcadeHandCard_GetHandIndex, ReturnValue) == 0x000000, "Member 'ArcadeHandCard_GetHandIndex::ReturnValue' has a wrong offset!");

// Function OrionUI.OrionArcadeCardSelection.OnCardSelected
// 0x0008 (0x0008 - 0x0000)
struct OrionArcadeCardSelection_OnCardSelected final
{
public:
	class UArcadeHandCard*                        HandCardWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionArcadeCardSelection_OnCardSelected) == 0x000008, "Wrong alignment on OrionArcadeCardSelection_OnCardSelected");
static_assert(sizeof(OrionArcadeCardSelection_OnCardSelected) == 0x000008, "Wrong size on OrionArcadeCardSelection_OnCardSelected");
static_assert(offsetof(OrionArcadeCardSelection_OnCardSelected, HandCardWidget) == 0x000000, "Member 'OrionArcadeCardSelection_OnCardSelected::HandCardWidget' has a wrong offset!");

// Function OrionUI.OrionScoreboardPlayerRow.OnIsFrozenChanged
// 0x0001 (0x0001 - 0x0000)
struct OrionScoreboardPlayerRow_OnIsFrozenChanged final
{
public:
	bool                                          bIsFrozen;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionScoreboardPlayerRow_OnIsFrozenChanged) == 0x000001, "Wrong alignment on OrionScoreboardPlayerRow_OnIsFrozenChanged");
static_assert(sizeof(OrionScoreboardPlayerRow_OnIsFrozenChanged) == 0x000001, "Wrong size on OrionScoreboardPlayerRow_OnIsFrozenChanged");
static_assert(offsetof(OrionScoreboardPlayerRow_OnIsFrozenChanged, bIsFrozen) == 0x000000, "Member 'OrionScoreboardPlayerRow_OnIsFrozenChanged::bIsFrozen' has a wrong offset!");

// Function OrionUI.OrionScoreboardPlayerRow.OnPlayerInfoSet
// 0x0001 (0x0001 - 0x0000)
struct OrionScoreboardPlayerRow_OnPlayerInfoSet final
{
public:
	bool                                          bIsLocalPlayer;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionScoreboardPlayerRow_OnPlayerInfoSet) == 0x000001, "Wrong alignment on OrionScoreboardPlayerRow_OnPlayerInfoSet");
static_assert(sizeof(OrionScoreboardPlayerRow_OnPlayerInfoSet) == 0x000001, "Wrong size on OrionScoreboardPlayerRow_OnPlayerInfoSet");
static_assert(offsetof(OrionScoreboardPlayerRow_OnPlayerInfoSet, bIsLocalPlayer) == 0x000000, "Member 'OrionScoreboardPlayerRow_OnPlayerInfoSet::bIsLocalPlayer' has a wrong offset!");

// Function OrionUI.OrionScoreboardPlayerRow.OnSetBotInfo
// 0x0002 (0x0002 - 0x0000)
struct OrionScoreboardPlayerRow_OnSetBotInfo final
{
public:
	bool                                          bIsBot;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAIBotDifficulty                              BotDifficulty;                                     // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionScoreboardPlayerRow_OnSetBotInfo) == 0x000001, "Wrong alignment on OrionScoreboardPlayerRow_OnSetBotInfo");
static_assert(sizeof(OrionScoreboardPlayerRow_OnSetBotInfo) == 0x000002, "Wrong size on OrionScoreboardPlayerRow_OnSetBotInfo");
static_assert(offsetof(OrionScoreboardPlayerRow_OnSetBotInfo, bIsBot) == 0x000000, "Member 'OrionScoreboardPlayerRow_OnSetBotInfo::bIsBot' has a wrong offset!");
static_assert(offsetof(OrionScoreboardPlayerRow_OnSetBotInfo, BotDifficulty) == 0x000001, "Member 'OrionScoreboardPlayerRow_OnSetBotInfo::BotDifficulty' has a wrong offset!");

// Function OrionUI.OrionScoreboardPlayerRow.OnSetPositionInfo
// 0x0002 (0x0002 - 0x0000)
struct OrionScoreboardPlayerRow_OnSetPositionInfo final
{
public:
	bool                                          bIsFirst;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLast;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionScoreboardPlayerRow_OnSetPositionInfo) == 0x000001, "Wrong alignment on OrionScoreboardPlayerRow_OnSetPositionInfo");
static_assert(sizeof(OrionScoreboardPlayerRow_OnSetPositionInfo) == 0x000002, "Wrong size on OrionScoreboardPlayerRow_OnSetPositionInfo");
static_assert(offsetof(OrionScoreboardPlayerRow_OnSetPositionInfo, bIsFirst) == 0x000000, "Member 'OrionScoreboardPlayerRow_OnSetPositionInfo::bIsFirst' has a wrong offset!");
static_assert(offsetof(OrionScoreboardPlayerRow_OnSetPositionInfo, bIsLast) == 0x000001, "Member 'OrionScoreboardPlayerRow_OnSetPositionInfo::bIsLast' has a wrong offset!");

// Function OrionUI.OrionArcadeReadyScreen.SetKills
// 0x0008 (0x0008 - 0x0000)
struct OrionArcadeReadyScreen_SetKills final
{
public:
	EOrionTeam                                    TeamNum;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Kills;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OrionArcadeReadyScreen_SetKills) == 0x000004, "Wrong alignment on OrionArcadeReadyScreen_SetKills");
