#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_Kill_Player_R

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Player_Kill_Player_R.Player_Kill_Player_R_C
// 0x0088 (0x0288 - 0x0200)
class UPlayer_Kill_Player_R_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0200(0x0008)(Transient, DuplicateTransient)
	class UOrionLazyImage*                        LazyImage_HeroPortrait;                            // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Player_Name;                                       // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Team_Color_frame;                                  // 0x0218(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_BG_Black;                                     // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_BG_Red;                                       // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0230(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           Outline_Color;                                     // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Hero_Icon_Texture;                                 // 0x0258(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bShowRed;                                          // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Player_Kill_Player_R(int32 EntryPoint);
	void Construct();
	void Setup_Widget(const class FText& New_Player_Name, const struct FLinearColor& New_Outline_Color, TSoftObjectPtr<class UObject> New_Hero_Icon, bool Show_Red);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_Kill_Player_R_C">();
	}
	static class UPlayer_Kill_Player_R_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_Kill_Player_R_C>();
	}
};
static_assert(alignof(UPlayer_Kill_Player_R_C) == 0x000008, "Wrong alignment on UPlayer_Kill_Player_R_C");
static_assert(sizeof(UPlayer_Kill_Player_R_C) == 0x000288, "Wrong size on UPlayer_Kill_Player_R_C");
static_assert(offsetof(UPlayer_Kill_Player_R_C, UberGraphFrame) == 0x000200, "Member 'UPlayer_Kill_Player_R_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_R_C, LazyImage_HeroPortrait) == 0x000208, "Member 'UPlayer_Kill_Player_R_C::LazyImage_HeroPortrait' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_R_C, Player_Name) == 0x000210, "Member 'UPlayer_Kill_Player_R_C::Player_Name' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_R_C, Team_Color_frame) == 0x000218, "Member 'UPlayer_Kill_Player_R_C::Team_Color_frame' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_R_C, Text_BG_Black) == 0x000220, "Member 'UPlayer_Kill_Player_R_C::Text_BG_Black' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_R_C, Text_BG_Red) == 0x000228, "Member 'UPlayer_Kill_Player_R_C::Text_BG_Red' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_R_C, PlayerName) == 0x000230, "Member 'UPlayer_Kill_Player_R_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_R_C, Outline_Color) == 0x000248, "Member 'UPlayer_Kill_Player_R_C::Outline_Color' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_R_C, Hero_Icon_Texture) == 0x000258, "Member 'UPlayer_Kill_Player_R_C::Hero_Icon_Texture' has a wrong offset!");
static_assert(offsetof(UPlayer_Kill_Player_R_C, bShowRed) == 0x000280, "Member 'UPlayer_Kill_Player_R_C::bShowRed' has a wrong offset!");

}

