#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerRating

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerRating.PlayerRating_C
// 0x00C0 (0x0530 - 0x0470)
class UPlayerRating_C final : public UOrionPlayerRatingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Ally0;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Ally1;                                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Ally2;                                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Ally3;                                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Ally4;                                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Enemy0;                                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Enemy1;                                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Enemy2;                                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Enemy3;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerToRate_C*                        Enemy4;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_15;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_header;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ParagonLogo;                                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerRating_Icon;                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Submit_Backing;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Submit_Dash;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PlayerListing;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultButton_C*                       SubmitButton;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUi_StylizedDivider_Hor_C*              Ui_StylizedDivider_Hor;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUi_StylizedDivider_Hor_C*              Ui_StylizedDivider_Hor_0;                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerRating(int32 EntryPoint);
	void BndEvt__SubmitButton_K2Node_ComponentBoundEvent_8_OrionBaseButtonClicked__DelegateSignature(class UOrionBaseButton* Button);
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerRating_C">();
	}
	static class UPlayerRating_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerRating_C>();
	}
};
static_assert(alignof(UPlayerRating_C) == 0x000008, "Wrong alignment on UPlayerRating_C");
static_assert(sizeof(UPlayerRating_C) == 0x000530, "Wrong size on UPlayerRating_C");
static_assert(offsetof(UPlayerRating_C, UberGraphFrame) == 0x000470, "Member 'UPlayerRating_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Intro) == 0x000478, "Member 'UPlayerRating_C::Intro' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Ally0) == 0x000480, "Member 'UPlayerRating_C::Ally0' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Ally1) == 0x000488, "Member 'UPlayerRating_C::Ally1' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Ally2) == 0x000490, "Member 'UPlayerRating_C::Ally2' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Ally3) == 0x000498, "Member 'UPlayerRating_C::Ally3' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Ally4) == 0x0004A0, "Member 'UPlayerRating_C::Ally4' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Enemy0) == 0x0004A8, "Member 'UPlayerRating_C::Enemy0' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Enemy1) == 0x0004B0, "Member 'UPlayerRating_C::Enemy1' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Enemy2) == 0x0004B8, "Member 'UPlayerRating_C::Enemy2' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Enemy3) == 0x0004C0, "Member 'UPlayerRating_C::Enemy3' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Enemy4) == 0x0004C8, "Member 'UPlayerRating_C::Enemy4' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Image_4) == 0x0004D0, "Member 'UPlayerRating_C::Image_4' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Image_14) == 0x0004D8, "Member 'UPlayerRating_C::Image_14' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Image_15) == 0x0004E0, "Member 'UPlayerRating_C::Image_15' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Image_header) == 0x0004E8, "Member 'UPlayerRating_C::Image_header' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Image_ParagonLogo) == 0x0004F0, "Member 'UPlayerRating_C::Image_ParagonLogo' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Image_PlayerRating_Icon) == 0x0004F8, "Member 'UPlayerRating_C::Image_PlayerRating_Icon' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Image_Submit_Backing) == 0x000500, "Member 'UPlayerRating_C::Image_Submit_Backing' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Image_Submit_Dash) == 0x000508, "Member 'UPlayerRating_C::Image_Submit_Dash' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, PlayerListing) == 0x000510, "Member 'UPlayerRating_C::PlayerListing' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, SubmitButton) == 0x000518, "Member 'UPlayerRating_C::SubmitButton' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Ui_StylizedDivider_Hor) == 0x000520, "Member 'UPlayerRating_C::Ui_StylizedDivider_Hor' has a wrong offset!");
static_assert(offsetof(UPlayerRating_C, Ui_StylizedDivider_Hor_0) == 0x000528, "Member 'UPlayerRating_C::Ui_StylizedDivider_Hor_0' has a wrong offset!");

}

