#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameSurvey

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OrionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PostGameSurvey.PostGameSurvey_C
// 0x0018 (0x04B8 - 0x04A0)
class UPostGameSurvey_C final : public UOrionPostGameSurvey
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PostGameSurvey(int32 EntryPoint);
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostGameSurvey_C">();
	}
	static class UPostGameSurvey_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPostGameSurvey_C>();
	}
};
static_assert(alignof(UPostGameSurvey_C) == 0x000008, "Wrong alignment on UPostGameSurvey_C");
static_assert(sizeof(UPostGameSurvey_C) == 0x0004B8, "Wrong size on UPostGameSurvey_C");
static_assert(offsetof(UPostGameSurvey_C, UberGraphFrame) == 0x0004A0, "Member 'UPostGameSurvey_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPostGameSurvey_C, Appear) == 0x0004A8, "Member 'UPostGameSurvey_C::Appear' has a wrong offset!");
static_assert(offsetof(UPostGameSurvey_C, Image_0) == 0x0004B0, "Member 'UPostGameSurvey_C::Image_0' has a wrong offset!");

}

