#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Card_ImmobilityTrap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Proj_Card_ImmobilityTrap.Proj_Card_ImmobilityTrap_C.ExecuteUbergraph_Proj_Card_ImmobilityTrap
// 0x0020 (0x0020 - 0x0000)
struct Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetTeamColorFromMPC_ReturnValue;          // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap) == 0x000004, "Wrong alignment on Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap");
static_assert(sizeof(Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap) == 0x000020, "Wrong size on Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap");
static_assert(offsetof(Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap, EntryPoint) == 0x000000, "Member 'Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap, CallFunc_GetTeamColorFromMPC_ReturnValue) == 0x000004, "Member 'Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap::CallFunc_GetTeamColorFromMPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000014, "Member 'Proj_Card_ImmobilityTrap_C_ExecuteUbergraph_Proj_Card_ImmobilityTrap::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

}

