#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Prime_Helix_V2_SpecialAttack1_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_Prime_Helix_V2_SpecialAttack1_V2.Proj_Prime_Helix_V2_SpecialAttack1_V2_C
// 0x0040 (0x0750 - 0x0710)
class AProj_Prime_Helix_V2_SpecialAttack1_V2_C final : public AOrionProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_PrimeHelix_SpecialAttack1_Projectile;            // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityRamp_Velocity_97889A744EF4187F148F7886020A6B6B; // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            VelocityRamp__Direction_97889A744EF4187F148F7886020A6B6B; // 0x0724(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_725[0x3];                                      // 0x0725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     VelocityRamp;                                      // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Initial_Loc;                                       // 0x0730(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target;                                            // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_749[0x3];                                      // 0x0749(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrimeLevel;                                        // 0x074C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2(int32 EntryPoint);
	void OnHitActor(const struct FHitResult& Hit);
	void OnNetSync_SetNewTarget(class AActor* NewTargetActor, const struct FVector& NewSourceLocation, const struct FVector& NewTargetLocation, int32 UserStateID);
	void OnNotifyRange();
	void OnNotifyTime();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void VelocityRamp__FinishedFunc();
	void VelocityRamp__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_Prime_Helix_V2_SpecialAttack1_V2_C">();
	}
	static class AProj_Prime_Helix_V2_SpecialAttack1_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_Prime_Helix_V2_SpecialAttack1_V2_C>();
	}
};
static_assert(alignof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C) == 0x000008, "Wrong alignment on AProj_Prime_Helix_V2_SpecialAttack1_V2_C");
static_assert(sizeof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C) == 0x000750, "Wrong size on AProj_Prime_Helix_V2_SpecialAttack1_V2_C");
static_assert(offsetof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C, UberGraphFrame) == 0x000710, "Member 'AProj_Prime_Helix_V2_SpecialAttack1_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C, P_PrimeHelix_SpecialAttack1_Projectile) == 0x000718, "Member 'AProj_Prime_Helix_V2_SpecialAttack1_V2_C::P_PrimeHelix_SpecialAttack1_Projectile' has a wrong offset!");
static_assert(offsetof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C, VelocityRamp_Velocity_97889A744EF4187F148F7886020A6B6B) == 0x000720, "Member 'AProj_Prime_Helix_V2_SpecialAttack1_V2_C::VelocityRamp_Velocity_97889A744EF4187F148F7886020A6B6B' has a wrong offset!");
static_assert(offsetof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C, VelocityRamp__Direction_97889A744EF4187F148F7886020A6B6B) == 0x000724, "Member 'AProj_Prime_Helix_V2_SpecialAttack1_V2_C::VelocityRamp__Direction_97889A744EF4187F148F7886020A6B6B' has a wrong offset!");
static_assert(offsetof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C, VelocityRamp) == 0x000728, "Member 'AProj_Prime_Helix_V2_SpecialAttack1_V2_C::VelocityRamp' has a wrong offset!");
static_assert(offsetof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C, Initial_Loc) == 0x000730, "Member 'AProj_Prime_Helix_V2_SpecialAttack1_V2_C::Initial_Loc' has a wrong offset!");
static_assert(offsetof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C, Target) == 0x000740, "Member 'AProj_Prime_Helix_V2_SpecialAttack1_V2_C::Target' has a wrong offset!");
static_assert(offsetof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C, Debug) == 0x000748, "Member 'AProj_Prime_Helix_V2_SpecialAttack1_V2_C::Debug' has a wrong offset!");
static_assert(offsetof(AProj_Prime_Helix_V2_SpecialAttack1_V2_C, PrimeLevel) == 0x00074C, "Member 'AProj_Prime_Helix_V2_SpecialAttack1_V2_C::PrimeLevel' has a wrong offset!");

}

