#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Core

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OrionGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_Core.Proj_Core_C
// 0x0028 (0x0738 - 0x0710)
class AProj_Core_C final : public AOrionProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(Transient, DuplicateTransient)
	struct FVector                                ProjectileOrigin;                                  // 0x0718(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProjectileHitLocation;                             // 0x0724(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        LaserTrailParticleSystem;                          // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_Core(int32 EntryPoint);
	void OnHitActor(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_Core_C">();
	}
	static class AProj_Core_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_Core_C>();
	}
};
static_assert(alignof(AProj_Core_C) == 0x000008, "Wrong alignment on AProj_Core_C");
static_assert(sizeof(AProj_Core_C) == 0x000738, "Wrong size on AProj_Core_C");
static_assert(offsetof(AProj_Core_C, UberGraphFrame) == 0x000710, "Member 'AProj_Core_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProj_Core_C, ProjectileOrigin) == 0x000718, "Member 'AProj_Core_C::ProjectileOrigin' has a wrong offset!");
static_assert(offsetof(AProj_Core_C, ProjectileHitLocation) == 0x000724, "Member 'AProj_Core_C::ProjectileHitLocation' has a wrong offset!");
static_assert(offsetof(AProj_Core_C, LaserTrailParticleSystem) == 0x000730, "Member 'AProj_Core_C::LaserTrailParticleSystem' has a wrong offset!");

}

