#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Prime_Helix_V2_SpecialAttack1_V2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Proj_Prime_Helix_V2_SpecialAttack1_V2.Proj_Prime_Helix_V2_SpecialAttack1_V2_C.ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2
// 0x00E0 (0x00E0 - 0x0000)
struct Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_NewTargetActor;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NewSourceLocation;                    // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NewTargetLocation;                    // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_UserStateID;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x00C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2) == 0x000008, "Wrong alignment on Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2");
static_assert(sizeof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2) == 0x0000E0, "Wrong size on Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, EntryPoint) == 0x000000, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, K2Node_Event_NewTargetActor) == 0x000008, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::K2Node_Event_NewTargetActor' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, K2Node_Event_NewSourceLocation) == 0x000010, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::K2Node_Event_NewSourceLocation' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, K2Node_Event_NewTargetLocation) == 0x00001C, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::K2Node_Event_NewTargetLocation' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, K2Node_Event_UserStateID) == 0x000028, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::K2Node_Event_UserStateID' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, K2Node_Event_Hit) == 0x000030, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x0000C4, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_HasAuthority_ReturnValue) == 0x0000D0, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000D4, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_ExecuteUbergraph_Proj_Prime_Helix_V2_SpecialAttack1_V2::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Proj_Prime_Helix_V2_SpecialAttack1_V2.Proj_Prime_Helix_V2_SpecialAttack1_V2_C.OnHitActor
// 0x0088 (0x0088 - 0x0000)
struct Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnHitActor final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnHitActor) == 0x000008, "Wrong alignment on Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnHitActor");
static_assert(sizeof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnHitActor) == 0x000088, "Wrong size on Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnHitActor");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnHitActor, Hit) == 0x000000, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnHitActor::Hit' has a wrong offset!");

// Function Proj_Prime_Helix_V2_SpecialAttack1_V2.Proj_Prime_Helix_V2_SpecialAttack1_V2_C.OnNetSync_SetNewTarget
// 0x0028 (0x0028 - 0x0000)
struct Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget final
{
public:
	class AActor*                                 NewTargetActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewSourceLocation;                                 // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewTargetLocation;                                 // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UserStateID;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget) == 0x000008, "Wrong alignment on Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget");
static_assert(sizeof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget) == 0x000028, "Wrong size on Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget, NewTargetActor) == 0x000000, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget::NewTargetActor' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget, NewSourceLocation) == 0x000008, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget::NewSourceLocation' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget, NewTargetLocation) == 0x000014, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget::NewTargetLocation' has a wrong offset!");
static_assert(offsetof(Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget, UserStateID) == 0x000020, "Member 'Proj_Prime_Helix_V2_SpecialAttack1_V2_C_OnNetSync_SetNewTarget::UserStateID' has a wrong offset!");

}

