#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseFlow

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct PurchaseFlow.PurchaseFlowItem
// 0x0030 (0x0030 - 0x0000)
struct FPurchaseFlowItem final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EntitlementId;                                     // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ValidationInfo;                                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPurchaseFlowItem) == 0x000008, "Wrong alignment on FPurchaseFlowItem");
static_assert(sizeof(FPurchaseFlowItem) == 0x000030, "Wrong size on FPurchaseFlowItem");
static_assert(offsetof(FPurchaseFlowItem, ItemId) == 0x000000, "Member 'FPurchaseFlowItem::ItemId' has a wrong offset!");
static_assert(offsetof(FPurchaseFlowItem, EntitlementId) == 0x000010, "Member 'FPurchaseFlowItem::EntitlementId' has a wrong offset!");
static_assert(offsetof(FPurchaseFlowItem, ValidationInfo) == 0x000020, "Member 'FPurchaseFlowItem::ValidationInfo' has a wrong offset!");

// ScriptStruct PurchaseFlow.PurchaseFlowOffer
// 0x0038 (0x0038 - 0x0000)
struct FPurchaseFlowOffer final
{
public:
	class FString                                 OfferNamespace;                                    // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OfferId;                                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchaseFlowItem>              Items;                                             // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPurchaseFlowOffer) == 0x000008, "Wrong alignment on FPurchaseFlowOffer");
static_assert(sizeof(FPurchaseFlowOffer) == 0x000038, "Wrong size on FPurchaseFlowOffer");
static_assert(offsetof(FPurchaseFlowOffer, OfferNamespace) == 0x000000, "Member 'FPurchaseFlowOffer::OfferNamespace' has a wrong offset!");
static_assert(offsetof(FPurchaseFlowOffer, OfferId) == 0x000010, "Member 'FPurchaseFlowOffer::OfferId' has a wrong offset!");
static_assert(offsetof(FPurchaseFlowOffer, Quantity) == 0x000020, "Member 'FPurchaseFlowOffer::Quantity' has a wrong offset!");
static_assert(offsetof(FPurchaseFlowOffer, Items) == 0x000028, "Member 'FPurchaseFlowOffer::Items' has a wrong offset!");

// ScriptStruct PurchaseFlow.PurchaseFlowReceiptParam
// 0x0030 (0x0030 - 0x0000)
struct FPurchaseFlowReceiptParam final
{
public:
	class FString                                 TransactionId;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TransactionState;                                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPurchaseFlowOffer>             Offers;                                            // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPurchaseFlowReceiptParam) == 0x000008, "Wrong alignment on FPurchaseFlowReceiptParam");
static_assert(sizeof(FPurchaseFlowReceiptParam) == 0x000030, "Wrong size on FPurchaseFlowReceiptParam");
static_assert(offsetof(FPurchaseFlowReceiptParam, TransactionId) == 0x000000, "Member 'FPurchaseFlowReceiptParam::TransactionId' has a wrong offset!");
static_assert(offsetof(FPurchaseFlowReceiptParam, TransactionState) == 0x000010, "Member 'FPurchaseFlowReceiptParam::TransactionState' has a wrong offset!");
static_assert(offsetof(FPurchaseFlowReceiptParam, Offers) == 0x000020, "Member 'FPurchaseFlowReceiptParam::Offers' has a wrong offset!");

}

