#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuickChatTooltipWrapper

#include "Basic.hpp"


namespace SDK::Params
{

// Function QuickChatTooltipWrapper.QuickChatTooltipWrapper_C.ExecuteUbergraph_QuickChatTooltipWrapper
// 0x0058 (0x0058 - 0x0000)
struct QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowChatOptions;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue3;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue4;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue5;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue6;                  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper) == 0x000008, "Wrong alignment on QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper");
static_assert(sizeof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper) == 0x000058, "Wrong size on QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, EntryPoint) == 0x000000, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, Temp_bool_Variable) == 0x000004, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, CallFunc_GetChildAt_ReturnValue2) == 0x000010, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::CallFunc_GetChildAt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, Temp_int_Variable) == 0x000018, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, Temp_int_Variable2) == 0x00001C, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, Temp_bool_Variable2) == 0x000020, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, Temp_int_Variable3) == 0x000024, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, Temp_int_Variable4) == 0x000028, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, K2Node_Event_bShowChatOptions) == 0x00002C, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::K2Node_Event_bShowChatOptions' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, K2Node_Select_Default) == 0x000030, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, K2Node_Select2_Default) == 0x000034, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, CallFunc_GetChildAt_ReturnValue3) == 0x000038, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::CallFunc_GetChildAt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, CallFunc_GetChildAt_ReturnValue4) == 0x000040, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::CallFunc_GetChildAt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, CallFunc_GetChildAt_ReturnValue5) == 0x000048, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::CallFunc_GetChildAt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper, CallFunc_GetChildAt_ReturnValue6) == 0x000050, "Member 'QuickChatTooltipWrapper_C_ExecuteUbergraph_QuickChatTooltipWrapper::CallFunc_GetChildAt_ReturnValue6' has a wrong offset!");

// Function QuickChatTooltipWrapper.QuickChatTooltipWrapper_C.OnToggleChatOptions
// 0x0001 (0x0001 - 0x0000)
struct QuickChatTooltipWrapper_C_OnToggleChatOptions final
{
public:
	bool                                          bShowChatOptions;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuickChatTooltipWrapper_C_OnToggleChatOptions) == 0x000001, "Wrong alignment on QuickChatTooltipWrapper_C_OnToggleChatOptions");
static_assert(sizeof(QuickChatTooltipWrapper_C_OnToggleChatOptions) == 0x000001, "Wrong size on QuickChatTooltipWrapper_C_OnToggleChatOptions");
static_assert(offsetof(QuickChatTooltipWrapper_C_OnToggleChatOptions, bShowChatOptions) == 0x000000, "Member 'QuickChatTooltipWrapper_C_OnToggleChatOptions::bShowChatOptions' has a wrong offset!");

}

