#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RateMenu

#include "Basic.hpp"

#include "OrionUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RateMenu.RateMenu_C
// 0x0070 (0x04E0 - 0x0470)
class URateMenu_C final : public UOrionPlayerRateMenu
{
public:
	class UWidgetAnimation*                       Reveal;                                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_31;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_33;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_36;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_38;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_41;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_44;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Negative_Glow;                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Positive_Glow;                               // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Topline;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Topline_Backing;                             // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Underline;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Underline_Backing;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Reveal_Feedback();
	void Close_Feedback();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RateMenu_C">();
	}
	static class URateMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URateMenu_C>();
	}
};
static_assert(alignof(URateMenu_C) == 0x000008, "Wrong alignment on URateMenu_C");
static_assert(sizeof(URateMenu_C) == 0x0004E0, "Wrong size on URateMenu_C");
static_assert(offsetof(URateMenu_C, Reveal) == 0x000470, "Member 'URateMenu_C::Reveal' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_31) == 0x000478, "Member 'URateMenu_C::Image_31' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_32) == 0x000480, "Member 'URateMenu_C::Image_32' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_33) == 0x000488, "Member 'URateMenu_C::Image_33' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_36) == 0x000490, "Member 'URateMenu_C::Image_36' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_38) == 0x000498, "Member 'URateMenu_C::Image_38' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_41) == 0x0004A0, "Member 'URateMenu_C::Image_41' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_44) == 0x0004A8, "Member 'URateMenu_C::Image_44' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_Negative_Glow) == 0x0004B0, "Member 'URateMenu_C::Image_Negative_Glow' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_Positive_Glow) == 0x0004B8, "Member 'URateMenu_C::Image_Positive_Glow' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_Topline) == 0x0004C0, "Member 'URateMenu_C::Image_Topline' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_Topline_Backing) == 0x0004C8, "Member 'URateMenu_C::Image_Topline_Backing' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_Underline) == 0x0004D0, "Member 'URateMenu_C::Image_Underline' has a wrong offset!");
static_assert(offsetof(URateMenu_C, Image_Underline_Backing) == 0x0004D8, "Member 'URateMenu_C::Image_Underline_Backing' has a wrong offset!");

}

