#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedBuff_AnimBP

#include "Basic.hpp"

#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RedBuff_AnimBP.RedBuff_AnimBP_C
// 0x1590 (0x2750 - 0x11C0)
class URedBuff_AnimBP_C final : public UOrionHeroAnimInstance
{
public:
	uint8                                         Pad_11B8[0x8];                                     // 0x11B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11C0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_2529AF5A48351E61E2FADE9D1C6A7BFE; // 0x11C8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_ADA469C84451E27A49FF5CA347EE6A1C; // 0x1210(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_61D18E794C909A031C030E823DEACDFD; // 0x1278(0x0078)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_C0D7CBDA4A670BCA8BA453AC4395B1D3; // 0x12F0(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E6E13FF84724C9C6583C1CB54525DA2F; // 0x1350(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_314F5F5E4D65764A353765826FDDAEBE; // 0x13D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154; // 0x1450(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E6830DD74203A90AAFE9AE89BB7DF39B; // 0x14D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726; // 0x1550(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676; // 0x15D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D; // 0x1650(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B4F6A27D4E6A41A423139294B590EAB0; // 0x16D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87D74D354E92E9B20FF647AA046A9F59; // 0x1750(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8A09EC4F457B1D1E5947FCA4504C6039; // 0x17D0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D587A99B4B8E3B24D2C0BB8620E9232A; // 0x1850(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336; // 0x18D0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_96478E21475B0CF515D9CBACB5346A22; // 0x1950(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5CE44C3745E7ECDAFD1693BE44F6BF76; // 0x1A20(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CB9EB05D4BD8BE509E27E4B21D7C20A2; // 0x1A90(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_216F0C0F4E6CB81CE3E12E988226D814; // 0x1B00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_042FDBB044AD1A2B8F2DC79E6FBA66F6; // 0x1B48(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_5152ACBB4F2D993D2F9D41B6BAD9E2E8; // 0x1BB8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_19BB54B84B01DB6C050A7F885FB76514; // 0x1C00(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C30C348B4B75C3278E5445ADC7C8A3DD; // 0x1C70(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_B98A85CA47ACA890C046E0963B76483C; // 0x1CB8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_AF59F8784DB0FD0B177E4581A8D4ADC8; // 0x1D28(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_F3FF2AA7429249084CAF0EA932993BEE; // 0x1D70(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_56ABEE054FAD34A266BF5A9B7BF662D1; // 0x1E98(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FB0E650F4A6A69EDAB642DA5781C7AC7; // 0x1EE0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_69889BAE4F5E7DC78D5FA6A5424E3604; // 0x1F50(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E42600BC40EBB3E4D550689C224FC6E6; // 0x1F98(0x00D8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2CA6D29A45A7CB66E561EDA823AAE0DB; // 0x2070(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_63EA73624628DF6A361005B1CB182518; // 0x20D8(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3034089E45AA6987B76FFCBF0B605C2E; // 0x21B8(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_B5E33E724A73AA88E5E18097611D80A2; // 0x2288(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_F5D90E1548543ED0EAC8928C340699EE; // 0x22F0(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1333815642341211796DCFBD24BC8CE5; // 0x2398(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F29CD8A44F00719B60C7129BA9A2CFCF; // 0x23E8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29F10D194BFA845EFED324A5D96213DC; // 0x2438(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_66A50D7C4472DAE47D221580B3D5156A; // 0x2488(0x00A8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_948B88FE4F8A590CB0F32EA0D455B70D; // 0x2530(0x0050)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_CE47478941ADF43B5A541583D537553A; // 0x2580(0x0158)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_697248094789EC453E088782F2364EBC; // 0x26D8(0x0070)()
	float                                         Pitch;                                             // 0x2748(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RedBuff_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_ApplyAdditive_61D18E794C909A031C030E823DEACDFD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_BlendListByBool_3034089E45AA6987B76FFCBF0B605C2E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_BlendListByBool_96478E21475B0CF515D9CBACB5346A22();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_BlendSpacePlayer_F3FF2AA7429249084CAF0EA932993BEE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_RotateRootBone_C0D7CBDA4A670BCA8BA453AC4395B1D3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_CE47478941ADF43B5A541583D537553A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_SequenceEvaluator_19BB54B84B01DB6C050A7F885FB76514();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_SequenceEvaluator_697248094789EC453E088782F2364EBC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_SequenceEvaluator_B98A85CA47ACA890C046E0963B76483C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_314F5F5E4D65764A353765826FDDAEBE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_87D74D354E92E9B20FF647AA046A9F59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_8A09EC4F457B1D1E5947FCA4504C6039();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_B4F6A27D4E6A41A423139294B590EAB0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_D587A99B4B8E3B24D2C0BB8620E9232A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RedBuff_AnimBP_AnimGraphNode_TransitionResult_E6E13FF84724C9C6583C1CB54525DA2F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RedBuff_AnimBP_C">();
	}
	static class URedBuff_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedBuff_AnimBP_C>();
	}
};
static_assert(alignof(URedBuff_AnimBP_C) == 0x000010, "Wrong alignment on URedBuff_AnimBP_C");
static_assert(sizeof(URedBuff_AnimBP_C) == 0x002750, "Wrong size on URedBuff_AnimBP_C");
static_assert(offsetof(URedBuff_AnimBP_C, UberGraphFrame) == 0x0011C0, "Member 'URedBuff_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_Root_2529AF5A48351E61E2FADE9D1C6A7BFE) == 0x0011C8, "Member 'URedBuff_AnimBP_C::AnimGraphNode_Root_2529AF5A48351E61E2FADE9D1C6A7BFE' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_Slot_ADA469C84451E27A49FF5CA347EE6A1C) == 0x001210, "Member 'URedBuff_AnimBP_C::AnimGraphNode_Slot_ADA469C84451E27A49FF5CA347EE6A1C' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_ApplyAdditive_61D18E794C909A031C030E823DEACDFD) == 0x001278, "Member 'URedBuff_AnimBP_C::AnimGraphNode_ApplyAdditive_61D18E794C909A031C030E823DEACDFD' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_RotateRootBone_C0D7CBDA4A670BCA8BA453AC4395B1D3) == 0x0012F0, "Member 'URedBuff_AnimBP_C::AnimGraphNode_RotateRootBone_C0D7CBDA4A670BCA8BA453AC4395B1D3' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_E6E13FF84724C9C6583C1CB54525DA2F) == 0x001350, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_E6E13FF84724C9C6583C1CB54525DA2F' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_314F5F5E4D65764A353765826FDDAEBE) == 0x0013D0, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_314F5F5E4D65764A353765826FDDAEBE' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154) == 0x001450, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_DFEF7569467D4EB460CDB893697B7154' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_E6830DD74203A90AAFE9AE89BB7DF39B) == 0x0014D0, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_E6830DD74203A90AAFE9AE89BB7DF39B' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726) == 0x001550, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_B1DDC514452675C8A18EBE830BD13726' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676) == 0x0015D0, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_06C0174B477DA8486A90D493E73AD676' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D) == 0x001650, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_836B35EA4B75177D8B2355BBDE9EEB1D' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_B4F6A27D4E6A41A423139294B590EAB0) == 0x0016D0, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_B4F6A27D4E6A41A423139294B590EAB0' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_87D74D354E92E9B20FF647AA046A9F59) == 0x001750, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_87D74D354E92E9B20FF647AA046A9F59' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_8A09EC4F457B1D1E5947FCA4504C6039) == 0x0017D0, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_8A09EC4F457B1D1E5947FCA4504C6039' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_D587A99B4B8E3B24D2C0BB8620E9232A) == 0x001850, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_D587A99B4B8E3B24D2C0BB8620E9232A' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336) == 0x0018D0, "Member 'URedBuff_AnimBP_C::AnimGraphNode_TransitionResult_6CBC68F94B0A2158E3023CA2478A0336' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_BlendListByBool_96478E21475B0CF515D9CBACB5346A22) == 0x001950, "Member 'URedBuff_AnimBP_C::AnimGraphNode_BlendListByBool_96478E21475B0CF515D9CBACB5346A22' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_SequencePlayer_5CE44C3745E7ECDAFD1693BE44F6BF76) == 0x001A20, "Member 'URedBuff_AnimBP_C::AnimGraphNode_SequencePlayer_5CE44C3745E7ECDAFD1693BE44F6BF76' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_SequencePlayer_CB9EB05D4BD8BE509E27E4B21D7C20A2) == 0x001A90, "Member 'URedBuff_AnimBP_C::AnimGraphNode_SequencePlayer_CB9EB05D4BD8BE509E27E4B21D7C20A2' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_StateResult_216F0C0F4E6CB81CE3E12E988226D814) == 0x001B00, "Member 'URedBuff_AnimBP_C::AnimGraphNode_StateResult_216F0C0F4E6CB81CE3E12E988226D814' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_SequencePlayer_042FDBB044AD1A2B8F2DC79E6FBA66F6) == 0x001B48, "Member 'URedBuff_AnimBP_C::AnimGraphNode_SequencePlayer_042FDBB044AD1A2B8F2DC79E6FBA66F6' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_StateResult_5152ACBB4F2D993D2F9D41B6BAD9E2E8) == 0x001BB8, "Member 'URedBuff_AnimBP_C::AnimGraphNode_StateResult_5152ACBB4F2D993D2F9D41B6BAD9E2E8' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_SequenceEvaluator_19BB54B84B01DB6C050A7F885FB76514) == 0x001C00, "Member 'URedBuff_AnimBP_C::AnimGraphNode_SequenceEvaluator_19BB54B84B01DB6C050A7F885FB76514' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_StateResult_C30C348B4B75C3278E5445ADC7C8A3DD) == 0x001C70, "Member 'URedBuff_AnimBP_C::AnimGraphNode_StateResult_C30C348B4B75C3278E5445ADC7C8A3DD' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_SequenceEvaluator_B98A85CA47ACA890C046E0963B76483C) == 0x001CB8, "Member 'URedBuff_AnimBP_C::AnimGraphNode_SequenceEvaluator_B98A85CA47ACA890C046E0963B76483C' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_StateResult_AF59F8784DB0FD0B177E4581A8D4ADC8) == 0x001D28, "Member 'URedBuff_AnimBP_C::AnimGraphNode_StateResult_AF59F8784DB0FD0B177E4581A8D4ADC8' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_BlendSpacePlayer_F3FF2AA7429249084CAF0EA932993BEE) == 0x001D70, "Member 'URedBuff_AnimBP_C::AnimGraphNode_BlendSpacePlayer_F3FF2AA7429249084CAF0EA932993BEE' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_StateResult_56ABEE054FAD34A266BF5A9B7BF662D1) == 0x001E98, "Member 'URedBuff_AnimBP_C::AnimGraphNode_StateResult_56ABEE054FAD34A266BF5A9B7BF662D1' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_SequencePlayer_FB0E650F4A6A69EDAB642DA5781C7AC7) == 0x001EE0, "Member 'URedBuff_AnimBP_C::AnimGraphNode_SequencePlayer_FB0E650F4A6A69EDAB642DA5781C7AC7' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_StateResult_69889BAE4F5E7DC78D5FA6A5424E3604) == 0x001F50, "Member 'URedBuff_AnimBP_C::AnimGraphNode_StateResult_69889BAE4F5E7DC78D5FA6A5424E3604' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_StateMachine_E42600BC40EBB3E4D550689C224FC6E6) == 0x001F98, "Member 'URedBuff_AnimBP_C::AnimGraphNode_StateMachine_E42600BC40EBB3E4D550689C224FC6E6' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_Slot_2CA6D29A45A7CB66E561EDA823AAE0DB) == 0x002070, "Member 'URedBuff_AnimBP_C::AnimGraphNode_Slot_2CA6D29A45A7CB66E561EDA823AAE0DB' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_LayeredBoneBlend_63EA73624628DF6A361005B1CB182518) == 0x0020D8, "Member 'URedBuff_AnimBP_C::AnimGraphNode_LayeredBoneBlend_63EA73624628DF6A361005B1CB182518' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_BlendListByBool_3034089E45AA6987B76FFCBF0B605C2E) == 0x0021B8, "Member 'URedBuff_AnimBP_C::AnimGraphNode_BlendListByBool_3034089E45AA6987B76FFCBF0B605C2E' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_Slot_B5E33E724A73AA88E5E18097611D80A2) == 0x002288, "Member 'URedBuff_AnimBP_C::AnimGraphNode_Slot_B5E33E724A73AA88E5E18097611D80A2' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_SaveCachedPose_F5D90E1548543ED0EAC8928C340699EE) == 0x0022F0, "Member 'URedBuff_AnimBP_C::AnimGraphNode_SaveCachedPose_F5D90E1548543ED0EAC8928C340699EE' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_UseCachedPose_1333815642341211796DCFBD24BC8CE5) == 0x002398, "Member 'URedBuff_AnimBP_C::AnimGraphNode_UseCachedPose_1333815642341211796DCFBD24BC8CE5' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_UseCachedPose_F29CD8A44F00719B60C7129BA9A2CFCF) == 0x0023E8, "Member 'URedBuff_AnimBP_C::AnimGraphNode_UseCachedPose_F29CD8A44F00719B60C7129BA9A2CFCF' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_UseCachedPose_29F10D194BFA845EFED324A5D96213DC) == 0x002438, "Member 'URedBuff_AnimBP_C::AnimGraphNode_UseCachedPose_29F10D194BFA845EFED324A5D96213DC' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_SaveCachedPose_66A50D7C4472DAE47D221580B3D5156A) == 0x002488, "Member 'URedBuff_AnimBP_C::AnimGraphNode_SaveCachedPose_66A50D7C4472DAE47D221580B3D5156A' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_UseCachedPose_948B88FE4F8A590CB0F32EA0D455B70D) == 0x002530, "Member 'URedBuff_AnimBP_C::AnimGraphNode_UseCachedPose_948B88FE4F8A590CB0F32EA0D455B70D' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_CE47478941ADF43B5A541583D537553A) == 0x002580, "Member 'URedBuff_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_CE47478941ADF43B5A541583D537553A' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, AnimGraphNode_SequenceEvaluator_697248094789EC453E088782F2364EBC) == 0x0026D8, "Member 'URedBuff_AnimBP_C::AnimGraphNode_SequenceEvaluator_697248094789EC453E088782F2364EBC' has a wrong offset!");
static_assert(offsetof(URedBuff_AnimBP_C, Pitch) == 0x002748, "Member 'URedBuff_AnimBP_C::Pitch' has a wrong offset!");

}

