#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_HeroPedestalAttachments

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_HeroPedestalAttachments.Struct_HeroPedestalAttachments
// 0x0040 (0x0040 - 0x0000)
struct FStruct_HeroPedestalAttachments final
{
public:
	struct FTransform                             AttachmentTransform_2_4B4440AE483577EF8939709A7CC21C25; // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FName                                   AttachSocket_5_D8A2F1564D7C2E6486BB28AACA49D230;   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMeshAttachment_8_041BD62B40F732F8AA9E968358D296B3; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_HeroPedestalAttachments) == 0x000010, "Wrong alignment on FStruct_HeroPedestalAttachments");
static_assert(sizeof(FStruct_HeroPedestalAttachments) == 0x000040, "Wrong size on FStruct_HeroPedestalAttachments");
static_assert(offsetof(FStruct_HeroPedestalAttachments, AttachmentTransform_2_4B4440AE483577EF8939709A7CC21C25) == 0x000000, "Member 'FStruct_HeroPedestalAttachments::AttachmentTransform_2_4B4440AE483577EF8939709A7CC21C25' has a wrong offset!");
static_assert(offsetof(FStruct_HeroPedestalAttachments, AttachSocket_5_D8A2F1564D7C2E6486BB28AACA49D230) == 0x000030, "Member 'FStruct_HeroPedestalAttachments::AttachSocket_5_D8A2F1564D7C2E6486BB28AACA49D230' has a wrong offset!");
static_assert(offsetof(FStruct_HeroPedestalAttachments, StaticMeshAttachment_8_041BD62B40F732F8AA9E968358D296B3) == 0x000038, "Member 'FStruct_HeroPedestalAttachments::StaticMeshAttachment_8_041BD62B40F732F8AA9E968358D296B3' has a wrong offset!");

}

