#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Structure_Destroyed

#include "Basic.hpp"


namespace SDK::Params
{

// Function Structure_Destroyed.Structure_Destroyed_C.ExecuteUbergraph_Structure_Destroyed
// 0x0018 (0x0018 - 0x0000)
struct Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed) == 0x000008, "Wrong alignment on Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed");
static_assert(sizeof(Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed) == 0x000018, "Wrong size on Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed");
static_assert(offsetof(Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed, EntryPoint) == 0x000000, "Member 'Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed::EntryPoint' has a wrong offset!");
static_assert(offsetof(Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed, K2Node_Event_Animation) == 0x000008, "Member 'Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed, K2Node_SwitchName_CmpSuccess) == 0x000011, "Member 'Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'Structure_Destroyed_C_ExecuteUbergraph_Structure_Destroyed::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Structure_Destroyed.Structure_Destroyed_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct Structure_Destroyed_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Structure_Destroyed_C_OnAnimationFinished) == 0x000008, "Wrong alignment on Structure_Destroyed_C_OnAnimationFinished");
static_assert(sizeof(Structure_Destroyed_C_OnAnimationFinished) == 0x000008, "Wrong size on Structure_Destroyed_C_OnAnimationFinished");
static_assert(offsetof(Structure_Destroyed_C_OnAnimationFinished, Animation) == 0x000000, "Member 'Structure_Destroyed_C_OnAnimationFinished::Animation' has a wrong offset!");

}

