#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuperMinions_Dawn_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SuperMinions_Dawn_AnimBP.SuperMinions_Dawn_AnimBP_C.ExecuteUbergraph_SuperMinions_Dawn_AnimBP
// 0x0008 (0x0008 - 0x0000)
struct SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP) == 0x000004, "Wrong alignment on SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP");
static_assert(sizeof(SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP) == 0x000008, "Wrong size on SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP");
static_assert(offsetof(SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP, EntryPoint) == 0x000000, "Member 'SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP, CallFunc_Not_PreBool_ReturnValue2) == 0x000005, "Member 'SuperMinions_Dawn_AnimBP_C_ExecuteUbergraph_SuperMinions_Dawn_AnimBP::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");

}

