#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuperMinions_Dusk_AnimBP

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "OrionGame_structs.hpp"
#include "OrionGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SuperMinions_Dusk_AnimBP.SuperMinions_Dusk_AnimBP_C
// 0x13B0 (0x1FE0 - 0x0C30)
class USuperMinions_Dusk_AnimBP_C final : public UOrionMinionAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6A82AB1A4AED8ECC09CF0885926C5EB2; // 0x0C38(0x0048)()
	struct FOrionAnimNode_MinionBehavior          OrionAnimGraphNode_MinionBehavior_CBA4FC734ED08044D8FC249A8631FFAB; // 0x0C80(0x02F0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1DCD7FD0405449F61B24099D1A14BEF7; // 0x0F70(0x03C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_DC5D946647A7B5F665A848836839CBDC; // 0x1338(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_69ECC87947FBB88B9C645F99C18341E2; // 0x1380(0x0048)()
	uint8                                         Pad_13C8[0x8];                                     // 0x13C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrionAnimNode_SimpleSlopeAndAim       OrionAnimGraphNode_SimpleSlopeAndAim_8EBCDBA145B9A5739FED2CAB4C1EF20D; // 0x13D0(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_816CAF984A68FE50A60D3AB4E53433CB; // 0x1480(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58E809E24F1CF869E2752798955975E0; // 0x1500(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F2E92E36413F96E137A9A4827F156A94; // 0x1580(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51CD0E5A4489307D4A2F20A9581B1FA5; // 0x1600(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9240C7214593FD99644472A8281A8789; // 0x1680(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2A07895B498816794D5AC7A8CECCA45C; // 0x1700(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_972C351F4F06F156ACF0DB8F032ADB93; // 0x1780(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A4DB64D64B66877F5EB3D89FF9D95590; // 0x17F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_775D231F4C875D451D462AB462AD165F; // 0x1838(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8421F30C4D30354E2DC00EA14CE6CFEB; // 0x18A8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_367D04BA43C0A944025F8792C3B47A8E; // 0x18F0(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1D1CB0154AAB6DC789CA2181DEC687BB; // 0x19C0(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C3FCE69F47FB5FB2BED7EC927FE818C6; // 0x1A30(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CC7413334840F47B75C165B134529788; // 0x1B00(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1466D1E64044EF4927DD739AA116219D; // 0x1B70(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_F4C8CD8A4EC5A1C7FB10C48FB22AE0A7; // 0x1BE0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_CC2B11A44B62A0DB4D59189540AB6F19; // 0x1C28(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AD8D087441F3ACA6B9107BBC0C48A0BE; // 0x1CF8(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ECBE78674ED82E4632DEE797192D6BDC; // 0x1D68(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_CE87EC5D459920EAC7CF11AA738EC47C; // 0x1DD8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_300D3AC7410E1DAC8DD424A1100F8335; // 0x1E20(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_513A677645747650950BF888B832D4B6; // 0x1EF8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28DA65FE4E30BA9CA0EAE28676AA1C1E; // 0x1F70(0x0070)()

public:
	void ExecuteUbergraph_SuperMinions_Dusk_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_ApplyAdditive_513A677645747650950BF888B832D4B6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_BlendListByBool_367D04BA43C0A944025F8792C3B47A8E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_BlendListByBool_C3FCE69F47FB5FB2BED7EC927FE818C6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_BlendListByBool_CC2B11A44B62A0DB4D59189540AB6F19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_RigidBody_1DCD7FD0405449F61B24099D1A14BEF7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_SequencePlayer_1466D1E64044EF4927DD739AA116219D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_SequencePlayer_1D1CB0154AAB6DC789CA2181DEC687BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_SequencePlayer_AD8D087441F3ACA6B9107BBC0C48A0BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_SequencePlayer_CC7413334840F47B75C165B134529788();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_TransitionResult_2A07895B498816794D5AC7A8CECCA45C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_TransitionResult_816CAF984A68FE50A60D3AB4E53433CB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_TransitionResult_9240C7214593FD99644472A8281A8789();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_AnimGraphNode_TransitionResult_F2E92E36413F96E137A9A4827F156A94();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SuperMinions_Dusk_AnimBP_OrionAnimGraphNode_SimpleSlopeAndAim_8EBCDBA145B9A5739FED2CAB4C1EF20D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SuperMinions_Dusk_AnimBP_C">();
	}
	static class USuperMinions_Dusk_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USuperMinions_Dusk_AnimBP_C>();
	}
};
static_assert(alignof(USuperMinions_Dusk_AnimBP_C) == 0x000010, "Wrong alignment on USuperMinions_Dusk_AnimBP_C");
static_assert(sizeof(USuperMinions_Dusk_AnimBP_C) == 0x001FE0, "Wrong size on USuperMinions_Dusk_AnimBP_C");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, UberGraphFrame) == 0x000C30, "Member 'USuperMinions_Dusk_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_Root_6A82AB1A4AED8ECC09CF0885926C5EB2) == 0x000C38, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_Root_6A82AB1A4AED8ECC09CF0885926C5EB2' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, OrionAnimGraphNode_MinionBehavior_CBA4FC734ED08044D8FC249A8631FFAB) == 0x000C80, "Member 'USuperMinions_Dusk_AnimBP_C::OrionAnimGraphNode_MinionBehavior_CBA4FC734ED08044D8FC249A8631FFAB' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_RigidBody_1DCD7FD0405449F61B24099D1A14BEF7) == 0x000F70, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_RigidBody_1DCD7FD0405449F61B24099D1A14BEF7' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_LocalToComponentSpace_DC5D946647A7B5F665A848836839CBDC) == 0x001338, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_LocalToComponentSpace_DC5D946647A7B5F665A848836839CBDC' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_69ECC87947FBB88B9C645F99C18341E2) == 0x001380, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_69ECC87947FBB88B9C645F99C18341E2' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, OrionAnimGraphNode_SimpleSlopeAndAim_8EBCDBA145B9A5739FED2CAB4C1EF20D) == 0x0013D0, "Member 'USuperMinions_Dusk_AnimBP_C::OrionAnimGraphNode_SimpleSlopeAndAim_8EBCDBA145B9A5739FED2CAB4C1EF20D' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_TransitionResult_816CAF984A68FE50A60D3AB4E53433CB) == 0x001480, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_TransitionResult_816CAF984A68FE50A60D3AB4E53433CB' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_TransitionResult_58E809E24F1CF869E2752798955975E0) == 0x001500, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_TransitionResult_58E809E24F1CF869E2752798955975E0' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_TransitionResult_F2E92E36413F96E137A9A4827F156A94) == 0x001580, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_TransitionResult_F2E92E36413F96E137A9A4827F156A94' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_TransitionResult_51CD0E5A4489307D4A2F20A9581B1FA5) == 0x001600, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_TransitionResult_51CD0E5A4489307D4A2F20A9581B1FA5' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_TransitionResult_9240C7214593FD99644472A8281A8789) == 0x001680, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_TransitionResult_9240C7214593FD99644472A8281A8789' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_TransitionResult_2A07895B498816794D5AC7A8CECCA45C) == 0x001700, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_TransitionResult_2A07895B498816794D5AC7A8CECCA45C' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_972C351F4F06F156ACF0DB8F032ADB93) == 0x001780, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_972C351F4F06F156ACF0DB8F032ADB93' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_StateResult_A4DB64D64B66877F5EB3D89FF9D95590) == 0x0017F0, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_StateResult_A4DB64D64B66877F5EB3D89FF9D95590' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_775D231F4C875D451D462AB462AD165F) == 0x001838, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_775D231F4C875D451D462AB462AD165F' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_StateResult_8421F30C4D30354E2DC00EA14CE6CFEB) == 0x0018A8, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_StateResult_8421F30C4D30354E2DC00EA14CE6CFEB' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_367D04BA43C0A944025F8792C3B47A8E) == 0x0018F0, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_367D04BA43C0A944025F8792C3B47A8E' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_1D1CB0154AAB6DC789CA2181DEC687BB) == 0x0019C0, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_1D1CB0154AAB6DC789CA2181DEC687BB' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_C3FCE69F47FB5FB2BED7EC927FE818C6) == 0x001A30, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_C3FCE69F47FB5FB2BED7EC927FE818C6' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_CC7413334840F47B75C165B134529788) == 0x001B00, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_CC7413334840F47B75C165B134529788' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_1466D1E64044EF4927DD739AA116219D) == 0x001B70, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_1466D1E64044EF4927DD739AA116219D' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_StateResult_F4C8CD8A4EC5A1C7FB10C48FB22AE0A7) == 0x001BE0, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_StateResult_F4C8CD8A4EC5A1C7FB10C48FB22AE0A7' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_BlendListByBool_CC2B11A44B62A0DB4D59189540AB6F19) == 0x001C28, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_BlendListByBool_CC2B11A44B62A0DB4D59189540AB6F19' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_AD8D087441F3ACA6B9107BBC0C48A0BE) == 0x001CF8, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_AD8D087441F3ACA6B9107BBC0C48A0BE' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_ECBE78674ED82E4632DEE797192D6BDC) == 0x001D68, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_ECBE78674ED82E4632DEE797192D6BDC' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_StateResult_CE87EC5D459920EAC7CF11AA738EC47C) == 0x001DD8, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_StateResult_CE87EC5D459920EAC7CF11AA738EC47C' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_StateMachine_300D3AC7410E1DAC8DD424A1100F8335) == 0x001E20, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_StateMachine_300D3AC7410E1DAC8DD424A1100F8335' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_ApplyAdditive_513A677645747650950BF888B832D4B6) == 0x001EF8, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_ApplyAdditive_513A677645747650950BF888B832D4B6' has a wrong offset!");
static_assert(offsetof(USuperMinions_Dusk_AnimBP_C, AnimGraphNode_SequencePlayer_28DA65FE4E30BA9CA0EAE28676AA1C1E) == 0x001F70, "Member 'USuperMinions_Dusk_AnimBP_C::AnimGraphNode_SequencePlayer_28DA65FE4E30BA9CA0EAE28676AA1C1E' has a wrong offset!");

}

