#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TM_Box

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TM_Box.TM_Box_C
// 0x0048 (0x07C8 - 0x0780)
class ATM_Box_C : public ATM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TM_Box_C;                           // 0x0780(0x0008)(Transient, DuplicateTransient)
	class UDecalComponent*                        BoxDecal;                                          // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               TargetingParticleSystem;                           // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSplineTargetVisuals;                            // 0x0798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ThickBox;                                          // 0x0799(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79A[0x6];                                      // 0x079A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ThickBoxParticleSystem;                            // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animated;                                          // 0x07A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        AnimatedParticleSystem;                            // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BoxDecalMat;                                       // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseRangeDecal;                                     // 0x07C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RoundedLineBox;                                    // 0x07C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TM_Box(int32 EntryPoint);
	void OnTargetingModeConfirm();
	void OnFacetBoxBuilt(const struct FVector& MinBounds, const struct FVector& MaxBounds);
	void OnTargetingModeActivate();
	void OnTargetingModeCancel();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TM_Box_C">();
	}
	static class ATM_Box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATM_Box_C>();
	}
};
static_assert(alignof(ATM_Box_C) == 0x000008, "Wrong alignment on ATM_Box_C");
static_assert(sizeof(ATM_Box_C) == 0x0007C8, "Wrong size on ATM_Box_C");
static_assert(offsetof(ATM_Box_C, UberGraphFrame_TM_Box_C) == 0x000780, "Member 'ATM_Box_C::UberGraphFrame_TM_Box_C' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, BoxDecal) == 0x000788, "Member 'ATM_Box_C::BoxDecal' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, TargetingParticleSystem) == 0x000790, "Member 'ATM_Box_C::TargetingParticleSystem' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, UseSplineTargetVisuals) == 0x000798, "Member 'ATM_Box_C::UseSplineTargetVisuals' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, ThickBox) == 0x000799, "Member 'ATM_Box_C::ThickBox' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, ThickBoxParticleSystem) == 0x0007A0, "Member 'ATM_Box_C::ThickBoxParticleSystem' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, Animated) == 0x0007A8, "Member 'ATM_Box_C::Animated' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, AnimatedParticleSystem) == 0x0007B0, "Member 'ATM_Box_C::AnimatedParticleSystem' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, BoxDecalMat) == 0x0007B8, "Member 'ATM_Box_C::BoxDecalMat' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, UseRangeDecal) == 0x0007C0, "Member 'ATM_Box_C::UseRangeDecal' has a wrong offset!");
static_assert(offsetof(ATM_Box_C, RoundedLineBox) == 0x0007C1, "Member 'ATM_Box_C::RoundedLineBox' has a wrong offset!");

}

