#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TM_Card_VisionSpore_v2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TM_Card_VisionSpore_v2.TM_Card_VisionSpore_v2_C.ExecuteUbergraph_TM_Card_VisionSpore_v2
// 0x0038 (0x0038 - 0x0000)
struct TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetFriendlyColorFromMPC_ReturnValue;      // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ConfirmAllowed;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2) == 0x000008, "Wrong alignment on TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2");
static_assert(sizeof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2) == 0x000038, "Wrong size on TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2, EntryPoint) == 0x000000, "Member 'TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2::EntryPoint' has a wrong offset!");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2, CallFunc_GetFriendlyColorFromMPC_ReturnValue) == 0x000004, "Member 'TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2::CallFunc_GetFriendlyColorFromMPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2, K2Node_Event_ConfirmAllowed) == 0x000028, "Member 'TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2::K2Node_Event_ConfirmAllowed' has a wrong offset!");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2, CallFunc_Percent_FloatFloat_ReturnValue) == 0x00002C, "Member 'TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'TM_Card_VisionSpore_v2_C_ExecuteUbergraph_TM_Card_VisionSpore_v2::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function TM_Card_VisionSpore_v2.TM_Card_VisionSpore_v2_C.OnConfirmAllowedChange
// 0x0001 (0x0001 - 0x0000)
struct TM_Card_VisionSpore_v2_C_OnConfirmAllowedChange final
{
public:
	bool                                          ConfirmAllowed;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TM_Card_VisionSpore_v2_C_OnConfirmAllowedChange) == 0x000001, "Wrong alignment on TM_Card_VisionSpore_v2_C_OnConfirmAllowedChange");
static_assert(sizeof(TM_Card_VisionSpore_v2_C_OnConfirmAllowedChange) == 0x000001, "Wrong size on TM_Card_VisionSpore_v2_C_OnConfirmAllowedChange");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_OnConfirmAllowedChange, ConfirmAllowed) == 0x000000, "Member 'TM_Card_VisionSpore_v2_C_OnConfirmAllowedChange::ConfirmAllowed' has a wrong offset!");

// Function TM_Card_VisionSpore_v2.TM_Card_VisionSpore_v2_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TM_Card_VisionSpore_v2_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TM_Card_VisionSpore_v2_C_ReceiveTick) == 0x000004, "Wrong alignment on TM_Card_VisionSpore_v2_C_ReceiveTick");
static_assert(sizeof(TM_Card_VisionSpore_v2_C_ReceiveTick) == 0x000004, "Wrong size on TM_Card_VisionSpore_v2_C_ReceiveTick");
static_assert(offsetof(TM_Card_VisionSpore_v2_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'TM_Card_VisionSpore_v2_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

