#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TM_Card_VisionSpore_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TM_Card_VisionSpore_v2.TM_Card_VisionSpore_v2_C
// 0x0040 (0x07C0 - 0x0780)
class ATM_Card_VisionSpore_v2_C final : public ATM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TM_Card_VisionSpore_v2_C;           // 0x0780(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   RangeMesh;                                         // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TM_OverrideRadius;                                 // 0x0790(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79C[0x4];                                      // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     M_Range;                                           // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Range;                                         // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActive;                                           // 0x07B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x3];                                      // 0x07B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SecondCounter;                                     // 0x07B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFlashVisibilityOn;                                // 0x07B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bConfirmAllowed;                                   // 0x07B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TM_Card_VisionSpore_v2(int32 EntryPoint);
	void OnConfirmAllowedChange(bool ConfirmAllowed);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnTargetingModeActivate();
	void OnTargetingModeCancel();
	void OnTargetingModeConfirm();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TM_Card_VisionSpore_v2_C">();
	}
	static class ATM_Card_VisionSpore_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATM_Card_VisionSpore_v2_C>();
	}
};
static_assert(alignof(ATM_Card_VisionSpore_v2_C) == 0x000008, "Wrong alignment on ATM_Card_VisionSpore_v2_C");
static_assert(sizeof(ATM_Card_VisionSpore_v2_C) == 0x0007C0, "Wrong size on ATM_Card_VisionSpore_v2_C");
static_assert(offsetof(ATM_Card_VisionSpore_v2_C, UberGraphFrame_TM_Card_VisionSpore_v2_C) == 0x000780, "Member 'ATM_Card_VisionSpore_v2_C::UberGraphFrame_TM_Card_VisionSpore_v2_C' has a wrong offset!");
static_assert(offsetof(ATM_Card_VisionSpore_v2_C, RangeMesh) == 0x000788, "Member 'ATM_Card_VisionSpore_v2_C::RangeMesh' has a wrong offset!");
static_assert(offsetof(ATM_Card_VisionSpore_v2_C, TM_OverrideRadius) == 0x000790, "Member 'ATM_Card_VisionSpore_v2_C::TM_OverrideRadius' has a wrong offset!");
static_assert(offsetof(ATM_Card_VisionSpore_v2_C, M_Range) == 0x0007A0, "Member 'ATM_Card_VisionSpore_v2_C::M_Range' has a wrong offset!");
static_assert(offsetof(ATM_Card_VisionSpore_v2_C, DMI_Range) == 0x0007A8, "Member 'ATM_Card_VisionSpore_v2_C::DMI_Range' has a wrong offset!");
static_assert(offsetof(ATM_Card_VisionSpore_v2_C, bActive) == 0x0007B0, "Member 'ATM_Card_VisionSpore_v2_C::bActive' has a wrong offset!");
static_assert(offsetof(ATM_Card_VisionSpore_v2_C, SecondCounter) == 0x0007B4, "Member 'ATM_Card_VisionSpore_v2_C::SecondCounter' has a wrong offset!");
static_assert(offsetof(ATM_Card_VisionSpore_v2_C, bFlashVisibilityOn) == 0x0007B8, "Member 'ATM_Card_VisionSpore_v2_C::bFlashVisibilityOn' has a wrong offset!");
static_assert(offsetof(ATM_Card_VisionSpore_v2_C, bConfirmAllowed) == 0x0007B9, "Member 'ATM_Card_VisionSpore_v2_C::bConfirmAllowed' has a wrong offset!");

}

