#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TM_Sector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TM_Sector.TM_Sector_C
// 0x0020 (0x07A0 - 0x0780)
class ATM_Sector_C : public ATM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TM_Sector_C;                        // 0x0780(0x0008)(Transient, DuplicateTransient)
	class UDecalComponent*                        RadiusDecal;                                       // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDecal;                                          // 0x0790(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               RadiusDecalMat;                                    // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TM_Sector(int32 EntryPoint);
	void OnFacetSectorBuilt(float AngleHorizontal, float RadiusMin, float RadiusMax, float HeightMin, float HeightMax);
	void OnTargetingModeConfirm();
	void OnTargetingModeCancel();
	void OnTargetingModeActivate();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TM_Sector_C">();
	}
	static class ATM_Sector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATM_Sector_C>();
	}
};
static_assert(alignof(ATM_Sector_C) == 0x000008, "Wrong alignment on ATM_Sector_C");
static_assert(sizeof(ATM_Sector_C) == 0x0007A0, "Wrong size on ATM_Sector_C");
static_assert(offsetof(ATM_Sector_C, UberGraphFrame_TM_Sector_C) == 0x000780, "Member 'ATM_Sector_C::UberGraphFrame_TM_Sector_C' has a wrong offset!");
static_assert(offsetof(ATM_Sector_C, RadiusDecal) == 0x000788, "Member 'ATM_Sector_C::RadiusDecal' has a wrong offset!");
static_assert(offsetof(ATM_Sector_C, UseDecal) == 0x000790, "Member 'ATM_Sector_C::UseDecal' has a wrong offset!");
static_assert(offsetof(ATM_Sector_C, RadiusDecalMat) == 0x000798, "Member 'ATM_Sector_C::RadiusDecalMat' has a wrong offset!");

}

