#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TM_WardPlacement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TM_WardPlacement.TM_WardPlacement_C.ExecuteUbergraph_TM_WardPlacement
// 0x0038 (0x0038 - 0x0000)
struct TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetFriendlyColorFromMPC_ReturnValue;      // 0x000C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ConfirmAllowed;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement) == 0x000008, "Wrong alignment on TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement");
static_assert(sizeof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement) == 0x000038, "Wrong size on TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement");
static_assert(offsetof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement, EntryPoint) == 0x000000, "Member 'TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement::EntryPoint' has a wrong offset!");
static_assert(offsetof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000004, "Member 'TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement, CallFunc_GetFriendlyColorFromMPC_ReturnValue) == 0x00000C, "Member 'TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement::CallFunc_GetFriendlyColorFromMPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement, K2Node_Event_ConfirmAllowed) == 0x000030, "Member 'TM_WardPlacement_C_ExecuteUbergraph_TM_WardPlacement::K2Node_Event_ConfirmAllowed' has a wrong offset!");

// Function TM_WardPlacement.TM_WardPlacement_C.OnConfirmAllowedChange
// 0x0001 (0x0001 - 0x0000)
struct TM_WardPlacement_C_OnConfirmAllowedChange final
{
public:
	bool                                          ConfirmAllowed;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TM_WardPlacement_C_OnConfirmAllowedChange) == 0x000001, "Wrong alignment on TM_WardPlacement_C_OnConfirmAllowedChange");
static_assert(sizeof(TM_WardPlacement_C_OnConfirmAllowedChange) == 0x000001, "Wrong size on TM_WardPlacement_C_OnConfirmAllowedChange");
static_assert(offsetof(TM_WardPlacement_C_OnConfirmAllowedChange, ConfirmAllowed) == 0x000000, "Member 'TM_WardPlacement_C_OnConfirmAllowedChange::ConfirmAllowed' has a wrong offset!");

// Function TM_WardPlacement.TM_WardPlacement_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TM_WardPlacement_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TM_WardPlacement_C_ReceiveTick) == 0x000004, "Wrong alignment on TM_WardPlacement_C_ReceiveTick");
static_assert(sizeof(TM_WardPlacement_C_ReceiveTick) == 0x000004, "Wrong size on TM_WardPlacement_C_ReceiveTick");
static_assert(offsetof(TM_WardPlacement_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'TM_WardPlacement_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

