#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ui_StylizedDivider_Hor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StylizedDivider_Hor_ArrowDir_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ui_StylizedDivider_Hor.ui_StylizedDivider_Hor_C
// 0x0028 (0x0228 - 0x0200)
class UUi_StylizedDivider_Hor_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0200(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ImageArrow;                                        // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxRoot;                                       // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerArrowSetting;                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Minimum_Width;                                     // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EStylizedDivider_Hor_ArrowDir                 Arrow_Direction;                                   // 0x0224(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ui_StylizedDivider_Hor(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ui_StylizedDivider_Hor_C">();
	}
	static class UUi_StylizedDivider_Hor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUi_StylizedDivider_Hor_C>();
	}
};
static_assert(alignof(UUi_StylizedDivider_Hor_C) == 0x000008, "Wrong alignment on UUi_StylizedDivider_Hor_C");
static_assert(sizeof(UUi_StylizedDivider_Hor_C) == 0x000228, "Wrong size on UUi_StylizedDivider_Hor_C");
static_assert(offsetof(UUi_StylizedDivider_Hor_C, UberGraphFrame) == 0x000200, "Member 'UUi_StylizedDivider_Hor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUi_StylizedDivider_Hor_C, ImageArrow) == 0x000208, "Member 'UUi_StylizedDivider_Hor_C::ImageArrow' has a wrong offset!");
static_assert(offsetof(UUi_StylizedDivider_Hor_C, SizeBoxRoot) == 0x000210, "Member 'UUi_StylizedDivider_Hor_C::SizeBoxRoot' has a wrong offset!");
static_assert(offsetof(UUi_StylizedDivider_Hor_C, SpacerArrowSetting) == 0x000218, "Member 'UUi_StylizedDivider_Hor_C::SpacerArrowSetting' has a wrong offset!");
static_assert(offsetof(UUi_StylizedDivider_Hor_C, Minimum_Width) == 0x000220, "Member 'UUi_StylizedDivider_Hor_C::Minimum_Width' has a wrong offset!");
static_assert(offsetof(UUi_StylizedDivider_Hor_C, Arrow_Direction) == 0x000224, "Member 'UUi_StylizedDivider_Hor_C::Arrow_Direction' has a wrong offset!");

}

