#pragma once

/**
 * Name: Paragon
 * Version: v30
 */

#include "../SDK.h"

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function OrionGame.OrionXPSet.OnRep_CurrentLevel
	 */
	struct UOrionXPSet_OnRep_CurrentLevel_Params
	{	};

	/**
	 * Function OrionGame.OrionGameMode_MOBA.ReceivePlayerSpawned
	 */
	struct AOrionGameMode_MOBA_ReceivePlayerSpawned_Params
	{
	public:
		unsigned char                                              Team;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameMode_MOBA.ReceivePlayerKillStreakShutdown
	 */
	struct AOrionGameMode_MOBA_ReceivePlayerKillStreakShutdown_Params
	{
	public:
		int32_t                                                    KillStreakCount;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameMode_MOBA.ReceivePlayerKilled
	 */
	struct AOrionGameMode_MOBA_ReceivePlayerKilled_Params
	{
	public:
		int32_t                                                    MultiKillCount;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    KillStreakCount;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameMode_MOBA.IsMatchTimeBased
	 */
	struct AOrionGameMode_MOBA_IsMatchTimeBased_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameMode_MOBA.IsMatchObjectiveCompleted
	 */
	struct AOrionGameMode_MOBA_IsMatchObjectiveCompleted_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameMode_MOBA.GetWinningTeamNum
	 */
	struct AOrionGameMode_MOBA_GetWinningTeamNum_Params
	{
	public:
		unsigned char                                              ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameMode_MOBA.ForceMatchWinCondition
	 */
	struct AOrionGameMode_MOBA_ForceMatchWinCondition_Params
	{
	public:
		unsigned char                                              TeamNum;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameUserSettings.TriggerRenderingBenchmark
	 */
	struct UOrionGameUserSettings_TriggerRenderingBenchmark_Params
	{	};

	/**
	 * Function OrionGame.OrionGameUserSettings.SetOrionGameplayQuality
	 */
	struct UOrionGameUserSettings_SetOrionGameplayQuality_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameUserSettings.SetMenuFrameRateLimit
	 */
	struct UOrionGameUserSettings_SetMenuFrameRateLimit_Params
	{
	public:
		float                                                      NewLimit;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameUserSettings.SetForceAutomaticSettingsAtStartup
	 */
	struct UOrionGameUserSettings_SetForceAutomaticSettingsAtStartup_Params
	{
	public:
		bool                                                       bShouldForceSettings;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameUserSettings.IsRunningOnUnsupportedGraphicsCard
	 */
	struct UOrionGameUserSettings_IsRunningOnUnsupportedGraphicsCard_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameUserSettings.GetOrionGameUserSettings
	 */
	struct UOrionGameUserSettings_GetOrionGameUserSettings_Params
	{	};

	/**
	 * Function OrionGame.OrionGameUserSettings.GetOrionGameplayQuality
	 */
	struct UOrionGameUserSettings_GetOrionGameplayQuality_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameUserSettings.GetMenuFrameRateLimit
	 */
	struct UOrionGameUserSettings_GetMenuFrameRateLimit_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameUserSettings.GetInitialBenchmarkState
	 */
	struct UOrionGameUserSettings_GetInitialBenchmarkState_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameUserSettings.GetGPUDisplayString
	 */
	struct UOrionGameUserSettings_GetGPUDisplayString_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionGameUserSettings.GetForceAutomaticSettingsAtStartup
	 */
	struct UOrionGameUserSettings_GetForceAutomaticSettingsAtStartup_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction OrionGame.MatchmakingSearchWidgetAnimationRoot.OnHoveredChanged__DelegateSignature
	 */
	struct UMatchmakingSearchWidgetAnimationRoot_OnHoveredChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsHovered;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnShowWidget
	 */
	struct UMatchmakingSearchWidget_OnShowWidget_Params
	{	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnRestoreWidget
	 */
	struct UMatchmakingSearchWidget_OnRestoreWidget_Params
	{	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnReadyCheckTimerWarning
	 */
	struct UMatchmakingSearchWidget_OnReadyCheckTimerWarning_Params
	{	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnReadyCheckReadyClicked
	 */
	struct UMatchmakingSearchWidget_OnReadyCheckReadyClicked_Params
	{	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnReadyCheckNotReadyClicked
	 */
	struct UMatchmakingSearchWidget_OnReadyCheckNotReadyClicked_Params
	{	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnReadyCheck
	 */
	struct UMatchmakingSearchWidget_OnReadyCheck_Params
	{	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnPartyReadyUpClicked
	 */
	struct UMatchmakingSearchWidget_OnPartyReadyUpClicked_Params
	{	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnMinimizeWidget
	 */
	struct UMatchmakingSearchWidget_OnMinimizeWidget_Params
	{	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnHoveredChanged
	 */
	struct UMatchmakingSearchWidget_OnHoveredChanged_Params
	{
	public:
		bool                                                       bIsHovered;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnHideWidget
	 */
	struct UMatchmakingSearchWidget_OnHideWidget_Params
	{	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnFrontEndTabChanged
	 */
	struct UMatchmakingSearchWidget_OnFrontEndTabChanged_Params
	{
	public:
		class FName                                                TabId;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.MatchmakingSearchWidget.OnCancelButtonClicked
	 */
	struct UMatchmakingSearchWidget_OnCancelButtonClicked_Params
	{	};

	/**
	 * Function OrionGame.MessageOfTheDay.ShouldShowMOTD
	 */
	struct UMessageOfTheDay_ShouldShowMOTD_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.MessageOfTheDay.GetMessageOfTheDay
	 */
	struct UMessageOfTheDay_GetMessageOfTheDay_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.UnlockCharacterRotation
	 */
	struct UOrionAbility_UnlockCharacterRotation_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.UnlockCameraRotation
	 */
	struct UOrionAbility_UnlockCameraRotation_Params
	{
	public:
		bool                                                       bResetOnDeath;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.UnBlockMovementInput
	 */
	struct UOrionAbility_UnBlockMovementInput_Params
	{
	public:
		bool                                                       bResetOnDeath;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.TryCombo
	 */
	struct UOrionAbility_TryCombo_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.TravelModeUnblockAbilities
	 */
	struct UOrionAbility_TravelModeUnblockAbilities_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.TravelModeBlockAbilities
	 */
	struct UOrionAbility_TravelModeBlockAbilities_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.TrackActor
	 */
	struct UOrionAbility_TrackActor_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.SnapCharacterRotationToCamera
	 */
	struct UOrionAbility_SnapCharacterRotationToCamera_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.SetReticleVisibility
	 */
	struct UOrionAbility_SetReticleVisibility_Params
	{
	public:
		unsigned char                                              Visibility;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.SetPassiveTargetingMode
	 */
	struct UOrionAbility_SetPassiveTargetingMode_Params
	{
	public:
		int32_t                                                    TargetingModeIndex;                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.SetCameraMode
	 */
	struct UOrionAbility_SetCameraMode_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.MakeGameplayCueParameters
	 */
	struct UOrionAbility_MakeGameplayCueParameters_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.LockCharacterRotation
	 */
	struct UOrionAbility_LockCharacterRotation_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.LockCameraRotation
	 */
	struct UOrionAbility_LockCameraRotation_Params
	{
	public:
		bool                                                       bResetOnDeath;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.K2_SetUseFixedSkeletalBounds
	 */
	struct UOrionAbility_K2_SetUseFixedSkeletalBounds_Params
	{
	public:
		bool                                                       UseFixedSkeletalBounds;                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.K2_ScaleTimeByAttackSpeed
	 */
	struct UOrionAbility_K2_ScaleTimeByAttackSpeed_Params
	{
	public:
		float                                                      BaseTime;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionRemoveUnselectableStatus
	 */
	struct UOrionAbility_K2_OrionRemoveUnselectableStatus_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionRemoveLimboStatus
	 */
	struct UOrionAbility_K2_OrionRemoveLimboStatus_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionRemoveInterruptionImmunity
	 */
	struct UOrionAbility_K2_OrionRemoveInterruptionImmunity_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionRemoveIgnorePawnCollision
	 */
	struct UOrionAbility_K2_OrionRemoveIgnorePawnCollision_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionRemoveGameplayCue
	 */
	struct UOrionAbility_K2_OrionRemoveGameplayCue_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionExecuteGameplayCueWithParams
	 */
	struct UOrionAbility_K2_OrionExecuteGameplayCueWithParams_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionExecuteGameplayCue
	 */
	struct UOrionAbility_K2_OrionExecuteGameplayCue_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionApplyUnselectableStatus
	 */
	struct UOrionAbility_K2_OrionApplyUnselectableStatus_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionApplyLimboStatus
	 */
	struct UOrionAbility_K2_OrionApplyLimboStatus_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionApplyInterruptionImmunity
	 */
	struct UOrionAbility_K2_OrionApplyInterruptionImmunity_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionApplyIgnorePawnCollision
	 */
	struct UOrionAbility_K2_OrionApplyIgnorePawnCollision_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.K2_OrionAddGameplayCue
	 */
	struct UOrionAbility_K2_OrionAddGameplayCue_Params
	{
	public:
		bool                                                       bRemoveOnAbilityEnd;                                     // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.K2_GetTotalAttackTime
	 */
	struct UOrionAbility_K2_GetTotalAttackTime_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.K2_GetRateForAttackSpeedMontage
	 */
	struct UOrionAbility_K2_GetRateForAttackSpeedMontage_Params
	{
	public:
		class FName                                                SectionName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       FillEntireAttackTime;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.K2_GetBestMontageForAttackSpeed
	 */
	struct UOrionAbility_K2_GetBestMontageForAttackSpeed_Params
	{
	public:
		float                                                      OutPlayRate;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.K2_GetAttackSpeedMultiplier
	 */
	struct UOrionAbility_K2_GetAttackSpeedMultiplier_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.IsCharacterFalling
	 */
	struct UOrionAbility_IsCharacterFalling_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.InitFilterAndEffectsContainer
	 */
	struct UOrionAbility_InitFilterAndEffectsContainer_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.InitAndApplyFilterContainerToTargetData
	 */
	struct UOrionAbility_InitAndApplyFilterContainerToTargetData_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.GetTargets
	 */
	struct UOrionAbility_GetTargets_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.GetOrionCharHeroFromActorInfo
	 */
	struct UOrionAbility_GetOrionCharHeroFromActorInfo_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.GetOrionCharFromActorInfo
	 */
	struct UOrionAbility_GetOrionCharFromActorInfo_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.GetOrionCharAIFromActorInfo
	 */
	struct UOrionAbility_GetOrionCharAIFromActorInfo_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.GetMontageForEmote
	 */
	struct UOrionAbility_GetMontageForEmote_Params
	{
	public:
		unsigned char                                              EmoteType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.GetExternalAbilityLevel
	 */
	struct UOrionAbility_GetExternalAbilityLevel_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.GetAbilitiesByTag
	 */
	struct UOrionAbility_GetAbilitiesByTag_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.EndAura
	 */
	struct UOrionAbility_EndAura_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.EnableAbilityQueuing
	 */
	struct UOrionAbility_EnableAbilityQueuing_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.DisableAbilityQueuing
	 */
	struct UOrionAbility_DisableAbilityQueuing_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.ClearCameraMode
	 */
	struct UOrionAbility_ClearCameraMode_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.ChangeActivationGroup
	 */
	struct UOrionAbility_ChangeActivationGroup_Params
	{
	public:
		unsigned char                                              NewGroup;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.CancelCombo
	 */
	struct UOrionAbility_CancelCombo_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.BP_GetCachedGameplayEffeectSpec
	 */
	struct UOrionAbility_BP_GetCachedGameplayEffeectSpec_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.BP_CommitConsumableStack
	 */
	struct UOrionAbility_BP_CommitConsumableStack_Params
	{
	public:
		bool                                                       BroadcastCommitEvent;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.BP_ApplyGameplayEffectToOwner_Cached
	 */
	struct UOrionAbility_BP_ApplyGameplayEffectToOwner_Cached_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility.BlockMovementInput
	 */
	struct UOrionAbility_BlockMovementInput_Params
	{
	public:
		bool                                                       bResetOnDeath;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.BeginAura
	 */
	struct UOrionAbility_BeginAura_Params
	{
	public:
		float                                                      Radius;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       EndWhenAbilityEnds;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility.AbilityHasTag
	 */
	struct UOrionAbility_AbilityHasTag_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility_MeleeAttack.ServerMeleeTouch
	 */
	struct UOrionAbility_MeleeAttack_ServerMeleeTouch_Params
	{	};

	/**
	 * Function OrionGame.OrionAbility_MeleeAttack.OnMontageEnded
	 */
	struct UOrionAbility_MeleeAttack_OnMontageEnded_Params
	{
	public:
		bool                                                       bInterrupted;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbility_MeleeAttack.OnMeleeTouch
	 */
	struct UOrionAbility_MeleeAttack_OnMeleeTouch_Params
	{
	public:
		int32_t                                                    OtherBodyIndex;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bFromSweep;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityAITask_ExecuteGameplayAbility.K2_SetUp
	 */
	struct UOrionAbilityAITask_ExecuteGameplayAbility_K2_SetUp_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityAITask_ExecuteGameplayAbility.AIExecuteGameplayAbilityByTag
	 */
	struct UOrionAbilityAITask_ExecuteGameplayAbility_AIExecuteGameplayAbilityByTag_Params
	{
	public:
		bool                                                       bWaitForAbilityEnd;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityAITask_ExecuteGameplayAbility.AIExecuteGameplayAbilityByHandle
	 */
	struct UOrionAbilityAITask_ExecuteGameplayAbility_AIExecuteGameplayAbilityByHandle_Params
	{
	public:
		bool                                                       bWaitForAbilityEnd;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityAITask_ExecuteGameplayAbility.AIExecuteGameplayAbilityByClass
	 */
	struct UOrionAbilityAITask_ExecuteGameplayAbility_AIExecuteGameplayAbilityByClass_Params
	{
	public:
		bool                                                       bWaitForAbilityEnd;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityAITask_ExecuteGameplayAbility.AIExecuteAvailableGameplayAbility
	 */
	struct UOrionAbilityAITask_ExecuteGameplayAbility_AIExecuteAvailableGameplayAbility_Params
	{
	public:
		bool                                                       bWaitForAbilityEnd;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_AddPlayerScoreListener.CreateAddPlayerScoreListenerTask
	 */
	struct UOrionAbilityTask_AddPlayerScoreListener_CreateAddPlayerScoreListenerTask_Params
	{
	public:
		class FName                                                ListenerName;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_DirectedMovement.DirectedMovementToLocation
	 */
	struct UOrionAbilityTask_DirectedMovement_DirectedMovementToLocation_Params
	{
	public:
		unsigned char                                              MovementSpaceType;                                       // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      MovementDuration;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      CloseEnoughDistance;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ModifyZ;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_DirectedMovement.DirectedMovementToComponent
	 */
	struct UOrionAbilityTask_DirectedMovement_DirectedMovementToComponent_Params
	{
	public:
		float                                                      MaxMovementDistance;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      MovementDuration;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      IdealDistance;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ModifyZ;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_DirectedMovement.DirectedMovementToActor
	 */
	struct UOrionAbilityTask_DirectedMovement_DirectedMovementToActor_Params
	{
	public:
		float                                                      MaxMovementDistance;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      MovementDuration;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      IdealDistance;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ModifyZ;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_DirectedMovement.DirectedMovement
	 */
	struct UOrionAbilityTask_DirectedMovement_DirectedMovement_Params
	{
	public:
		unsigned char                                              MovementSpaceType;                                       // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      MovementDistance;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      MovementDuration;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      IdealDistance;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ModifyZ;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_InstantTargetData.HitScanTube
	 */
	struct UOrionAbilityTask_InstantTargetData_HitScanTube_Params
	{
	public:
		float                                                      Range;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      BlockingRadius;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      OverlapRadius;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bMultiHit;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bDebug;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAnimInstance.TryGetOrionChar
	 */
	struct UOrionAnimInstance_TryGetOrionChar_Params
	{	};

	/**
	 * Function OrionGame.OrionAnimInstance.ShouldRateLimitBlueprintTicks
	 */
	struct UOrionAnimInstance_ShouldRateLimitBlueprintTicks_Params
	{
	public:
		bool                                                       bIsHero;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		float                                                      Amount;                                                  // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAnimInstance.OwnerHasMatchingGameplayTag
	 */
	struct UOrionAnimInstance_OwnerHasMatchingGameplayTag_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAnimInstance.OnHit
	 */
	struct UOrionAnimInstance_OnHit_Params
	{	};

	/**
	 * Function OrionGame.OrionAnimInstance.IsGameplayCueActive
	 */
	struct UOrionAnimInstance_IsGameplayCueActive_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAnimInstance.AnimNotify_RightFootStep
	 */
	struct UOrionAnimInstance_AnimNotify_RightFootStep_Params
	{	};

	/**
	 * Function OrionGame.OrionAnimInstance.AnimNotify_LeftFootStep
	 */
	struct UOrionAnimInstance_AnimNotify_LeftFootStep_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_PlayMontageAndWaitNotifyName.PlayMontageAndWaitNotifyName
	 */
	struct UOrionAbilityTask_PlayMontageAndWaitNotifyName_PlayMontageAndWaitNotifyName_Params
	{
	public:
		class FName                                                TaskInstanceName;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Rate;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                StartSection;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bStopWhenAbilityEnds;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_PlayMontageAndWaitNotifyName.OnNotifyEndReceived
	 */
	struct UOrionAbilityTask_PlayMontageAndWaitNotifyName_OnNotifyEndReceived_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_PlayMontageAndWaitNotifyName.OnNotifyBeginReceived
	 */
	struct UOrionAbilityTask_PlayMontageAndWaitNotifyName_OnNotifyBeginReceived_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_PlayMontageAndWaitNotifyName.OnMontageInterrupted
	 */
	struct UOrionAbilityTask_PlayMontageAndWaitNotifyName_OnMontageInterrupted_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_PlayMontageAndWaitNotifyName.OnMontageEnded
	 */
	struct UOrionAbilityTask_PlayMontageAndWaitNotifyName_OnMontageEnded_Params
	{
	public:
		bool                                                       bInterrupted;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_PlayMontageAndWaitNotifyName.OnMontageBlendingOut
	 */
	struct UOrionAbilityTask_PlayMontageAndWaitNotifyName_OnMontageBlendingOut_Params
	{
	public:
		bool                                                       bInterrupted;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_RepeatedAction.PerformRepeatedAction
	 */
	struct UOrionAbilityTask_RepeatedAction_PerformRepeatedAction_Params
	{
	public:
		float                                                      TimeBetweenActions;                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    TotalActionCount;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnOrionActor.SpawnOrionActorTransform
	 */
	struct UOrionAbilityTask_SpawnOrionActor_SpawnOrionActorTransform_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnOrionActor.SpawnOrionActorTargetData
	 */
	struct UOrionAbilityTask_SpawnOrionActor_SpawnOrionActorTargetData_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnOrionActor.SpawnOrionActor
	 */
	struct UOrionAbilityTask_SpawnOrionActor_SpawnOrionActor_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnOrionActor.FinishSpawningActor
	 */
	struct UOrionAbilityTask_SpawnOrionActor_FinishSpawningActor_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnOrionActor.BeginSpawningActor
	 */
	struct UOrionAbilityTask_SpawnOrionActor_BeginSpawningActor_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnProjectile.SpawnProjectile
	 */
	struct UOrionAbilityTask_SpawnProjectile_SpawnProjectile_Params
	{
	public:
		float                                                      PitchOffset;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      YawOffset;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnProjectile.FinishSpawningActor
	 */
	struct UOrionAbilityTask_SpawnProjectile_FinishSpawningActor_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnProjectile.BeginSpawningActor
	 */
	struct UOrionAbilityTask_SpawnProjectile_BeginSpawningActor_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnProjectileMulti.SpawnProjectileMulti
	 */
	struct UOrionAbilityTask_SpawnProjectileMulti_SpawnProjectileMulti_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnProjectileMulti.FinishSpawningActorArray
	 */
	struct UOrionAbilityTask_SpawnProjectileMulti_FinishSpawningActorArray_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnProjectileMulti.BeginSpawningActorArray
	 */
	struct UOrionAbilityTask_SpawnProjectileMulti_BeginSpawningActorArray_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnProjectileMulti_HorizontalSpreadFire.SpawnProjectileMulti_HorizontalSpread
	 */
	struct UOrionAbilityTask_SpawnProjectileMulti_HorizontalSpreadFire_SpawnProjectileMulti_HorizontalSpread_Params
	{
	public:
		int32_t                                                    ProjectileCount;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      PitchRandom;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      PitchOffset;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      YawRange;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      YawOffset;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnProjectileMulti_Cone.SpawnProjectileMulti_Cone
	 */
	struct UOrionAbilityTask_SpawnProjectileMulti_Cone_SpawnProjectileMulti_Cone_Params
	{
	public:
		int32_t                                                    ProjectileCount;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      PitchRandom;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      PitchOffset;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      YawRandom;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      YawOffset;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnRig.SpawnRig
	 */
	struct UOrionAbilityTask_SpawnRig_SpawnRig_Params
	{
	public:
		unsigned char                                              RigTeamNum;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnRig.FinishSpawningActor
	 */
	struct UOrionAbilityTask_SpawnRig_FinishSpawningActor_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnRig.BeginSpawningActor
	 */
	struct UOrionAbilityTask_SpawnRig_BeginSpawningActor_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnWard.SpawnWard
	 */
	struct UOrionAbilityTask_SpawnWard_SpawnWard_Params
	{
	public:
		unsigned char                                              TeamNum;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnWard.FinishSpawningActor
	 */
	struct UOrionAbilityTask_SpawnWard_FinishSpawningActor_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_SpawnWard.BeginSpawningActor
	 */
	struct UOrionAbilityTask_SpawnWard_BeginSpawningActor_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_StartTargeting.StartTargeting
	 */
	struct UOrionAbilityTask_StartTargeting_StartTargeting_Params
	{
	public:
		class FName                                                TaskInstanceName;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ConfirmationType;                                        // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_StartTargeting.ServerForceClientTargetData
	 */
	struct UOrionAbilityTask_StartTargeting_ServerForceClientTargetData_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_StartTargeting.ConfirmOrWait
	 */
	struct UOrionAbilityTask_StartTargeting_ConfirmOrWait_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_StartTargeting.ConfirmOrCancel
	 */
	struct UOrionAbilityTask_StartTargeting_ConfirmOrCancel_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_StartTargeting.CancelImpl
	 */
	struct UOrionAbilityTask_StartTargeting_CancelImpl_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitAbilityLevelUp.WaitThisAbilityLevelUp
	 */
	struct UOrionAbilityTask_WaitAbilityLevelUp_WaitThisAbilityLevelUp_Params
	{
	public:
		bool                                                       OnlyTriggerOnce;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitAbilityLevelUp.WaitAbilityLevelUp
	 */
	struct UOrionAbilityTask_WaitAbilityLevelUp_WaitAbilityLevelUp_Params
	{
	public:
		bool                                                       OnlyTriggerOnce;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitAnyAbilityInput.WaitAnyAbilityInput
	 */
	struct UOrionAbilityTask_WaitAnyAbilityInput_WaitAnyAbilityInput_Params
	{
	public:
		bool                                                       bConsumeInput;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitAnyAbilityInput.OnAnyAbilityInput
	 */
	struct UOrionAbilityTask_WaitAnyAbilityInput_OnAnyAbilityInput_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitForCombo.WaitForCombo
	 */
	struct UOrionAbilityTask_WaitForCombo_WaitForCombo_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitForCombo.SuccessEventCallback
	 */
	struct UOrionAbilityTask_WaitForCombo_SuccessEventCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitForCombo.FailEventCallback
	 */
	struct UOrionAbilityTask_WaitForCombo_FailEventCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitForSpecialAttackRotation.WaitForSpecialAttackRotation
	 */
	struct UOrionAbilityTask_WaitForSpecialAttackRotation_WaitForSpecialAttackRotation_Params
	{
	public:
		unsigned char                                              Mode;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitHeroGameplayTag.WaitHeroGameplayTagRemove
	 */
	struct UOrionAbilityTask_WaitHeroGameplayTag_WaitHeroGameplayTagRemove_Params
	{
	public:
		bool                                                       bAllies;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bEnemies;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bOnlyTriggerOnce;                                        // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitHeroGameplayTag.WaitHeroGameplayTagAdd
	 */
	struct UOrionAbilityTask_WaitHeroGameplayTag_WaitHeroGameplayTagAdd_Params
	{
	public:
		bool                                                       bAllies;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bEnemies;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bOnlyTriggerOnce;                                        // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitInputPress_WithState.WaitInputPress_WithState
	 */
	struct UOrionAbilityTask_WaitInputPress_WithState_WaitInputPress_WithState_Params
	{
	public:
		bool                                                       bTestAlreadyPressed;                                     // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bForceAlreadyPressed;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitInputPress_WithState.OnPressCallback
	 */
	struct UOrionAbilityTask_WaitInputPress_WithState_OnPressCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitKilled.WaitOwnerKilled
	 */
	struct UOrionAbilityTask_WaitKilled_WaitOwnerKilled_Params
	{
	public:
		bool                                                       TriggerOnce;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitKilled.WaitActorKilled
	 */
	struct UOrionAbilityTask_WaitKilled_WaitActorKilled_Params
	{
	public:
		bool                                                       TriggerOnce;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitKilled.OnKilledCallback
	 */
	struct UOrionAbilityTask_WaitKilled_OnKilledCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitLanded.WaitLanded
	 */
	struct UOrionAbilityTask_WaitLanded_WaitLanded_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitLanded.OnLandedCallback
	 */
	struct UOrionAbilityTask_WaitLanded_OnLandedCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitMeleeImpact.OnMeleeImpact
	 */
	struct UOrionAbilityTask_WaitMeleeImpact_OnMeleeImpact_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitMeleeImpact.CreateWaitMovementModeChange
	 */
	struct UOrionAbilityTask_WaitMeleeImpact_CreateWaitMovementModeChange_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitProjectileShutdown.WaitProjectileShutdown
	 */
	struct UOrionAbilityTask_WaitProjectileShutdown_WaitProjectileShutdown_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitProjectileShutdown.OnShutdownCallback
	 */
	struct UOrionAbilityTask_WaitProjectileShutdown_OnShutdownCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitProjectileHitActor.WaitProjectileHitActor
	 */
	struct UOrionAbilityTask_WaitProjectileHitActor_WaitProjectileHitActor_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitProjectileHitActor.OnShutdownCallback
	 */
	struct UOrionAbilityTask_WaitProjectileHitActor_OnShutdownCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitProjectileHitActor.OnHitActorCallback
	 */
	struct UOrionAbilityTask_WaitProjectileHitActor_OnHitActorCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitProjectileStop.WaitProjectileStop
	 */
	struct UOrionAbilityTask_WaitProjectileStop_WaitProjectileStop_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitProjectileStop.OnStopCallback
	 */
	struct UOrionAbilityTask_WaitProjectileStop_OnStopCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitProjectileStop.OnShutdownCallback
	 */
	struct UOrionAbilityTask_WaitProjectileStop_OnShutdownCallback_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitSprintCancel.WaitSprintCancel
	 */
	struct UOrionAbilityTask_WaitSprintCancel_WaitSprintCancel_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitSprintCancel.OnSprintDirectionChanged
	 */
	struct UOrionAbilityTask_WaitSprintCancel_OnSprintDirectionChanged_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitSprintCancel.HandleReplicatedEvent
	 */
	struct UOrionAbilityTask_WaitSprintCancel_HandleReplicatedEvent_Params
	{	};

	/**
	 * Function OrionGame.OrionAbilityTask_WaitTowerTargetAcquired.WaitTowerTargetAcquired
	 */
	struct UOrionAbilityTask_WaitTowerTargetAcquired_WaitTowerTargetAcquired_Params
	{	};

	/**
	 * Function OrionGame.OrionAIController.GetTeamNum
	 */
	struct AOrionAIController_GetTeamNum_Params
	{
	public:
		unsigned char                                              ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAIController.GetOrionChar
	 */
	struct AOrionAIController_GetOrionChar_Params
	{	};

	/**
	 * Function OrionGame.OrionAIController.GetAIFormation
	 */
	struct AOrionAIController_GetAIFormation_Params
	{	};

	/**
	 * Function OrionGame.OrionAIBot.OnCharacterDied
	 */
	struct AOrionAIBot_OnCharacterDied_Params
	{	};

	/**
	 * Function OrionGame.OrionAIBot.K2_SetEnemy
	 */
	struct AOrionAIBot_K2_SetEnemy_Params
	{	};

	/**
	 * Function OrionGame.OrionAIBot.K2_SetAbilityToUse
	 */
	struct AOrionAIBot_K2_SetAbilityToUse_Params
	{	};

	/**
	 * Function OrionGame.OrionAIBot.K2_IsSafeToApproachOffensiveLaneGoal
	 */
	struct AOrionAIBot_K2_IsSafeToApproachOffensiveLaneGoal_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAIBot.K2_IsInsideTurret
	 */
	struct AOrionAIBot_K2_IsInsideTurret_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAIBot.K2_GetPrimaryAttackHandle
	 */
	struct AOrionAIBot_K2_GetPrimaryAttackHandle_Params
	{	};

	/**
	 * Function OrionGame.OrionAIBot.K2_GetEnemySelectionQuery
	 */
	struct AOrionAIBot_K2_GetEnemySelectionQuery_Params
	{	};

	/**
	 * Function OrionGame.OrionAIBot.IsAbilityInRage
	 */
	struct AOrionAIBot_IsAbilityInRage_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAIBot.HasUsableAbilityAgainstCurrentEnemy
	 */
	struct AOrionAIBot_HasUsableAbilityAgainstCurrentEnemy_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAIBot.GetLaneProgress
	 */
	struct AOrionAIBot_GetLaneProgress_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function OrionGame.OrionAIBot.GetCurrentScriptedBehavior
	 */
	struct AOrionAIBot_GetCurrentScriptedBehavior_Params
	{	};

	/**
	 * Function OrionGame.OrionAIBot.CanActivateAbility
	 */
	struct AOrionAIBot_CanActivateAbility_Params
	{
	public:
