#pragma once

/**
 * Name: Paragon
 * Version: v30
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class OrionGame.OrionXPSet
	 * Size -> 0x0090 (FullSize[0x00C0] - InheritedSize[0x0030])
	 */
	class UOrionXPSet : public UOrionAttributeSet
	{
	public:
		unsigned char                                              UnknownData_6QOJ[0x90];                                  // 0x0030(0x0090) MISSED OFFSET (PADDING)

	public:
		void OnRep_CurrentLevel();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionGameMode_MOBA
	 * Size -> 0x02C8 (FullSize[0x07F0] - InheritedSize[0x0528])
	 */
	class AOrionGameMode_MOBA : public AOrionGameMode_Base
	{
	public:
		unsigned char                                              UnknownData_3Q8H[0x2C8];                                 // 0x0528(0x02C8) MISSED OFFSET (PADDING)

	public:
		void ReceivePlayerSpawned(unsigned char Team);
		void ReceivePlayerKillStreakShutdown(int32_t KillStreakCount);
		void ReceivePlayerKilled(int32_t MultiKillCount, int32_t KillStreakCount);
		bool IsMatchTimeBased();
		bool IsMatchObjectiveCompleted();
		unsigned char GetWinningTeamNum();
		void ForceMatchWinCondition(unsigned char TeamNum);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionGameMode_PreGame
	 * Size -> 0x0000 (FullSize[0x0528] - InheritedSize[0x0528])
	 */
	class AOrionGameMode_PreGame : public AOrionGameMode_Base
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.GameSessionCommon
	 * Size -> 0x01F8 (FullSize[0x0590] - InheritedSize[0x0398])
	 */
	class AGameSessionCommon : public AGameSession
	{
	public:
		unsigned char                                              UnknownData_L1A4[0x1F8];                                 // 0x0398(0x01F8) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionGameSession
	 * Size -> 0x0040 (FullSize[0x05D0] - InheritedSize[0x0590])
	 */
	class AOrionGameSession : public AGameSessionCommon
	{
	public:
		unsigned char                                              UnknownData_0EU7[0x40];                                  // 0x0590(0x0040) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.GameUserSettingsCommon
	 * Size -> 0x0028 (FullSize[0x0130] - InheritedSize[0x0108])
	 */
	class UGameUserSettingsCommon : public UGameUserSettings
	{
	public:
		unsigned char                                              UnknownData_4YI7[0x28];                                  // 0x0108(0x0028) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionGameUserSettings
	 * Size -> 0x00F0 (FullSize[0x0220] - InheritedSize[0x0130])
	 */
	class UOrionGameUserSettings : public UGameUserSettingsCommon
	{
	public:
		unsigned char                                              UnknownData_02YP[0xF0];                                  // 0x0130(0x00F0) MISSED OFFSET (PADDING)

	public:
		void TriggerRenderingBenchmark();
		void SetOrionGameplayQuality(int32_t Value);
		void SetMenuFrameRateLimit(float NewLimit);
		void SetForceAutomaticSettingsAtStartup(bool bShouldForceSettings);
		bool STATIC_IsRunningOnUnsupportedGraphicsCard();
		void STATIC_GetOrionGameUserSettings();
		int32_t GetOrionGameplayQuality();
		float GetMenuFrameRateLimit();
		int32_t GetInitialBenchmarkState();
		class FText GetGPUDisplayString();
		bool GetForceAutomaticSettingsAtStartup();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.GenericRecord
	 * Size -> 0x0020 (FullSize[0x0048] - InheritedSize[0x0028])
	 */
	class UGenericRecord : public UObject
	{
	public:
		unsigned char                                              UnknownData_JRIJ[0x20];                                  // 0x0028(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.ClientSettingsRecord
	 * Size -> 0x01C8 (FullSize[0x0210] - InheritedSize[0x0048])
	 */
	class UClientSettingsRecord : public UGenericRecord
	{
	public:
		unsigned char                                              UnknownData_AINN[0x1C8];                                 // 0x0048(0x01C8) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionClientSettingsRecord
	 * Size -> 0x0020 (FullSize[0x0230] - InheritedSize[0x0210])
	 */
	class UOrionClientSettingsRecord : public UClientSettingsRecord
	{
	public:
		unsigned char                                              UnknownData_U5BM[0x20];                                  // 0x0210(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.GraphicsCardInfoDB
	 * Size -> 0x0070 (FullSize[0x00A8] - InheritedSize[0x0038])
	 */
	class UGraphicsCardInfoDB : public UDeveloperSettings
	{
	public:
		unsigned char                                              UnknownData_35F6[0x70];                                  // 0x0038(0x0070) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.HoverDroneMovementComponent
	 * Size -> 0x00C8 (FullSize[0x0238] - InheritedSize[0x0170])
	 */
	class UHoverDroneMovementComponent : public USpectatorPawnMovement
	{
	public:
		unsigned char                                              UnknownData_T89B[0xC8];                                  // 0x0170(0x00C8) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.InfluenceMapRenderingComponent
	 * Size -> 0x0000 (FullSize[0x05F0] - InheritedSize[0x05F0])
	 */
	class UInfluenceMapRenderingComponent : public UPrimitiveComponent
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.InputSwitcher
	 * Size -> 0x0028 (FullSize[0x0140] - InheritedSize[0x0118])
	 */
	class UInputSwitcher : public UWidget
	{
	public:
		unsigned char                                              UnknownData_8E98[0x28];                                  // 0x0118(0x0028) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.LocalPlayerCommon
	 * Size -> 0x0190 (FullSize[0x0320] - InheritedSize[0x0190])
	 */
	class ULocalPlayerCommon : public ULocalPlayer
	{
	public:
		unsigned char                                              UnknownData_NUHN[0x190];                                 // 0x0190(0x0190) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionLocalPlayer
	 * Size -> 0x0660 (FullSize[0x0980] - InheritedSize[0x0320])
	 */
	class UOrionLocalPlayer : public ULocalPlayerCommon
	{
	public:
		unsigned char                                              UnknownData_FTJC[0x660];                                 // 0x0320(0x0660) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.MatchmakingSearchWidgetAnimationRoot
	 * Size -> 0x0020 (FullSize[0x0258] - InheritedSize[0x0238])
	 */
	class UMatchmakingSearchWidgetAnimationRoot : public UUserWidget
	{
	public:
		unsigned char                                              UnknownData_L5TS[0x20];                                  // 0x0238(0x0020) MISSED OFFSET (PADDING)

	public:
		void OnHoveredChanged__DelegateSignature(bool bIsHovered);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.MatchmakingSearchWidget
	 * Size -> 0x0438 (FullSize[0x06E0] - InheritedSize[0x02A8])
	 */
	class UMatchmakingSearchWidget : public UOrionUserWidgetBase
	{
	public:
		unsigned char                                              UnknownData_HPBX[0x438];                                 // 0x02A8(0x0438) MISSED OFFSET (PADDING)

	public:
		void OnShowWidget();
		void OnRestoreWidget();
		void OnReadyCheckTimerWarning();
		void OnReadyCheckReadyClicked();
		void OnReadyCheckNotReadyClicked();
		void OnReadyCheck();
		void OnPartyReadyUpClicked();
		void OnMinimizeWidget();
		void OnHoveredChanged(bool bIsHovered);
		void OnHideWidget();
		void OnFrontEndTabChanged(const class FName& TabId);
		void OnCancelButtonClicked();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.MessageOfTheDay
	 * Size -> 0x0060 (FullSize[0x0088] - InheritedSize[0x0028])
	 */
	class UMessageOfTheDay : public UObject
	{
	public:
		unsigned char                                              UnknownData_2GHS[0x60];                                  // 0x0028(0x0060) MISSED OFFSET (PADDING)

	public:
		bool ShouldShowMOTD();
		void STATIC_GetMessageOfTheDay();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionOnlineAccount
	 * Size -> 0x0000 (FullSize[0x0700] - InheritedSize[0x0700])
	 */
	class UOrionOnlineAccount : public UOnlineAccountCommon
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OnlineSessionClientCommon
	 * Size -> 0x0000 (FullSize[0x0270] - InheritedSize[0x0270])
	 */
	class UOnlineSessionClientCommon : public UOnlineSessionClient
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionOnlineSessionClient
	 * Size -> 0x0100 (FullSize[0x0370] - InheritedSize[0x0270])
	 */
	class UOrionOnlineSessionClient : public UOnlineSessionClientCommon
	{
	public:
		unsigned char                                              UnknownData_ULYS[0x100];                                 // 0x0270(0x0100) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAuraManager
	 * Size -> 0x0040 (FullSize[0x03C0] - InheritedSize[0x0380])
	 */
	class AOrionAuraManager : public AActor
	{
	public:
		unsigned char                                              UnknownData_KMIQ[0x40];                                  // 0x0380(0x0040) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbility
	 * Size -> 0x0470 (FullSize[0x09F0] - InheritedSize[0x0580])
	 */
	class UOrionAbility : public UGameplayAbility
	{
	public:
		unsigned char                                              UnknownData_O3JM[0x470];                                 // 0x0580(0x0470) MISSED OFFSET (PADDING)

	public:
		void UnlockCharacterRotation();
		void UnlockCameraRotation(bool bResetOnDeath);
		void UnBlockMovementInput(bool bResetOnDeath);
		void TryCombo();
		void TravelModeUnblockAbilities();
		void TravelModeBlockAbilities();
		void TrackActor();
		void SnapCharacterRotationToCamera();
		void SetReticleVisibility(unsigned char Visibility);
		void SetPassiveTargetingMode(int32_t TargetingModeIndex);
		void SetCameraMode();
		void MakeGameplayCueParameters();
		void LockCharacterRotation();
		void LockCameraRotation(bool bResetOnDeath);
		void K2_SetUseFixedSkeletalBounds(bool UseFixedSkeletalBounds);
		float K2_ScaleTimeByAttackSpeed(float BaseTime);
		void K2_OrionRemoveUnselectableStatus();
		void K2_OrionRemoveLimboStatus();
		void K2_OrionRemoveInterruptionImmunity();
		void K2_OrionRemoveIgnorePawnCollision();
		void K2_OrionRemoveGameplayCue();
		void K2_OrionExecuteGameplayCueWithParams();
		void K2_OrionExecuteGameplayCue();
		void K2_OrionApplyUnselectableStatus();
		void K2_OrionApplyLimboStatus();
		void K2_OrionApplyInterruptionImmunity();
		void K2_OrionApplyIgnorePawnCollision();
		void K2_OrionAddGameplayCue(bool bRemoveOnAbilityEnd);
		float K2_GetTotalAttackTime();
		float K2_GetRateForAttackSpeedMontage(const class FName& SectionName, bool FillEntireAttackTime);
		void K2_GetBestMontageForAttackSpeed(float* OutPlayRate);
		float K2_GetAttackSpeedMultiplier();
		bool IsCharacterFalling();
		void InitFilterAndEffectsContainer();
		void InitAndApplyFilterContainerToTargetData();
		void GetTargets();
		void GetOrionCharHeroFromActorInfo();
		void GetOrionCharFromActorInfo();
		void GetOrionCharAIFromActorInfo();
		void GetMontageForEmote(unsigned char EmoteType);
		int32_t GetExternalAbilityLevel();
		void GetAbilitiesByTag();
		void EndAura();
		void EnableAbilityQueuing();
		void DisableAbilityQueuing();
		void ClearCameraMode();
		void ChangeActivationGroup(unsigned char NewGroup);
		void CancelCombo();
		void BP_GetCachedGameplayEffeectSpec();
		void BP_CommitConsumableStack(bool BroadcastCommitEvent);
		void BP_ApplyGameplayEffectToOwner_Cached();
		void BlockMovementInput(bool bResetOnDeath);
		void BeginAura(float Radius, bool EndWhenAbilityEnds);
		bool AbilityHasTag();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbility_CharacterJump
	 * Size -> 0x0000 (FullSize[0x09F0] - InheritedSize[0x09F0])
	 */
	class UOrionAbility_CharacterJump : public UOrionAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbility_MeleeAttack
	 * Size -> 0x0100 (FullSize[0x0AF0] - InheritedSize[0x09F0])
	 */
	class UOrionAbility_MeleeAttack : public UOrionAbility
	{
	public:
		unsigned char                                              UnknownData_OKA0[0x100];                                 // 0x09F0(0x0100) MISSED OFFSET (PADDING)

	public:
		void ServerMeleeTouch();
		void OnMontageEnded(bool bInterrupted);
		void OnMeleeTouch(int32_t OtherBodyIndex, bool bFromSweep);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbility_Sprint
	 * Size -> 0x0000 (FullSize[0x09F0] - InheritedSize[0x09F0])
	 */
	class UOrionAbility_Sprint : public UOrionAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityAITask_ExecuteGameplayAbility
	 * Size -> 0x00A0 (FullSize[0x0110] - InheritedSize[0x0070])
	 */
	class UOrionAbilityAITask_ExecuteGameplayAbility : public UAITask
	{
	public:
		unsigned char                                              UnknownData_DI1J[0xA0];                                  // 0x0070(0x00A0) MISSED OFFSET (PADDING)

	public:
		void K2_SetUp();
		void STATIC_AIExecuteGameplayAbilityByTag(bool bWaitForAbilityEnd);
		void STATIC_AIExecuteGameplayAbilityByHandle(bool bWaitForAbilityEnd);
		void STATIC_AIExecuteGameplayAbilityByClass(bool bWaitForAbilityEnd);
		void STATIC_AIExecuteAvailableGameplayAbility(bool bWaitForAbilityEnd);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilitySystemGlobals
	 * Size -> 0x0000 (FullSize[0x01E0] - InheritedSize[0x01E0])
	 */
	class UOrionAbilitySystemGlobals : public UAbilitySystemGlobals
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTargetActor_Beam
	 * Size -> 0x0070 (FullSize[0x05C0] - InheritedSize[0x0550])
	 */
	class AOrionAbilityTargetActor_Beam : public AGameplayAbilityTargetActor
	{
	public:
		unsigned char                                              UnknownData_6LJT[0x70];                                  // 0x0550(0x0070) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTargetActor_SelectMultipleTargets
	 * Size -> 0x0040 (FullSize[0x0590] - InheritedSize[0x0550])
	 */
	class AOrionAbilityTargetActor_SelectMultipleTargets : public AGameplayAbilityTargetActor
	{
	public:
		unsigned char                                              UnknownData_U56Y[0x40];                                  // 0x0550(0x0040) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTargetActor_SelectSingleTarget
	 * Size -> 0x0030 (FullSize[0x0580] - InheritedSize[0x0550])
	 */
	class AOrionAbilityTargetActor_SelectSingleTarget : public AGameplayAbilityTargetActor
	{
	public:
		unsigned char                                              UnknownData_SBZP[0x30];                                  // 0x0550(0x0030) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTargetActor_SelectTargets
	 * Size -> 0x0040 (FullSize[0x0590] - InheritedSize[0x0550])
	 */
	class AOrionAbilityTargetActor_SelectTargets : public AGameplayAbilityTargetActor
	{
	public:
		unsigned char                                              UnknownData_IMSX[0x40];                                  // 0x0550(0x0040) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTargetActor_WellSelector
	 * Size -> 0x0000 (FullSize[0x0550] - InheritedSize[0x0550])
	 */
	class AOrionAbilityTargetActor_WellSelector : public AGameplayAbilityTargetActor
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_AddPlayerScoreListener
	 * Size -> 0x0140 (FullSize[0x01C0] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_AddPlayerScoreListener : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_N5M0[0x140];                                 // 0x0080(0x0140) MISSED OFFSET (PADDING)

	public:
		void STATIC_CreateAddPlayerScoreListenerTask(const class FName& ListenerName);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_DirectedMovement
	 * Size -> 0x0060 (FullSize[0x00E0] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_DirectedMovement : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_62OU[0x60];                                  // 0x0080(0x0060) MISSED OFFSET (PADDING)

	public:
		void STATIC_DirectedMovementToLocation(unsigned char MovementSpaceType, float MovementDuration, float CloseEnoughDistance, bool ModifyZ);
		void STATIC_DirectedMovementToComponent(float MaxMovementDistance, float MovementDuration, float IdealDistance, bool ModifyZ);
		void STATIC_DirectedMovementToActor(float MaxMovementDistance, float MovementDuration, float IdealDistance, bool ModifyZ);
		void STATIC_DirectedMovement(unsigned char MovementSpaceType, float MovementDistance, float MovementDuration, float IdealDistance, bool ModifyZ);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_InstantTargetData
	 * Size -> 0x0030 (FullSize[0x00F0] - InheritedSize[0x00C0])
	 */
	class UOrionAbilityTask_InstantTargetData : public UAbilityTask_WaitTargetData
	{
	public:
		unsigned char                                              UnknownData_R0LH[0x30];                                  // 0x00C0(0x0030) MISSED OFFSET (PADDING)

	public:
		void STATIC_HitScanTube(float Range, float BlockingRadius, float OverlapRadius, bool bMultiHit, bool bDebug);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAnimTypes
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UOrionAnimTypes : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAnimInstance
	 * Size -> 0x0030 (FullSize[0x04A8] - InheritedSize[0x0478])
	 */
	class UOrionAnimInstance : public UAnimInstance
	{
	public:
		unsigned char                                              UnknownData_X2GZ[0x30];                                  // 0x0478(0x0030) MISSED OFFSET (PADDING)

	public:
		void TryGetOrionChar();
		bool STATIC_ShouldRateLimitBlueprintTicks(bool bIsHero, float* Amount);
		bool OwnerHasMatchingGameplayTag();
		void OnHit();
		bool IsGameplayCueActive();
		void AnimNotify_RightFootStep();
		void AnimNotify_LeftFootStep();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_PlayMontageAndWaitNotifyName
	 * Size -> 0x0110 (FullSize[0x0190] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_PlayMontageAndWaitNotifyName : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_ZU4O[0x110];                                 // 0x0080(0x0110) MISSED OFFSET (PADDING)

	public:
		void STATIC_PlayMontageAndWaitNotifyName(const class FName& TaskInstanceName, float Rate, const class FName& StartSection, bool bStopWhenAbilityEnds);
		void OnNotifyEndReceived(const class FName& NotifyName);
		void OnNotifyBeginReceived(const class FName& NotifyName);
		void OnMontageInterrupted();
		void OnMontageEnded(bool bInterrupted);
		void OnMontageBlendingOut(bool bInterrupted);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_RepeatedAction
	 * Size -> 0x0038 (FullSize[0x00B8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_RepeatedAction : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_CWAE[0x38];                                  // 0x0080(0x0038) MISSED OFFSET (PADDING)

	public:
		void STATIC_PerformRepeatedAction(float TimeBetweenActions, int32_t TotalActionCount);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_SpawnOrionActor
	 * Size -> 0x0080 (FullSize[0x0100] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_SpawnOrionActor : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_QSHY[0x80];                                  // 0x0080(0x0080) MISSED OFFSET (PADDING)

	public:
		void STATIC_SpawnOrionActorTransform();
		void STATIC_SpawnOrionActorTargetData();
		void STATIC_SpawnOrionActor();
		void FinishSpawningActor();
		bool BeginSpawningActor();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_SpawnProjectile
	 * Size -> 0x0068 (FullSize[0x00E8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_SpawnProjectile : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_QE7D[0x68];                                  // 0x0080(0x0068) MISSED OFFSET (PADDING)

	public:
		void STATIC_SpawnProjectile(float PitchOffset, float YawOffset);
		void FinishSpawningActor();
		bool BeginSpawningActor();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_SpawnProjectileMulti
	 * Size -> 0x0058 (FullSize[0x00D8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_SpawnProjectileMulti : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_FH4M[0x58];                                  // 0x0080(0x0058) MISSED OFFSET (PADDING)

	public:
		void STATIC_SpawnProjectileMulti();
		void FinishSpawningActorArray();
		bool BeginSpawningActorArray();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_SpawnProjectileMulti_HorizontalSpreadFire
	 * Size -> 0x0030 (FullSize[0x0108] - InheritedSize[0x00D8])
	 */
	class UOrionAbilityTask_SpawnProjectileMulti_HorizontalSpreadFire : public UOrionAbilityTask_SpawnProjectileMulti
	{
	public:
		unsigned char                                              UnknownData_MJ49[0x30];                                  // 0x00D8(0x0030) MISSED OFFSET (PADDING)

	public:
		void STATIC_SpawnProjectileMulti_HorizontalSpread(int32_t ProjectileCount, float PitchRandom, float PitchOffset, float YawRange, float YawOffset);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_SpawnProjectileMulti_Cone
	 * Size -> 0x0030 (FullSize[0x0108] - InheritedSize[0x00D8])
	 */
	class UOrionAbilityTask_SpawnProjectileMulti_Cone : public UOrionAbilityTask_SpawnProjectileMulti
	{
	public:
		unsigned char                                              UnknownData_CJ4J[0x30];                                  // 0x00D8(0x0030) MISSED OFFSET (PADDING)

	public:
		void STATIC_SpawnProjectileMulti_Cone(int32_t ProjectileCount, float PitchRandom, float PitchOffset, float YawRandom, float YawOffset);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_SpawnRig
	 * Size -> 0x0058 (FullSize[0x00D8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_SpawnRig : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_CFMS[0x58];                                  // 0x0080(0x0058) MISSED OFFSET (PADDING)

	public:
		void STATIC_SpawnRig(unsigned char RigTeamNum);
		void FinishSpawningActor();
		bool BeginSpawningActor();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_SpawnWard
	 * Size -> 0x0058 (FullSize[0x00D8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_SpawnWard : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_WL2T[0x58];                                  // 0x0080(0x0058) MISSED OFFSET (PADDING)

	public:
		void STATIC_SpawnWard(unsigned char TeamNum);
		void FinishSpawningActor();
		bool BeginSpawningActor();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_StartTargeting
	 * Size -> 0x0038 (FullSize[0x00B8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_StartTargeting : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_SQT6[0x38];                                  // 0x0080(0x0038) MISSED OFFSET (PADDING)

	public:
		void STATIC_StartTargeting(const class FName& TaskInstanceName, unsigned char ConfirmationType, int32_t Index);
		void ServerForceClientTargetData();
		void ConfirmOrWait();
		void ConfirmOrCancel();
		void CancelImpl();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityAITask_DoTargeting
	 * Size -> 0x0038 (FullSize[0x00F0] - InheritedSize[0x00B8])
	 */
	class UOrionAbilityAITask_DoTargeting : public UOrionAbilityTask_StartTargeting
	{
	public:
		unsigned char                                              UnknownData_HOM0[0x38];                                  // 0x00B8(0x0038) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitAbilityLevelUp
	 * Size -> 0x0030 (FullSize[0x00B0] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitAbilityLevelUp : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_MW3L[0x30];                                  // 0x0080(0x0030) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitThisAbilityLevelUp(bool OnlyTriggerOnce);
		void STATIC_WaitAbilityLevelUp(bool OnlyTriggerOnce);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitAnyAbilityInput
	 * Size -> 0x0068 (FullSize[0x00E8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitAnyAbilityInput : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_IE0Z[0x68];                                  // 0x0080(0x0068) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitAnyAbilityInput(bool bConsumeInput);
		void OnAnyAbilityInput();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitForCombo
	 * Size -> 0x0040 (FullSize[0x00C0] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitForCombo : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_PVG7[0x40];                                  // 0x0080(0x0040) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitForCombo();
		void SuccessEventCallback();
		void FailEventCallback();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitForSpecialAttackRotation
	 * Size -> 0x0028 (FullSize[0x00A8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitForSpecialAttackRotation : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_TAEV[0x28];                                  // 0x0080(0x0028) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitForSpecialAttackRotation(unsigned char Mode);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitHeroGameplayTag
	 * Size -> 0x0028 (FullSize[0x00A8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitHeroGameplayTag : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_7GT6[0x28];                                  // 0x0080(0x0028) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitHeroGameplayTagRemove(bool bAllies, bool bEnemies, bool bOnlyTriggerOnce);
		void STATIC_WaitHeroGameplayTagAdd(bool bAllies, bool bEnemies, bool bOnlyTriggerOnce);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitInputPress_WithState
	 * Size -> 0x0020 (FullSize[0x00A0] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitInputPress_WithState : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_B889[0x20];                                  // 0x0080(0x0020) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitInputPress_WithState(bool bTestAlreadyPressed, bool bForceAlreadyPressed);
		void OnPressCallback();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitKilled
	 * Size -> 0x00A8 (FullSize[0x0128] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitKilled : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_BCOD[0xA8];                                  // 0x0080(0x00A8) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitOwnerKilled(bool TriggerOnce);
		void STATIC_WaitActorKilled(bool TriggerOnce);
		void OnKilledCallback();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitLanded
	 * Size -> 0x0018 (FullSize[0x0098] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitLanded : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_D1WN[0x18];                                  // 0x0080(0x0018) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitLanded();
		void OnLandedCallback();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitMeleeImpact
	 * Size -> 0x0020 (FullSize[0x00A0] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitMeleeImpact : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_VW6G[0x20];                                  // 0x0080(0x0020) MISSED OFFSET (PADDING)

	public:
		void OnMeleeImpact();
		void STATIC_CreateWaitMovementModeChange();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitProjectileShutdown
	 * Size -> 0x0018 (FullSize[0x0098] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitProjectileShutdown : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_QWVI[0x18];                                  // 0x0080(0x0018) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitProjectileShutdown();
		void OnShutdownCallback();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitProjectileHitActor
	 * Size -> 0x0028 (FullSize[0x00A8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitProjectileHitActor : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_BHWQ[0x28];                                  // 0x0080(0x0028) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitProjectileHitActor();
		void OnShutdownCallback();
		void OnHitActorCallback();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitProjectileStop
	 * Size -> 0x0028 (FullSize[0x00A8] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitProjectileStop : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_JXP0[0x28];                                  // 0x0080(0x0028) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitProjectileStop();
		void OnStopCallback();
		void OnShutdownCallback();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitSprintCancel
	 * Size -> 0x0020 (FullSize[0x00A0] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitSprintCancel : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_T4EM[0x20];                                  // 0x0080(0x0020) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitSprintCancel();
		void OnSprintDirectionChanged();
		void HandleReplicatedEvent();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAbilityTask_WaitTowerTargetAcquired
	 * Size -> 0x0010 (FullSize[0x0090] - InheritedSize[0x0080])
	 */
	class UOrionAbilityTask_WaitTowerTargetAcquired : public UAbilityTask
	{
	public:
		unsigned char                                              UnknownData_CBKK[0x10];                                  // 0x0080(0x0010) MISSED OFFSET (PADDING)

	public:
		void STATIC_WaitTowerTargetAcquired();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAICommander
	 * Size -> 0x01E0 (FullSize[0x0208] - InheritedSize[0x0028])
	 */
	class UOrionAICommander : public UObject
	{
	public:
		unsigned char                                              BotTeams[0x170];                                         // 0x0000(0x0170) UNKNOWN PROPERTY: StructProperty OrionGame.OrionAICommander.BotTeams
		unsigned char                                              UnknownData_95UC[0x98];                                  // 0x0170(0x0098) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIController
	 * Size -> 0x0040 (FullSize[0x04B8] - InheritedSize[0x0478])
	 */
	class AOrionAIController : public AAIController
	{
	public:
		unsigned char                                              UnknownData_XIN6[0x40];                                  // 0x0478(0x0040) MISSED OFFSET (PADDING)

	public:
		unsigned char GetTeamNum();
		void GetOrionChar();
		void GetAIFormation();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIBot
	 * Size -> 0x0428 (FullSize[0x08E0] - InheritedSize[0x04B8])
	 */
	class AOrionAIBot : public AOrionAIController
	{
	public:
		unsigned char                                              UnknownData_VSGL[0x428];                                 // 0x04B8(0x0428) MISSED OFFSET (PADDING)

	public:
		void OnCharacterDied();
		void K2_SetEnemy();
		void K2_SetAbilityToUse();
		bool K2_IsSafeToApproachOffensiveLaneGoal();
		bool K2_IsInsideTurret();
		void K2_GetPrimaryAttackHandle();
		void K2_GetEnemySelectionQuery();
		bool IsAbilityInRage();
		bool HasUsableAbilityAgainstCurrentEnemy();
		float GetLaneProgress();
		void GetCurrentScriptedBehavior();
		bool CanActivateAbility(bool bRequirePerfectMatch);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIBot_Babysitter
	 * Size -> 0x0000 (FullSize[0x08E0] - InheritedSize[0x08E0])
	 */
	class AOrionAIBot_Babysitter : public AOrionAIBot
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIController_MinionBase
	 * Size -> 0x0020 (FullSize[0x04D8] - InheritedSize[0x04B8])
	 */
	class AOrionAIController_MinionBase : public AOrionAIController
	{
	public:
		unsigned char                                              UnknownData_MGGK[0x20];                                  // 0x04B8(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIController_Jungle
	 * Size -> 0x0058 (FullSize[0x0530] - InheritedSize[0x04D8])
	 */
	class AOrionAIController_Jungle : public AOrionAIController_MinionBase
	{
	public:
		unsigned char                                              UnknownData_L44W[0x58];                                  // 0x04D8(0x0058) MISSED OFFSET (PADDING)

	public:
		void GetSpawner();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionCharAI
	 * Size -> 0x0240 (FullSize[0x0C90] - InheritedSize[0x0A50])
	 */
	class AOrionCharAI : public AOrionChar
	{
	public:
		unsigned char                                              UnknownData_URXN[0x240];                                 // 0x0A50(0x0240) MISSED OFFSET (PADDING)

	public:
		void RequestSelfDestruct(float Delay);
		void RequestAnimation(unsigned char Behavior, int32_t PlayIndex, bool bLooping);
		void PlaySpawning();
		void PlayHeroAggroAlert();
		void OnRep_DeathData();
		void OnRep_AIData();
		void Native_DoRangedAttack();
		void Native_DoMeleeAttack();
		void GameplayCue_Damage(unsigned char EventType);
		void CancelAnimation(unsigned char Behavior);
		void ApplyGameplayEffectToSelf(float GameplayEffectLevel);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIMinionAggroManager
	 * Size -> 0x0198 (FullSize[0x01C0] - InheritedSize[0x0028])
	 */
	class UOrionAIMinionAggroManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_T1KF[0x198];                                 // 0x0028(0x0198) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIController_Lane
	 * Size -> 0x0018 (FullSize[0x04F0] - InheritedSize[0x04D8])
	 */
	class AOrionAIController_Lane : public AOrionAIController_MinionBase
	{
	public:
		unsigned char                                              UnknownData_LCPZ[0x18];                                  // 0x04D8(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIDataProvider_CurrentAbility
	 * Size -> 0x0038 (FullSize[0x0078] - InheritedSize[0x0040])
	 */
	class UOrionAIDataProvider_CurrentAbility : public UAIDataProvider_QueryParams
	{
	public:
		unsigned char                                              UnknownData_LHVF[0x38];                                  // 0x0040(0x0038) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIDataProvider_LaneGoal
	 * Size -> 0x0008 (FullSize[0x0048] - InheritedSize[0x0040])
	 */
	class UOrionAIDataProvider_LaneGoal : public UAIDataProvider_QueryParams
	{
	public:
		unsigned char                                              UnknownData_1HP1[0x8];                                   // 0x0040(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIFormation
	 * Size -> 0x0020 (FullSize[0x0048] - InheritedSize[0x0028])
	 */
	class UOrionAIFormation : public UObject
	{
	public:
		unsigned char                                              UnknownData_LN44[0x20];                                  // 0x0028(0x0020) MISSED OFFSET (PADDING)

	public:
		void HandleFormationMemberDeath();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIData
	 * Size -> 0x0050 (FullSize[0x0188] - InheritedSize[0x0138])
	 */
	class UOrionAIData : public UOrionCharacterData
	{
	public:
		unsigned char                                              UnknownData_D82I[0x50];                                  // 0x0138(0x0050) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIFormationData
	 * Size -> 0x0030 (FullSize[0x0058] - InheritedSize[0x0028])
	 */
	class UOrionAIFormationData : public UDataAsset
	{
	public:
		unsigned char                                              UnknownData_VVXQ[0x30];                                  // 0x0028(0x0030) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIKismetLibrary
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UOrionAIKismetLibrary : public UBlueprintFunctionLibrary
	{
	public:
		void STATIC_UpdateInfluenceSurce(unsigned char SourceType, float Radius, float Strength, bool bForceUpdate);
		void STATIC_RemoveInfluenceSource(bool bForceUpdate);
		float STATIC_GetInfluenceValueAt(unsigned char QuerierTeam);
		void STATIC_GetBlackboardValueAsAbilitySpecHandle();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIPerceptionComponent
	 * Size -> 0x0008 (FullSize[0x01A8] - InheritedSize[0x01A0])
	 */
	class UOrionAIPerceptionComponent : public UAIPerceptionComponent
	{
	public:
		unsigned char                                              UnknownData_81RK[0x8];                                   // 0x01A0(0x0008) MISSED OFFSET (PADDING)

	public:
		float GetRecentDamageTakenFromActor();
		float GetCallForHelpRating();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIBotPerceptionComponent
	 * Size -> 0x0000 (FullSize[0x01A8] - InheritedSize[0x01A8])
	 */
	class UOrionAIBotPerceptionComponent : public UOrionAIPerceptionComponent
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIPerceptionSystem
	 * Size -> 0x0008 (FullSize[0x0138] - InheritedSize[0x0130])
	 */
	class UOrionAIPerceptionSystem : public UAIPerceptionSystem
	{
	public:
		unsigned char                                              UnknownData_QBG6[0x8];                                   // 0x0130(0x0008) MISSED OFFSET (PADDING)

	public:
		void HandleCallForHelp();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIResource_AbilityExecution
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UOrionAIResource_AbilityExecution : public UGameplayTaskResource
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAISettings
	 * Size -> 0x0340 (FullSize[0x0378] - InheritedSize[0x0038])
	 */
	class UOrionAISettings : public UDeveloperSettings
	{
	public:
		struct FHealthPercentagetToStartHealing                    DefaultEQSQueries;                                       // 0x0000(0x00E0) Edit, Config, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8BMC[0x298];                                 // 0x00E0(0x0298) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAITask_FlowFieldMove
	 * Size -> 0x0030 (FullSize[0x00A0] - InheritedSize[0x0070])
	 */
	class UOrionAITask_FlowFieldMove : public UAITask
	{
	public:
		unsigned char                                              UnknownData_87LP[0x30];                                  // 0x0070(0x0030) MISSED OFFSET (PADDING)

	public:
		void MoveTaskCompletedSignature__DelegateSignature(unsigned char Result);
		void STATIC_FlowFieldMove(bool bLockAILogic);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAIWaypoint
	 * Size -> 0x0008 (FullSize[0x0388] - InheritedSize[0x0380])
	 */
	class AOrionAIWaypoint : public AActor
	{
	public:
		unsigned char                                              UnknownData_WSVP[0x8];                                   // 0x0380(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionStatManager
	 * Size -> 0x0088 (FullSize[0x00B0] - InheritedSize[0x0028])
	 */
	class UOrionStatManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_6BAZ[0x88];                                  // 0x0028(0x0088) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeartbeatManager
	 * Size -> 0x0058 (FullSize[0x0080] - InheritedSize[0x0028])
	 */
	class UOrionHeartbeatManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_UOAH[0x58];                                  // 0x0028(0x0058) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.TeamCommunicationsActor
	 * Size -> 0x0008 (FullSize[0x03D8] - InheritedSize[0x03D0])
	 */
	class ATeamCommunicationsActor : public AOrionBaseActor
	{
	public:
		unsigned char                                              UnknownData_DARA[0x8];                                   // 0x03D0(0x0008) MISSED OFFSET (PADDING)

	public:
		void StartHidingBeforeDestroy();
		void ShowVisuals(bool bIsOwningPlayer);
		void HideVisualsImmediately();
		void HideVisuals(bool bIsOwningPlayer);
		void HideMiniMapIcon();
		void Blueprint_StartHidingBeforeDestroy(bool bIsOwningPlayer);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.PCTeamCommunicationsData
	 * Size -> 0x0058 (FullSize[0x0080] - InheritedSize[0x0028])
	 */
	class UPCTeamCommunicationsData : public UDataAsset
	{
	public:
		unsigned char                                              UnknownData_8AWU[0x58];                                  // 0x0028(0x0058) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionPlayerController_Game
	 * Size -> 0x0070 (FullSize[0x0BB0] - InheritedSize[0x0B40])
	 */
	class AOrionPlayerController_Game : public AOrionPlayerController_Base
	{
	public:
		unsigned char                                              UnknownData_2V0U[0x70];                                  // 0x0B40(0x0070) MISSED OFFSET (PADDING)

	public:
		void ToggleTeamCommsMenu();
		void ToggleScoreboard();
		void ToggleLargeMinimap();
		void ToggleHUDMouse();
		void ToggleEscapeMenu();
		void ToggleCardMenu();
		void Suicide();
		void SetHealthCheat(float InPercent);
		void ServerTransitionToSpectating();
		void ServerSurrender(bool bSurrender);
		void ServerSuicide();
		void ServerSetIsUsingGamepad(bool bNewIsUsingGamepad);
		void ServerForceStartGame();
		void ScriptAIBehaviorCheat(const class FName& ScriptedBehaviorName);
		void ReportClientHitch(float Duration);
		void ReportBug();
		void OpenUpgradePanel();
		void OpenScoreboard();
		void OnHUDCursorModeToggle();
		void OnHUDCursorModeRelease();
		void OnHUDCursorModePress();
		void STATIC_GetLocationRotationForSpawnActor();
		void STATIC_GetLocationForTeamCommActor(float MaxRange);
		void ExecuteTeamCommData();
		void DisplayGameEventMessage();
		void DestroyTeamCommsActor();
		void CloseUpgradePanel();
		void CloseTeamCommsMenu();
		void CloseScoreboard();
		void CloseCardMenu();
		void ClientWardPing();
		void ClientTransitionToSpectating();
		void ClientSurrender(bool bSurrender, bool bSuccess);
		void ClientStopKillcam();
		void ClientPlayKillcam();
		void ClientMatchHasEnded();
		void ClientHandlePostLogin();
		void ClientHandleMatchIsWaitingToStart();
		void Client_ReceiveTeamComm();
		void CancelAllAbilitiesCheat();
		void CancelAbilityForPawnCheat();
		void ActivateAIAbility(unsigned char InputID);
		void ActivateAbilityForPawnCheat(unsigned char InputID, bool bPressed);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionAnalytics
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UOrionAnalytics : public UBlueprintFunctionLibrary
	{
	public:
		void STATIC_FireEvent_ModifiedSettings();
		void STATIC_FireEvent_InitialLoadComplete();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionCoreBaseAnimInstance
	 * Size -> 0x03E8 (FullSize[0x0890] - InheritedSize[0x04A8])
	 */
	class UOrionCoreBaseAnimInstance : public UOrionAnimInstance
	{
	public:
		unsigned char                                              UnknownData_40EP[0x3E8];                                 // 0x04A8(0x03E8) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionCoreRingsAnimInstance
	 * Size -> 0x0020 (FullSize[0x04C8] - InheritedSize[0x04A8])
	 */
	class UOrionCoreRingsAnimInstance : public UOrionAnimInstance
	{
	public:
		unsigned char                                              UnknownData_YB69[0x20];                                  // 0x04A8(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionCPPHeroBaseAnimInstance
	 * Size -> 0x0348 (FullSize[0x07F0] - InheritedSize[0x04A8])
	 */
	class UOrionCPPHeroBaseAnimInstance : public UOrionAnimInstance
	{
	public:
		unsigned char                                              UnknownData_8FA3[0x348];                                 // 0x04A8(0x0348) MISSED OFFSET (PADDING)

	public:
		void AnimNotify_EnteredDefaultIdle();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionBaseHeroAnimInstance
	 * Size -> 0x0010 (FullSize[0x0800] - InheritedSize[0x07F0])
	 */
	class UOrionBaseHeroAnimInstance : public UOrionCPPHeroBaseAnimInstance
	{
	public:
		unsigned char                                              UnknownData_SFZC[0x10];                                  // 0x07F0(0x0010) MISSED OFFSET (PADDING)

	public:
		void AnimNotify_MeleeUpperBody();
		void AnimNotify_MeleeFullBody();
		void AnimNotify_JumpLandingExit();
		void AnimNotify_JumpExit();
		void AnimNotify_JogToIdle();
		void AnimNotify_IdleToJog();
		void AnimNotify_HitReactEnd();
		void AnimNotify_ExitedTurnInPlace();
		void AnimNotify_ExitedIdle();
		void AnimNotify_EnteredTurnInPlace();
		void AnimNotify_EnteredIdle();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionArcBladeAnimInstance
	 * Size -> 0x0038 (FullSize[0x0838] - InheritedSize[0x0800])
	 */
	class UOrionArcBladeAnimInstance : public UOrionBaseHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_T1H7[0x38];                                  // 0x0800(0x0038) MISSED OFFSET (PADDING)

	public:
		void EnterBladeState03();
		void EnterBladeState02();
		void EnterBladeState01();
		void EnterBladeState00();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionGadgetAnimInstance
	 * Size -> 0x0000 (FullSize[0x0800] - InheritedSize[0x0800])
	 */
	class UOrionGadgetAnimInstance : public UOrionBaseHeroAnimInstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionGruxAnimInstance
	 * Size -> 0x0058 (FullSize[0x0858] - InheritedSize[0x0800])
	 */
	class UOrionGruxAnimInstance : public UOrionBaseHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_ROUH[0x58];                                  // 0x0800(0x0058) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHyperBreachAnimInstance
	 * Size -> 0x00D0 (FullSize[0x08D0] - InheritedSize[0x0800])
	 */
	class UOrionHyperBreachAnimInstance : public UOrionBaseHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_72GB[0xD0];                                  // 0x0800(0x00D0) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionMurielAnimInstance
	 * Size -> 0x0118 (FullSize[0x0918] - InheritedSize[0x0800])
	 */
	class UOrionMurielAnimInstance : public UOrionBaseHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_D6HP[0x118];                                 // 0x0800(0x0118) MISSED OFFSET (PADDING)

	public:
		void AnimNotify_Jump_Land_End();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionPriceAnimInstance
	 * Size -> 0x00A8 (FullSize[0x08A8] - InheritedSize[0x0800])
	 */
	class UOrionPriceAnimInstance : public UOrionBaseHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_06QD[0xA8];                                  // 0x0800(0x00A8) MISSED OFFSET (PADDING)

	public:
		void AnimNotify_IK_HndShotGun_On();
		void AnimNotify_IK_HndShotGun_Off();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionRampageAnimInstance
	 * Size -> 0x0030 (FullSize[0x0830] - InheritedSize[0x0800])
	 */
	class UOrionRampageAnimInstance : public UOrionBaseHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_PX9X[0x30];                                  // 0x0800(0x0030) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionSparrowAnimInstance
	 * Size -> 0x0010 (FullSize[0x0810] - InheritedSize[0x0800])
	 */
	class UOrionSparrowAnimInstance : public UOrionBaseHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_8AB7[0x10];                                  // 0x0800(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionTotemAnimInstance
	 * Size -> 0x0060 (FullSize[0x0860] - InheritedSize[0x0800])
	 */
	class UOrionTotemAnimInstance : public UOrionBaseHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_UXN5[0x60];                                  // 0x0800(0x0060) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionSteelAnimInstance
	 * Size -> 0x0158 (FullSize[0x0948] - InheritedSize[0x07F0])
	 */
	class UOrionSteelAnimInstance : public UOrionCPPHeroBaseAnimInstance
	{
	public:
		unsigned char                                              UnknownData_2XGR[0x158];                                 // 0x07F0(0x0158) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionCharMovementComponent
	 * Size -> 0x0130 (FullSize[0x0800] - InheritedSize[0x06D0])
	 */
	class UOrionCharMovementComponent : public UCharacterMovementComponent
	{
	public:
		unsigned char                                              UnknownData_2GTW[0x130];                                 // 0x06D0(0x0130) MISSED OFFSET (PADDING)

	public:
		void SimulateBasicFlight(float MaxDistancePerIncrement, int32_t MaxIncrements);
		void OrionServerMoveOld(float OldTimeStamp, unsigned char OldMoveFlags);
		void OrionServerMoveDualHybridRootMotion(float TimeStamp0, unsigned char PendingFlags, uint32_t View0, float TimeStamp, unsigned char NewFlags, unsigned char ClientRoll, uint32_t View, const class FName& ClientBaseBoneName, unsigned char ClientMovementMode);
		void OrionServerMoveDual(float TimeStamp0, unsigned char PendingFlags, uint32_t View0, float TimeStamp, unsigned char NewFlags, unsigned char ClientRoll, uint32_t View, const class FName& ClientBaseBoneName, unsigned char ClientMovementMode);
		void OrionServerMove(float TimeStamp, unsigned char CompressedMoveFlags, unsigned char ClientRoll, uint32_t View, const class FName& ClientBaseBoneName, unsigned char ClientMovementMode);
		void LaunchToPointFromTargetData(float LaunchVelocityXY, bool bLockAirControl);
		void LaunchToPoint(float LaunchVelocityXY, bool bLockAirControl);
		void LaunchInDirectionFromTargetData(float LaunchVelocity, bool bLockAirControl);
		void LaunchInDirection(float LaunchVelocity, bool bLockAirControl);
		void ApplyKnockup(float Distance);
		void ApplyKnockback(float DistanceXY);
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroAnimInstance
	 * Size -> 0x0C88 (FullSize[0x1130] - InheritedSize[0x04A8])
	 */
	class UOrionHeroAnimInstance : public UOrionAnimInstance
	{
	public:
		unsigned char                                              UnknownData_PI06[0xC88];                                 // 0x04A8(0x0C88) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroArcBladeAnimInstance
	 * Size -> 0x0010 (FullSize[0x1140] - InheritedSize[0x1130])
	 */
	class UOrionHeroArcBladeAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_VSR5[0x10];                                  // 0x1130(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroChainsAnimInstance
	 * Size -> 0x0170 (FullSize[0x12A0] - InheritedSize[0x1130])
	 */
	class UOrionHeroChainsAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_LREX[0x170];                                 // 0x1130(0x0170) MISSED OFFSET (PADDING)

	public:
		void SetUpBellyChainOrientation();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroCoilAnimInstance
	 * Size -> 0x00A0 (FullSize[0x11D0] - InheritedSize[0x1130])
	 */
	class UOrionHeroCoilAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_JO3C[0xA0];                                  // 0x1130(0x00A0) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroCrunchAnimInstance
	 * Size -> 0x0000 (FullSize[0x1130] - InheritedSize[0x1130])
	 */
	class UOrionHeroCrunchAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroGhostAnimInstance
	 * Size -> 0x0000 (FullSize[0x1130] - InheritedSize[0x1130])
	 */
	class UOrionHeroGhostAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroHammerAnimInstance
	 * Size -> 0x0040 (FullSize[0x1170] - InheritedSize[0x1130])
	 */
	class UOrionHeroHammerAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_FUZZ[0x40];                                  // 0x1130(0x0040) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroKurohaneAnimInstance
	 * Size -> 0x0060 (FullSize[0x1190] - InheritedSize[0x1130])
	 */
	class UOrionHeroKurohaneAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_QK0P[0x60];                                  // 0x1130(0x0060) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroMamboAnimInstance
	 * Size -> 0x0000 (FullSize[0x1130] - InheritedSize[0x1130])
	 */
	class UOrionHeroMamboAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroPriceAnimInstance
	 * Size -> 0x00A0 (FullSize[0x11D0] - InheritedSize[0x1130])
	 */
	class UOrionHeroPriceAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_RQ58[0xA0];                                  // 0x1130(0x00A0) MISSED OFFSET (PADDING)

	public:
		void AnimNotify_IK_HndShotGun_On();
		void AnimNotify_IK_HndShotGun_Off();
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroPyroAnimInstance
	 * Size -> 0x0080 (FullSize[0x11B0] - InheritedSize[0x1130])
	 */
	class UOrionHeroPyroAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_VRSP[0x80];                                  // 0x1130(0x0080) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroRampageAnimInstance
	 * Size -> 0x0020 (FullSize[0x1150] - InheritedSize[0x1130])
	 */
	class UOrionHeroRampageAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_CSX9[0x20];                                  // 0x1130(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroRiftmageAnimInstance
	 * Size -> 0x00D0 (FullSize[0x1200] - InheritedSize[0x1130])
	 */
	class UOrionHeroRiftmageAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_ZFGH[0xD0];                                  // 0x1130(0x00D0) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroSparrowAnimInstance
	 * Size -> 0x0030 (FullSize[0x1160] - InheritedSize[0x1130])
	 */
	class UOrionHeroSparrowAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_P25W[0x30];                                  // 0x1130(0x0030) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroSwordAnimInstance
	 * Size -> 0x0010 (FullSize[0x1140] - InheritedSize[0x1130])
	 */
	class UOrionHeroSwordAnimInstance : public UOrionHeroAnimInstance
	{
	public:
		unsigned char                                              UnknownData_HJSW[0x10];                                  // 0x1130(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class OrionGame.OrionHeroTacticiaAnimInstance
	 * Size -> 0x0000 (FullSize[0x1130] - InheritedSize[0x1130])
	 */
	class UOrionHeroTacticiaAnimInstance : public UOrionHeroAnimInstance
	{
	public:
