#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BlueprintContext.AnalogCursorContext.SetNormalizedPosition
	 */
	struct UAnalogCursorContext_SetNormalizedPosition_Params
	{
	public:
		struct FVector2D                                           NewRelativePosition;                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.SetIsListeningForGestures
	 */
	struct UAnalogCursorContext_SetIsListeningForGestures_Params
	{
	public:
		bool                                                       bNewlyListening;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.SetControllingAnalogStick
	 */
	struct UAnalogCursorContext_SetControllingAnalogStick_Params
	{
	public:
		EOrionAnalogStick                                          NewAnalogStick;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.AnalogCursorContext.OnFaceButtonClick__DelegateSignature
	 */
	struct UAnalogCursorContext_OnFaceButtonClick__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction BlueprintContext.AnalogCursorContext.OnAnalogCursorToggle__DelegateSignature
	 */
	struct UAnalogCursorContext_OnAnalogCursorToggle__DelegateSignature_Params
	{
	public:
		bool                                                       UsingAnalog;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.AnalogCursorContext.OnAnalogCursorHovered__DelegateSignature
	 */
	struct UAnalogCursorContext_OnAnalogCursorHovered__DelegateSignature_Params
	{
	public:
		bool                                                       bIsHovering;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.AnalogCursorContext.OnAnalogCursorEnabledToggle__DelegateSignature
	 */
	struct UAnalogCursorContext_OnAnalogCursorEnabledToggle__DelegateSignature_Params
	{
	public:
		bool                                                       bIsEnabled;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.IsUsingAnalogCursor
	 */
	struct UAnalogCursorContext_IsUsingAnalogCursor_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.IsHovering
	 */
	struct UAnalogCursorContext_IsHovering_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.IsDelegateToggleBound
	 */
	struct UAnalogCursorContext_IsDelegateToggleBound_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetVelocity
	 */
	struct UAnalogCursorContext_GetVelocity_Params
	{
	public:
		struct FVector2D                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetRightTriggerValue
	 */
	struct UAnalogCursorContext_GetRightTriggerValue_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetRadius
	 */
	struct UAnalogCursorContext_GetRadius_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetNormalizedPosition
	 */
	struct UAnalogCursorContext_GetNormalizedPosition_Params
	{
	public:
		struct FVector2D                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetLastCursorDirection
	 */
	struct UAnalogCursorContext_GetLastCursorDirection_Params
	{
	public:
		struct FVector2D                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetIsUsingGamePad
	 */
	struct UAnalogCursorContext_GetIsUsingGamePad_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetIsInFastMode
	 */
	struct UAnalogCursorContext_GetIsInFastMode_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetHoveredWidgetName
	 */
	struct UAnalogCursorContext_GetHoveredWidgetName_Params
	{
	public:
		class FName                                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetGestureInfo
	 */
	struct UAnalogCursorContext_GetGestureInfo_Params
	{
	public:
		EOrionGestureDirection                                     Direction0;                                              // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionGestureDirection                                     Direction1;                                              // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetDirectionFromVector
	 */
	struct UAnalogCursorContext_GetDirectionFromVector_Params
	{
	public:
		struct FVector2D                                           Vector;                                                  // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		EOrionGestureDirection                                     ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetCurrentPosition
	 */
	struct UAnalogCursorContext_GetCurrentPosition_Params
	{
	public:
		struct FVector2D                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.GetAnalogStickValues
	 */
	struct UAnalogCursorContext_GetAnalogStickValues_Params
	{
	public:
		struct FVector2D                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.EnableAnalogCursor
	 */
	struct UAnalogCursorContext_EnableAnalogCursor_Params
	{
	public:
		bool                                                       bEnableParallax;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AnalogCursorContext.DisableAnalogCursor
	 */
	struct UAnalogCursorContext_DisableAnalogCursor_Params
	{	};

	/**
	 * Function BlueprintContext.AutomationContext.ViewTarget
	 */
	struct UAutomationContext_ViewTarget_Params
	{
	public:
		class AActor*                                              ActorToFace;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AutomationContext.SetHealth
	 */
	struct UAutomationContext_SetHealth_Params
	{
	public:
		class AOrionChar*                                          InChar;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      InPercent;                                               // 0x0008(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AutomationContext.ScriptAIBehavior
	 */
	struct UAutomationContext_ScriptAIBehavior_Params
	{
	public:
		class AOrionChar*                                          InChar;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UAIScriptedBehavior*                                 ScriptedBehavior;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AutomationContext.ResetAFKTime
	 */
	struct UAutomationContext_ResetAFKTime_Params
	{	};

	/**
	 * Function BlueprintContext.AutomationContext.RegisterForActorSpawnCallbacks
	 */
	struct UAutomationContext_RegisterForActorSpawnCallbacks_Params
	{	};

	/**
	 * DelegateFunction BlueprintContext.AutomationContext.OnOrionCharSpawned__DelegateSignature
	 */
	struct UAutomationContext_OnOrionCharSpawned__DelegateSignature_Params
	{
	public:
		class AOrionChar*                                          NewOrionChar;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AutomationContext.GetRemainingCooldownForAbility
	 */
	struct UAutomationContext_GetRemainingCooldownForAbility_Params
	{
	public:
		class UOrionAbilitySystemComponent*                        AbilitySystem;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionAbilityBinding                                       InputID;                                                 // 0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_E1J2[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      ReturnValue;                                             // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AutomationContext.ConfirmAbilityForPawn
	 */
	struct UAutomationContext_ConfirmAbilityForPawn_Params
	{
	public:
		class AOrionChar*                                          InChar;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AutomationContext.CancelAllAbilities
	 */
	struct UAutomationContext_CancelAllAbilities_Params
	{
	public:
		class AOrionChar*                                          InChar;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AutomationContext.CancelAbilityForPawn
	 */
	struct UAutomationContext_CancelAbilityForPawn_Params
	{
	public:
		class AOrionChar*                                          InChar;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AutomationContext.ActivateAIAbility
	 */
	struct UAutomationContext_ActivateAIAbility_Params
	{
	public:
		class AOrionChar*                                          InChar;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionAbilityBinding                                       InputID;                                                 // 0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.AutomationContext.ActivateAbilityForPawn
	 */
	struct UAutomationContext_ActivateAbilityForPawn_Params
	{
	public:
		class AOrionChar*                                          InChar;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionAbilityBinding                                       InputID;                                                 // 0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bPressed;                                                // 0x0009(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.SetupPrototypeFromDef
	 */
	struct UBannerContext_SetupPrototypeFromDef_Params
	{
	public:
		class UOrionMcpBannerItemDefinition*                       BannerDef;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.SetupBannerSocketFromIdent
	 */
	struct UBannerContext_SetupBannerSocketFromIdent_Params
	{
	public:
		struct FSingleBannerEntry                                  Socket;                                                  // 0x0000(0x0050)  (Parm, OutParm, NativeAccessSpecifierPublic)
		class FString                                              BannerIdent;                                             // 0x0050(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bRetainSocketID;                                         // 0x0060(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0061(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.SetPrototypeStaffFromIdent
	 */
	struct UBannerContext_SetPrototypeStaffFromIdent_Params
	{
	public:
		class FString                                              BannerIdent;                                             // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bRetainSocketID;                                         // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.SetPrototypeSocketIdentFromArray
	 */
	struct UBannerContext_SetPrototypeSocketIdentFromArray_Params
	{
	public:
		TArray<class FString>                                      SocketIdentArray;                                        // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		EOrionBannerType                                           SocketType;                                              // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.SetPrototypeSocketIdent
	 */
	struct UBannerContext_SetPrototypeSocketIdent_Params
	{
	public:
		int32_t                                                    socketIndex;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_D795[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              Ident;                                                   // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionBannerType                                           SocketType;                                              // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.SetPrototypeSocketAlteration
	 */
	struct UBannerContext_SetPrototypeSocketAlteration_Params
	{
	public:
		int32_t                                                    socketIndex;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    AlterationIndex;                                         // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Ident;                                                   // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionBannerType                                           SocketType;                                              // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.IsValidAlteration
	 */
	struct UBannerContext_IsValidAlteration_Params
	{
	public:
		class FString                                              alterationId;                                            // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetProtoypeBanner
	 */
	struct UBannerContext_GetProtoypeBanner_Params
	{
	public:
		struct FSingleBannerEntryRoot                              BannerDef;                                               // 0x0000(0x0060)  (Parm, OutParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetPrototypeSocketIdentArray
	 */
	struct UBannerContext_GetPrototypeSocketIdentArray_Params
	{
	public:
		TArray<class FString>                                      SocketIdentArray;                                        // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		EOrionBannerType                                           SocketType;                                              // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetPrototypeSocketIdent
	 */
	struct UBannerContext_GetPrototypeSocketIdent_Params
	{
	public:
		int32_t                                                    socketIndex;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_J32I[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              SocketIdent;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionBannerType                                           SocketType;                                              // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetPrototypeSocketAlteration
	 */
	struct UBannerContext_GetPrototypeSocketAlteration_Params
	{
	public:
		int32_t                                                    socketIndex;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    AlterationIndex;                                         // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              SocketIdent;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionBannerType                                           SocketType;                                              // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetPrototypeAlterationIdentArray
	 */
	struct UBannerContext_GetPrototypeAlterationIdentArray_Params
	{
	public:
		TArray<class FString>                                      AlterationIdentArray;                                    // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    socketIndex;                                             // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionBannerType                                           SocketType;                                              // 0x0014(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetOwnedIDBannerItem
	 */
	struct UBannerContext_GetOwnedIDBannerItem_Params
	{
	public:
		TArray<class UOrionMcpBannerItem*>                         Banners;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		class FString                                              InItemIdent;                                             // 0x0010(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_J32I[0x48];
		//struct FBannerItemIdent                                    OutItemID;                                               // 0x0020(0x0048)  (Parm, OutParm, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0068(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetNumSocketsOfType
	 */
	struct UBannerContext_GetNumSocketsOfType_Params
	{
	public:
		struct FSingleBannerEntryRoot                              BannerEntry;                                             // 0x0000(0x0060)  (ConstParm, Parm, NativeAccessSpecifierPublic)
		EOrionBannerType                                           ItemType;                                                // 0x0060(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_7PBE[0x3];                                   // 0x0061(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0064(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetNumSockets
	 */
	struct UBannerContext_GetNumSockets_Params
	{
	public:
		struct FSingleBannerEntryRoot                              BannerEntry;                                             // 0x0000(0x0060)  (ConstParm, Parm, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0060(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetNumAlterationsOnPrototypeSocket
	 */
	struct UBannerContext_GetNumAlterationsOnPrototypeSocket_Params
	{
	public:
		int32_t                                                    socketIndex;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EOrionBannerType                                           SocketType;                                              // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_QE00[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetNameFromDisplayName
	 */
	struct UBannerContext_GetNameFromDisplayName_Params
	{
	public:
		EOrionBannerType                                           ItemType;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_MQIJ[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              Ident;                                                   // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0018(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetMaxAlterations
	 */
	struct UBannerContext_GetMaxAlterations_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetDisplayNameFromName
	 */
	struct UBannerContext_GetDisplayNameFromName_Params
	{
	public:
		EOrionBannerType                                           ItemType;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_O04O[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              Ident;                                                   // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0018(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetBannerItemStringsOfType
	 */
	struct UBannerContext_GetBannerItemStringsOfType_Params
	{
	public:
		EOrionBannerType                                           ItemTypes;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_FBK4[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<class FString>                                      OutArray;                                                // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		bool                                                       bMustOwn;                                                // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetBannerItemsOfType
	 */
	struct UBannerContext_GetBannerItemsOfType_Params
	{
	public:
		EOrionBannerType                                           ItemType;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_MXK1[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<class UOrionMcpBannerItemDefinition*>               ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetBannerItemNameFromDisplayName
	 */
	struct UBannerContext_GetBannerItemNameFromDisplayName_Params
	{
	public:
		EOrionBannerType                                           ItemType;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_Z4GF[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              Ident;                                                   // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0018(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetBannerItemDisplayNameFromName
	 */
	struct UBannerContext_GetBannerItemDisplayNameFromName_Params
	{
	public:
		EOrionBannerType                                           ItemType;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_C2GK[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              Ident;                                                   // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0018(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetBannerAlterationStrings
	 */
	struct UBannerContext_GetBannerAlterationStrings_Params
	{
	public:
		TArray<class FString>                                      OutArray;                                                // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		bool                                                       bMustOwn;                                                // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetBannerAlterationNameFromDisplayName
	 */
	struct UBannerContext_GetBannerAlterationNameFromDisplayName_Params
	{
	public:
		class FString                                              Ident;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GetBannerAlterationDisplayNameFromName
	 */
	struct UBannerContext_GetBannerAlterationDisplayNameFromName_Params
	{
	public:
		class FString                                              Ident;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GeneratePrototypeBannerItemIDs
	 */
	struct UBannerContext_GeneratePrototypeBannerItemIDs_Params
	{
	public:
		class AOrionPlayerController_Game*                         PlayerController;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FBannerItemIdent>                            ItemIdents;                                              // 0x0008(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.GenerateBannerItemIDs
	 */
	struct UBannerContext_GenerateBannerItemIDs_Params
	{
	public:
		class AOrionPlayerController_Game*                         PlayerController;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FBannerItemIdent>                            ItemIdents;                                              // 0x0008(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		struct FSingleBannerEntryRoot                              BannerEntry;                                             // 0x0018(0x0060)  (Parm, OutParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.FindActiveBanner
	 */
	struct UBannerContext_FindActiveBanner_Params
	{
	public:
		class UOrionMcpProfileAccount*                             McpProfile;                                              // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UOrionMcpBannerItem*                                 ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.CreateRandomBannerDef
	 */
	struct UBannerContext_CreateRandomBannerDef_Params
	{
	public:
		struct FSingleBannerEntryRoot                              RandomBanner;                                            // 0x0000(0x0060)  (Parm, OutParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0060(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.CreateDefaultBannerDef
	 */
	struct UBannerContext_CreateDefaultBannerDef_Params
	{
	public:
		struct FSingleBannerEntryRoot                              DefaultBanner;                                           // 0x0000(0x0060)  (Parm, OutParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0060(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.CountValidAlterations
	 */
	struct UBannerContext_CountValidAlterations_Params
	{
	public:
		TArray<class FString>                                      Alterations;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.CountOverlapAlterations
	 */
	struct UBannerContext_CountOverlapAlterations_Params
	{
	public:
		//struct FBannerItemIdent                                    BannerItem;                                              // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_J32I[0x48];
		int32_t                                                    ReturnValue;                                             // 0x0048(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.BuildListOfExistingItemAllocations
	 */
	struct UBannerContext_BuildListOfExistingItemAllocations_Params
	{
	public:
		class UOrionMcpProfileAccount*                             McpProfile;                                              // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FBannerItemIdent>                            AllocatedBannerIdents;                                   // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		TArray<struct FBannerItemIdent>                            OwnedBannerItems;                                        // 0x0018(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.AddRandomItemToSocketSlot
	 */
	struct UBannerContext_AddRandomItemToSocketSlot_Params
	{
	public:
		struct FSingleBannerEntry                                  Socket;                                                  // 0x0000(0x0050)  (Parm, OutParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BannerContext.AddRandomAlterationsToSocket
	 */
	struct UBannerContext_AddRandomAlterationsToSocket_Params
	{
	public:
		struct FSingleBannerEntry                                  Socket;                                                  // 0x0000(0x0050)  (Parm, OutParm, NativeAccessSpecifierPublic)
		int32_t                                                    NumRandomAlterations;                                    // 0x0050(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.QueueHUDAlert
	 */
	struct UBaseHUDContext_QueueHUDAlert_Params
	{
	public:
		class UHUDAlertAsset*                                      AlertAsset;                                              // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnUltimateReady__DelegateSignature
	 */
	struct UBaseHUDContext_OnUltimateReady__DelegateSignature_Params
	{
	public:
		int32_t                                                    InputID;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnPlayerXPUpdate__DelegateSignature
	 */
	struct UBaseHUDContext_OnPlayerXPUpdate__DelegateSignature_Params
	{
	public:
		int32_t                                                    XP;                                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    MaxXP;                                                   // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnLevelUp__DelegateSignature
	 */
	struct UBaseHUDContext_OnLevelUp__DelegateSignature_Params
	{
	public:
		int32_t                                                    NewLevel;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnKDAUpdate__DelegateSignature
	 */
	struct UBaseHUDContext_OnKDAUpdate__DelegateSignature_Params
	{
	public:
		int32_t                                                    Kills;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Deaths;                                                  // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Assists;                                                 // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Minions;                                                 // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnHeroDeathOrSpawnEvent__DelegateSignature
	 */
	struct UBaseHUDContext_OnHeroDeathOrSpawnEvent__DelegateSignature_Params
	{
	public:
		struct FOrionHUDTeamStatusInfo                             NewTeamInfo;                                             // 0x0000(0x0068)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnCardXPUpdate__DelegateSignature
	 */
	struct UBaseHUDContext_OnCardXPUpdate__DelegateSignature_Params
	{
	public:
		float                                                      NewXP;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      NewXPMax;                                                // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnCardPointsUpdated__DelegateSignature
	 */
	struct UBaseHUDContext_OnCardPointsUpdated__DelegateSignature_Params
	{
	public:
		int32_t                                                    NewCardActivationPointsSpent;                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    NewCardActivationPointsMax;                              // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnCardLevelUp__DelegateSignature
	 */
	struct UBaseHUDContext_OnCardLevelUp__DelegateSignature_Params
	{
	public:
		float                                                      NewLevel;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnCannotActivateAbility__DelegateSignature
	 */
	struct UBaseHUDContext_OnCannotActivateAbility__DelegateSignature_Params
	{
	public:
		int32_t                                                    InputID;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_K5AY[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FGameplayTagContainer                               RelevantTags;                                            // 0x0008(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.BaseHUDContext.OnAbilityUpdate__DelegateSignature
	 */
	struct UBaseHUDContext_OnAbilityUpdate__DelegateSignature_Params
	{
	public:
		EOrionAbilityBinding                                       InputID;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_OQUK[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FOrionAbilityUIData                                 AbilityData;                                             // 0x0008(0x00C0)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.IsUltimateReady
	 */
	struct UBaseHUDContext_IsUltimateReady_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.GetTopOpenMenu
	 */
	struct UBaseHUDContext_GetTopOpenMenu_Params
	{
	public:
		class UWidget*                                             ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.GetMyTeam
	 */
	struct UBaseHUDContext_GetMyTeam_Params
	{
	public:
		EOrionTeam                                                 ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.GetIsMenuVisible
	 */
	struct UBaseHUDContext_GetIsMenuVisible_Params
	{
	public:
		EOrionMenuSlotTypes                                        MenuType;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.GetHUDPlayerInfo
	 */
	struct UBaseHUDContext_GetHUDPlayerInfo_Params
	{
	public:
		struct FOrionBaseHUDPlayerInfo                             ReturnValue;                                             // 0x0000(0x0070)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.GetEnemyTeam
	 */
	struct UBaseHUDContext_GetEnemyTeam_Params
	{
	public:
		EOrionTeam                                                 ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.GetDesiredAnalogCursorState
	 */
	struct UBaseHUDContext_GetDesiredAnalogCursorState_Params
	{
	public:
		EOrionDesiredAnalogCursorState                             ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.GetCurrentMenu
	 */
	struct UBaseHUDContext_GetCurrentMenu_Params
	{
	public:
		EOrionMenuSlotTypes                                        ActiveMenu;                                              // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.GetCurrentMatchTime
	 */
	struct UBaseHUDContext_GetCurrentMatchTime_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.GetAbilityData
	 */
	struct UBaseHUDContext_GetAbilityData_Params
	{
	public:
		EOrionAbilityBinding                                       InputID;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_8YRI[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FOrionAbilityUIData                                 ReturnValue;                                             // 0x0008(0x00C0)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BaseHUDContext.ChangeMenuOpenState
	 */
	struct UBaseHUDContext_ChangeMenuOpenState_Params
	{
	public:
		EOrionMenuSlotTypes                                        MenuSlot;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bNewlyOpen;                                              // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction BlueprintContext.PlayerAwareContext.OnMcpError__DelegateSignature
	 */
	struct UPlayerAwareContext_OnMcpError__DelegateSignature_Params
	{
	public:
		class FText                                                ErrorMessage;                                            // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.PlayerAwareContext.GetMCPTime
	 */
	struct UPlayerAwareContext_GetMCPTime_Params
	{
	public:
		struct FDateTime                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BoostContext.IsBoostActive
	 */
	struct UBoostContext_IsBoostActive_Params
	{
	public:
		EOrionBoostType                                            BoostType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BoostContext.IsAnyBoostActive
	 */
	struct UBoostContext_IsAnyBoostActive_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BoostContext.GetUsesRemaining
	 */
	struct UBoostContext_GetUsesRemaining_Params
	{
	public:
		EOrionBoostType                                            BoostType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_G5VT[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BoostContext.GetBoosts
	 */
	struct UBoostContext_GetBoosts_Params
	{
	public:
		TArray<class UOrionMcpBoostItem*>                          Boosts;                                                  // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function BlueprintContext.BoostContext.GetBoostExpirationTime
	 */
	struct UBoostContext_GetBoostExpirationTime_Params
	{
	public:
		EOrionBoostType                                            BoostType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_UJLY[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
