#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnNotifyEnd_C60BC5314BC5A6C3B9BEBCBA653CB154
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnNotifyEnd_C60BC5314BC5A6C3B9BEBCBA653CB154_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnNotifyBegin_C60BC5314BC5A6C3B9BEBCBA653CB154
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnNotifyBegin_C60BC5314BC5A6C3B9BEBCBA653CB154_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnCancelled_C60BC5314BC5A6C3B9BEBCBA653CB154_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnInterrupted_C60BC5314BC5A6C3B9BEBCBA653CB154_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnBlendOut_C60BC5314BC5A6C3B9BEBCBA653CB154_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnCompleted_C60BC5314BC5A6C3B9BEBCBA653CB154_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025
	 */
	struct UGA_Buff_Black_RangedAttack_C_FailedToSpawn_6044C4CC4A54A0269E20AC836A2E0025_Params
	{
	public:
		class AOrionProjectile*                                    SpawnedProjectile;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.NotAuthority_6044C4CC4A54A0269E20AC836A2E0025
	 */
	struct UGA_Buff_Black_RangedAttack_C_NotAuthority_6044C4CC4A54A0269E20AC836A2E0025_Params
	{
	public:
		class AOrionProjectile*                                    SpawnedProjectile;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.PreSpawned_6044C4CC4A54A0269E20AC836A2E0025
	 */
	struct UGA_Buff_Black_RangedAttack_C_PreSpawned_6044C4CC4A54A0269E20AC836A2E0025_Params
	{
	public:
		class AOrionProjectile*                                    SpawnedProjectile;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.Success_6044C4CC4A54A0269E20AC836A2E0025
	 */
	struct UGA_Buff_Black_RangedAttack_C_Success_6044C4CC4A54A0269E20AC836A2E0025_Params
	{
	public:
		class AOrionProjectile*                                    SpawnedProjectile;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnNotifyEnd_CF989AF248CC6899420915B31A7FD9E6
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnNotifyEnd_CF989AF248CC6899420915B31A7FD9E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnNotifyBegin_CF989AF248CC6899420915B31A7FD9E6
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnNotifyBegin_CF989AF248CC6899420915B31A7FD9E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnCancelled_CF989AF248CC6899420915B31A7FD9E6
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnCancelled_CF989AF248CC6899420915B31A7FD9E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnInterrupted_CF989AF248CC6899420915B31A7FD9E6
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnInterrupted_CF989AF248CC6899420915B31A7FD9E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnBlendOut_CF989AF248CC6899420915B31A7FD9E6
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnBlendOut_CF989AF248CC6899420915B31A7FD9E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnCompleted_CF989AF248CC6899420915B31A7FD9E6
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnCompleted_CF989AF248CC6899420915B31A7FD9E6_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnNotifyEnd_CE0FEF3F424A7D58DEEDFF8C88DBAB45
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnNotifyEnd_CE0FEF3F424A7D58DEEDFF8C88DBAB45_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnNotifyBegin_CE0FEF3F424A7D58DEEDFF8C88DBAB45
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnNotifyBegin_CE0FEF3F424A7D58DEEDFF8C88DBAB45_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnCancelled_CE0FEF3F424A7D58DEEDFF8C88DBAB45_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnInterrupted_CE0FEF3F424A7D58DEEDFF8C88DBAB45
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnInterrupted_CE0FEF3F424A7D58DEEDFF8C88DBAB45_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnBlendOut_CE0FEF3F424A7D58DEEDFF8C88DBAB45_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnCompleted_CE0FEF3F424A7D58DEEDFF8C88DBAB45_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnNotifyEnd_C076CDD34EE5F1796CB9F6BE88A1CA04
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnNotifyEnd_C076CDD34EE5F1796CB9F6BE88A1CA04_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnNotifyBegin_C076CDD34EE5F1796CB9F6BE88A1CA04
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnNotifyBegin_C076CDD34EE5F1796CB9F6BE88A1CA04_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnCancelled_C076CDD34EE5F1796CB9F6BE88A1CA04_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnInterrupted_C076CDD34EE5F1796CB9F6BE88A1CA04_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnBlendOut_C076CDD34EE5F1796CB9F6BE88A1CA04_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04
	 */
	struct UGA_Buff_Black_RangedAttack_C_OnCompleted_C076CDD34EE5F1796CB9F6BE88A1CA04_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.K2_ActivateAbility
	 */
	struct UGA_Buff_Black_RangedAttack_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Buff_Black_RangedAttack.GA_Buff_Black_RangedAttack_C.ExecuteUbergraph_GA_Buff_Black_RangedAttack
	 */
	struct UGA_Buff_Black_RangedAttack_C_ExecuteUbergraph_GA_Buff_Black_RangedAttack_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_G1Z7[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
