#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Card_Passive_WhenHit_Parent.GA_Card_Passive_WhenHit_Parent_C.OnApplied_D9B60F364036EF76204502B4361E1B41
	 */
	struct UGA_Card_Passive_WhenHit_Parent_C_OnApplied_D9B60F364036EF76204502B4361E1B41_Params
	{
	public:
		class AActor*                                              Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FGameplayEffectSpecHandle                           SpecHandle;                                              // 0x0008(0x0018)  (Parm)
		struct FActiveGameplayEffectHandle                         ActiveHandle;                                            // 0x0020(0x0008)  (Parm)
	};

	/**
	 * Function GA_Card_Passive_WhenHit_Parent.GA_Card_Passive_WhenHit_Parent_C.OnApplied_78F12104420C0C0AD1A53D8ADAD6978D
	 */
	struct UGA_Card_Passive_WhenHit_Parent_C_OnApplied_78F12104420C0C0AD1A53D8ADAD6978D_Params
	{
	public:
		class AActor*                                              Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FGameplayEffectSpecHandle                           SpecHandle;                                              // 0x0008(0x0018)  (Parm)
		struct FActiveGameplayEffectHandle                         ActiveHandle;                                            // 0x0020(0x0008)  (Parm)
	};

	/**
	 * Function GA_Card_Passive_WhenHit_Parent.GA_Card_Passive_WhenHit_Parent_C.OnStateInterrupted_848983A548A0832E0EA032A279A7DBE3
	 */
	struct UGA_Card_Passive_WhenHit_Parent_C_OnStateInterrupted_848983A548A0832E0EA032A279A7DBE3_Params
	{	};

	/**
	 * Function GA_Card_Passive_WhenHit_Parent.GA_Card_Passive_WhenHit_Parent_C.OnStateEnded_848983A548A0832E0EA032A279A7DBE3
	 */
	struct UGA_Card_Passive_WhenHit_Parent_C_OnStateEnded_848983A548A0832E0EA032A279A7DBE3_Params
	{	};

	/**
	 * Function GA_Card_Passive_WhenHit_Parent.GA_Card_Passive_WhenHit_Parent_C.K2_ActivateAbility
	 */
	struct UGA_Card_Passive_WhenHit_Parent_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Card_Passive_WhenHit_Parent.GA_Card_Passive_WhenHit_Parent_C.ExecuteUbergraph_GA_Card_Passive_WhenHit_Parent
	 */
	struct UGA_Card_Passive_WhenHit_Parent_C_ExecuteUbergraph_GA_Card_Passive_WhenHit_Parent_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
