#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Card_Passive_WhenHitApplySElf_Parent.GA_Card_Passive_WhenHitApplySelf_Parent_C.OnApplied_D9B60F364036EF76204502B4884708B2
	 */
	struct UGA_Card_Passive_WhenHitApplySelf_Parent_C_OnApplied_D9B60F364036EF76204502B4884708B2_Params
	{
	public:
		class AActor*                                              Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FGameplayEffectSpecHandle                           SpecHandle;                                              // 0x0008(0x0018)  (Parm)
		struct FActiveGameplayEffectHandle                         ActiveHandle;                                            // 0x0020(0x0008)  (Parm)
	};

	/**
	 * Function GA_Card_Passive_WhenHitApplySElf_Parent.GA_Card_Passive_WhenHitApplySelf_Parent_C.OnStateInterrupted_697D596641938BEC85A248A3A74FC664
	 */
	struct UGA_Card_Passive_WhenHitApplySelf_Parent_C_OnStateInterrupted_697D596641938BEC85A248A3A74FC664_Params
	{	};

	/**
	 * Function GA_Card_Passive_WhenHitApplySElf_Parent.GA_Card_Passive_WhenHitApplySelf_Parent_C.OnStateEnded_697D596641938BEC85A248A3A74FC664
	 */
	struct UGA_Card_Passive_WhenHitApplySelf_Parent_C_OnStateEnded_697D596641938BEC85A248A3A74FC664_Params
	{	};

	/**
	 * Function GA_Card_Passive_WhenHitApplySElf_Parent.GA_Card_Passive_WhenHitApplySelf_Parent_C.K2_ActivateAbility
	 */
	struct UGA_Card_Passive_WhenHitApplySelf_Parent_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Card_Passive_WhenHitApplySElf_Parent.GA_Card_Passive_WhenHitApplySelf_Parent_C.ExecuteUbergraph_GA_Card_Passive_WhenHitApplySelf_Parent
	 */
	struct UGA_Card_Passive_WhenHitApplySelf_Parent_C_ExecuteUbergraph_GA_Card_Passive_WhenHitApplySelf_Parent_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_64ZU[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
