#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.CheckSpawnPad
	 */
	struct UGA_OnSpawn_C_CheckSpawnPad_Params
	{
	public:
		class ABP_Hero_C*                                          Hero;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnFinish_EF8C4CE74AFB6D93CD3C2C887D805B5F
	 */
	struct UGA_OnSpawn_C_OnFinish_EF8C4CE74AFB6D93CD3C2C887D805B5F_Params
	{	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F
	 */
	struct UGA_OnSpawn_C_OnNotifyEnd_F95C91B146B2CB6F25417A93AB4A967F_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F
	 */
	struct UGA_OnSpawn_C_OnNotifyBegin_F95C91B146B2CB6F25417A93AB4A967F_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnCancelled_F95C91B146B2CB6F25417A93AB4A967F
	 */
	struct UGA_OnSpawn_C_OnCancelled_F95C91B146B2CB6F25417A93AB4A967F_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F
	 */
	struct UGA_OnSpawn_C_OnInterrupted_F95C91B146B2CB6F25417A93AB4A967F_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F
	 */
	struct UGA_OnSpawn_C_OnBlendOut_F95C91B146B2CB6F25417A93AB4A967F_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnCompleted_F95C91B146B2CB6F25417A93AB4A967F
	 */
	struct UGA_OnSpawn_C_OnCompleted_F95C91B146B2CB6F25417A93AB4A967F_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnNotifyEnd_759325FE48659E7299F1899E3C4738AF
	 */
	struct UGA_OnSpawn_C_OnNotifyEnd_759325FE48659E7299F1899E3C4738AF_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnNotifyBegin_759325FE48659E7299F1899E3C4738AF
	 */
	struct UGA_OnSpawn_C_OnNotifyBegin_759325FE48659E7299F1899E3C4738AF_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnCancelled_759325FE48659E7299F1899E3C4738AF
	 */
	struct UGA_OnSpawn_C_OnCancelled_759325FE48659E7299F1899E3C4738AF_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnInterrupted_759325FE48659E7299F1899E3C4738AF
	 */
	struct UGA_OnSpawn_C_OnInterrupted_759325FE48659E7299F1899E3C4738AF_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnBlendOut_759325FE48659E7299F1899E3C4738AF
	 */
	struct UGA_OnSpawn_C_OnBlendOut_759325FE48659E7299F1899E3C4738AF_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.OnCompleted_759325FE48659E7299F1899E3C4738AF
	 */
	struct UGA_OnSpawn_C_OnCompleted_759325FE48659E7299F1899E3C4738AF_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.K2_ActivateAbility
	 */
	struct UGA_OnSpawn_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_OnSpawn.GA_OnSpawn_C.ExecuteUbergraph_GA_OnSpawn
	 */
	struct UGA_OnSpawn_C_ExecuteUbergraph_GA_OnSpawn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_FDF7[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
