#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Prime_Helix_Spawn.GA_Prime_Helix_Spawn_C.OnNotifyEnd_8595B1D147A59BB1C34C668824C421EE
	 */
	struct UGA_Prime_Helix_Spawn_C_OnNotifyEnd_8595B1D147A59BB1C34C668824C421EE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_Spawn.GA_Prime_Helix_Spawn_C.OnNotifyBegin_8595B1D147A59BB1C34C668824C421EE
	 */
	struct UGA_Prime_Helix_Spawn_C_OnNotifyBegin_8595B1D147A59BB1C34C668824C421EE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_Spawn.GA_Prime_Helix_Spawn_C.OnCancelled_8595B1D147A59BB1C34C668824C421EE
	 */
	struct UGA_Prime_Helix_Spawn_C_OnCancelled_8595B1D147A59BB1C34C668824C421EE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_Spawn.GA_Prime_Helix_Spawn_C.OnInterrupted_8595B1D147A59BB1C34C668824C421EE
	 */
	struct UGA_Prime_Helix_Spawn_C_OnInterrupted_8595B1D147A59BB1C34C668824C421EE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_Spawn.GA_Prime_Helix_Spawn_C.OnBlendOut_8595B1D147A59BB1C34C668824C421EE
	 */
	struct UGA_Prime_Helix_Spawn_C_OnBlendOut_8595B1D147A59BB1C34C668824C421EE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_Spawn.GA_Prime_Helix_Spawn_C.OnCompleted_8595B1D147A59BB1C34C668824C421EE
	 */
	struct UGA_Prime_Helix_Spawn_C_OnCompleted_8595B1D147A59BB1C34C668824C421EE_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_Spawn.GA_Prime_Helix_Spawn_C.K2_ActivateAbility
	 */
	struct UGA_Prime_Helix_Spawn_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Prime_Helix_Spawn.GA_Prime_Helix_Spawn_C.ExecuteUbergraph_GA_Prime_Helix_Spawn
	 */
	struct UGA_Prime_Helix_Spawn_C_ExecuteUbergraph_GA_Prime_Helix_Spawn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_EFXV[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
