#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.Added_41DCAFDF4BCCDE873529E5B9336B25DD
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_Added_41DCAFDF4BCCDE873529E5B9336B25DD_Params
	{	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnNotifyEnd_8F007D9E4263ED4823B4F78FE45DF1BC
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnNotifyEnd_8F007D9E4263ED4823B4F78FE45DF1BC_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnNotifyBegin_8F007D9E4263ED4823B4F78FE45DF1BC
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnNotifyBegin_8F007D9E4263ED4823B4F78FE45DF1BC_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnCancelled_8F007D9E4263ED4823B4F78FE45DF1BC
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnCancelled_8F007D9E4263ED4823B4F78FE45DF1BC_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnInterrupted_8F007D9E4263ED4823B4F78FE45DF1BC
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnInterrupted_8F007D9E4263ED4823B4F78FE45DF1BC_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnBlendOut_8F007D9E4263ED4823B4F78FE45DF1BC
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnBlendOut_8F007D9E4263ED4823B4F78FE45DF1BC_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnCompleted_8F007D9E4263ED4823B4F78FE45DF1BC
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnCompleted_8F007D9E4263ED4823B4F78FE45DF1BC_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.FailedToSpawn_C3A6E38340A52A5CC6B161AB94E9FCD0
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_FailedToSpawn_C3A6E38340A52A5CC6B161AB94E9FCD0_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.NotAuthority_C3A6E38340A52A5CC6B161AB94E9FCD0
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_NotAuthority_C3A6E38340A52A5CC6B161AB94E9FCD0_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.Success_C3A6E38340A52A5CC6B161AB94E9FCD0
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_Success_C3A6E38340A52A5CC6B161AB94E9FCD0_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnStateInterrupted_11D006A3418CDF90AAAA3780CDC77DFE
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnStateInterrupted_11D006A3418CDF90AAAA3780CDC77DFE_Params
	{	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnStateEnded_11D006A3418CDF90AAAA3780CDC77DFE
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnStateEnded_11D006A3418CDF90AAAA3780CDC77DFE_Params
	{	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnStateInterrupted_52B7214340D1BD6C35DC7A8EE9F8E575
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnStateInterrupted_52B7214340D1BD6C35DC7A8EE9F8E575_Params
	{	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.OnStateEnded_52B7214340D1BD6C35DC7A8EE9F8E575
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_OnStateEnded_52B7214340D1BD6C35DC7A8EE9F8E575_Params
	{	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.K2_ActivateAbility
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.K2_OnEndAbility
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_K2_OnEndAbility_Params
	{	};

	/**
	 * Function GA_Prime_Helix_V2_SpecialAttack2.GA_Prime_Helix_V2_SpecialAttack2_C.ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack2
	 */
	struct UGA_Prime_Helix_V2_SpecialAttack2_C_ExecuteUbergraph_GA_Prime_Helix_V2_SpecialAttack2_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_GNW9[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
