#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.Escape Button Pressed
	 */
	struct USurrender_Menu_Widget_C_EscapeButtonPressed_Params
	{	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.Unregister for Input
	 */
	struct USurrender_Menu_Widget_C_UnregisterforInput_Params
	{	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.Register for Input
	 */
	struct USurrender_Menu_Widget_C_RegisterforInput_Params
	{	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.On Open
	 */
	struct USurrender_Menu_Widget_C_OnOpen_Params
	{	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.On Close
	 */
	struct USurrender_Menu_Widget_C_OnClose_Params
	{	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderYesButton_K2Node_ComponentBoundEvent_42_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderYesButton_K2Node_ComponentBoundEvent_42_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderNoButton_K2Node_ComponentBoundEvent_52_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderNoButton_K2Node_ComponentBoundEvent_52_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderNo_K2Node_ComponentBoundEvent_529_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderNo_K2Node_ComponentBoundEvent_529_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderTeamPlayingPoorly_K2Node_ComponentBoundEvent_656_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderTeamPlayingPoorly_K2Node_ComponentBoundEvent_656_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderNoChance_K2Node_ComponentBoundEvent_674_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderNoChance_K2Node_ComponentBoundEvent_674_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderNoFun_K2Node_ComponentBoundEvent_693_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderNoFun_K2Node_ComponentBoundEvent_693_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderHaveToGo_K2Node_ComponentBoundEvent_713_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderHaveToGo_K2Node_ComponentBoundEvent_713_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderToldTo_K2Node_ComponentBoundEvent_734_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderToldTo_K2Node_ComponentBoundEvent_734_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderTooConfusing_K2Node_ComponentBoundEvent_756_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderTooConfusing_K2Node_ComponentBoundEvent_756_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderOther_K2Node_ComponentBoundEvent_779_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderOther_K2Node_ComponentBoundEvent_779_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.OnDeactivated
	 */
	struct USurrender_Menu_Widget_C_OnDeactivated_Params
	{	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.OnActivated
	 */
	struct USurrender_Menu_Widget_C_OnActivated_Params
	{	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderYes_K2Node_ComponentBoundEvent_149_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderYes_K2Node_ComponentBoundEvent_149_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.Construct
	 */
	struct USurrender_Menu_Widget_C_Construct_Params
	{	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderTeammateDisconnected_K2Node_ComponentBoundEvent_185_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderTeammateDisconnected_K2Node_ComponentBoundEvent_185_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.BndEvt__SurrenderTeammateJoinedLate_K2Node_ComponentBoundEvent_210_OrionBaseButtonClicked__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_BndEvt__SurrenderTeammateJoinedLate_K2Node_ComponentBoundEvent_210_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.ExecuteUbergraph_Surrender_Menu_Widget
	 */
	struct USurrender_Menu_Widget_C_ExecuteUbergraph_Surrender_Menu_Widget_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Surrender_Menu_Widget.Surrender_Menu_Widget_C.OnClosed__DelegateSignature
	 */
	struct USurrender_Menu_Widget_C_OnClosed__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
