#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnTimedOut_D9428E1C4FD68BCA2D83C1BA1C1E2AC4
	 */
	struct UTopLevelOptions_C_OnTimedOut_D9428E1C4FD68BCA2D83C1BA1C1E2AC4_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnKilled_D9428E1C4FD68BCA2D83C1BA1C1E2AC4
	 */
	struct UTopLevelOptions_C_OnKilled_D9428E1C4FD68BCA2D83C1BA1C1E2AC4_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnDeclined_D9428E1C4FD68BCA2D83C1BA1C1E2AC4
	 */
	struct UTopLevelOptions_C_OnDeclined_D9428E1C4FD68BCA2D83C1BA1C1E2AC4_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnConfirmed_D9428E1C4FD68BCA2D83C1BA1C1E2AC4
	 */
	struct UTopLevelOptions_C_OnConfirmed_D9428E1C4FD68BCA2D83C1BA1C1E2AC4_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnTimedOut_DCD80556441FB44B79F62A82D30EC49C
	 */
	struct UTopLevelOptions_C_OnTimedOut_DCD80556441FB44B79F62A82D30EC49C_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnKilled_DCD80556441FB44B79F62A82D30EC49C
	 */
	struct UTopLevelOptions_C_OnKilled_DCD80556441FB44B79F62A82D30EC49C_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnDeclined_DCD80556441FB44B79F62A82D30EC49C
	 */
	struct UTopLevelOptions_C_OnDeclined_DCD80556441FB44B79F62A82D30EC49C_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnConfirmed_DCD80556441FB44B79F62A82D30EC49C
	 */
	struct UTopLevelOptions_C_OnConfirmed_DCD80556441FB44B79F62A82D30EC49C_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnTimedOut_2E8BE94044ECC88A4D86FE91C81137DA
	 */
	struct UTopLevelOptions_C_OnTimedOut_2E8BE94044ECC88A4D86FE91C81137DA_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnKilled_2E8BE94044ECC88A4D86FE91C81137DA
	 */
	struct UTopLevelOptions_C_OnKilled_2E8BE94044ECC88A4D86FE91C81137DA_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnDeclined_2E8BE94044ECC88A4D86FE91C81137DA
	 */
	struct UTopLevelOptions_C_OnDeclined_2E8BE94044ECC88A4D86FE91C81137DA_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnConfirmed_2E8BE94044ECC88A4D86FE91C81137DA
	 */
	struct UTopLevelOptions_C_OnConfirmed_2E8BE94044ECC88A4D86FE91C81137DA_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnTimedOut_5D562E95456DFCC881BFC09C448010FA
	 */
	struct UTopLevelOptions_C_OnTimedOut_5D562E95456DFCC881BFC09C448010FA_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnKilled_5D562E95456DFCC881BFC09C448010FA
	 */
	struct UTopLevelOptions_C_OnKilled_5D562E95456DFCC881BFC09C448010FA_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnDeclined_5D562E95456DFCC881BFC09C448010FA
	 */
	struct UTopLevelOptions_C_OnDeclined_5D562E95456DFCC881BFC09C448010FA_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.OnConfirmed_5D562E95456DFCC881BFC09C448010FA
	 */
	struct UTopLevelOptions_C_OnConfirmed_5D562E95456DFCC881BFC09C448010FA_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__[Default Button] Settings_K2Node_ComponentBoundEvent_3431_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__DefaultButtonSettings_K2Node_ComponentBoundEvent_3431_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__[Default Button] Exit Game_K2Node_ComponentBoundEvent_3437_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__DefaultButtonExitGame_K2Node_ComponentBoundEvent_3437_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.Construct
	 */
	struct UTopLevelOptions_C_Construct_Params
	{	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__[Default Button] Leave Match_K2Node_ComponentBoundEvent_642_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__DefaultButtonLeaveMatch_K2Node_ComponentBoundEvent_642_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__Feedback_K2Node_ComponentBoundEvent_259_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__Feedback_K2Node_ComponentBoundEvent_259_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__About_K2Node_ComponentBoundEvent_207_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__About_K2Node_ComponentBoundEvent_207_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__ControlsButton_K2Node_ComponentBoundEvent_855_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__ControlsButton_K2Node_ComponentBoundEvent_855_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__DefaultButton_C_0_K2Node_ComponentBoundEvent_71_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__DefaultButton_C_0_K2Node_ComponentBoundEvent_71_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__DefaultButtonReportPlayer_K2Node_ComponentBoundEvent_146_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__DefaultButtonReportPlayer_K2Node_ComponentBoundEvent_146_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__DefaultButtonAnnouncement_K2Node_ComponentBoundEvent_29_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__DefaultButtonAnnouncement_K2Node_ComponentBoundEvent_29_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.BndEvt__DefaultButtonExitReplay_K2Node_ComponentBoundEvent_180_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UTopLevelOptions_C_BndEvt__DefaultButtonExitReplay_K2Node_ComponentBoundEvent_180_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.ExecuteUbergraph_TopLevelOptions
	 */
	struct UTopLevelOptions_C_ExecuteUbergraph_TopLevelOptions_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_9IDI[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function TopLevelOptions.TopLevelOptions_C.RequestClose__DelegateSignature
	 */
	struct UTopLevelOptions_C_RequestClose__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
