#pragma once

/**
 * Name: Paragon
 * Version: v34
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__VeterancyBeginner_K2Node_ComponentBoundEvent_9_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__VeterancyBeginner_K2Node_ComponentBoundEvent_9_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__VeterancyNew_K2Node_ComponentBoundEvent_10_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__VeterancyNew_K2Node_ComponentBoundEvent_10_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__VeterancyExperienced_K2Node_ComponentBoundEvent_11_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__VeterancyExperienced_K2Node_ComponentBoundEvent_11_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__VeterancyVeteran_K2Node_ComponentBoundEvent_12_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__VeterancyVeteran_K2Node_ComponentBoundEvent_12_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__PageForward_Out_K2Node_ComponentBoundEvent_13_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__PageForward_Out_K2Node_ComponentBoundEvent_13_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature_Params
	{	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__PageForward_Out_K2Node_ComponentBoundEvent_14_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__PageForward_Out_K2Node_ComponentBoundEvent_14_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature_Params
	{	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.OnActivated
	 */
	struct UWelcomeScreen_C_OnActivated_Params
	{	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__PageForward_In_K2Node_ComponentBoundEvent_15_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__PageForward_In_K2Node_ComponentBoundEvent_15_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature_Params
	{	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__ShowHeroDetails_K2Node_ComponentBoundEvent_18_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__ShowHeroDetails_K2Node_ComponentBoundEvent_18_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature_Params
	{	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__DefaultButtonBack_K2Node_ComponentBoundEvent_19_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__DefaultButtonBack_K2Node_ComponentBoundEvent_19_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__DefaultButtonPlay_K2Node_ComponentBoundEvent_20_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__DefaultButtonPlay_K2Node_ComponentBoundEvent_20_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__DefaultButtonSkip_K2Node_ComponentBoundEvent_21_OrionBaseButtonClicked__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__DefaultButtonSkip_K2Node_ComponentBoundEvent_21_OrionBaseButtonClicked__DelegateSignature_Params
	{
	public:
		class UOrionBaseButton*                                    Button;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__PageForward_In_K2Node_ComponentBoundEvent_22_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__PageForward_In_K2Node_ComponentBoundEvent_22_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature_Params
	{	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.HandleSetVeterancy
	 */
	struct UWelcomeScreen_C_HandleSetVeterancy_Params
	{	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.HandleVeterancySet
	 */
	struct UWelcomeScreen_C_HandleVeterancySet_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_6W6N[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FText                                                ErrorMessage;                                            // 0x0008(0x0018)  (Parm)
	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.BndEvt__CloseAndMatchmake_K2Node_ComponentBoundEvent_9_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature
	 */
	struct UWelcomeScreen_C_BndEvt__CloseAndMatchmake_K2Node_ComponentBoundEvent_9_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature_Params
	{	};

	/**
	 * Function WelcomeScreen.WelcomeScreen_C.ExecuteUbergraph_WelcomeScreen
	 */
	struct UWelcomeScreen_C_ExecuteUbergraph_WelcomeScreen_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HQ79[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
